{
  "title": "delete",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ndelete\nФункция для удаления экземпляров объекта.\nСинтаксис\ndelete\n(objID, [permanently])\nПараметр\nНазначение\nobjID\nУдаляемый экземпляр объекта или его Код.\nВ качестве значения параметра может передаваться параметр или переменная, которой присвоен объект или целочисленный код объекта, например, при помощи функций\nattr\n,\nparam\n,\nobjects\nлибо через отдельно заданную переменную.\nВ качестве удаляемого объекта, функция\nне может\nпринимать на вход числовое и справочное (добавленное при помощи функции\ndict\n) значение кода.\nОднако, числовое значение кода может быть передано через\nобъявленную переменную\n.\npermanently\nЛогический параметр, который регулирует способ удаления объекта.\nПараметр может принимать значение:\nfalse – перемещение объекта в\nкорзину\n;\ntrue – удаление объекта из базы данных без возможности восстановления.\nБезвозвратное удаление объекта допускается только при наличии права на действие \"Выполнение\" для\nразрешения\n\"Удаление объектов без возможности восстановления\".\nЕсли алгоритм запускается пользователем без наличия такого права, тогда Системой осуществляется удаление объекта в корзину.\nПри получении объекта корзины посредством функции\ngetObjects\nфункция\ndelete\nсо значением параметра\ntrue\nможет использоваться для удаления объекта без возможности восстановления.\nПараметр необязательный.\nЕсли параметр не указан, удаление осуществляется в корзину.\nПримечание\nВызов функции осуществляется с вкладки \"Объекты\" панели инструментов редактора алгоритмов, в результате чего в код алгоритма добавляется функция с фиктивной переменной\n\"objID\"\nв качестве первого параметра, которую следует заменить на необходимое значение, и значением\nfalse\nв качестве второго параметра._.\nУдаление объекта возможно только при отсутствии зависимостей.\nПри попытке удаления объекта с наличием\nзависимостей\n, в логе выполнения алгоритма будет выведена соответствующая ошибка.\nПримеры\nПример №1\nНеобходимо удалить (переместить в корзину) все экземпляры типа \"Каталог\", алгоритм примет следующий вид:\nВ данном случае удаление объектов осуществляется функцией\ndelete\nчерез переменную коллекции объектов, получаемой функцией\nobjects\n.\nТак как второй параметр функции\ndelete\nне указан, удаление объектов осуществится в корзину.\nПример №2\nНеобходимо безвозвратно удалить объект через заданный параметр, алгоритм примет следующий вид:\nВ данном случае удаление объектов осуществляется функцией\ndelete\nчерез параметр, добавленный при помощи функции\nparam\n.\nДля безвозвратного удаления из базы данных в качестве второго параметра функции\ndelete\nуказано значение true.\nПример №3\nЕсли необходимо удалить объект по атрибуту \"Код\", алгоритм примет следующий вид:\nВ данном случае в качестве первого параметра функции\ndelete\nдобавляется атрибут \"Код\" (при помощи функции\nattr\n).\nДля добавления атрибута в  карточке алгоритма должен быть выбран базовый тип объекта.\nВ качестве параметра функции\ndelete\nдопускается использование цепочечного атрибута.\nПример №4\nУдаление экземпляра, выбор которого осуществляется через источник, может осуществляться следующим образом:\nВ данном случае удаление объектов осуществляется функцией\ndelete\nчерез переменную коллекции объектов источника данных, получаемой функцией\nqueryForList\n.",
  "source": "https://docs.greendata.ru/platform/ru/delete.html"
}