{
  "title": "Системное действие. Параметры для автоматического запуска расчета",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСистемное действие. Параметры для автоматического запуска расчета\nСистемное действие\nс расширением \"Параметры для автоматического запуска расчета\" позволяет осуществлять автоматический запуск\nрасчета методики\nво время выполнения ETL-процесса.\nПри\nнастройке схемы ETL\nс панели действий и компонентов необходимо перетащить (Drag&Drop) в рабочую область элемент задачи. После чего нажатием на кнопку\nв меню действий выбрать тип \"Этап. Системное действие\":\nПараметры настройки\nДля перехода к параметрам настройки системного действия необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего откроется новая вкладка, на которой в модальном окне необходимо выбрать расширение \"Параметры для автоматического запуска расчета\":\nПосле чего Система отобразит соответствующие параметры настройки:\nПараметр\nНазначение\nМетодика\nОпределение\nметодики расчета\n, которая будет запускаться при обработке текущего этапа ETL-процесса.\nАлгоритм выбора отчетной даты (опционально)\nВыбор\nалгоритма\nдля определения отчетной даты.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nОтчетная дата задается при использовании в методике\nформ отчетности\n.\nРежим выбора объектов\nОпределение способа выбора объектов системы, по которым будет осуществлен расчет. Возможные значения:\nвыбор по типу объекта;\nвыбор по типу (с алгоритмом фильтрации);\nручной выбор из списка.\nДля расчета используется тип объектов\n\"РМ. Карточка расчета\" [CALC_CARD]\nи его дочерние типы.\nТип объектов для расчета\nОпределение типа объектов, по объектам которого будет осуществляться запуск расчета.\nВыбор ранее созданного типа объектов осуществляется из выпадающего списка, добавление нового\nтипа объектов\nдоступно через меню действий параметра.\nПараметр доступен при установке режима выбора объектов \"Выбор по типу объекта\".\nАлгоритм фильтрации объектов для расчета\nОпределение алгоритма для фильтрации объектов, по которым будет осуществляться запуск расчета.\nВыбор ранее созданного алгоритма фильтрации осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПараметр доступен при установке режима выбора объектов \"Выбор по типу (с алгоритмом фильтрации)\".\nОбъекты расчета\nОпределение объектов системы, по которым будет осуществлен запуск расчета.\nВыбор ранее созданных объектов осуществляется после нажатия на кнопку\n, добавление нового объекта доступно при нажатии на кнопку\nв панели управления реестра.\nПараметр доступен при установке режима выбора объектов \"Ручной выбор из списка\".\nТип динамики\nОпределение динамики (временного периода) предоставляемых данных в методике расчета. Возможные значения:\nдень;\nмесяц;\nквартал;\nгод;\n…​\nПример\nДопустим, в процессе выполнения ETL-процесса необходимо запустить расчет методики оценки состояния клиента.\nДля решения данной задачи на\nсхему ETL-процесса\nдобавляется этап типа \"Этап. Системное действие\".\nПосле сохранения схемы ETL необходимо перейти к настройкам системного действия по кнопке\nв меню действий этапа и в открывшемся модальном окне выбрать расширение \"Параметры для автоматического запуска расчета\", после чего параметры настроек определяются следующим образом:\nв качестве параметра \"Алгоритм выбора отчетной даты\" указан алгоритм расчета даты начала квартала с помощью функций trancDate и\ncurrentDate\n.\nВ результате настроек при выполнении ETL-процесса будет запущен расчет методики \"Методика оценки состояния клиента\". Значения показателей отобразятся в выбранной\nкарточке расчета\nна вкладке \"Расчет\".",
  "source": "https://docs.greendata.ru/platform/ru/system-action-calculation-autorunning-parameter.html"
}