{
  "title": "Automatic user creation",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nAutomatic user creation\nThe functionality of GreenData platform allows automating the process of creating a new user. It can be done via algorithms for working with users and user groups.\nTask\nThis  article gives information on how to create an account for a participant in an educational course on algorithms. The user registration is completed by:\nentering user data (last name, name, login, email) in a special form of the course participant;\nautomatic password generation by the System using the\ngeneratePass\nfunction and sending data for platform authorization to the specified email address.\nObject model\nAs part of the example, create an object model consisting of 2 entities:\nParticipants\nis the object type where data about the new participant will be stored. After saving each instance of the \"Participants\" type, the algorithm will create a new object in the system users registry where data of saved instance will be copied.\nAlgorithms. Course materials\nis an object type where all useful information (videos, presentations, text documents) from the course is saved. Course participants have access to the object type and its instancies.\n\"Participants\" object type\nThe \"Participants\" entity includes the following attributes:\n\"Login\";\n\"Temporary password\";\n\"Email\";\nattributes of the \"Employee\" parent type.\nFor all attributes of the entity, select the «String» value.\nSelect \"Algorithm\" in the \"Required\" field and add the algorithm in the \"Required actions algorithm\" field.\nThe\nvisual\nfor the \"Participant\" instance can be configured as follows:\nThe \"Temporary password\" attribute can be left out of the visual, as its value will be send to the user’s email. A description of the setting is provided\nbelow\n.\n\"Algorithms. Course materials\" object type\nThe \"Algorithms. Course materials\" object type contains the following attributes:\n«Topic»\n«Attached files»\nA detailed configuration of the \"Attached files\" attribute is presented in the\n\"Attach files\" widget\"\narticle.\nThe \"Algorithms. Course materials\" registry provides information about course workshops and topics of each lesson. Each type instance of the type also has useful materials in the \"Attached files\" attribute.\nStep 1. Configuring permissions\nDefine an\naccess group\nfor course participants before giving permissions. To do that, go to the \"Access groups\" registry and create a new instance by clicking\n.\nEnter the name and identifier for the access group. New course participants will be added to the group after saving their profiles.\nPermissions\nare given to the \"Algorithm. Course materials\" type. In order to give permissions to work with object, go to the menu item \"Administration\" → \"Access control\" → \"Access to objects\".\nGive \"Read\" permission to the \"Participants of \"Algorithms\" course\" access group in the \"Algorithms. Course materials\" object type.\nStep 2. Creating algorithms and notification template\nTo implement this example, 3 interrelated algorithms are used:\nAlg. Creating a new user;\nAlg. Filtering a user by ID;\nAlg. Sending a registration letter.\nThe \"Alg. Creating a new user\" algorithm uses functions that link it to other auxiliary algorithms:\nThe\nfilterAlg\nfunction filters user data in the System using the \"Alg. Filtering a user by ID\" algorithm;\nThe\nalg\nfunction runs the \"Alg. Sending a registration letter\" algorithm.\nThe \"Alg. Creating a new user\" algorithm creates a new user account, adds it to the \"Participants of the Algorithm training course\" access group and sends a generated password to the participant’s email address.\nFirst, the algorithm checks the\npresence\nof the \"Participants\" entity in the \"Login\" field. Then, whether the user account with the same login exists in the System. Algorithm stops if logins of the new and previously registered user accounts match.\nThe \"Alg. Filtering a user by ID\" algorithm, containing the \"pIdent\" parameter, is used  to filter users.\nThe parameter settings are presented as follows:\nIf the user has not been previously registered in the system, then a new account is created in the registry of the \"User\" type. In this case, the values specified in the attributes of the \"Participants\" type are duplicated into a new instance of the \"User\" type.\nThe user’s password is generated using the\ngeneratePass\nfunction.\nThen a new user is saved and added to the access group \"Participants of the Algorithm training course\" using the\naddSecSubjectToGroup\nfunction.\nThe generated user password is set in the \"Temporary Password\" field in the user profile (the \"Participants\" entity).\nNext, using the \"Alg. Sending a registration letter\" algorithm, an e-mail is sent to the specified user’s email address in the \"Participants\" object type. The email is sent using\nsendMsgToEmail\nfunction, in which you need to specify 2 parameters: the message template and the user’s e-mail.\nThe message template is created in the registry of the \"Notification template\" object type. In the template settings, specify the email header and its contents (login and the user password generated by the algorithm).\nAfter saving the \"Alg. Creating a new user\" algorithm profile, it is necessary to enter a setting that will run the algorithm after saving the form of the new participant of the training course.\nTo do this, go to the «\nEvents\n» tab of the \"Participants\" object type. In order for the \"Alg. Creating a new user\" algorithm to start\nafter the course participant profile is saved\n, specify it in the \"Event after saving\" field.\nCreating a new user\nTo create a user account, go to the registry of the \"Participants\" type and create a new instance. After filling in all the fields, save the data by clicking\n.\nAfter saving the instance, the algorithm for creating a new user and sending an email will start. If the algorithm’s actions are successful, pop-up notifications will be displayed in the lower right corner of the screen:\nWhen the user will see a new email corresponding to the configured notification template after opening the letter. The email will contain the username and the generated password. With information, the user will be able to log in the System.\nThe user will be able to change the password of the account, if necessary.\nThe algorithm will automatically add the user to the access group \"Participants of the algorithm training course\". Accordingly, he will have permissions to the \"Algorithms. Course materials\" type (viewing instancies).",
  "source": "https://docs.greendata.ru/platform/en/automatic-user-creation.html"
}