{
  "title": "Тип объекта \"Файл\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nТип объекта \"Файл\"\nТип объекта\n\"Файл\" [FS_FILE]\nявляется\nсистемным\nи используется для управления файлами, связанными с объектами системы. Он позволяет пользователям загружать, просматривать и удалять прикрепленные документы.\nДоступ к файлу, загруженному в Систему, предоставляется при выполнении одного из следующих условий:\nпользователь является автором файла;\nпользователь обладает правом на \"Чтение\" объекта Системы, с которым связан файл.\nДля выполнения административных задач предусмотрены отдельные системные разрешения:\nправо на\nпросмотр всех файлов\n(экземпляров типа \"Файл\" [FS_FILE] или наследуемых от него типов) регулируется разрешением\n\"Возможность просмотра всех файлов без проверки прав на чтение\"\n;\nПри этом для открытия реестра типа \"Файл\", помимо указанного выше разрешения, необходимо дополнительно обладать правом на выполнение разрешения\n\"Просмотр метаданных\"\n.\nработа с\nверсионностью файла\nрегулируется разрешением\n\"Возможность просмотра/создания версий файлов\"\n;\nизменение тела файла\nрегулируется разрешением\n\"Замена содержимого файла\"\n.\nПри работе с файлами в Системе действуют следующие ограничения:\nРазмер загружаемых файлов ограничивается настройками:\nв\nSaaS-решении\nразмер HTTP-запроса, в теле которого передаются файлы,\nне может превышать 200мб\n;\nв\nOn-Premise решении\nограничение задается в\nконфигурационном файле\n.\nВ Системе ограничена возможность загрузки файлов формата *.pdf с активным содержанием (содержащих JavaScript).\nНа\nOn-Premise решении\nимеется возможность регулировать данную проверку на наличие вредоносного содержимого с помощью специального\nпараметра конфигурационного файла\n.\nНастройка\nФайлы в Системе являются самостоятельными объектами. Для их привязки к другим объектам Системы (например, к документам или задачам) используется механизм файловых атрибутов.\nЧтобы объект мог содержать файлы, в его типе должен быть добавлен атрибут\nтипа\n\"Файл\" или\nобъектный атрибут\nсо ссылкой на тип \"Файл\" (или наследуемый от него тип объекта), который обычно именуется как\n\"Прикрепленные файлы\"\n.\nДля дальнейшей настройки могут использоваться:\nвизуалы  атрибута типа \"Файл\"\n;\nвиджеты\nиз раздела\n\"Файлы\"\n.\nВозможности работы с файлами\nКлассификация\nВсе файлы в Системе можно\nклассифицировать\n. Это позволяет организовать их категоризацию и выполнять фильтрацию по заданным классификациям.\nВерсионность\nВ Системе реализована поддержка\nверсионности\nфайлов. При изменении файла в Системе сохраняются все его предыдущие версии, которые остаются доступными для просмотра.\nПодписание электронной подписью\nПрикрепленные документы могут быть подписаны\nэлектронной подписью\n. Подписанные документы отмечаются в интерфейсе специальным визуальным индикатором, вид которого зависит от выбранного способа отображения файлов. Например:\nв\nвиджете \"Иерархия файлов\"\nдля отображения состояния файла используются обозначения:\n– файл подписан;\n– файл не подписан.\nв\nвиджете \"Список файлов по статусам\"\nподписанный документ отмечен индикатором\n.\nПодробнее с настройкой соответствующих действий для подписания документов можно ознакомиться в\nстатье\n.",
  "source": "https://docs.greendata.ru/platform/ru/file-object-type.html"
}