{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.425.6 of August 29, 2024\nNew features\n1. It is now possible to customize the header display in the\nlight registry\n.\n2. The registry virtual column was improved with new option to specify the attribute type.\nIt is now possible to automatically\nrestart ETL operation\nwhen an abnormal interruption of ETL processing occurs.\nIt is now possible to customize the control panel buttons for the start page of the mobile app.\nChanges and improvements\nFor\nobject attributes\nwith multiple selections, the process of creating a two-way relation was debugged and the filtering mechanism was improved;\nOpening the\nprimitive object\nprofile from the registry was debugged;\nThe ability to hide tab group outer frames when using any design theme was stabilized;\nIn\ndashboards\n, the ability to apply default chart height and width values was stabilized;\nThe customization of\ncommunication-panel\nwas improved;\nThe display of object drop-down lists when configuring profiles in\nlogin page constructor\nwas debugged;\nWorking with\n“Selecting from directory as radio buttons” visual\nobject attribute was stabilized;\nFiltering of registry instances with\nRating widget\nwas debugged;\nThe display of the\n“Progress-bar”\nand\n“Employee information”\nwidgets was stabilized;\nThe display of the registry when grouping and aggregating by an empty column was stabilized;\nThe header length display was adjusted to the available width in the Light registry;\nThe ability to filter values was stabilized in the registry;\nThe process of selecting an icon for the\nmain menu items\nfolder was debugged;\nThe work of the “Menu item: FAQ” module was improved;\nWorking with\ndict\nfunction was debugged;\nFor\nattr\nfunction, the process of attaching an array of objects from files to an attribute is debugged\nThe need to select a single value to go from task stage\nbusiness process\nis now unnecessary;\nIn action auditing, the process of adding a new record of access permission change was debugged, as well as displaying a link to the object on which the action was started;\nThe transfer of\nupdates\ncontaining visuals with frames was stabilized;\nRegistry settings\nupdate migration was stabilized\nThe ability to use the mouse scroll wheel when selecting an extension was debugged;\nIn the eDoc module, when creating a source and its highlighting algorithm, the template of the print form on which the source is created is automatically set. The comment text now has no character limit;\nIn the eDoc module, the ability to change the document scale using hotkeys was improved, as well as the display of comments in the exported document.\nIn the eDoc module, comparison of main source wording with typical wording was improved;\nData display in modal windows was stabilized;\nWorking with\ndict\nand\ngetObject\nwas improved;\ngetSelected\nwas optimized when working with chain attributes;\nRegistry display in edit mode was stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.425.6-latest.html"
}