{
  "title": "Уведомление об обновлениях в платформе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nУведомление об обновлениях в платформе\nОбновления в платформе – список новых возможностей, изменений и улучшений платформы.\nДля пользователей, использующих платформу на:\nSaaS или On-Premise решении\n, данный список предоставляет возможность ознакомиться с содержанием последней установленной версии приложения;\nPrivate Cloud решении\n, данный список позволяет ознакомиться с содержанием последней установленной версии приложения, а при наличии более новой версии информирует о составе обновления последнего опубликованного релиза с возможностью его\nустановки\n.\nПросмотр таких обновлений осуществляется путем нажатия на иконку\nв навигационной панели приложения:\n– наличие индикатора на иконке свидетельствует о том, что:\nверсия платформы обновлена, если используется SaaS-модель;\nопубликована новая версия обновления, если платформа развернута на решении On-Premise.\nОзнакомиться с самым свежим выпуском релиза можно по\nссылке\n.\nПеречень описаний всех ранее выпущенных релизов представлен на\nстранице\n.\nНастройка уведомлений\nВидимость кнопки\nи просмотр состава обновления регулируется правом доступа на \"Выполнение\"\nразрешения \"Просмотр обновлений в платформе\"\n.\nВ On-Premise решении данная возможность активна после добавления дополнительных\nпараметров в конфигурационный файл\nприложения.\nУстановка обновления\nДля\nPrivate Cloud решения\nвозможность установки более новой версии приложения доступна непосредственно из модального окна \"Обновления в платформе\".\nЕсли текущая версия приложения ниже последней опубликованной, то для пользователя с правом доступа на \"Выполнение\"\nразрешения \"Запуск обновления платформы\"\nотображается кнопка\n, по нажатию на которую откроется модальное окно для подтверждения действия:\nПри наличии\nопорного релиза\nмежду текущей и последней опубликованной версиями приложений кнопка для установки обновления будет заблокирована.\nНеобходимо произвести последовательную установку промежуточных релизов.\nПроцесс обновления начнется через\nминуту\nпосле подтверждения действия.\nС целью сохранения необходимых данных и завершения активных операций пользователи, на текущий момент работающие в приложении, будут оповещены о предстоящем обновлении следующим образом:\nПо истечении минуты начнется перезагрузка системы, приложение станет недоступно.\nПосле окончания процесса установки обновления в случае удачной загрузки номер установленной версии приложения будет указан в информации\n\"О программе\"\n, при возникновении ошибки будет отображено уведомление:",
  "source": "https://docs.greendata.ru/platform/ru/notification_of_platform_updates.html"
}