{
  "title": "\"Map with objects\" Analytical dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Map with objects\" Analytical dashboard\nThe \"Map with objects\" analytical dashboard allows users to display necessary map markers on the dashboard profile.\nTo set up the \"Map with objects\" analytical dashboard in the\ndashboard\nprofile, a\ndata source\nmust be added in the visual editing mode.\nAdding the \"Map with objects\" analytical dashboard to the\ndashboard\nprofile is done in visual editing mode. Drag & Drop the \"Map with objects\" element from the \"Elements\" panel to the working area of the dashboard profile located under the \"Dashboards\" tab.\nFurther configuration is available via the\nbutton, which opens the \"settings of map with objects\" modal window.\nConfiguration parameters\nMain parameters\nSetting\nPurpose\nName\nTitle of the analytical dashboard.\nContainer height, %\nSetting the height of the analytical dashboard.\nThe height is defined as a percentage of the screen height.\nThe default value is 40%.\nView of the card being opened\nDefining a type of profile opened when clicking a map marker. Possible values:\nCustom object card – the object profile opens in a modal window by the code specified in the \"Source ID field\" parameter.\nAn object visual can be selected if needed;\nSpecialized booking card – opens a location profile that allows access to the booking profile.\nThis option allows selecting the\n\"Booking\"\ndashboard element.\nThe default value is \"Custom object card\".\nThis button provides access to the object type visual selection, which is displayed when clicking the map marker.\nIf no visual is selected, the default visual is displayed upon clicking the marker.\nThe button is available when the \"Custom object card\" option is selected for the \"View of the card being opened\" field.\nBooking element of dashboard\nSelecting the\n\"Booking\"\ndashboard element to display the location profile when clicking the map marker.\nThis field is available when the \"Specialized booking card\" option is selected for the \"View of the card being opened\" field.\nExample of a location profile when using the \"Booking\" analytical dashboard\nType of map\nDefining the map type. Possible values:\nGoogle;\nYandex;\nOpenStreetMap.\nThe default value is \"OpenStreetMap\".\nAPI key\nAPI key entry field.\nAvailable when the \"Google\" or \"Yandex\" map type is selected.\nData source\nSelecting the\ndata source\nfor displaying objects on the map.\nSelect from a dropdown list of sources added to the dashboard profile.\nThis field is required.\nSource latitude field\nDefining the field containing object latitude information.\nSelect from a dropdown list of all fields in the selected data source.\nThis field is required.\nSource longitude field\nDefining the field containing object longitude information.\nSelect from a dropdown list of all fields in the selected data source.\nThis field is required.\nSource icon field\nDefining the field containing object icon information.\nSelect from a dropdown list of all fields in the selected data source.\nThis field is required.\nSource ID field\nDefining the field containing the object code.\nSelect from a dropdown list of all fields in the selected data source.\nThis field is required.\nAdditional parameters\nTo display only objects within the visible map area, the following dashboard parameters should be set:\nSetting\nPurpose\nSetting current latitude dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the user’s current latitude.\nA dashboard parameter must be created beforehand to link to the control element.\nSetting current longitude dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the user’s current longitude.\nA dashboard parameter must be created beforehand to link to the control element.\nLatitude of the lower left border dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the latitude of the lower left border of the visible map area.\nA dashboard parameter must be created beforehand to link to the control element.\nLongitude of the lower left border dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the longitude of the lower left border of the visible map area.\nA dashboard parameter must be created beforehand to link to the control element.\nLatitude of the upper right border dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the latitude of the upper right border of the visible map area.\nA dashboard parameter must be created beforehand to link to the control element.\nLongitude of the upper right dashboard\nSelecting a previously created\ncontrol element\nof the \"Number\" type that transmits the longitude of the upper right border of the visible map area.\nA dashboard parameter must be created beforehand to link to the control element.\nSearch parameter location\nSelecting a previously created\ncontrol element\nof the \"String\" type that transmits a search string for quick map navigation.\nA dashboard parameter must be created beforehand to link to the control element.\nResult\nAfter saving the analytical dashboard settings and dashboard profile visual, the configured panel will be displayed on the user’s screen.\nA detailed example of configuring the \"Map with objects\" and \"Booking\" analytical dashboards is given\nhere\n.",
  "source": "https://docs.greendata.ru/platform/en/map-with-objects-analytical-dashboard.html"
}