{
  "title": "Setting up a data converter",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up a data converter\nAs part of a custom ETL process (for more information, refer to\nSetting up an ETL schema\n), a data converter is used when the data types in the\nsource\nand receiver do not match. For example, if the custom attribute value is represented as an Object in the System and the data is represented externally as a Row. The converter is also used when several attributes are represented within one tag (for example), while in the System, these are different properties (attributes) of one object.\nThe setting of converters of different types is the same. To do this, click the\nSettings\nbutton of the item selected.\nNote: the administrator can independently configure the visualization of\nany type of the System object\n(for more information, refer to\nConfiguring the visual\n).\nwhere:\nSetting\nPurpose\nSchema item outputs\nAdjusting the output data of the converter. Described below.\nData converters\nCustomizing the change/generating the output data attributes. Described below.\nInitially, for the\nConverter\nitem, the System will display a dynamic data structure (left) at the input, and a blank sheet (right) at the output. To transfer data, click the\nbutton.\nAdding the entire item is available when you select the root object (object{1}) using\nAdd with hierarchy\n.\nIf there is a direct attribute relation, the selected values on the right (highlighted in blue) will be highlighted in yellow on the left.\nThe data is transformed using the\nbutton on the right.\nYou can perform the following actions to transform:\nDelete a field.\nBreak the relation with the source: the field will no longer assign a value from the source. It is available to assign a value calculated by the algorithm (converter setting).\nAdd a converter: to transform a field value. Described below.\nAdd a field.\nThe converter transforms/forms the field value. Converters can be configured from the dynamic data structure, or in the\nData converters\ntable using the\nbutton.",
  "source": "https://docs.greendata.ru/platform/en/etl-data-converter.html"
}