{
  "title": "Виджет \"Реестр задач\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Реестр задач\"\nВиджет \"Реестр задач\" позволяет отобразить список (\nреестр\n) задач внутри настраиваемой карточки.\nПример настроенного виджета:\nНастройка\nДобавление виджета в карточку объекта осуществляется в режиме настройки\nвизуала экземпляра\n. При переходе на панели \"Элементы\" на вкладку \"Виджеты\" необходимо из раздела \"Списки и таблицы объектов\" перетащить (Drag&Drop) виджет \"Реестр задач\" в рабочую область карточки.\nПараметры\nДля настройки виджета необходимо определить параметр:\nПараметр\nНазначение\nРеестр по умолчанию\nВыбор\nреестра\nтипа \"ДО\". Задачи на процессе\" [WF_PROCESS_TASK] и его дочерних типов.\nДальнейшая настройка виджета предполагает использование инструментов панели управления.\nЭлемент\nНазначение\nОпределение режима просмотра списка задач. Возможные значения:\nРедактирование;\nПросмотр.\nПодробнее о работе с реестром в режиме редактирования можно ознакомиться в\nстатье\n.\nИсполнитель\nВыбор исполнителя (группы пользователей) представленных задач из списка.\nСписок исполнителей отражен с учетом иерархии подразделений организационной структуры.\nОпределение вида просмотра реестра задач. Возможные значения:\nКалендарь;\nТаблица.\nПо умолчанию открывается вид, установленный в\nнастройках реестра\n. Если настройка не задана, то в соответствии со значением\nсистемной настройки \"Вид реестра задач по умолчанию\"\n.\nОпределение границ рассматриваемого периода. Возможные значения:\nМесяц;\nНеделя;\nДень.\nПосле заполнения настроек и сохранения визуала экземпляра на экране отобразится список задач конкретного пользователя.\nПример\nВ карточку объекта в режиме настройки\nвизуала экземпляра\nдобавляется виджет \"Реестр задач\".\nПри выборе в настройках виджета реестра типа \"Задачи\" для исполнителя \"Иванов А. (ОРГ)\" с видом \"Таблица\" в карточке объекта будет отображено:",
  "source": "https://docs.greendata.ru/platform/ru/task-list-widget.html"
}