{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.459.5\nот 02.06.2025\nНовые возможности\nНа\nпредметной области\nпоявилась возможность поиска атрибутов и типов объектов.\nРеализована новая функция\nstartUser\nдля получения пользователя, инициировавшего выполнение расчета выражений, автокалькуляций, алгоритмов событий или использующего функцию\nexecAs\n.\nПри\nдобавлении в обновление типа объекта\nс определенным видом контроля прав появилась возможность применять права по умолчанию к существующим объектам.\nПосредством\nобновлений\nпоявилась возможность переноса периодов рабочего времени.\nОчистка временных файлов текущей ноды теперь осуществляется и при запуске приложения.\nПоявилась возможность настройки колонтитулов и нумерации страниц.\nПри настройке интеграция с\nMango Office\nпоявилась возможность указывать пользовательский тип объекта телефонии.\nСоздатель встречи\nGreenData Meet\nтеперь может управлять правами участников.\nДля повышения безопасности было добавлено предупреждение при попытке\nоткрытия потенциально опасного файла\n.\nИзменения и улучшения\nДоработана логика отображения пунктов меню пользователя при наличии вложенности.\nОптимизировано время загрузки главного меню, а процесс загрузки демонстрируется пользователю в виде лоадера.\nСтабилизировано положение модального окна при открытии объекта.\nСтабилизирована возможность возврата к предыдущей странице.\nОтлажена отправка уведомлений текущему пользователю.\nОтлажен процесс выбора значений в radio button при помощи горячих клавиш.\nОтлажен процесс сохранения значений атрибутов объекта, размещенного на\nфрейме\n.\nСтабилизировано логическое удаление объекта.\nОтлажено отображение атрибута после удаления его значений.\nСтабилизирована фильтрация объектных атрибутов на визуале объекта.\nПри возвращении алгоритмом карточки объекта с несохраненными изменениями доработана возможность сохранения объекта пользователем.\nСтабилизирован пересчёт выражений в родительском объекте при изменении дочерних объектов.\nОтлажена возможность автоматического заполнения значений атрибутов с помощью\nалгоритма\nпри создании объекта.\nСтабилизировано автоматическое заполнения поля \"Идентификатор\" при создании настройки\nкнопок панели управления\n.\nОтлажено отображение данных на\nфрейме\nв соответствии с выбранным объектов.\nСтабилизировано отображение дочернего объекта, созданного через реестр, размещенный в карточке объекта.\nОтлажен процесс сохранения текущей карточки по нажатию горячих клавиш Ctrl+S при фокусе на текстовом поле.\nДля типов  с наименованием таблиц [RISK_CALCIND_DATA], [RISK_ANALYT_TAB_DATA], [RISK_FORM_ROW_ANALYT_DATA] родителем установлен \"Примитив без суррогатного ключа\".\nСтабилизировано отображение времени пересчета выражения/автокалькуляции.\nОптимизировано время открытия плиточного реестра.\nНалажена возможность экспорта реестра с настроенными фильтрами.\nОтлажено сохранение значений по умолчанию при создании нового реестра через\nопцию \"Закрепить реестр\"\n.\nВ реестре стабилизирована отработка проверки алгоритма фильтрации.\nПосле обновления реестра стабилизировано отображение пользовательского фильтра и применение настроенного фильтра колонки реестра.\nОтлажен процесс фильтрации реестра по цепочечным атрибутам.\nДоработано создание\nбазового реестра\nпри сохранении настроек фильтрации/сортировки по\nкнопке\nв ранее несохраненном реестре.\nОтлажено отображение данных при замене значений объектных атрибутов в реестре в\nрежиме редактирования\n.\nСтабилизирована возможность фильтрации значений при наличии в наименовании символа\n'\n.\nСтабилизирована возможность удаления реестра при отсутствии прав доступа на просмотр метаданных.\nУстановлено ограничение на длину наименования\nгруппы атрибутов/вкладок\n– 2000 символов.\nНа\nфрейме\nстабилизирована возможность открытия карточки типа через меню действий параметра \"Визуал\".\nСкорректирована область открытия панели настроек элемента группировки\n\"Ряд\"\n.\nЗаменен визуал маршрута бизнес-процесса, обеспечивающий скрытие многострочного отображения текста.\nЗаменено модальное окно для загрузки файлов в систему.\nЗа счет добавления пагинации повышено удобство выбора значений объектных атрибутов в\nпоисковых фильтрах\n.\nВ\nвиджете \"Подсказка\"\nотлажен процесс редактирования алгоритма, по которому формируется текст подсказки.\nДоработана передача данных цепочечных атрибутов типа \"Дата\" в\nвиджет \"Заголовок по атрибуту\"\n.\nОтлажен процесс обновления данных дашборда по нажатию на кнопку\n.\nВ дашборде скорректированы кнопки для настройки отображения в мобильном приложении.\nСтабилизирована возможность выбора представлений дашборда после отмены создания нового представления.\nОтлажен процесс расшифровки данных в дашборде.\nВ дашбордах налажено отображение полей ввода значений фильтра.\nОптимизирована загрузка страницы при добавлении типа объекта на\nпредметную область\n.\nВ источнике данных на основе SQL отлажена возможность заполнения параметров значениями по умолчанию.\nОтлажена возможность компиляции алгоритма с числовыми атрибутами.\nОтлажено выполнение алгоритма блокировки объектного атрибута с визуалом \"Множественные значения в виде таблицы\", работающего независимо от опций\n\"Включить режим редактирования\", \"Выбор объекта через всплывающее окно\".\nДоработано хранение информации об алгоритмах, используемых в тексте шаблона уведомления.\nОтлажен процесс сохранения файлов при помощи функции\ncreateArchiveWithSign\n.\nОтлажена возможность сохранения алгоритма с использованием функций\nisNotNull\nи\nisNull\n.\nСтабилизирована работа функции\nprintEDoc\n.\nОтлажена работа функции\ninclineName\n.\nОтлажено отображение расчета значений на\nфрейме\nпри выполнении алгоритма\nсобытия\n.\nСтабилизирована работа\nмонопольного режима\n.\nСтабилизирована возможность использования\nанонимного доступа\n.\nПри редактировании или создании экземпляра типа объектов\n\"Расписание (CRON-формат)\"\nотлажено отображение числовых значений при настройке часов.\nПраво на \"Чтение\" для действия \"Завершить задачу\" теперь доступно всем пользователям.\nАдминистративной группе выданы права на удаление экземпляров типа \"Документ, сформированный по шаблону\" [RF_DOCUMENT].\nСтабилизирован возможность выдачи прав доступа при создании скрипта СУБД как потенциального расширения.\nДоработано отображение данных маршрута бизнес-процесса.\nПри создании схемы бизнес-процесса теперь сохранение будет осуществляться посредством ручного нажатия на кнопку\n.\nСтабилизирована возможность сохранения и экспорта отчетности в мастере консолидации.\nДоработан процесс выбора атрибутов для расчета методик.\nОтлажена возможность удаления поля в структуре выходов источника.\nСтабилизирована возможность логирования в экземпляре объекта ETL при\nвыполнении ETL по файлам\n.\nУлучшен процесс формирования обновления с вкладки\n\"Поиск по UUID\"\n.\nОптимизированы настройки отображения кнопок добавления файлов в\nкомпоненте \"Исходящие документы\"\nи\nвиджете \"Иерархия файлов\"\n.\nПри загрузке файла  в атрибут с визуалом\n\"Визуал прикрепления файлов для подписания (с группировкой)\"\nв конкретную классификацию стабилизировано присвоение файлу выбранной классификации.\nДоработана проверка всех типов источников при экспорте файла.\nСтабилизирован расчет суммы для версий файлов.\nПовышена безопасность при выполнении api-запросов для работы с документом печатной формы, бизнес-процессом, с источниками данных, ETL и моделью данных.\nПри переходе к объекту системы по гипперссылке из стороннего приложения в случае неудачной авторизации через\nKerberos\nили\nNTLM\nбудет открываться страница авторизации.\nОтлажена возможность мультидоменной аутентификации через\nKerberos\n.\nДоработана возможность работы swagger при включенном CSP.\nПри записи в лог доработано шифрование доменных имен (информация по FQDN и IP-адресам).\nНалажено автоматическое шифрование секретных переменных для уровня строгости контроля доступа WARN.\nСтабилизирована возможность формирования печатной формы с изображением из текстового атрибута с\nподдержкой сложного форматирования\n.\nПри работе с документом, сформированным по шаблону, отлажена возможность\nсоздания новой версии\n.\nСтабилизировано одинаковое отображение элементов оглавления в документе при предварительном просмотре, скачивании и печати.\nДоработана обработка изображений при сравнении версии документа, отредактированного в \"Р7-Офис\".\nВ документе печатной формы отлажено отображение границ и возможность экспорта документа.\nДля удобства пользователя приведены к общему виду наименование модального окно диалога и пункт главного меню для открытия чатов.\nОтлажен процесс отправки уведомлений при смене аккаунта пользователя.\nДоработано отображение ошибки при попытке просмотра удаленного сообщения через системные уведомления о закрепе данного сообщения.\nОтлажен процесс установки\nстатуса\nпользователя.\nИсправлена возможность редактирования пересланного сообщения другого пользователя.\nОтлажен процесс обработки и сохранения записи\nвстречи\n.\nСтабилизирована передача аудио и видео потока в\nGreenData Meet\nпри кратковременной потере соединения.\nДлительность встречи теперь может отображаться с указанием часов.\nСтабилизировано отображение списка участников встречи.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.459.5\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.459.5.war\nhttps://downloads.greendatasoft.ru/LTS/lts.459.5.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.459.5-latest.html"
}