{
  "title": "Setting up access permissions to document creation",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up access permissions to document creation\nThe ability to work with print forms of the document is determined by the access permissions thereto.\nYou need to:\nDisplay the button itself to create a print form\nAllow users to work with the generated document template\nA button to create a print form\nA button, as a control, is an\naction\nin the System. Setting the required action is defined in the appropriate registry (for more information, refer to\nWorking with the object registry\n).\nTo configure the display of the button to create a print form, you need to:\n1. Go to the\nActions\nregistry in the System.\n2. Select the\nPrint form\naction. The System will display the object profile.\n3. In the\nRelated object types\nblock of fields, use the\nbutton to specify the type of object where the button will be displayed to create a print form.\nSetting\nPurpose\nName\nEntering the setting name.\nAlgorithm of action visibility in the child object\nSelecting/entering an algorithm to specify whether the button is visible in an object type.\nActions\nDisplaying the name of the custom action.\nSystem attribute object type\nSelecting the type of object in which you want to display the button to create a print form.\nOverride the action name\nEntering the button name. By default, the button is called \"Print form\".\nOverride the action hint\nEntering the hint text for the custom button.\n4. Use\nto save the settings in the object profile.\nWhen all settings are entered, the System will display a button to create a print form in instances of the type specified:\nDocument template permissions\nA document template, like any item in the System, is an object type. Permissions to System object types are provided in the same way (\nmore about this\n).\nSo, to grant permissions to a document template, you need to:\n1. Go to the\nAccess to System objects\nregistry. The System will display the registry of all objects.\n2. Select the\nPrint form template\nobject type. The System will display a register of print form templates.\n3. Select a\nCustom template\nfrom the list of print forms and allow the user/user group to take the necessary actions.\n4. Use the\nbutton to save the values entered.\nIf the document contains nested templates, you should configure permissions for them as well.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-access-permissions-to-document-creation.html"
}