{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.414.2 от 07.06.2024\nНовые возможности\nДля комфортной работы с электронным документом добавлена возможность поиска по тексту документа.\nТеперь в электронном документе помимо открытия самого объекта, можно также открыть объект-источник закладки.\nТеперь просмотр служебной информацией об алгоритме доступен по кнопке, расположенной на панели управления карточки алгоритма.\nИзменения и улучшения\nДоработки по\nвиджету \"Чат по объекту\"\nкоснулись перехода в чат по ссылке-приглашению, блокировки кнопки в карточке объекта при отсутствии прав, наименованию чата по умолчанию и содержимому уведомлений.\nСтабилизирована работа\nвиджета \"Проводник\"\n, а также добавлена возможность скачивания папки.\nТеперь в\nдашбордах\nи в\nвиджете \"Дашборд\"\nчисловые значения отображаются с разделителем.\nОтлажен процесс регулирования ручной и автоматической корректировки расчета значения атрибута.\nСтабилизирована возможность изменения\nтипа связи объектного атрибута\n.\nСтабилизировано открытие карточки объекта, на визуал которого вынесены атрибуты дочернего типа.\nДоработано отображение объектов мультиселект-атрибута с визуальным представлением\n\"Выбор из справочника в виде radio button’ов\"\nи атрибутов с визуальным представлением\n\"Изображение\"\n.\nСкорректированы значения атрибутов, отображаемые в реестре \"Алгоритм\".\nДля экземпляров примитивных типов объекта теперь доступно только отображение реестра вида \"Календарный реестр\", \"Плоский реестр\" и \"Легкий реестр\".\nСтабилизирована возможность выбора объектов в реестре\nсессий пользователей\n.\nСкорректировано выполнение действия при запуске алгоритма из дочернего объекта.\nСтабилизировано отображение визуала, установленного по алгоритму.\nДля фильтрации значений посредством дерева условий доработан процесс проверки условия на Null.\nДоработана возможность обновления данных посредством функции\nrefreshVisualItem\nпри открытии неактивной вкладки, данные на которой были изменены.\nСтабилизировано отображение кнопки блокировки пользователя при отсутствии прав на блокировку.\nСкорректирована логика проверки прав для возможности изменения собственного пароля.\nОтлажен процесс создания обновлений при наличии\nразрешения\n.\nОптимизировано время отрытия карточки задачи и процесса удаления объектов.\nВ модуле EDoc стабилизирована работа с электронным документом при активной настройке \"Оптимизировать формирование документа\".\nПовышена производительность открытия пунктов главного меню.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.414.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.414.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.414.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.414.2-latest.html"
}