{
  "title": "Настройки для работы с почтовым сервером",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройки для работы с почтовым сервером\nИспользование корпоративной почты – необходимая часть коммуникации в организации.\nСбор, хранение, обработка информации, а также организация деятельности сотрудников невозможны без функционирования почтового сервера организации.\nФункциональность платформы GreenData позволяет:\nнастроить оперативную рассылку электронных сообщений с заданного электронного адреса;\nпринимать, обрабатывать и сохранять данные, получаемые на электронную почту.\nДля настройки взаимодействия с почтовым сервером в Системе используется тип объекта \"Учетная запись электронной почты\" [SYS_MAIL_ACCOUNT], в экземпляре которого могут быть настроены следующие параметры:\nПараметр\nНазначение\nНаименование\nНаименование учетной записи.\nУчетная запись по умолчанию\nИспользование данной учетной записи при отправке электронных писем по умолчанию.\nДанный параметр может быть активен только у одного объекта типа \"Учетная запись электронной почты\".\nПри попытке изменения учетной записи по умолчанию во время сохранения объекта Система выведет соответствующее уведомление для подтверждения действия.\nОтправка\nУчетная запись\nАдрес электронной почты, с которой выполняется рассылка сообщений.\nЗначение не должно содержать пробелов.\nПароль\nПароль пользователя, от имени которого производится рассылка сообщений (в некоторых почтовых сервисах при предоставлении доступа почтовым клиентам формируется дополнительный пароль).\nПараметр определяется через\nсекретную переменную\n.\nПротокол\nОпределение сетевого протокола для передачи исходящей почты.\nВозможные варианты:\nsmtp – простой протокол для передачи электронной почты;\nsmtps – защищённое соединение;\nstarttls – расширение простого протокола smtp, которое позволяет создать зашифрованное соединение.\nПо умолчанию используется smtp.\nSMTP (Simple Mail Transfer Protocol) – простой протокол передачи почты, используется для отправки почты, как клиентом на сервер, так и сервером на другой сервер.\nУ протокола две главные задачи:\nПроверка корректности настроек системы и предоставление \"разрешения\" на отправку email-сообщения для определенного устройства.\nОтправка исходящего сообщения на заданный адрес электронной почты и подтверждение успешной доставки. Если сообщение доставить не удается, отправитель получает соответствующее извещение.\nХост\nАдрес или имя почтового сервера.\nХостинг почты — услуга интернет-хостинга почтовых серверов, которая позволяет настроить собственный адрес электронной почты и использовать его для отправки электронных писем.\nПорт\nПорт для работы с почтовым сервером. Выбор порта зависит от указанного протокола.\nПорт — это числовой идентификатор программы или процесса, которые обслуживают сетевые соединения на заданном сетевом адресе (IP-адресе).\nПротокол \"smtp\" (часто используемый документ, регламентирующий работу сети Интернет и ее основных компонентов) использует следующие порты:\nпорт 25 – для передачи почты между почтовыми серверами;\nпорт 465 – для безопасного соединения (устанавливается при использовании порта SMPTS);\nпорт 587 –  для передачи почты от почтового клиента на сервер.\nПо умолчанию используется порт 25.\nНаименование отправителя\nОтправитель, от имени которого производится рассылка сообщений. Наименование отправителя отображается в заголовке письма.\nПолучение\nУчетная запись\nАдрес электронной почты пользователя, с которой настраивается интеграция.\nПароль\nПароль от электронной почты (в некоторых почтовых сервисах при предоставлении доступа почтовым клиентам формируется дополнительный пароль).\nПараметр определяется через\nсекретную переменную\n.\nПротокол\nОпределение метода доступа к электронной почте.\nВозможные варианты:\nimap — протокол без шифрования;\nimaps — защищённое соединение;\npop3 — протокол без шифрования;\npop3s — защищённое соединение.\nРекомендуется использовать протокол imaps.\nХост\nОпределение хоста.\nХостинг почты — услуга интернет-хостинга почтовых серверов, которая позволяет настроить собственный адрес электронной почты и использовать его для получения электронных писем.\nПредоставляется почтовым сервером.\nПорт\nОпределение порта входящей почты.\nВыбор порта зависит от указанного протокола:\nдля pop3 — 110;\nдля pop3s — 995;\nдля imap —  143;\nдля imaps — 993.\nПо умолчанию используется порт 143.\nОтправка электронных сообщений реализуется при помощи функции\nsendMsgToEmail\n.\nВ\nOn-Premise\nрешении для корректной отправки сообщений с заданного по умолчанию адреса электронной почты потребуется:\nСоздать экземпляр\nучетной записи электронной почты\n, указать наименование и заполнить параметры блока \"Отправка\".\nДля созданного объекта активировать параметр \"Учетная запись по умолчанию\".\nПрименить функцию\nsendMsgToEmail\nв рамках поставленной задачи.\nВ SaaS решении данные настройки задаются Системой по умолчанию (в качестве e-mail адреса отправителя используется адрес электронной почты пользователя).\nСписок имен или IP-адресов серверов приложений, на которые может выполняться отправка уведомлений\nопределяется в\nсистемных настройках\n.\nДля получения и обработки e-mail сообщений используется\nслушатель сообщений\n, в настройках которого необходимо выбрать экземпляр учетной записи электронной почты.\nУчетная запись электронной почты может быть создана через одноименный параметр непосредственно в карточке\nслушателя сообщений\n.",
  "source": "https://docs.greendata.ru/platform/ru/settings-for-working-with-a-mail-server.html"
}