{
  "title": "Business processes",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nBusiness processes\nIn modern automation projects, organizing data and designing a user-friendly interface is not enough. Business automation specialists are required to organize the very activity of users.\nRole\nThe System user is not only the task performer, but also a human who can forget something, lose something, get delayed completing a task, make a mistake, get distracted, misunderstand something, etc. As a result of possible inaccuracy, an important document may not be issued, a task wouldn’t be completed, a client wouldn’t get proper service and contract wouldn’t get signed.\nBusiness processes do not replace people and do not eliminate the mistakes of performers, but they reduce the likelihood of organizational errors:\nremind users about forgotten assignments;\narrange the sequence of work stages;\neliminate conflicts between performer’s tasks;\ncontain the basic logic of making organizational decisions.\nYou could hear not only about \"Business processes\" but also about their analogues — \"Workflows\" which can perform important technical actions without reflecting them in documentation. But within GreenData, it is assumed that\nbusiness processes are inextricably linked with workflows\nand record changes in documents. Therefore, the activity of business processes is provided by the \"Workflow\" module, and the type of the business process itself is called \"WF. Business process\" [WF_PROCESS].\nVisibility of business processes\nA business process is a scheme of interaction, an algorithm by which users act to get a result.\nThe business process flowchart should be created according to the rules of a specific modeling notation. In the field of business process automation, we use notations such as IDEF0, procedure, EPC, etc. BPMN (Business Process Model and Notation) is considered to be the most advanced, flexible and universal notation. This exact BPMN notation is used in the System.\nThe visibility of the BPMN notation (even for an untrained user) allows the employee to quickly navigate the possible options for conducting activities.\nNaturally, a typical business process has one start event and one end event. In our case, \"Task 1\" will be executed after starting the business process. Next, depending on a certain condition (excluding \"or\"), the process will go along one of the following paths:\n\"Task 2\" and \"Task 3\";\n\"Task 4\";\n\"Task 5\", \"Task 6\", \"Task 7\".\nAfter completing the chain (we don’t know which one in advance), \"Task 8\" will be completed together with the process itself.\nMore information about the elements of BPMN notation can be found in the following articles:\nEvent Flow Item\n;\nAction Flow Item\n;\nLogical Operators (Gateways)\n;\nWorkflow Connector\n;\nFootnote Artifacts\n.\nThe flow chart configuration process seems obvious until the question of performers arises.\nBusiness process performers\nIf tasks (actions) within the business process are required to be performed by several System users, it may lead to the appearance of pools and lanes of performers on the business process chart.\nA pool\n– is a generalizing contour of the business process flowchart in which the activity of one or more performers occurs. A pool contains one or more lane.\nA lane\n– is a part of the flowchart indicating the area of responsibility of a particular performer (system user).\nMore information:\n*\nFlow chart items: PooL, Lane\n;\nIn most cases, the business process flowchart does not require the presence of a pool and lanes (they may be absent even in complex charts), since all business process tasks are individually configured to match with their performers. Pools and lanes are used to increase the flowchart’s visual clarity, but they do not actually affect the assignment of the performer.\nPerformers should be assigned in the properties of each task\n.\nBusiness processes are designed as rules of role activity. Therefore, it is not a specific person but a role of the user that should be selected/assigned as the task performer. Please note that the business process configuration interface uses the concept called\nRole\nwhich is named \"Access group\" [SYS_SEC_GROUP] in the System.\nIn GreenData, actions within the business process are ordered by stages.\nA stage\n– is a generalized term for the execution activity (task and subprocess) regardless of the performer. The stage can be represented by \"User task\", \"Sending messages\", \"Service task, etc.\nAll types of stages (general actions and tasks) are presented in the \"WorkFlow. Type of business process stage\" [WF_PROCESS_STAGE_TYPE] registry.\nConnectivity of the business process model\nThe business process model is presented in an integrated fashion in the System and consists of elements:\nBusiness process profile\n(\"WorkFlow. Business process\" [WF_PROCESS]);\nBPMN flowchart\n(a special profile attribute, filled with XML content presented as related chart elements);\nBusiness process versions\n(\"Workflow. Business process version\" [WF_PROCESS_VERSION]);\nRelation with route object\n(\"WorkFlow. Relation of process and document type\" [WF_PROCESS_OBJ_TYPE] - mandatory mapping of object types for which a business process can be started and executed).\nNote. Naturally, when the BPMN visual chart and its elements are saved, they are saved not only in XML format, but also converted into entities of the object model. For example, all the flowchart tasks (stages) are saved in \"WorkFlow. Business process stage\" [WF_PROCESS_STAGE] registry and gateways in \"WorkFlow. Business process gateway\" [WF_PROCESS_COND] registry.\nMore details in the following articles:\nCreating a business process profile\n;\nSetting up business process flow charts\n;\nCreating a relation between a business process and an object type\n;\nBusiness process versioning\n;\nThis model allows users to declare the business process and save it in the System. The mechanism of the business process execution leads to the appearance of new elements – business process instances.\nBusiness process execution\nThe business process starts running precisely with the route object (in the registry or an instance profile). The business process can be started manually (by the \"Start business process\" action) or triggered automatically (e.g. when creating an instance of a route object). The start of the business process is defined by its additional settings. More information in the\nStarting a business process\narticle.\nWhen the business process is launched, the \"WorkFlow. Running process instance\" [WF_PROCESS_INSTANCE] object is created in the registry and an autonomous instance of the business process with an activity attribute (IS_ACTIVE) starts functioning.\nEach instance of the business process is connected with a common (for the process) execution scheme, a specific instance of the route object but is characterized by its active state.\nIf the Simultaneous launch is allowed in the business process additional settings, then several instances of the same business process can be started and executed simultaneously for one instance of the route object.\nSince business process stages (generalized actions and tasks) are logically connected with performers (due to stage settings and not being part of pools and lanes), then as it moves to the next stage (active stages are visualized in red) the \"WF. Task in process\" [WF_PROCESS_TASK] task will be automatically sent to the corresponding performer.\nNote that a process instance is always connected with a specific instance of a route object. Therefore, the task coming to the performer’s interface is supplemented with the corresponding instance of the route object.\nThe performer reacts to the task and after completing the required actions reports that the task is completed (\"Complete task\" action). After completing a task, the business process automatically proceeds to the next stage.\nIn our case (see the figure above), \"Performer 1\" sees two tasks in the interface.\nIf \"Performer 1\" completes \"Task 8\", then the instance of \"Business process 1\" will be completed with the end event.\nIf \"Performer 1\" completes \"Task 4\", then an instance of \"Business process 2\", thanks to an exclusive gateway (management \"or\"), will move on to the next stage and assign \"Task 8\" to the same performer.\nIf a certain stage (task) of the business process involves automatic (with no user participation) data extraction, import, export, calculation and result substitution, then such a task is presented on a flowchart as a \"Service task\" or \"Task-scenario\". In this case, the task is performed by the System according to a predetermined scenario (algorithm).\nIn complex cases of business processes with a large number of recurring elements, the \"Subprocess\" will be an effective task, allowing you to decompose actions and increase the readability and visibility of the process flowchart.\nMore on the subject in the following articles:\nLogical Operators (Gateways)\n;\nTask\n;\nWorkflow Connector\n;\nEnd Event\n;\nScript task\n;\nService Task\n;\nSub Process\n.\nMechanism for determining performers\nThe properties of the configurable business process task which should be performed by an employee allow you to select the \"Role of the task performer\", but in organizations with a developed organizational structure (with offices, branches, separate divisions, etc.), one role can be present in several departments at once and cause difficulties in assigning those responsible.\nFor example, the \"Service request\" business process implies that there will be a \"Driver\" role, but some drivers are subordinate to the head of the transport service (\"Supervisor\" role), while others are subordinate to the head of production (\"Supervisor\" role). Therefore, if the driver’s request registered in the business process should be reviewed by his supervisor, then it is necessary to regulate possible options for interaction.\nIn cases of a simple organizational structure (which does not contain variations of subordination of roles), the business process curation matrix may not be created. At this point, tasks will be redirected between the roles of performers.\nIf the subordination of roles is actually required, then it’s provided by \"Curation matrix\" [SYS_LEADING_MATRIX] which is created for each pair of interacting roles in the business process:\nsupervising role\nsupervised role\nand contains names of departments with employees assigned to these roles (or more accurately \"Access groups\").\nThe curation matrix contains permissions (colored in green) for interactions of roles within the business process. In this case, the process will transfer requests from supervised employees to supervisors within their offices.\nThe curation matrix allows users to:\ndifferentiate the permissions to view and record an object;\nidentify potentially responsible employees by tasks;\nsolve the tasks of determining subordinate employees.\nMore on the subject in the following articles:\nConfiguring permissions for a business process (Curation Matrix)\n;\nCuration of departments\n;\nCreating a Curation Matrix\n;\nUse cases of setting up a Curation Matrix\n.\nIt should be particularly noted that even a clearly defined (e.g., according to the curation matrix) performer cannot always fulfill his duties and in some cases should be automatically replaced by the System.\nSubstitutions in the business process\nIf the performer — for objective reasons — cannot complete the task within the business process (vacation, sick leave, day off, etc.), then the analyst is required to address the \"Substitution\" [SYS_SUBSTITUTION] option and specify:\nemployee (being replaced);\nthe reason for the absence (reason for substitution);\ntime range (from \"start date\" to \"end date\");\nsubstitute employee (temporary performer).\nDistribution of access in the business process\nThe business process setup implies that as the performer is defined and assigned to a task (stage), the user will receive a notification about the assigned task with an indication of the object instance (route object) in which the action is required to be performed. In order to perform actions with an instance, the performer require (permanent or temporary) access rights to this instance. The lack of permissions will not allow the performer to fill in data, make changes and even see the required document.\nInitially, it is difficult to correctly grant the required permissions to all participants (who can be rotated, assigned, replaced) for a complex business process. It is even more difficult to keep previously given permissions settings up to date for a long time. Therefore, the System provides a special automatic mode of distribution of permissions for the duration of tasks and stages of the business process.\nThis kind of permissions control \"\nControl of permissions for responsible employees\n\" allows users to automatically issue permissions as the tasks of the business process are completed:\nto a specific performer (an employee assigned as the task performer);\nto a specific object (an actual instance of a route object);\nfor the duration of the task execution (after the task is complete, the permissions will be revoked).\nIt is strongly recommended for business analysts to select the \"\nControl of permissions for responsible employees\n\" option to automate business processes . This feature is available when configuring the route object type in \"Advanced Settings\" → \"Access Control\".\nBusiness process routing\nIn addition to visualizing business processes in BPMN format, the System’s tools and interface allow users to display a sequence of tasks (stages) of a business process in a table format, on which completed tasks (completed stages) are colored in green, and active tasks are colored in red.\nThe command button \"Route\" on the toolbar allows users to switch to a tabular representation of the route. The \"Complete Task\" button implies that the user can close an active (current) task in an unfinished business process. The tabular representation of the route allows users to quickly navigate through the previously performed actions, the current stage of the business process, as well as the active task(s) with an understanding of the responsible performers.\nIt is possible to display the stages of the business process (the progress of the route object) as well as technical information (service actions and service operators) within offices in the routing table. In cases when the business process execution requires editing, the System interface allows us to perform key administrative actions:\nThe BPMN flowchart and the route table are complementary modes of control over the execution of business processes. Learn more in the\nViewing the route map\narticle.\nAdditional features\nIt is possible to display the stages of the business process (the progress of the route object) as well as technical information (service actions and service operators) within offices in the routing table.\nIn cases when the business process execution requires editing, the System interface allows us to perform key administrative actions:\nrollback of a completed task;\ntask re-creation;\nresuming the business process;\n\"clearing\" the task.\nFor more information, see the\nRoutes administration\narticle.\nManaging deadlines\nTasks assigned to performers can be regulated by deadlines. For this purpose, the System has a directory of deadlines (\"WorkFlow. Deadlines\" [WF_NORMATIVE]) which allows users to set deadlines for business process stages. This directory helps you to answer the question: \"\nIn what time should the stage (task) or even the entire business process route be completed?\n\".\nIn order to plan the deadline, user needs to create an entity in the \"WorkFlow. Deadline\" directory and link it to a route object type, a business process and its task (stage). Other relation fields are populated for specialized tasks. The task deadline can be set explicitly or calculated algorithmically.\nThe actual data on the time to completion of business process tasks is saved as records in the registry of the System \"WorkFlow. Regulatory term example\" [WF_NORMATIVE_INSTANCE].\nDeadlines allow users to ensure the relevance of the execution of business process stages, as well as motivate performers to complete assigned tasks in time.\nMore on the subject in the following articles:\nDeadlines directory\n;\nNotifications of deadlines\n;\nSuspension of deadlines\n;\nDisplaying data for configured deadlines\n.\nConclusion\nSetting up business processes is a key goal of the business automation projects. Well-tuned business processes will not exclude human mistakes, but significantly increase the productivity and efficiency of employees and make them more responsible to achieve the result within the team.\nThere is no need to assume that a business analyst will be able to immediately describe and configure all the declared business processes. The effect of process automation should be gradual. The client will inevitably change the requirements, make clarifications and adjustments.\nThat is why GreenData is designed as a flexible and dynamic business logic execution environment. It allows you to correct the rules of business processes without stopping activities, disconnecting users and without making technical pauses, which seem inevitable in typical automation projects.",
  "source": "https://docs.greendata.ru/platform/en/business-processes.html"
}