{
  "title": "\"External frame\" Widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"External frame\" Widget\nThe \"External frame\" Widget\nis a tool that allows displaying other Systems in the object profile (by the given URL).\nExample of a configured widget:\nAdding a widget is done in the\nvisual editing mode\n. When switching to the Widgets tab in the Elements panel, drag (Drag&drop) the \"External frame\" widget into the profile area (into the previously added \"Row\" space container).\nThe “Frame to external system” widget can only be dragged and dropped into the “Row” space container previously added to the profile workspace from the “Groupings” tab of the “Elements” panel.\nThe system will display the widget settings.\nWidget settings\nSetting\nPurpose\nAlgorithm for external system link\nAdding an algorithm that returns a link to an external system. The selection is made using a drop-down list of pre-created algorithms. To create a new algorithm, click on the kebab menu on the right side of the field and select \"Add\" in the context menu.\nThe algorithm should return a\ntext\nwith a link to an external system.\nWidget height, px\nSpecifying the widget height in px by entering a numeric value.\nThe default value is 150.\nThe URL that displays the external system is displayed should not have restrictions, read more\nhere\n.\nOnce the widget is set up, the visual will display a frame to an external system.\nUse example\nThe\nwww.paylab.com/salary-calculators-list\nsite should be displayed in the object profile.\nTo do this, in the visual editing mode, add the \"Row\" element to the workspace, and then the \"External frame\" widget. After adding the widget, the System will display its parameters in the workspace.\nFor the subsequent adjustment of the widget, set the frame height and add an algorithm.\nTo add a new algorithm, click on the kebab menu in the right part of the field and select the \"Add\" option, which will open a modal window for creating a new algorithm, where you should specify the algorithm name and identifier.\nThe algorithm code contains a link to an external system placed in double quotes:\nNext, save the algorithm with the\nicon and click on the \"OK\" button. Also, save the visual by clicking on the \"Save\" / \"OK\" buttons on the \"Elements\" panel.\nAfter that, the selected site will be displayed in the object profile.\nIf the borders allocated for the widget do not allow to fully display the site content, a vertical scroll bar is displayed on the right side of the frame, and a horizontal scroll bar on the bottom.",
  "source": "https://docs.greendata.ru/platform/en/external-frame-widget.html"
}