{
  "title": "Виджет \"Управление вкладками\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Управление вкладками\"\nВиджет \"Управление вкладками\" позволяет продемонстрировать настроенные ранее вкладки в карточке Объекта.\nПример настроенного виджета:\nВиджет отобразит вкладки выбранной группы вкладок (подробнее,\nНастройка элементов группировки\n).\nНастройка виджета\nДля создания виджета необходимо перейти на вкладку \"Виджеты\", выбрать элемент \"Управление вкладками\" и перенести его в рабочую область. Чтобы настроить виджет, нужно заполнить параметры в карточке объекта.\nДля настройки виджета доступны следующие\nпризнаки, обозначенные в графе \"Параметр\"\n. При выборе параметра (признака) доступно свойство (назначение):\nПараметр\nНазначение\nСокращать наименования вкладок\nАвтоматическое сокращение наименования вкладки в зависимости от размера пространства для его отображения\nГоризонтальное выравнивание\nОтображение наименования вкладок горизонтально\nСтилизовать как вкладки\nОтображение наименований вкладок в нижнем регистре\nПоказывать выпадающее меню\nОтображение выпадающего меню (списка) при использовании группы вкладок (как элемента группировки) на настраиваемой вкладке\nОтображение виджета\nОтображение виджета зависит от используемых настроек. Например, с применением свойства \"Сокращать наименование вкладок\" виджет выглядит следующим образом:\nПри использовании свойств \"Горизонтальное выравнивание\" и \"Стилизовать как вкладки\" виджет отображает информацию таким образом:\nПри использовании свойства \"Показывать выпадающее меню\" виджет представляет данные следующим образом. При нажатии курсором на вкладку с выпадающим меню доступна дополнительная информация:",
  "source": "https://docs.greendata.ru/platform/ru/tabs-management-widget.html"
}