{
  "title": "Настройка реестра",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка реестра\nПользователь может настроить вид интерфейса и отображение данных в\nреестре типа объекта\nв соответствии с приоритетами, задачами и визуальными предпочтениями.\nНастройки визуала реестра, созданного системой автоматически, хранятся в реестре типа \"Реестр по умолчанию\" [SYS_REG_DEFAULT].\nНастроенные пользователем визуалы реестров сохраняются в реестре типа \"Реестр\" [SYS_REGISTRY].\nПрава доступа\nПереход к настройкам реестра осуществляется по кнопке\n, по умолчанию расположенной в панели управления.\nВозможность настройки реестра предоставляется при наличии\nправ доступа\nна:\n\"Создание экземпляров\" типа объектов \"Настройка базового реестра\" [SYS_REGISTRY] и/или \"Настройка пользовательского реестра\" [SYS_REGISTRY_CUSTOM].\n\"Редактирование\" текущего реестра (объекта типа \"Настройка базового реестра\"/\"Настройка пользовательского реестра\").\nПри этом если у пользователя отсутствуют права на \"Редактирование\" текущего реестра, но есть права на \"Создание экземпляров\" типа объектов \"Настройка пользовательского реестра\" [SYS_REGISTRY_CUSTOM], то при клике на кнопку\nбудет создан пользовательский реестр.\nЕсли же кнопка\nбыла\nскрыта\nна панели управления, тогда для доступа к настройкам реестра необходимо обладать правом на\nразрешение\n\"Настройка реестра\".\nВ данном случае кнопка будет отображаться в правом верхнем углу панели управления.\nНастройка\nПосле\nоткрытия\nнеобходимого реестра и нажатия на кнопку\nотобразится модальное окно с параметрами настройки:\nПараметр\nНазначение\nНаименование\nВвод (просмотр) наименования реестра\nТип объекта\nОпределение/ просмотр типа объекта, реестр которого настраивается.\nПолный перечень типов в выпадающем списке параметра доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nВид реестра\nВыбор вида настраиваемого реестра. Возможные значения:\nплоский реестр (отображение экземпляров единым списком);\nкалендарный реестр\n(отображение экземпляров внутри календаря);\nреестр с иерархией\n(отображение экземпляров согласно иерархии);\nреестр с папками\n(отображение экземпляров, систематизированных по папкам);\nплиточный реестр\n(отображение экземпляров в виде заявленных форм, для определения формы необходимо выбрать ранее настроенный визуал\nв поле \"Визуал для плиточного реестра\"\n);\nлегкий реестр\n.\nВид реестра задач\nВид\nреестра задач\n, открываемый по умолчанию. Возможные варианты:\nКалендарь;\nТаблица.\nПо умолчанию параметр определяется значением, установленным в\nсистемной настройке \"Вид реестра задач по умолчанию\"\n.\nПри настройке\nпользовательского реестра\nзначение параметра наследуется от\nбазового реестра\n.\nПараметр отображается при настройке реестров типа \"ДО\". Задачи на процессе\" [WF_PROCESS_TASK] и его дочерних типов.\nРазрешить мультивыбор\nРежим выделения экземпляров типа определяет возможность выбора объектов в реестре: единичный или мультивыбор.\nПараметр доступен при выборе следующих видов реестра:\n\"Плоский реестр\";\n\"Легкий реестр\";\n\"Реестр с иерархией\";\n\"Реестр с папками\".\nОбновлять реестр автоматически\nОпределение возможности автоматического обновления данных в реестре.\nДанная настройка влияет на автообновление данных в реестре, в виджете\n\"Реестр объектов\"\n, в объектных атрибутах с визуалами\n\"Реестр для мультселект атрибута\"\nи\n\"Множественные объекты в виде таблицы\"\n.\nАвтообновление данных в\nдочерних атрибутах\nи виджете\n\"Реестр задач\"\nот состояния данной настройки не зависят – данные в них всегда обновляются автоматически.\nПо умолчанию параметр неактивен.\nВ зависимости от вида настраиваемого реестра отображаются вкладки для настройки:\n\"Настройка колонок\"\n– вкладка, на которой определяется какие колонки будут отображаться в реестре, их порядок и группировка строк;\n\"Общие настройки\"\n–  вкладка для настройки отображения объекта в реестре и при открытии;\n\"Панель управления\"\n– вкладка отвечает за отображение элементов в панели управления реестра;\n\"Действия\" – вкладка для определения способа отображения действий, совершаемых над экземплярами реестра (подробнее в статье\n«Вид реестра \"Легкий реестр\"»\n);\n\"Фильтрация и поисковые фильтры\"\n– вкладка, настройки которой позволяют отсортировать и отфильтровать объекты в реестре, а также отобразить специализированную панель для поиска и фильтрации данных в реестре по заданным параметрам;\n\"Стили отображения\"\n– вкладка для настройки границ ячеек реестра и стиля отображения объектов;\n\"Пагинация\"\n– вкладка для настройки постраничного просмотра данных реестра.\nАлгоритмы стилизации и фильтрации\nучитываются Системой только при условии вывода в реестр используемых в формуле полей (атрибутов). То есть в формулах учитываются поля,  непосредственно добавленные в реестр в качестве колонок.\nПосле сохранения изменений по кнопке\nвнешний вид реестра изменится в соответствии с произведенными настройками.",
  "source": "https://docs.greendata.ru/platform/ru/configuring-the-registry-visual.html"
}