{
  "title": "Logical Operators (Gateways)",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nLogical Operators (Gateways)\nIn business processes (BP),\ngateways/logical operators\nare used to record divergences and convergences of the BP workflow\nand determine the progress of the route object. Thus, this item implies branching, splitting, merging and connecting the routes of the object(s) in the BP of the System.\nOn the BP flow chart, the gateway is represented as a diamond (by default, the System will display an\nExclusive gateway\n, which is described below):\nThe type of gateway determines its specificity. To choose a gateway type, click the\nbutton in its menu: a list of types will open.\nGateways of each type affect both inbound and outbound flows. The gateway types are:\n– Exclusive gateway (the OR operator, exclusive gateway):\nif the operator is used to branch the BP, the workflow is directed only on one outgoing branch (depending on the conditions)\nif the operator is used for synchronization, it waits for at least one incoming branch to complete and activates the outbound flow\n– Parallel gateway (the AND operator, parallel gateway):\nif the operator is used for branching, it splits one control flow into several parallel ones. All outgoing branches are activated at the same time\nif the operator is used for synchronization, it waits for all incoming branches to complete and then activates the outbound flow\n– Inclusive gateway (the inclusive OR operator, inclusive gateway):\nit activates one or more outgoing branches if branching is performed\nif the operator is used for synchronization, it waits for one incoming branch to complete and activates the outbound flow\n– Complex gateway has several conditions, depending on meeting which the outgoing branches are activated. Conditions are set for transitions (in the item settings window) coming out of this operator\n– Event-based gateway (the exclusive OR operator) directs the control flow only to the outgoing branch on which the event occurred first. Only events or message handler actions can follow the operator of this type\nTo configure the gateway of the selected type, you need to:\n1. Drag the item to the workspace of the custom BP. For more information, refer to\nSetting up business process flow charts\n.\n2. Save the business flow chart generated.\n3. Click\non the item’s action bar. The System will display the settings profile.\nThe outbound flows (flow) will be defined automatically\nafter saving the BP flow chart. The following gateway parameters are defined automatically, where:\nSetting\nPurpose\nName\nDisplaying the setting name. It is formed automatically, borrowed from the name of the connector used (for more information, refer to\nControl Flows Connector\n).\nCondition type\nThe display of the gateway type is generated automatically.\nIdentifier\nThe display of the BP item identifier is generated automatically.\nSetting up outbound transitions\nThe outbound transitions are formed automatically according to the custom flow chart. The field is editable.\nFor example, when considering the business process which takes into account the early repayment of the loan, the gateway branches the flow chart into:\non-time loan repayment\nearly repayment\nAt the same time, the System allows you to create (edit) outbound flows. The first transition is taken into account by default in case of on-time loan repayment. The second transition – the\nearly repayment\n– is configured by the analyst. Here, you need to specify the algorithm (condition) to define the route of the Client’s Request (Application for decision-making) in case of early repayment of the loan.\nFor example, you can edit the visual settings in the profile of any object (for more information, refer to\nConfiguring the visual\n).\nThe transition condition is specified by the algorithm (condition) to define the route of the Client’s Request (application) for early repayment of the loan:\nIn other words, if you specify the\nEarly repayment\noption, the route object will be directed to the conditional transition of the business process.",
  "source": "https://docs.greendata.ru/platform/en/logical-operators-gateways.html"
}