{
  "title": "System integration using a message queue",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSystem integration using a message queue\nThe message queue is one of the forms of interaction between systems for data transmission and synchronization, which is used to process messages in the order they arrive.\nThe sender puts the message in the queue, and the recipient retrieves it and processes it.\nMessages are usually small in size and can be represented as requests, responses, error messages, or some kind of information.\nIntegrations with the following queue types can be configured within the framework of the platform:\nJMS\nis a standard software for sending messages, in which messages are sent asynchronously, i.e. the sender does not wait for a response from the recipient.\nKafka\nis a message broker for large distributed systems. The sent data is stored until the specified period expires. Messages are not deleted after they are received and can be re-read.\nRabbitMQ\n(AMQP 0-9-1) is a software message broker based on the Advanced Message Queuing Protocol 0-9-1. In RabbitMQ, the message is stored until the receiving application receives it from the queue.\nData integration using a message queue is performed by configuring an\nETL process\n.\nFor\nreading messages\nfrom the queue, the ETL process is run via\nmessage queue listener\n.\nTo access the message queue,\nconnection parameters\nneed to be specified.\nThe connection can be created in advance or added during the setup process:\nreading a message from the queue (in the \"ETL. Message queue listener\" type profile);\nsending a message to the queue (when setting up the \"Receiver. Message queue\" ETL stage).\nConnection settings\nTo configure the connection to the message queue, an instance of the type \"ETL. Message queue connection parameters\" [ETL_MQ_CONNECTION_PARAM] is created and the following parameters are specified:\nSetting\nPurpose\nConnection name\nThe name of the connection .\nMessage encoding\nSelecting the message encoding type via the drop-down list.\nBy default, the encoding is \"UTF-8\".\nThe type of queue\nQueue type selection.\nPossible  options:\nJMS\n;\nKafka\n;\nRabbitMQ (AMQP 0-9-1)\n.\nJMS provider\nSelecting a JMS provider depending on the project requirements and specific tasks. Selected via the drop-down list.\nPossible values:\nActiveMQ;\nTibco EMS;\nWebsphere MQ.\nThis parameter is available if JMS is specified as the queue type.\nThe set of additional parameters for configuring the connection depends on the selected queue type and will be presented in the following subsections for each queue type.\nFor example, the instance profile, selecting the \"Kafka\" queue type will look like this:\nJMS connection settings\nWhen selecting the JMS queue type, a field will be displayed to identify the JMS provider, a set of parameters for configuring the connection with JMS will be different depending on the chosen provider.\nSetting\nPurpose\nHost\nAdding the IP address of the connected server.\nPort\nAdding the port of the connected server.\nLogin\nSelecting the login for authentication on the server.\nPassword\nSelecting the password to the specified login for authentication on the server.\nWhen choosing the \"ActiveMQ\"\nSSL setup\nThe message encryption method\nusing SSL\n. The selection is done via the drop-down list of pre-created encryption protocols.\nWhen choosing the \"Tibco EMS\"\nMessage Queue\nThe queue name in which messages are placed or withdrawn.\nWhen choosing the \"Websphere MQ\"\nSSL setup\nThe message encryption method\nusing SSL\n. The selection is done via the drop-down list of pre-created encryption protocols.\nMessage queue\nThe name of the queue in which messages are placed or withdrawn.\nThe \"com.ibm.mq.cfg.useIBMCipherMappings\" parameter value\nDetails on an external resource\nparameter value.\nConfiguring encryption (Cipher suite)\nSetting up encryption. The value can be taken from the \"Table 1. CipherSpecs supported by IBM MQ and the equivalent CipherSuites\" table , available at\nlink\n.\nUse MQCSP authentication\nDetermining the possibility of using MQCSP authentication by selecting the \"Yes\"/\"No\" values in the drop-down list.\nQueue manager\nManaging message queues and ensures their delivery.\nThe parameter value is provided by the queue administrator.\nChannel\nThe channel provides communication between applications.\nThe parameter value is provided by the queue administrator.\nConnection settings with Kafka\nParameter\nDestination\nHost\nAdding the address of the Kafka server to be connected. The IP addresses are separated by commas.\nIf necessary, the connection port is added with a colon after the specified URL.\nThe name of the group of listeners\nDetermining the name of the group of listeners. Unified group names allow seeing which groups of listeners read the sent message.\nMessage queue\nThe name of the queue (topic), which is specified in the Kafka server settings.\nUsername\nDetermining the user’s login for authentication on the server.\nPassword\nDetermining the password to the specified login for authentication on the server.\nKafka. Type of SASL mechanism\nDefining the type of authentication mechanism to enhance verification capabilities. The selection is done via the drop-down list of available options:\nPLAIN is a simple login and password authentication mechanism;\nSCRAM-SHA-256 is a data hashing mechanism;\nSCRAM—SHA-512 is a data hashing mechanism.\nThis parameter is required if the \"Username\" and \"Password\" fields are filled in.\nSSL setup\nThe message encryption\nusing SSL method\n. The selection is done via the drop-down list of pre-created encryption protocols.\nLearn more about the Kafka integration\nhere\n.\nConnection settings with RabbitMQ\nSetting\nPurpose\nHost\nAdding the IP address or name of the connected RabbitMQ server.\nPort\nAdding a connection port to the server.\nUsername\nDetermining the user’s login for authentication on the RabbitMQ server.\nPassword\nDetermining the password to the specified login for authentication on the RabbitMQ server.\nMessage queue\nThe name of the queue, which is specified in the RabbitMQ server settings.\nSending messages\nTo place a message in the message queue, configure the\nETL process\n, which\nflow chart\nmust have a configured \"Receiver. Message queue\" stage.\nReading messages\nTo read messages from the queue, configure the\nmessage queue listener\nand the\nETL process\nit runs.\nWhen a new message appears in the queue, the active\nmessage queue listener\nruns the ETL process in which, at the\n\"External service\" source type\nstage, the received message is divided into elements of a dynamic structure for further transformations within the framework of the task.\nMessage\nThe message queue listener checks for new messages in the queue, when new messages appear, it runs the\nETL process\nthat processes the extracted data.\nThe message queue listener is added in the\nregistry\nof the \"ETL. Message queue listener\" [ETL_MQ_LISTENER] by creating a new instance of the type and configuring the following settings:\nSetting\nPurpose\nETL to run\nThe ETL process which will be started when a message arrives in the queue.\nNumber of handlers\nSelecting the number of messages processed simultaneously.\nThe default value is \"10\".\nParameters for connecting to the message queue\nSelecting\nconnections to the message queue\n.\nThe selection is done via the drop-down list of previously configured\nconnections\n.\nThe creation of a new connection is performed using the \"Add\" option, available in the context menu after clicking on the action menu icon.\nThe listener acts\nActivating the listener by selecting a value in the drop-down list.\nThe listener is active when the box is checked, the listener is disabled when the box is unchecked.\nIn addition to the described settings, the instance profile of the \"ETL. Message Queue Listener\" type that contains a settings block consisting of two tabs:\nThe first tab contains the \"Message structure\" parameter, the contents of which are generated automatically based on the settings specified in the \"Parameters for connecting to the message queue\" field after saving the instance profile.\nOn the second \"Message part structure\" tab, it is possible to supplement the message structure by adding properties and headers that will automatically appear on the \"Message structure\" tab.\nWhen editing the \"Message part structure\" instance, the following settings are specified:\nSetting\nPurpose\nName\nEnter the name of the structure of the message part.\nIdentifier\nSpecifying the identifier of the structure of the message part.\nData type\nSpecifying the data type of the message part structure to be added. Available types:\ndate;\ncollection;\nboolean;\nobject;\nrow;\nnumber.\nType of message\nSelecting the message part type title or property. The title must be unique among all queues.\nThe received message structure will be passed to the input of the running\nETL process\nin the attribute of the \"External service response\" ETL instance.\nThe stage is added to the chart of the running ETL process started by the\n\"External service\"\nmessage queue listener. When configuring the listener, the\nformed message structure\nis inserted into the \"WSDL/JSON\" field. As a result, the message received from the queue will be decomposed into a dynamic structure according to the specified message structure.",
  "source": "https://docs.greendata.ru/platform/en/message-queue-system-integration.html"
}