{
  "title": "Private Cloud licensing",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nPrivate Cloud licensing\nUse of the GreenData platform deployed via\nrented cloud service\nis available upon purchase of a license.\nPurchase a license\nTo purchase a license, click on the “Buy a license” button.\nThis will open a tariff calculator that will allow defining the license parameters. The license cost will be displayed for the specified parameters.\nIf there is a need to select additional parameters or increase the limit, it is recommended to contact\nsales department\n.\nAfter clicking on the “Continue” button, a form will be displayed for entering the name and E-mail of the future license holder.\nAfter clicking on the “Pay” button, a form will open to verify the data of the selected tariff and the specified data, read and confirm the agreement with the offer, general terms and conditions and user agreement.\nClicking on the “Pay” button will open a form for payment. After successful payment wait for the license to be generated.\nPayment for the license is only possible with a bank card.\nAfter the license is generated, the user will be automatically redirected to the authorization page of the created application.\nDefault authorization data are used for the first login to the application:\nlogin: admin\npassword: adminka\nBind a license\nIn order to replace the license in the application, click on the “Bind a license” button.\nThis will open a form for uploading the license file by clicking\nor by dragging (Drag&Drop) the file into the upload area.\nIf a valid license is attached, the System will display its parameters.\nTo attach a license, read and confirm the agreement with the general terms and conditions and the terms and conditions of personal data processing, and then click on the “Apply license” button.\nTo delete a license, click on the\nicon.\nAfter attaching the license to the application, the user will be automatically redirected to the authorization page.",
  "source": "https://docs.greendata.ru/platform/en/licensing-private-cloud.html"
}