{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.425.6 от 29.08.2024\nНовые возможности\nПоявилась возможность настройки отображения заголовка в\nлегком реестре\n.\nРасширен функционал настройки виртуальной колонки реестра – добавлена возможность уточнения типа для выбора атрибута.\nТеперь при нештатном прерывании обработки ETL-процесса появилась возможность автоматического\nперезапуска работы ETL\n.\nПоявилась возможность настройки кнопок панели управления для стартовой страницы мобильного приложения.\nИзменения и улучшения\nДля\nобъектных атрибутов\nс множественным выбором отлажен процесс создания двусторонней связи и доработан механизм фильтрации.\nСтабилизирована работа\nвизуала \"Выбор из справочника в виде radio button’ов\"\nобъектного атрибута.\nСтабилизирована возможность скрытия внешних рамок группы вкладок при использовании любой\nтемы оформления\n.\nСтабилизировано отображение виджетов\n\"Прогресс-бар\"\nи\n\"Информация о сотруднике\"\n.\nОтлажено открытие карточки\nпримитивного объекта\nиз реестра.\nОтлажена фильтрация экземпляров реестра с\nвиджетом \"Рейтингование\"\n.\nСтабилизировано отображение реестра при группировке и агрегации по незаполненному столбцу.\nВ\nлегком реестре\nотображение длины заголовка адаптировано под доступную ширину.\nВ реестре стабилизирована возможность фильтрации значений.\nСтабилизировано отображение реестра при переходе к режиму редактирования.\nВ\nдашбордах\nстабилизирована возможность применения дефолтных значений высоты и ширины диаграммы.\nПовышено удобство настройки\nкоммуникационной панели\n.\nОтлажено отображение выпадающих списков объектов при настройке профилей в\nконструкторе страницы входа\n.\nОтлажен процесс выбора иконки для папки\nпунктов главного меню\n.\nВосстановлена работа модуля \"Пункт меню: FAQ\".\nОтлажена работа функций\ndict\nи\ngetObject\n.\nДля функции\nattr\nотлажен процесс прикрепления массива объектов из файлов в атрибут.\nФункция\ngetSelected\nоптимизирована для работы с цепочечными атрибутами.\nЛокализованы элементы настройки схемы\nбизнес-процесса\n.\nТеперь не требуется необходимость выбора единственного значения для перехода с этапа задачи\nбизнес-процесса\n.\nВ аудите действий отлажен процесс добавления новой записи об изменении прав доступа, а также отображение ссылки на объект, по которому запускалось действие.\nСтабилизирован перенос обновлений\nнастроек реестра\n.\nОтлажена возможность использования колеса прокрутки мыши при выборе расширения.\nВ модуле EDoc при создании источника и алгоритма его подсветки автоматически проставляется шаблон печатной формы, на которой создается источник.\nВ модуле EDoc налажена возможность изменения масштаба документа при помощи горячих клавиш, а также отлажено отображение комментариев в экспортируемом документе, помимо этого текст комментария теперь не имеет ограничений по количеству символов.\nВ модуле EDoc доработано сравнение формулировок основного источника с типовыми формулировками.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.425.6\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.425.6.war\nhttps://downloads.greendatasoft.ru/LTS/lts.425.6.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.425.6-latest.html"
}