{
  "title": "getCardOpeningArg",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ngetCardOpeningArg\nThe function allows determining the parameters for opening the screen form.:\nopening method (in a new/current tab or in a modal window);\nvisual instance\nID.\nThe function returns an object of the CardOpeningArg class.\nSyntax\ngetCardOpeningArg\n()\nNo parameters.\nNote\nWhen selecting the\ngetCardOpeningArg\nfunction from the \"Forms\" tab, the following structure is inserted into the algorithm code:\ndef cardOpeningArg = getCardOpeningArg()\nif (isNotNull(cardOpeningArg)) {\ndef cardOpeningMode = cardOpeningArg.getOpeningMode()\ndef cardOpeningVisualId = cardOpeningArg.getVisualId()\nif (cardOpeningMode.isTab() and cardOpeningVisualId = 100500) {\n// ...\n}\n}\nThe\ngetCardOpeningArg\nfunction gets an instance of the CardOpeningArg class. By default, the received instance is assigned to the cardOpeningArg variable.\nThe following methods are used when working with the function:\nMethod\nPurpose\ngetOpeningMode\nReturns an instance of the CardOpeningMode class. The following methods are used when working with the function:\nisTab – returns a boolean value that determines the opening of an object in a new/current tab;\nisModal – returns a boolean value that defines the opening of an object in a modal window.\ngetVisualId\nReturns the xref code:visual.adoc#ekz[instance visual].\nUse case\nAssume the user is required to configure the System depending on the way the client’s application is opened:\nwhen opening in a new/current tab, consider that the application has been accepted for work – change the status of the application to \"Doing\", appoint the current employee as the responsible;\nif the application is open in a modal window, the status and responsible employee of the application should not change.\nTo do this, set up the\nEvent before opening\n:\nLearn more about the algorithm\nThe variables are defined using the\nvar\nfunction;\nThe\nif\noperator is used to set conditions.\nThe\ngetCardOpeningArg\nusing the\nisTab\nmethod, the condition for opening an object in a new/current tab is checked;\nThe \"Request status\" attribute is selected using the\nattr\nfunction with the \"Set value\" attribute, where the dummy\nnull\nvalue should be replaced with the \"In progress\" value;\nUsing the\nattr\nfunction with the \"Set value\" attribute in the \"Responsible Employee\" attribute the current employee is recorded, obtained using the\nCurrentUser\nfunction;\nThe\ncurrent object\nis saved by the\nsave\nfunction.\nAs a result, the client’s request will be automatically taken into operation when opened in a new/current tab, and when opened in a modal window, the application can be previewed – the request status and the responsible employee will remain unchanged:",
  "source": "https://docs.greendata.ru/platform/en/getcardopeningarg.html"
}