{
  "title": "\"Search filters\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Search filters\" widget\nThe\n\"Search filters\" widget\nis used to filter registry data in the\n\"Object list General\"\nwidget.\nExample of a customized widget:\nConfiguring the widget\nThe widget is added to the object profile in the editing mode of the widget is added in the\nobject visual\nediting mode. Drag-and-drop the “Search filters” widget from the \"Control elements\" section of the \"Widgets\" tab of the \"Elements\" window to the workspace.\nThe \"Search Filters\" widget is used to manage the registry of the\n\"Object list General\"\nwidget, so both widgets should be added to the workspace.\nSettings\nIf clicking on the widget settings button, a modal window will be opened with the following settings:\nSetting\nPurpose\nRegistry widget\nSelect the registry for which search filters should be displayed.\nThe selection is made from the drop-down list, where only registries with\nconfigured display of search filters\n, which are selected in the settings of the\n\"Object list General\"\nwidget added to the visual, are presented.\nCompact view\nWidget display method, when only the search bar is located on the panel and the filtering area is opened in a modal window after clicking the filter button.\nUse example\nFor example, there is a certain object type, the instance profile of which will be displayed for the end user the offers for renting special equipment (for example, in the form of a\nstart page\n).\nFor the user’s convenience when selecting the rented special equipment, it is necessary to provide an opportunity to filter offers by specified parameters.\nStep 1: When editing the profile visual, the working area should be organized by using grouping elements (\"Row\", \"Column\" and \"Attribute group\"). After that, place \"Search Filters\" and \"Object list General\" widgets in the container areas:\nStep 2: Configuring \"Object registry\" widget.\nFirst, the\n\"Object registry\"\nwidget must be configured.\nSpecial equipment rental offers are objects of the \"Heavy machine rental\" type, so when setting up the \"Object registry\" widget, this type is specified in the \"Object type\" parameter.\nNext, the value of the \"Registry\" parameter is defined, in which the registry with the active search filter option should be selected.\nSearch filters\nare activated in the registry settings on the \"Filtering and search filters\" tab where the \"Display search filters\" switch must be set to the active position.\nThis tab is used to configure the future filtering panel:\nif necessary, the \"Search is applied immediately after changes\" switch is active;\nfilters of the filter bar are configured and grouped using two tables, for more details please refer to the\nlink\n.\nStep 3.  Configuring the \"Search filters\" widget.\nWhen configuring the \"Search Filters\" widget in the \"Registry widget\" parameter, the registry that was specified when\nconfiguring the \"Object list General\"\nwidget is selected.\nAfter saving the instance visual, the user will be able to use data search and filtering when selecting the rented special equipment:\nIf the \"Compact view\" switch is activated when configuring the \"Search filters\" widget, and the widget itself is moved above the \"Object list General\" widget, the following visual will be available:",
  "source": "https://docs.greendata.ru/platform/en/widget-search-filters.html"
}