{
  "title": "attr",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nattr\nФункция вставки значения атрибута в алгоритм.\nВыбор атрибутов ограничен выбранным базовым типом объекта (подробнее,\n\"Создание алгоритма\"\n).\nСинтаксис\nСинтаксис функции зависит от выбора признака:\nПризнак\nНазначение\nПолучить объект целиком\nОпределяет работу с объектом, а\nне\nс его идентификатором (отключается автоматическое добавление \"КОД\" к выбранном атрибуту).\nРаботает только с атрибутами первого уровня вложенности.\nПреобразование вставляемого объектного атрибута до определения его идентификатора выполняется автоматически\nдля всех атрибутов первого уровня вложенности\n.\nПри вставке цепочечного атрибута стоит учитывать, что оптимизация отключена и необходимо указывать конечный атрибут.\nУстановить значение\nОпределяет присваивание значения выбранному атрибуту. То есть посредством этой функции выполняется преобразование значения используемого атрибута.\nДля сохранения преобразований необходимо воспользоваться функцией\nsave\n.\nРаботает только с атрибутами первого уровня вложенности.\nУточнить тип атрибута\nОпределяет работу с атрибутами дочернего типа объекта.\nПризнак активен после выбора объектного атрибута.\nДанный признак нельзя использовать одновременно с режимами \"Получить объект целиком\" и \"Установить значение\".\nбез признаков\nили\nс признаком \"Получить объект целиком\"\n:\nattr\nПараметр\nНазначение\nattr\nВыбранный атрибут или КОД атрибута.\nПри активном признаке \"Получить объект целиком\" объект возвращается целиком, в противном случае возвращается только уникальный код объекта (атрибут КОД).\nс признаком \"Установить значение\"\n:\ncurrentObject().setAttr\n(attr, value)\nПараметр\nНазначение\nattr\nВыбранный атрибут или КОД атрибута.\nvalue\nЗначение, присваиваемое атрибуту.\nПри вызове функции устанавливается фиктивная переменная\n\"null\"\n, которую следует заменить на необходимое значение.\nв случае\nприсваивания значения\nисторическому атрибуту\n,  примет вид:\ncurrentObject.setAttr\n(attr, value, date)\nПараметр\nНазначение\nattr\nВыбранный исторический атрибут или КОД атрибута.\nvalue\nЗначение, присваиваемое атрибуту.\nПри вызове функции устанавливается фиктивная переменная\n\"null\"\n, которую следует заменить на необходимое значение.\ndate\nДата, на которую присваивается значение.\nПри вызове функции устанавливается фиктивная переменная\n\"currentDate()\"\n, которую следует заменить на необходимое значение.\nЗначение присваивается в рамках заданного периода динамики (\nполе \"Дискретность зависимости от времени\"\n).\nЕсли период динамики\nисторического атрибута\nне установлен, то данные фиксируются до момента ввода следующего значения.\nс признаком \"Уточнить тип атрибута\"\n:\nattr as obj.[attr]\nПараметр\nНазначение\nattr\nВыбранный объектный атрибут, через который необходимо уточнить тип, или КОД атрибута.\nobj.[attr]\nНаследуемый тип объекта, атрибуты которого могут выбраны для вставки. Вставка цепочечного атрибута осуществляется через точку.\nПримечание\nПеред работой с функцией\nattr\nтребуется указать \"Базовый тип объектов\", после чего атрибуты данного типа станут доступны для вставки в код алгоритма.\nВызов функции осуществляется из раздела \"Источники\" панели инструментов редактора алгоритмов, в результате чего откроется модальное окно для выбора атрибута.\nПри необходимости активировать признак атрибута (рядом с каждым находится пиктограмма\n, при нажатии на которую откроется справка).\nДля вставки цепочечного атрибута следует открыть вложенный список объектного атрибута.\nИспользование функции с признаком \"Установить значение\" при выборе\nmultiselect-атрибута\nосуществит\nдобавление\nуказанного объекта в качестве выбранного значения атрибута.\nДля того чтобы значение multiselect-атрибута перезаписывалось, необходимо в код алгоритма добавить функцию\nsetMultiSelectIsReplaceValues\nс выбором значения true в качестве параметра, определяющего признак сохранения.\nВ данном случае для добавления в значение атрибута нескольких объектов при помощи функции\nattr\nустанавливаемым значением должна быть коллекция объектов.\nДля обращения к атрибуту дочернего типа\nотносительно базового в настраиваемом алгоритме необходимо:\n1. Выбрать объектный атрибут, ссылающийся на тип объекта, имеющий дочерние типы.\n2. Установить признак \"Уточнить тип атрибута\", Система отобразит раскрывающийся список с дочерними типами на текущей форме ввода.\n3. Выбрать дочерний тип из выпадающего списка.\nСистема отобразит атрибуты дочернего типа для выбора на текущей форме ввода. При этом наименование атрибута преобразится как \"Наименование родительского объекта → Наименование дочернего объекта\".\nОтображение атрибута в коде алгоритма в зависимости от выбранного признака:\nПримеры\nПример № 1\nНеобходимо реализовать автозаполнение поля \"Наименование\". При этом запись должна отображаться как \"Объект № [Формируемый номер/ Идентификатор]\". Код алгоритма примет следующий вид:\nДля написания данного алгоритма также была использована функция\ntext\n.\nПример № 2\nНеобходимо установить дату создания заявки на 10 дней ранее текущей даты. Для этого в алгоритме используется функция\nattr\nс признаком \"Установить значение\":\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nзначение для атрибута \"Дата создания\" задается функцией\nplusDays\n;\nдля возвращения значения применена функция\nreturn\n.\nПример № 3\nНапример, список сотрудников, которые получат премию, формируется постепенно – при выполнении плана продаж сотрудник добавляется в значение\nmultiselect-атрибута\n\"Премирование\" к ранее добавленным сотрудникам.\nЕсли сотрудник выполнил план продаж, он добавляется в значение атрибута \"Премирование\" при помощи функции\nattr\nс активной опцией \"Установить значение\".\nДля написания данного алгоритма также были использованы другие функции.\nЧерез\nцикл\nпо коллекции\nобъектов\nтипа \"Сотрудники\" проверяется\nусловие\nвыполнения плана продаж по каждому сотруднику (атрибут \"Продажи\", добавленный при помощи\nattrByVar\nсравнивается атрибутом \"План продаж\", добавленный через\nattr\n).\nДля сохранения значения атрибута \"Премирование\" в базе данных используется функция\nsave\n.\nВ результате выполнения алгоритма в атрибуте \"Премирование\" по мере выполнения плана продаж будет формироваться список отличившихся сотрудников:\nПример № 4\nДопустим, лучший сотрудник месяца определяется по максимальному объему продаж. Так как данный объем продаж может совпадать у нескольких сотрудников, может сформироваться список, который необходимо записать в\nmultiselect-атрибут\n\"Доска почета\".\nЕжемесячно данный список обновляется новыми данными, при этом предыдущие данные удаляются.\nАлгоритм может принять следующий вид:\nЛучшие сотрудники будут записываться в атрибут \"Доска почета\"  посредством функции\nattr\nс активной опцией \"Установить значение\", но так как в атрибут можно установить только одно значение, а возможна ситуация, когда таких сотрудников несколько – это будет коллекция объектов \"employeeList\".\nДля того чтобы значения атрибута перезаписывались при вызове алгоритма, в текущем объекте для атрибута \"Доска почета\" с идентификатором \"BEST_EMPLOYEE_ID\" функцией\nsetMultiSelectIsReplaceValues\nследует установить признак сохранения со значением\ntrue\n.\nДля написания данного алгоритма также были использованы другие функции.\nНовые переменные задаются при помощи функции\nvar\n.\nВ первую очередь через\nцикл\nпо коллекции\nобъектов\nтипа  \"Сотрудник\" проверяется\nусловие\nдля поиска максимального объема продаж (атрибут \"Продажи\" типа объектов \"Сотрудники\" вставляется в код алгоритма при помощи функции\nattrByVar\n).\nДалее через\nцикл\nпо коллекции\nобъектов\nтипа \"Сотрудник\" коллекция объектов \"employeeList\" будет пополняться сотрудниками с максимальным объемом продаж.\nПосле того как атрибуту \"Доска почета\" установится значение полученной коллекции объектов \"employeeList\", для сохранения необходимо применить функцию\nsave\nпо\nтекущему объекту\n.\nПример № 5\nДопустим, в карточке заявки в\nmultiselect-атрибуте\n\"Статус\" выбраны несколько объектов, наименования которых следует получить в виде списка.\nАлгоритм может принять следующий вид:\nСтатус в данном случае выступает в качестве коллекции объектов, который добавляется в\nцикле\nпри помощи функции\nattr\n.\nДля написания данного алгоритма также были использованы другие функции.\nДля нумерации списка при помощи функции\nvar\nопределяется переменная \"f\".\nПо каждому объекту, выбранному в качестве значения в атрибуте \"Статус\", функцией\nattrByVar\nможно получить наименование.\nСписок полученных наименований с нумерацией выводится в лог алгоритма функцией\nprintout\n.",
  "source": "https://docs.greendata.ru/platform/ru/attr.html"
}