{
  "title": "Вкладка \"Настройка условий и переходов\" элемента \"Задача (Task)\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВкладка \"Настройка условий и переходов\" элемента \"Задача (Task)\"\nНа\nвкладке \"Настройка условий и переходов\"\nпараметры представлены в 3 блоках:\nнастройка условий ухода с этапа\n;\nнастройка исходящих переходов\n;\nдополнительные настройки\n.\nНастройка условий ухода с этапа\nНастройка условий ухода с этапа осуществляется в реестре \"Условия ухода с этапа\" (подробнее\nо работе с реестром\n):\nПараметр\nНазначение\nОграничение действует как предупреждение\nЛогический параметр, определяющий характер действия ограничения.\nПри активном положении переключателя ограничение действует как предупреждение, работа пользователя при этом не блокируется.\nЕсли переключатель неактивен, Система не позволит продолжить работу с задачей в случае выполнения недопустимых условий ограничения.\nПрименить настройку для всех переходов\nЛогический параметр, определяющий применение настройки для всех переходов.\nАлгоритм (условие)\nОпределение\nалгоритма\n, с помощью которого задается условие перехода с этапа.\nВыбор перехода\nОпределение переходов, для которых задается условие.\nПоле доступно при неактивном параметре \"Применить настройку для всех переходов\".\nТекст заголовка\nОпределение алгоритма формирования заголовка для сообщения о нарушении условия перехода с этапа.\nЗадать текст сообщения алгоритмом\nЛогический параметр, определяющий формирование сообщения о нарушении условия перехода с этапа с помощью алгоритма. Возможные значения:\nда;\nнет.\nАлгоритм формулировки сообщения\nОпределение алгоритма формирования сообщения для пользователя.\nПараметр доступен при выборе значения \"Да\" в поле \"Задать текст сообщения алгоритмом\".\nТекст сообщения\nВвод текста сообщения для пользователя.\nПараметр доступен при выборе значения \"Нет\" в поле \"Задать текст сообщения алгоритмом\".\nПри добавлении хотя бы одного условия ухода с этапа станет доступен параметр \"Наименование кнопки пропуска условий ухода с этапа\" для формирования наименования кнопки с помощью алгоритма.\nНастройка исходящих переходов\nНастройка исходящих переходов определяет переход/переходы внутри настраиваемого бизнес-процесса.\nВыбор нескольких переходов может быть настроен в случае работы с задачей вида \"Выбор варианта\".\nПереход по умолчанию определяется посредством одноименного параметра.\nДополнительные настройки\nВ данном блоке производится настройка следующих параметров:\nПараметр\nНазначение\nАлгоритм после формирования задачи\nОпределение алгоритма, который будет запущен после формирования задачи.\nСпособ сбора снапшота\nОпределение способа формирования снапшота (используется для фиксации данных, актуальных на момент завершения задачи). Возможные варианты:\nс одним уровнем вложенности порталов;\nминимальный;\nне собирать;\nполный.\nСистемное отображение поля \"Статус/Информация\"\nЛогический параметр, определяющий способ отображения значения в поле \"Статус/Информация\" при\nпросмотре маршрута бизнес-процесса\n.\nПри активном параметре будет отображена системная информация о событиях/переходах, способе запуска процесса (вручную или автоматически), его статусе.\nДля просмотра способа запуска бизнес-процесса необходимо обладать разрешениями\n\"Администрирование маршрутов\"\nи/или\n\"Просмотр технической информации по маршруту\"\n.\nПри неактивном параметре значение для отображения определяется с помощью алгоритма.\nАлгоритм формирования поля \"Статус/Информация\" в маршруте\nОпределение алгоритма формирования текста для поля \"Статус/Информация\".\nПоле доступно при неактивном параметре \"Системное отображение поля \"Статус/Информация\".",
  "source": "https://docs.greendata.ru/platform/ru/transition-conditions-task-element-tab.html"
}