{
  "title": "\"Explorer\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Explorer\" widget\nFor some tasks when working with files, it is required to display not just a list of files, but also a certain logical structure of file ordering (like folders and classifications). In this case, one of the possible solutions will be to configure the \"Explorer\" widget.\nExample of a configured widget:\nThe Explorer widget is made for solving the following tasks:\nworking with complementary files and documents (from different entities);\nvisualizing the logical structure (hierarchy and classification) of files;\nattaching (uploading to the server) files and documents;\nrearranging (moving) files in the structure;\nthe ability to sign files (if the\nappropriate actions\nare configured);\nthe ability to delete irrelevant files.\nWidget components\nThe Explorer widget resembles the standard Windows explorer and consists of three complementary areas:\nthe top area (is analogous to the folder structure);\nfile display area (the main area of working with files);\nversioning area (auxiliary information about the file).\nWhen selecting a top (active check mark), a set of files is displayed for the active top, if a file is selected (active check mark), information about available versions can be shown for it.\nIf necessary, the analyst can change the proportions of the width of the areas or turn off the visibility of irrelevant areas. The proportions are adjusted using the\nelement.\nSetting up the widget\nAdding a widget to the object profile is done in the\nvisual of instance\nconfiguration mode. When switching to the “Widgets” tab in the “Elements” panel, drag and drop the “Explorer” widget from the “Files” section to the workspace of the profile.\nThe widget’s functioning assumes:\nsetting up a hierarchical view;\nwriting algorithms for determining objects;\ncreating tops (and connecting algorithms).\nConfiguring the widget involves filling in the following parameters:\nSetting\nPurpose\nConfiguring the file hierarchy\nSelecting hierarchy settings from the drop-down list. This hierarchy is set using the\n\"Configuring file hierarchical representation\"\n[FS_HIER] object type (more about\nsetting up a hierarchical display of files\n).\nNumber of elements per page (directories)\nDetermining the number of elements (folders) displayed on the page in the top area (left area).\nBy default, the value of the parameter is “-1”, and all elements will be displayed on the same page.\nNumber of elements per page (files)\nDetermining the number of elements (files) displayed on the page in the file display area (center area).\nBy default, the value of the parameter is “-1”, and all elements will be displayed on the same page.\nControl attributes\nDetermining the type attribute from the drop-down list. If the specified type attribute is changed, the System will automatically update the customized data representation. Otherwise, data is updated when objects are loaded/deleted.\nExplorer display proportions\nDefining proportions for displaying widget areas. When selecting the proportions, it is necessary to take into account that:\nfirst value - top area (left box);\nsecond value - file display area (center box);\nthird value - versioning area (right box).\nBy default, the parameter is set to “25 / 55 / 20%”.\nHeight (in px). Minimum value is 150\nForce widget height setting, in px. The minimum value is 150 px.\nBy default, the parameter is set to \"450\".\nTop area\nDetermining how to display the top area (left area). Possible values that will be used when opening the object profile:\nrevealed;\ncollapsed;\nunavailable.\nBy default, the parameter is set to \"Revealed\".\nVersioning area\nDetermining how to display the versioning area (right area). Learn more about\nconfiguring versioning\n. Possible values that will be used when opening the object profile:\nrevealed;\ncollapsed;\nunavailable.\nBy default, the parameter is set to \"Revealed\".\nShow bulk upload button\nDefining the display of the\nbutton for bulk document upload on the action bar. The system allows uploading several files at once. Without selecting this feature, the document can be added only after moving the cursor over a top (title in the left box).\nTop names when bulk uploading files\nEntering the\nname\nof the field to select the top to be used for all files in a bulk upload.\nThe parameter is used when the “Show bulk upload button” option is active.\nTop switcher name when uploading files\nEntering the\nname\nof the switch used in the bulk file upload modal window.\nThe parameter is used when the “Show bulk upload button” option is active.\nRegistry (Files)\nThe selection is made via a drop-down list of instances of the system type\n“ Basic registry settings” [SYS_REGISTRY]\nassociated with the\n“File” type [FS_FILE]\n.\nAutomatically select the first item on the left\nDetermining the automatic selection – highlighting of the first top.\nShow column \"Employee who attached the file\"\nDetermining the display of the\n\"Employee who attached the file\" column\nin the file display area.\nDisplay signatures types\nDetermining the type of signature. It is used then downloading signature files to determine them.\nThe selection is made using a drop-down list of instances of the system type\n“File Signature Type” [FS_FILE_SIGN_KIND]\n.\nValue algorithm \"read-only\"(return boolean)\nSelecting an algorithm to display the read-only widget files. The value of the algorithm should return the boolean value (true or false).\nDisplay custom filter\nDetermining the display of the custom filter string.\nFile info profile settings\nDetermining the displayed attributes of the “Document characteristics” profile located at the top of the widget’s versioning area.\nDisplay the file signing button\nDetermining the display of a signing files button. If selected, the\nbutton will be displayed in the widget’s action bar.\nSigning actions\nDefine the actions available when clicking the\nbutton on the widget’s action bar.\nThe parameter is available when the “Display file signing button” option is active.\nName for custom filter\nEntering the\nname\nfor the custom filter field.\nFilter for custom filter\nDetermining a filter to generate a list of options for a custom filter.\nThe selection is made using a drop-down list of instances of\n“Filter” [SYS_FILTER]\ntype .\nThe parameter is used when the “Display custom filter” option is active.\nFile filter for custom filter\nDefining a filter to generate a list of files of objects selected in the custom filter.\nFilter functioning involves setting a parameter with the identifier [FILE_EXPLORER_USER_FILTER] to which the codes of the selected objects will be sent.\nThe parameter is used when the “Display custom filter” option is active.\nDisplay the navigation button\nDetermining the display of a button for moving a file from one top to another. The\nbutton is displayed on the action bar.\nCollapse folders on move by default\nDetermining collapsing all folders by default when moving files to make the hierarchy more compact.\nThe parameter is used when the “Display navigation button” option is active.\nAdvanced preview\nDetermining the possibility of an extended preview of the selected file.\nAdd files from System\nDetermining if files can be downloaded from the system.\nWhen this option is active, adding files is possible both from disk and from the system:\nFilter of files loaded from the system\nDefining an algorithm for filtering files downloaded from the system.\nThe parameter is used when the “Add files from System” option is active.\nChecking signatures by button\nDetermining the ability to verify signatures. If selected, the\nbutton will be displayed in the widget’s header.\nWhen this option is active, only manual signature verification is available, automatic signature verification will be disabled.\nDisplay the signature of the buttons on the action bar\nAn attribute that determines the display of signatures for buttons on the widget’s action bar.\nDisplay in snapshot mode\nAllow displaying the status of a file on a specific date.\nIt is used, for example, to display files that are relevant at the time a business process task is completed.\nThe display of the \"Add tags\" and \"Remove tags\" buttons is adjusted using the settings of the\nhierarchical file display\n.\nWorking with the widget\nAdding files\nusing the widget is possible from the file display area by clicking the\nbutton or from the top area by clicking the\nbutton. In the second case, the button is available after hovering the mouse cursor over the top.\nThe size of files uploaded to the System is limited. Find more details in the\narticle\n.\nAction bar\nThe display of buttons in the widget’s action bar depends on the selected element: the top or the file. The displayed (available) actions are applicable to the selected element.\nDefault actions available:\nButton\nAction\nDownload all files into one archive.\nDownload all files into one archive, taking into account the hierarchy.\nPreview the selected file.\nDelete the selected file.\nSignatures of the selected file.\nExport the hierarchy to Excel.\nCopy the file link.\nThe display of other buttons is adjusted using the widget settings.\nThe buttons for working with the document are also displayed in the file field when you hover the cursor over it.\nIn case of signing a file, the user can view the signature information by clicking the\nbutton from the action bar (the button will be displayed after selecting the signed file).\nVersioning area\nIn the left area of the widget, after selecting a file, information about the classification of the file, its date of addition and a list of previous versions are displayed.\nPrevious versions are displayed when replacing a file using the corresponding button at the bottom of the area. The user can also download the file in the same way and select the current version from the list of previous versions of the file.\nDisplay and search modes\nDepending on the selected file display mode, the appearance of the file area will be different:\nTile\nTable\nIf a search is required, use the corresponding interface element\n.\nUse example\nConsider the example, where the analyst needs organize an interface for working with related documents (office format files, photocopies) for complementary object types using the \"Explorer\" widget.\nObject model\nFor the technical services of the enterprise, it is necessary to organize the possibility of working with documents (and photocopies) for user types of objects (entities):\nElevator\n[Elevator];\nInspection\n[Inspection].\nDue to object inheritance (from the \"Object\" parent type), the \"ID\" and \"Name\" attributes are initially present in entities along with their individual attributes.\nEntities are related by the \"Elevator\" object attribute [ELEVATOR_ID] and contain file attributes:\nAttached files\n[SYS_FILE_ID] - equipment documents (technical certificate, etc.);\nAttachment files\n[ATT_FILE_ID] - inspection documents (inspection certificates, etc.).\nIt is required to configure the operation of the \"Explorer\" widget on the \"Elevator\" type profile according to the following scheme:\nonly the files of the selected elevator and its inspections are displayed;\nin the hierarchy area, the elements (tops) \"Elevator files\" and \"Files of completed inspections\" are provided, in which all inspections of the current elevator are grouped;\nwhen the hierarchy element is selected, the corresponding documents become available in the file display area;\nthe user can add new documents to the selected inspection;\nthe user-selected inspection has the ability to delete irrelevant files.\nTo solve this, previously connect (place) the \"Explorer\" widget on the \"Elevator\" profile type and start configuring the widget.\nFor the \"Explorer\" widget to function, the file hierarchy must be configured, which declares the rules for the operation of widget elements in the top area.\nConfiguring the file hierarchy\nWithin the framework of this example create (add) a hierarchy setting\nHS_Elevator\n(we use the HS_ prefix to avoid the appearance of objects of the same name in the System) by matching the setting to the\nElevator\nobject type.\nConfiguring tops of the hierarchy\nThe Explorer widget is based on working with the active (selected) tops. The tops (or nodes) of the hierarchy can receive files from various object types.\nIf necessary, tops can be nested and perceived by users as folders named of the file structure.\nEach top must correspond to the object type and is associated with an algorithm (attribute \"Algorithm for determining objects\"), which returns a set of object instances to be displayed as a list of tops.\nAlthough the System interface allows you to create algorithms during setup, it is recommended to prepare and debug the necessary algorithms in advance.\nConfiguring tops and algorithms\nAs part of the example, you will need to add two tops to the hierarchy setup:\n1st top:\nElevator files\n;\n2nd top:\nFiles of completed inspections\n.\nNote that when you create each top, you must assign the original algorithm for determining objects, which prepares and forms a set (array) of objects to be shown when you activate a particular top.\nIn this case, you will only need to select existing algorithms:\nAlg_set_current_object\n(for the 1st top)\nreturns in object set format, a reference to the current object from the specified attribute of which files should be extracted;\nAlg_inspections_set_for_equipment\n(for the 2nd top)\nreturns a set of completed inspections for the current (active) elevator equipment. At the same time, an additional filter algorithm is required for the algorithm to function;\nAlg_filter_inspections_equipment\n(for the 2nd top)\nreceives the \"Parameter_equipment\" incoming parameter of the \"Elevator\" type and provides filtering of records corresponding to the equipment selected in the form.\nPrepare the top algorithms in advance.\nTop 1: Alg_set_current_object\nTop 2: Alg_inspections_set_for_equipment and Alg_filter_inspections_equipment\nTo connect the algorithms, let’s switch to the adding tops to the hierarchy settings mode. When creating tops, set the corresponding properties (shown below).\nNote that the\nElevator files\ntop will be related to the \"Attached files\" attribute of \"Elevator\" objects types , which will be returned by the appropriate algorithm. In this case, the three specified file classifications will be allowed to be displayed. The option to hide the header will allow you not to display the header of the nested structure when selecting a node (top).\nFor the\nFiles of completed inspections\ntop,there will be a relation with the \"Attachment Files\" attribute of the \"Inspection\" object types, which the algorithm will return. In this case, you will be allowed to work with files of two selected categories.\nSetup result\nAfter performing the specified configuration actions and saving the result, the \"Explorer\" widget containing two tops will be displayed on the \"Elevator\" type profile:\nElevator files;\nFiles of completed inspections (with a set of inspections).\nEach top is characterized by a numeric file counter and the ability to view a nested list of files and documents.\nWidget configuration functionally meets the requirements of the thematic task.\nConclusions\nThe Explorer widget allows you to combine complementary files and documents from different sources in one space. This allows the analyst to use the settings to solve non-standard tasks for organizing document flow at users' workplaces.\nThe complexity of configuring a widget is determined by its functionality and connectivity with other file management components. For simpler file processing tasks, simpler\nwidgets\nand\nvisuals\nmay be sufficient.",
  "source": "https://docs.greendata.ru/platform/en/explorer-widget.html"
}