{
  "title": "Configuring the filtering panel",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nConfiguring the filtering panel\nThe system allows to configure the displayed filtering panel in the Object registry. This panel can be used for displaying other necessary information, including buttons and fields for filtering data.\nMost attributes are used to set up filtering, including source attributes.\nConsider configuring the panel in the Request for loan-security documentation registry .\nI. Initially, it is necessary to configure the panel itself, which will be displayed in the registry.\nTo do this, configure the\nadditional visual\nof the object type profile , whose registry will be configured.\nIt is necessary to put the required attributes on the panel to organize the registry filtering. The System supports filtering by\nmultiple choice object attributes\n(multiselect attributes). Other elements, such as buttons, may also be placed in the panel, if necessary.\nII. In this visual setting, specify (in addition to the\nbasic visual settings\n):\nVisual type\n– \"\nFiltering for the registry\n\";\nDisplay in advanced registry search settings\n– \"\nYes\n\".\nIII. It is necessary to display the previously configured panel in the object registry. To do this, in the Registry settings, on the\n\"Filters\" tab\n, specify:\nDisplay the advanced search when opening the registry\n– select \"\nYes\n\", to display the panel immediately when opening the registry. If necessary, the panel can be hidden by pressing the\nbutton.\nFiltering visualization\n– select the\npreviously created visual\n; in the present example - \"Filter for loan-security documentation\".\nThis is how the filtering panel in the object registry is configured.\nCustom actions (buttons)\ncan be configured to work with the registry. The attribute values specified in the filtering panel are taken into account in the algorithms used in configuring the \"\nCall algorithm\n\" action.\nThe values of these attributes are not taken into account\nwhen working with\ncustom actions\n.",
  "source": "https://docs.greendata.ru/platform/en/configuring-the-filtering-panel.html"
}