{
  "title": "plainText",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nplainText\nThe function is designed to clean up text formatting by removing HTML tags from the text.\nSyntax\nplainText\n(text)\nSetting\nPurpose\ntext\nThe text (string) to be converted.\nText can be provided by, for example,\nattr\n,\nalg\n,\nparam\n,\nvar\n,\nattrByVar\n,\ncalcTemplate\nfunctions.\nNote\nThe function is called from the\n\"Text\" tab\ntoolbar of the algorithm editor.\nWhen the function works:\nthe contents of <script></script> and <style></style> tags will be ignored;\nCSS styles and attributes of HTML tags are not considered;\nmeta information (meta tags) is not processed.\nUse example\nIt is required to retrieve the contents of a notification template and write the value to a text attribute ( with no complex formatting support) for further use and to make edits to the text if necessary.\nImagine that there is a customized object type containing the following attributes:\n“Notification template” - an\nobject attribute\nreferring to the\n“Notification template”\n[SYS_EMAIL_NOTIFICATION] object type to select the customized template.\n“Mail text” - an attribute of the “Text” type with\n\"Multiline input\" visual\nto insert text from a template.\nThere is also a customized notification template for the current special offer, where formatting is applied to the message text:\nTo achieve this task, create the “Past text from template”\ncustom action\ncalling\nalgorithm\n, which uses the\nplainText\nfunction to clean up text formatting:\nRead more about the algorithm.\nthe “template” variable is declared using the\nvar\nfunction;\nthe\ncalcTemplate\nfunction retrieves the message text (“BODY”) from the notification template contained in the “Notification template” attribute, with the template calculation based on the current object (\ncurrentObject\n);\nusing the\nattr\nfunction with the “Set value” attribute, the message text from the template, cleaned from formatting by the\nplainText\nfunction, is written to the “Mail text” attribute;\nadding the “Notification template” and “Mail text” attributes is done using the\nattr\nfunction.\nTo trigger the action, place the\n“Button”\nwidget on the visual.\nAs a result of customization, when selecting a template in the “Notification template” field and pressing the “Paste text from template” button, the message text will be inserted into the “Mail text” attribute and can be edited if necessary:",
  "source": "https://docs.greendata.ru/platform/en/plaintext.html"
}