{
  "title": "Release details, version LTS.464",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.464\nPatch LTS.464.12 of August 20, 2025\nChanges and improvements\nHiding empty folders in the attribute with the\n\"Multiple objects as a table\"\nvisual was improved.\nThe display of a string attribute with the \"Phone\" visual in the object registry was adjusted.\nThe behavior logic of the\n\"Quick access toolbar\"\nwidget was adjusted.\nThe ability to visualize data using the\n\"Linear chart\"\ndashboard panel regardless of data volume was debugged.\nThe task assignment at the start of a business process was debugged.\nThe algorithm call with\nuser action\n, in the additional parameters of which the object is saved before the algorithm is executed was debugged.\n(introduced in release\nLTS.463.8\n).\nThe operation of the modal window for entering parameters was stabilized.\nThe process of deleting a child object instance followed by saving the parent object when using\ncustom actions\nwas debugged.\nThe error display during algorithm compilation was adjusted.\nWhen working with algorithm parameters, the ability to filter values based on the data source was debugged.\nIn the\nlogin page constructor\n, the subheading of the start page component was aligned.\nThe creation of\nuser registration profiles\nwas stabilized.\nAfter\nsubstitution\nends, task return to the original assignee was restored, along with the ability to change the assignee.\nThe ability to delete rows in the reporting form was stabilized.\nThe behavior when expanding a collapsed attribute group in a document questionnaire was optimized.\nThe content display when working in bookmark value comparison mode was fixed.\nThe display of questionnaire values when updating from a data source was stabilized.\nThe comment display in the document was stabilized.\nThe version comparison results display was debugged.\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.464.8 of August 11, 2025\nNew features\nThe user can now flexibly\nconfigure allowed email notifications\nfor employees.\nThe extended Kanban board version now supports WIP limits.\nA configured Kanban board can now be added as a menu item.\nUser account parameters were extended: the reason for\nuser blocking\nis now displayed, along with block history.\nThe new\ndeleteLdapEntry\nfunction allows deleting entries from the Active Directory service.\nUsers currently working on a document are now displayed. Cursor highlighting and text selection by other users were added.\nWhen uploading a new document version, the System retains existing text locks and ignores changes made to locks in the file.\nChanges and improvements\nThe hint text in the modal window for adding a new email address to the employee profile was adjusted.\nThe stability when editing a\nprimitive object\nprofile was improved.\nChanging the company logo in\nSaaS solutions\nwhen using a Community Edition license was restrcited.\nThe template name display during product installation from the\nsolution catalog\nwas fixed.\nThe license purchase process was improved.\nThe modal window behavior across the System was stabilized.\nThe automatic naming of tables/fields was stabilized.\nSaving object attributes configured with a\nframe\nwas improved.\nThe stability when entering attribute values using a configured\ninput mask\nwas enhanced.\nFor the \"File\" type attribute with the\n\"Multiple files in table view\"\nvisual, the ability to switch the registry type was implemented.\nThe operation of\nOnChanged events\nwas stabilized when the object type contains child attributes.\nThe instance creation process in a folder-enabled registry was fixed.\nThe\ntile registry\nloading on open was optimized.\nThe height configuration for \"File\" attributes using the\n\"Image\"\nvisual was stabilized.\nThe task icon display between web and mobile GreenData apps was unified.\nThe logic for configuring\nobject type hierarchy\nwas improved.\nAn SQL query creation option for the \"Regular expressions for update verification\" visual was added. The visual and default registry for object types included in the information security checklist were adjusted.\nThe deletion of files added via the\n\"Explorer\"\nwidget was simplified.\nThe handling of column width/height settings in the\n\"Financial Reporting\"\nwidget was improved.\nThe filtering of objects in the registry displayed using the\n\"Object list\"\nwidget was debugged and optimized.\nThe date selection via calendar in the\nGantt chart\nwas improved.\nThe logic for configuring the\n\"Control element\"\nanalytical dashboard was improved: value auto-fill algorithm can now return empty or coded object lists.\nWhen configuring columns of the dashboard analytical panel\n\"Table\"\n, the formatting algorithms were stabilized, and the display of column names during export was debugged.\nThe logic for building a\ncondition tree\nwhen unsaved data is present was improved: earlier operators and conditions are no longer auto-saved as drafts.\nThe condition tree setup in\nMozilla Firefox\nbrowser was stabilized.\nThe user task completion process was stabilized.\nData saving in task profile attributes after attaching a file was debugged and stabilized.\nThe\ncopyAndSave\nfunction for copying report form data was improved.\nThe operation of the\nattr\nfunction with the \"Set value\" option for\nhistorical attributes\nwas debugged.\nThe attribute list display in modal windows when calling\nobjectsWithOptions\nwas updated.\nThe operation of the\nprintEDoc\nfunction was debugged.\nSaving\ndata source algorithms\nfor dashboards was improved.\nThe contextual object type selection for\n\"Condition for visual\"\nalgorithms was restored.\nThe algorithm behavior when comparing values with a\nvariable attribute\nwas fixed.\nError warnings now appear when trying to save an invalid algorithm.\nA language selection for Telegram bot\nmessage settings\nwas added.\nThe ETL data converter can now continue processing other inputs even if some elements of a dynamic structure fail.\nThe ability to\nlaunch the ETL process by file\nwas implemented and debugged.\nThe transfer of\nobject hierarchies\nvia updates was fixed.\nFiltering by tag on the\nupdate creation\npage was added.\nThe process of writing to the\naudit log of attribute value changes\nwas optimized when\nattribute-level permissions\nare configured.\nThe management of\nsecurity policies\nindependently of user administration permissions was improved.\nThe logic of\nuser lockout due to inactivity\nwas corrected: this parameter now takes into account the use of hook tokens.\nThe application of permission control based on condition trees, which relies on\nprimitive objects\n, was debugged.\nThe\ntemporary file cleanup\nprocess was optimized.\nThe\naggregation of reporting form values\nwas debugged and stabilized.\nThe button labels for \"Attach to object\" in template-based documents were adjusted.\nThe display of tabulation symbols and underlined list markers was improved.\nThe footnote addition to selected text was stabilized.\nThe comment button display when selecting text with\nShift\n+ mouse click was fixed.\nThe version comparison in bookmark mode with comments was stabilized.\nExport is now possible even without edit permissions.\nThe comment text handling was improved.\nIn documents generated from templates, the handling of bookmarks was debugged, including the ability to copy bookmark text.\nThe process of creating a new document version was stabilized.\nThe page format settings in EDoc documents were debugged.\nThe position of \"Mute notifications\" icon was changed.\nThe ability to configure the\ntranscription service\nwas debugged.\nThe info panel link to the GreenData VK social network page:\nVK\nwas updated.",
  "source": "https://docs.greendata.ru/platform/en/LTS.464.12-details.html"
}