{
  "title": "Аналитическая панель дашборда \"Канбан-доска\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАналитическая панель дашборда \"Канбан-доска\"\nАналитическая панель дашборда \"Канбан-доска\"\nпредставляет собой специализированный инструмент для наглядного отображения, оптимизации и эффективного управления объектами (далее – задачами) посредством поэтапного разделения.\nПланирование при помощи данного инструмента достигается путём разбиения потока задач на несколько этапов, представляющих собой последовательно расположенные вертикальные доски, на которые помещаются соответствующие этапу карточки задач.\nКоличество этапов и отображаемые данные задачи настраиваются пользователем. Карточку задачи можно перемещать в режиме реального времени (Drag&Drop) как в рамках одного этапа, так и в разрезе этапов между досками. Последовательность этапов также можно изменять посредством Drag&Drop.\nПример настроенной Канбан-доски:\nДля обеспечения многоуровневого представления потока задач необходимо использовать\nКанбан-доску расширенной версии\n.\nНастройка\nДобавление аналитической панели \"Канбан-доска\" в карточку\nдашборда\nосуществляется в режиме редактирования визуала. Необходимо перейти на вкладку \"Аналитические панели\" на панели \"Элементы\" и перетащить (Drag&Drop) аналитическую панель дашборда \"Канбан-доска\" в\nрабочую область карточки\n.\nДля настройки аналитической панели следует нажать на кнопку \"Открыть настройки\", в результате чего откроется модальное окно \"Настройка Канбан-доски\".\nПараметры настройки\nПараметры настройки Канбан-доски расположены на трех вкладках.\nОсновные настройки\nНа вкладке \"Основные настройки\"\nпользователю предоставляется возможность управления аналитической панелью при помощи следующих параметров, распределенных на два блока:\nОбщие настройки Канбан-доски\nПараметр\nНазначение\nНаименование\nЗаголовок аналитической панели.\nТип объектов Канбан-доски\nОпределение типа объектов, данные объектов которого будут отображены в виде карточек задач.\nВыбор осуществляется из существующих в Системе типов при помощи выпадающего списка. При необходимости добавления нового типа объектов, редактирования выбранного типа или просмотра его реестра следует нажать на меню действий в правой части поля и выбрать соответствующее действие.\nПолный перечень типов в выпадающем списке параметра доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nПоле является обязательным для заполнения.\nАтрибут для разбиения по этапам\nВыбор атрибута, посредством которого будет производиться распределение задач на этапы.\nВыбор осуществляется посредством выпадающего списка из\nобъектных атрибутов\n(в том числе унаследованных) типа объектов, указанного в качестве параметра \"Тип объектов Канбан-доски\".\nПоле является обязательным для заполнения.\nСпособ открытия карточки\nСпособ открытия карточки объекта Канбан-доски (задачи).\nВозможные варианты:\nкак в системе – способ открытия, который дублирует значение системной настройки\n\"Открывать гиперссылки в модальном окне\"\n;\nв модальном окне;\nв новой вкладке;\nв этом окне.\nПо умолчанию используется значение \"Как в системе\".\nНастройка атрибутов\nВ данном блоке производится выбор атрибутов для последующего отображения их значений на карточке задачи.\nПо умолчанию данный блок содержит атрибуты \"Код\", \"Наименование\", \"Дата последнего изменения\", \"Сотрудник, создавший объект\" с настроенными параметрами отображения, что позволяет быстро перейти к просмотру готовой аналитической панели.\nПорядок отображения атрибутов в карточке задачи может быть отрегулирован при помощи перетаскивания (Drag&Drop) строк с атрибутами посредством элемента\n.\nНастройки отображения атрибутов можно редактировать по кнопке\n.\nУдаление атрибутов осуществляется по кнопке\n.\nДля формирования Канбан-доски необходимо вынести на карточку задачи как минимум один атрибут.\nДобавление атрибута для отображения осуществляется нажатием на кнопку\n, при этом откроется модальное окно настройки атрибута.\nМаксимально возможное количество атрибутов на карточке задачи – 10, после чего кнопка для добавления новых атрибутов станет неактивна.\nПараметр\nНазначение\nОбщие настройки атрибута\nНастройка атрибута\nВыбор варианта настройки атрибута:\nстатичная;\nалгоритм.\nАтрибут\nВыбор атрибута для отображения в карточке задачи.\nВыбор осуществляется посредством выпадающего списка из всех атрибутов (в том числе унаследованных) типа объектов, указанного в качестве параметра \"Тип объектов Канбан-доски\".\nПоле доступно при выборе \"Статичная\" в качестве варианта настройки атрибута.\nАлгоритм\nВыбор алгоритма, результат выполнения которого будет отображен в карточке задачи.\nВыбор осуществляется из выпадающего списка заранее подготовленных алгоритмов. Для добавления нового алгоритма необходимо нажать на меню действий в правой части поля и выбрать опцию \"Добавить\" в контекстном меню, после чего откроется модальное окно по\nсозданию алгоритма\n.\nПоле доступно при выборе \"Алгоритм\" в качестве варианта настройки атрибута.\nВторостепенный атрибут\nПараметр, определяющий необходимость скрытия атрибутов для более компактного отображения карточки задачи.\nПри активной опции атрибут размещается на скрытой области карточки. Отображение второстепенных атрибутов осуществляется по кнопке\n.\nСтиль отображения атрибута\nЗаголовок\nВвод заголовка атрибута для отображения в карточке задачи.\nПо умолчанию поле заполнено наименованием атрибута.\nОтображать заголовок\nПараметр, определяющий необходимость отображения заголовка атрибута в карточке.\nОтображать иконку\nПараметр, определяющий отображение иконки рядом со значением атрибута:\n– для задачи, срок исполнения которой не истек;\n– для просроченной задачи;\n– для завершенной задачи.\nПараметр доступен для атрибутов типа\n\"Дата\", \"Дата и время\"\n.\nОтображать как срок\nПараметр, определяющий отображение значения атрибута в виде срока.\nПри активации признака вместо даты будет отображаться надпись вида:\n– оставшееся время до значения, указанного в атрибуте;\n– в случае, если время, указанное в атрибуте, наступило или истекло;\n– в случае, если указана дата фактического завершения.\nПараметр доступен для атрибутов типа\n\"Дата\", \"Дата и время\"\n.\nТип назначения срока\nПараметр, определяющий тип назначения для определения срока у объекта.\nВыбор значения осуществляется посредством выпадающего списка из объектов типа \"ДО. Тип назначения сроков\" [WF_TASK_TERM_TYPE] для\nфиксированного срока\n. Возможные варианты:\nфиксированный срок в минутах;\nфиксированный срок в рабочих минутах;\nфиксированный срок в часах;\nфиксированный срок в рабочих часах;\nфиксированный срок в днях;\nфиксированный срок в рабочих днях.\nПоле доступно при активной опции \"Отображать как срок\".\nДата фактического выполнения\nВыбор атрибута в качестве даты фактического выполнения задачи.\nВыбор осуществляется посредством выпадающего списка из атрибутов типа \"Дата\", \"Дата и время\" (в том числе унаследованных) типа объектов, указанного в качестве параметра \"Тип объектов Канбан-доски\".\nПоле доступно при активной опции \"Отображать как срок\".\nОтображать кнопку чата\nПараметр, определяющий отображение иконки чата, при нажатии на которую в правом нижнем углу экрана откроется окно с\nчатом\nдля обсуждений.\nПризнак доступен для\nобъектного атрибута\nтипа \"Персональные данные\" [SYS_EMPLOYEE] или наследуемого от него.\nОтображать фотографию\nПараметр, определяющий отображение иконки профиля пользователя.\nПризнак доступен для\nобъектного атрибута\nтипа \"Персональные данные\" [SYS_EMPLOYEE] или наследуемого от него.\nОтображать как гиперссылку\nПараметр, определяющий отображение значения атрибута в виде гиперссылки, при нажатии на которую осуществится переход на экземпляр типа объекта атрибута.\nПризнак доступен для\nобъектного атрибута\nза исключением типа \"Персональные данные\" [SYS_EMPLOYEE].\nСтиль\nВыбор стиля отображения атрибута.\nВыбор осуществляется из выпадающего списка заранее подготовленных\nстилей форматирования\n. Для добавления нового стиля необходимо нажать на меню действий в правой части поля и выбрать опцию \"Добавить\" в контекстном меню, после чего откроется модальное окно по созданию стиля.\nВ настоящий момент при выборе стиля для отображения атрибута учитывается только размер шрифта и форматирование текста (жирный, курсив, подчеркнутый).\nПример отображения настраиваемых параметров на карточке задачи:\nНаименование задачи представлено в виде гиперссылки для открытия карточки задачи.\nСпособ открытия карточки регулируется одноименным параметром в блоке настроек\n\"Общие настройки Канбан-доски\"\n.\nВозможность создания чата по объекту предоставляется на вкладке  \"Дополнительное\", представленной в следующем разделе.\nДополнительное\nНа вкладке \"Дополнительное\"\nдоступна настройка следующих параметров:\nПараметр\nНазначение\nОтображать чат по объекту\nПереключатель для отображения иконки чата по объекту на карточке канбан доски.\nПри активном переключателе в верхнем правом углу карточки канбан доски будет отображаться иконка чата:\n– для создания чата по объекту;\n– для открытия ранее созданного чата по объекту;\n– для открытия ранее созданного чата по объекту с индикацией количества непрочитанных сообщений в чате. Счетчик непрочитанных сообщений отображает чисто от 1 до 99, при большем количестве непрочитанных сообщений на индикаторе будет отображено \"99+\".\nПо умолчанию переключатель неактивен.\nЧат по текущему объекту\nСоздание чата по текущему объекту канбан доски.\nПараметр отображается при активном переключателе \"Отображать чат по объекту\" и используется в качестве значения по умолчанию.\nЧат по связанному объекту\nСоздание чата по связанному объекту.\nПараметр отображается при активном переключателе \"Отображать чат по объекту\".\nЧат по объекту\nОпределение связанного объекта, по которому будет создан чат.\nВ выпадающем списке доступен выбор среди\nобъектных singleselect-атрибутов\n.\nПодробнее о работе с чатом по объекту можно ознакомиться в\nстатье\n.\nОформление\nНа вкладке \"Оформление\"\nдоступна настройка следующих параметров:\nПараметр\nНазначение\nОжидаемая дата выполнения\nВыбор атрибута с указанием предполагаемой даты выполнения задачи.\nВыбор осуществляется посредством выпадающего списка из атрибутов типа \"Дата\", \"Дата и время\" (в том числе унаследованных) типа объектов, указанного в качестве параметра \"Тип объектов Канбан-доски\".\nПо умолчанию используется унаследованный атрибут \"Дата последнего изменения\" [LAST_MODIFIED_DATE].\nДата фактического выполнения\nВыбор атрибута, определяющего дату фактического выполнения задачи.\nВыбор осуществляется посредством выпадающего списка из атрибутов типа \"Дата\", \"Дата и время\" (в том числе унаследованных) типа объектов, указанного в качестве параметра \"Тип объектов Канбан-доски\".\nПо умолчанию используется унаследованный атрибут \"Дата создания\" [CREATE_DATE].\nЗадача создана\nВыбор\nстиля форматирования\nдля задач, у которых выполняются оба условия:\nв задаче\nне заполнено\nзначение атрибута, выбранного в качестве параметра \"Дата фактического выполнения\";\nразница между текущими значениями даты и времени и значением параметра \"Ожидаемая дата выполнения\"\nбольше\nзначения, указанного в параметре \"Значение для истекающего срока\" (с учетом параметра \"Тип назначения истекающего срока\").\nПо умолчанию используется \"Стиль для новой задачи\".\nЗадача просрочена\nВыбор\nстиля форматирования\nдля задач, у которых выполняются оба условия:\nв задаче\nне заполнено\nзначение атрибута, выбранного в качестве параметра \"Дата фактического выполнения\";\nтекущие значения даты и времени\nбольше\nзначения параметра \"Ожидаемая дата выполнения\".\nПо умолчанию используется \"Стиль для просроченной задачи\".\nЗадача выполнена\nВыбор\nстиля форматирования\nдля задач, у которых\nзаполнен\nпараметр \"Дата фактического выполнения\".\nПо умолчанию используется \"Стиль для завершенной задачи\".\nИстекает срок задачи\nВыбор\nстиля форматирования\nдля задач, у которых выполняются оба условия:\nв задаче\nне заполнено\nзначение атрибута, выбранного в качестве параметра \"Дата фактического выполнения\";\nразница между текущими значениями даты и времени и значением параметра \"Ожидаемая дата выполнения\"\nменьше\nзначения, указанного в параметре \"Значение для истекающего срока\" (с учетом параметра \"Тип назначения истекающего срока\").\nПо умолчанию используется \"Стиль для задачи с истекающим сроком\".\nТип назначения истекающего срока\nОпределяет тип назначения для определения истекающего срока у объекта.\nВыбор значения осуществляется посредством выпадающего списка из объектов типа \"ДО. Тип назначения сроков\" [WF_TASK_TERM_TYPE] для\nфиксированного срока\n. Возможные варианты:\nфиксированный срок в минутах;\nфиксированный срок в рабочих минутах;\nфиксированный срок в часах;\nфиксированный срок в рабочих часах;\nфиксированный срок в днях;\nфиксированный срок в рабочих днях.\nПо умолчанию используется значение \"Фиксированный срок в днях\".\nЗначение для истекающего срока\nОпределяет значение в соответствии с типом назначения истекающего срока у объекта. В поле указывается целочисленное значение.\nПо умолчанию указывается значение \"1\".\nДля параметров \"Задача создана\", \"Истекает срок задачи\", \"Задача просрочена\", \"Задача выполнена\" выбор стиля форматирования осуществляется из доступного перечня ранее созданных\nстилей\nпри помощи выпадающего списка. При необходимости имеется возможность просмотра/редактирования выбранного стиля или создание нового посредством нажатия на меню действий в правой части поля.\nФильтрация\nДля настройки параметров фильтрации необходимо перейти\nна вкладку \"Фильтрация\"\nи заполнить следующие параметры:\nПараметр\nНазначение\nАлгоритм фильтрации\nОпределение алгоритма для фильтрации значений.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nВ выпадающем списке доступен выбор алгоритмов, у которых базовый тип объекта совпадает или наследуется от типа, выбранного в качестве значения параметра\n\"Тип объектов Канбан-доски\"\n.\nФильтр\nОпределение фильтра объектов на основе\nSQL-условия\n.\nВыбор ранее созданного фильтра осуществляется из выпадающего списка, добавление нового фильтра доступно через меню действий параметра.\nВ выпадающем списке доступен выбор фильтров, у которых базовый тип объекта совпадает или наследуется от типа, выбранного в качестве значения параметра\n\"Тип объектов Канбан-доски\"\n.\nДополнительные атрибуты для фильтрации\nВыбор атрибутов, по значениям которых будет предоставляться возможность фильтрации задач на Канбан-доске.\nВыбор осуществляется посредством выпадающего списка из всех атрибутов (в том числе унаследованных) типа объектов, выбранного в качестве значения параметра\n\"Тип объектов Канбан-доски\"\n.\nПересчет фильтрации по кнопке\nОпределение способа осуществления фильтрации.\nПри активном положении переключателя параметр пересчета фильтрации объектов будет применен после нажатия на кнопку\n.\nПри неактивном положении переключателя фильтрация производится при любом изменении параметров Канбан-доски.\nПри наличии параметров алгоритма или фильтра в блоке \"Параметры\" отображаются поля:\nПараметр\nНазначение\nЧем заполнять\nВыбор типа значения параметра посредством выпадающего списка. Возможные варианты:\nтекущей датой;\nконстантой;\nпараметром дашборда.\nПараметр дашборда\nВыбор параметра дашборда.\nПоле доступно при выборе типа значения \"Параметр дашборда\".\nЗначение\nВвод значения константы.\nПоле доступно при выборе типа значения \"Константа\".\nДобавление и редактирование этапа\nВозможность редактирования и добавления этапа регулируется\nправами доступа\nк объектам Системы.\nКнопки добавления и редактирования этапов, а также право на изменение порядка этапов доступны пользователям, обладающим правами на редактирование текущего дашборда.\nДля создания нового этапа необходимо нажать на кнопку\n, в результате чего отобразится область с настройками добавления этапа для ввода значений следующих параметров:\nПараметр\nНазначение\nНаименование\nВвод наименования этапа на Канбан-доске.\nЗначения этапа\nВыбор одного или нескольких признаков, при наличии которых задача будет размещаться на этапе.\nВыбор осуществляется посредством выпадающего списка из значений атрибута, указанного в настройках в поле \"Атрибут для разбиения по этапам\". После выбора необходимых значений необходимо нажать вне области списка значений.\nДоступен выбор нескольких значений для одного этапа, при этом\nодин объект не может быть добавлен одновременно в нескольких этапах\n.\nДля удобства выбора объектов имеется возможность одновременного выделения и снятия меток посредством нажатия на соответствующие кнопки, также можно воспользоваться поиском по наименованию объектов.\nПосле завершения настройки следует нажать на кнопку \"Ок\", после чего новый этап будет добавлен на Канбан-доску с относящимися к нему карточками объектов. При нажатии на кнопку \"Отмена\" доска вернется в исходное состояние.\nВ случае, когда количество этапов выходит за рамки области отображения экрана, становится доступен горизонтальный скролл.\nДля редактирования или удаления уже созданного этапа необходимо нажать на иконку настроек этапа, расположенную в правом верхнем углу этапа. Откроется область с настройками редактируемого этапа, где в отличие от области добавления нового этапа, будет доступна кнопка удаления. После редактирования для сохранения внесенных изменений следует нажать на кнопку \"Ок\", при нажатии на кнопку \"Отмена\" доска вернется в исходное состояние.\nНельзя одновременно редактировать или добавлять несколько этапов. Следует завершать сохранение введенных настроек нажатием на кнопку \"Ок\", иначе при попытке редактирования другого этапа или добавления нового этапа в ранее открытой области для настройки добавления/редактирования этапа автоматически применится кнопка \"Отмена\".\nНа доске этапа в виде карточек задач будут отображены все экземпляры типа, выбранного в поле \"Тип объектов Канбан-доски\", у которых атрибут для разбиения на этапы соответствует хотя бы одному из выбранных значений в параметре \"Значения этапа\" при добавлении/редактировании этапа.\nКоличество соответствующих этапу карточек задач отображается в верхней части доски этапа.\nДля этапов с большим количеством карточек задач (случай, когда все задачи этапа не помещаются в область экрана, регулируется масштабированием экрана) становится доступен вертикальный скролл.\nДобавление и редактирование карточки задачи\nДля добавления новой задачи необходимо нажать на соответствующую кнопку в правом верхнем углу доски этапа. В результате чего откроется модальное окно по созданию нового экземпляра типа, указанного в качестве параметра \"Тип объектов Канбан-доски\" с\nвизуалом\nпо умолчанию.\nДля просмотра и редактирования данных задачи следует нажать на гиперссылку со значением атрибута \"Наименование\" (если данный атрибут вынесен на карточку задачи) или двойным кликом по карточке задачи. В результате чего откроется модальное окно карточки соответствующего экземпляра.\nФильтрация и поиск задач\nДля поиска значений на Канбан-доске необходимо ввести текстовое значение в поле поиска. В результате чего на Канбан-доске отобразятся только карточки задач, содержащие поисковой запрос, с выделением соответствующего значения в карточке задачи.\nДля фильтрации задач по атрибуту следует нажать на кнопку\n, в результате чего откроется контекстное меню, в котором указываются значения для фильтрации в полях необходимых атрибутов. После завершения ввода значений для фильтрации нажимается кнопка \"Ок\".\nПо умолчанию фильтрация может быть осуществлена по атрибутам, указанным при настройке параметров в блоке \"Настройка атрибутов\" на вкладке \"Основные настройки\".\nДобавление дополнительных атрибутов для фильтрации осуществляется в одноименном поле в настройках Канбан-доски на вкладке \"Фильтрация\".\nДля очистки фильтра следует нажать на иконку\n, расположенную на кнопке фильтра.\nЕсли в настройках Канбан-доски переключатель \"Пересчет фильтрации по кнопке\" на вкладке \"Фильтрация\" находится в активном положении, для осуществления поиска и фильтрации после ввода поискового запроса или выбора значений фильтра необходимо нажать на кнопку\n.\nПримеры настройки Канбан-доски\nПример 1\nДопустим, имеется пул задач, и появилась необходимость визуализации рабочего процесса, отслеживания сроков выполнения этапов работы и при наличии потребности – перераспределение нагрузки между сотрудниками. Для решения поставленной задачи можно внедрить в работу аналитическую панель \"Канбан-доска\".\nДля последующих настроек Канбан-доски рекомендуется заранее настроить объектную модель, содержащую объектные атрибуты для отображения их значений на карточке задачи, а также определить принцип разбиения задач на этапы.\nДля текущего примера будет использован тип объекта \"Задача (issue)\" со следующим атрибутивным составом:\nРазбиение на этапы возможно по любому из объектных атрибутов типа \"Задача (issue)\", как собственных, так и унаследованных. В рамках примера разбиение на этапы будет производиться по объектному атрибуту \"Статус задачи\", содержащему следующие экземпляры:\nДля работы с Канбан-доской необходимо:\n1.\nНастроить дашборд\n.\n2. В режиме настройки визуала перетащить (Drag&Drop) в\nрабочую область\nэлемент \"Ряд\" с вкладки \"Разметка\" и аналитическую панель дашборда \"Канбан-доска\" с вкладки \"Аналитические панели\".\n3. Перейти к настройкам параметров Канбан-доски посредством кнопки \"Открыть настройки\".\n3.1. На вкладке основных настроек:\nввести наименование аналитической панели \"Задачи\";\nв поле \"Тип объектов Канбан-доски\" выбрать подготовленный тип \"Задача (issue)\" (при необходимости можно создать новый тип объекта посредством меню действий в правой части поля);\nв качестве атрибута для разбиения указать атрибут \"Статус задачи\".\n3.2. В блоке \"Настройка атрибутов\" поля параметров заполнены по умолчанию, при необходимости следует заменить их на требуемые в рамках решения задачи атрибуты, как показано на рисунке далее. Значения выбранных объектных атрибутов будут отображены на карточках задач (с учетом настроек п.3.3).\n3.3. В рассматриваемом примере не требуется применения особого\nстиля форматирования\nдля задач, поэтому параметры на вкладке \"Оформление\" используются по умолчанию.\n3.4. Фильтрация отображения задач на канбан-доске по умолчанию осуществляется по атрибутам, указанным в качестве параметров в блоке \"Настройка атрибутов\".\nЕсли потребуется фильтрация задач по иным атрибутам типа \"Задача (issue)\", например, по атрибуту \"Бирка (label)\", добавление дополнительных атрибутов для фильтрации осуществляется на вкладке \"Фильтрация\".\n4. Сохранить внесенные настройки нажатием кнопки \"Ок\" в модальном окне \"Настройка Канбан-доски\" и в панели элементов настраиваемого визуала.\nВ результате данных настроек в дашборд будет встроена Канбан-доска с наименованием \"Задачи\".\nДалее необходимо добавить этапы при помощи кнопки\n. В отобразившейся области настроек добавляемого этапа указывается наименование и выбирается одно или несколько значений из представленных (выбор осуществляется из объектов типа \"Статус задачи\", который является объектным атрибутом типа \"Задача (issue)\" и выбран в качестве параметра \"Атрибут для разбиения по этапам\" в настройках аналитической панели).\nКарточки задач автоматически будут отображены на соответствующих этапах.\nПосле добавления всех необходимых этапов дашборд может принять следующий вид:\nИспользование Канбан-доски на дашборде предполагает возможность:\nдобавления новых этапов (при наличии прав на редактирование текущего дашборда);\nредактирования существующих этапов (при наличии прав на редактирование текущего дашборда);\nперемещения этапов (при наличии прав на редактирование текущего дашборда);\nдобавления новых задач;\nперемещения задач по этапу;\nперемещения задач из одного этапа в другой;\nфильтрации отображения задач посредством поля поиска;\nфильтрации отображения задач по атрибутам при помощи кнопки \"Фильтры\";\nоткрытия карточки задачи при помощи клика по наименованию или двойного клика по карточке задачи;\nоткрытия окна чата по нажатию на соответствующую иконку (при активном положении выключателя \"Отображать кнопку чата\" в настройках аналитической панели);\nПример фильтрации посредством поискового запроса \"Летов\":\nПример 2\nУправлять отображением данных в Аналитической панели \"Канбан-доска\" можно при помощи добавленного параметра, иными словами через\nаналитическую панель \"Элемент управления\"\n.\nРассмотрим данную настройку, используя наработку из примера 1.\nОдним из объектных атрибутов типа объектов \"Задача (issue)\" является \"Команда\". Рассмотрим пример, в котором отображение карточек задач на аналитической панели будет зависеть от выбранного значения типа объектов \"Команда\".\nДля этого в режиме настройки визуала дашборда необходимо перетащить (Drag&Drop) в\nрабочую область\nэлемент\nаналитическая панель дашборда \"Элемент управления\"\nс вкладки \"Аналитические панели\".\nРекомендуется размещать аналитические панели в области элемента \"Группа атрибутов\", добавленного в рабочую область с вкладки \"Разметка\".\nПерейдя в настройки элемента управления при помощи нажатия на кнопку \"Открыть настройки\", в открывшемся модальном окне \"Настройки элемента управления\" указать:\n\"Наименование\" аналитической панели – \"Команда\";\n\"Тип элемента управления\" – \"Выпадающий список по типу объектов\";\nтип \"Команда\" в качестве типа объектов.\nДля сохранения настроек нажимается кнопка \"Ок\" в модальном окне \"Настройка элемента управления\" и кнопка \"Сохранить\" на панели \"Элементы\".\nПосле сохранения автоматически сгенерируется параметр дашборда. Убедиться в этом можно, повторно открыв \"Настройки элемента управления\" или нажав на кнопку \"Управление параметрами\", расположенную в верхней части рабочей области.\nДалее осуществляется настройка аналитической панели \"Канбан-доски\". Для этого следует нажать на кнопку \"Открыть настройки\", перейти на вкладку \"Фильтрация\" и в поле \"Алгоритм фильтрации\" посредством меню действий добавить новый алгоритм следующего вида:\nВ качестве параметра алгоритма фильтрации в поле \"Тип значения\" выбирается значение \"Параметр дашборда\", после чего в отобразившемся поле \"Параметр дашборда\" указывается созданный параметр дашборда.\nПосле сохранения настроек аналитической панели посредством кнопки \"Ок\" и визуала при помощи кнопок \"Сохранить\"/\"Ок\" на панели \"Элементы\" будет доступна настройка отображения карточек задач Канбан-доски в зависимости от значения, выбранного в поле \"Команда\".",
  "source": "https://docs.greendata.ru/platform/ru/kanban-board-dashboard.html"
}