{
  "title": "Setting up a data source for a dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up a data source for a dashboard\nAny structural information can be reflected on the visual using\ndashboards\n. Doing this requires the\ndata source\n, which is a representaion of data systematized according to certain criteria.\nThe following data source types can be generated for dashboards:\nObject data source (\nlearn more\n);\nSQL-based data source (\nlearn more\n);\nAlgorithm-based data source.\nObject data source and SQL-based data source\nThe object data source and the SQL-based data source are formed by combining information (columns) from one or more registries.\nIn order to configure any dashboard element for data visualization, specify the desired data source in the \"Source management\" settings in the editing mode of the dashboard visual.\nIf settings were added in the data source profile, they will be reflected under the corresponding source in the \"Source management\" window.\nThe parameter value can be of the following type:\nCurrent date;\nConstant;\nDashboard parameter;\nValue from the source field.\nAfter saving the data, the specified source can be used for data visual by specifying the following dashboard elements in the settings:\nTable\n;\nStructural diagram\n;\nDynamics chart\n;\nLinear chart\n;\nCustom highcharts\n;\nGraph\n;\nSlider with charts\n.\nThe example of using the data source when configuring the \"Table\" dashboard can be found\nhere\n.\nConfiguring data source parameters in the dashboard profile\nIf the data source contains parameters (inserted into the query structure), they automatically become available in the dashboard profile and can be configured.\nFor example, the \"Client application\" object data source with the internal filtering parameter \"Car brand\" can be linked to the control dashboard.\nTo do this, follow the step-by-step setup of the dashboard:\n1. Setting up the control (the multiple choice element for selecting car brands).\nAt this stage, it is necessary to specify the \"Car brand\" object type in the control settings, as well as other settings (as shown on the figure below), and then save them.\n2. Click\nSave\non the \"Elements\" panel.\nAfter that, the dashboard parameter will be automatically created. See the result by clicking the\nbutton, and by going to the control settings. The \"Link to parameter\" field will be filled in automatically.\n3. Adding the data source.\nAfter adding the previously created data source, its settings will be configured, the \"Value type\" field indicates the \"Parameter reference\". After that select the dashboard parameter.\nIf there are several parameters at the data source, this action is performed separately for each parameter. The \"Control element\" is also created for each parameter (if necessary).\n4. Set up the result table (with data from client applications with selected car brands).\nThus, the dashboard not only visualizes the source data, but also provides the user with control over the data set returned from the source.\nFor example, when choosing \"BMW\" and \"Audi\" car brands, only the profiles of customers who specified these brands in the customer profile will be displayed.\nThe columns of the table are formed using the visual (\nmore details\n). The fields available for selecting the visual are generated in the data source, more details\nhere\n.\nAlgorithm-based data source\nIf the previously specified dashboard elements demonstrate an incomplete representation of information, use the graphical tools provided by the algorithm-based data source. To do this, go to the \"Source management\" settings and click the \"Add based on algorithm\" button to specify an existing algorithm or create a new one by clicking the three dots icon and selecting the appropriate value in the drop-down list.\nAfter saving the data, the specified source can be used for data visual specified in the\nHighcharts dashboard\nsettings.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-data-source-for-dashboards.html"
}