{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.435.5 от 28.10.2024\nНовые возможности\nПоявилась возможность\nудаления дубликатов объектов\nпри помощи  пользовательского действия.\nТеперь в\nкомнате для звонков\nпользователь может установить фото профиля.\nВ панели управления атрибута типа \"Файл\" с визуалом \"Визуал прикрепления файлов для подписания\" появилась возможность размещения\nпользовательских действий\n.\nРазмещение кнопки для просмотра маршрута бизнес-процесса теперь реализуется при помощи\nдействия\n.\nТеперь изменение значений управляющих атрибутов в\nвиджете \"Дашборд\"\nприводит к обновлению визуализации аналитической панели при сохранении без необходимости обновления страницы.\nПоявилась новая функция\nnewPdfFile\n, которая при помощи метода  insertText позволяет добавлять текст в файл формата pdf.\nПоявилась возможность проверки корректности файлов\nобновления\n, регулируемая новым\nразрешением\n.\nПри настройке аутентификации через\nисточник типа \"Внешний сервис\"\nтеперь можно задавать логин и пароль не только для сервиса, но и для прокси.\nПри работе с\nдокументом eDoc\nпоявилась возможность вставлять изображения из буфера обмена, помимо этого поддержка использования горячих клавиш теперь доступна как на Windows, так и на Mac.\nИзменения и улучшения\nДоработана блокировка настроек типа объекта для пользователя с правами на чтение.\nСтабилизировано создание экземпляра в новой вкладке.\nОтлажен процесс удаления объекта.\nНалажено автоматическое обновление реестра после добавления или редактирования объекта.\nОтлажена установка фокуса строки в реестре, отображаемом на фрейме.\nСтабилизирован процесс сохранения визуала экземпляра наследуемого типа.\nОтлажена возможность настройки расширений загружаемых файлов для атрибута с визуалом \"Виджет для файлов\".\nУсовершенствована работа с виджетом \"\nФинансовая отчетность\n\".\nПри использовании\ndrill down расшифровки\nв дашбордах с активной опцией отображения на месте родителя появилась возможность возврата к предыдущей таблице при помощи кнопки\n.\nВ\nаналитической панели \"Таблица\"\nстабилизирована возможность фильтрации данных по логическому атрибуту.\nСоздание\nцветовой палитры\nтеперь доступно при настройке диаграммы.\nСтабилизирован работа алгоритма блокировки, накладываемого на кнопку\nдействия\n.\nОтлажена работа функции\nattrOldValue\n.\nВ приложениях с системой кеширования Redis стабилизирована работа алгоритмов по построению\nграфиков\n.\nТеперь при компиляции алгоритма не осуществляется замена символа \"?\".\nВ\nконструкторе входа\nстабилизирована настройка высоты окна.\nОптимизирована работа аудита групп доступа.\nВ\nисточнике типа \"Внешний сервис\"\nдля логических значений реализована поддержка NULL.\nОтлажен процесс отображение ошибок при\nустановке обновлений\nпосредством GUF-файла.\nСтабилизирован процесс\nустановки обновлений посредством GUF-файла\n, содержащих поисковые фильтры, алгоритмы фильтрации или настройка кнопок панели управления в реестре.\nОбновлена структура XML-файла, используемая для отправки уведомлений в Нотариат.\nОтлажен процесс смены наименования у экземпляра объекта \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\".\nВ модуле EDoc доработано отображение больших картинок в параграфах с запретом висячих строк, исправлено обновление элементов в таблице после перерисовки, а также стабилизирована установка курсора в документе.\nВ мобильном приложении GreenData оптимизировано время для обмена сообщениями.\nСкорректирован визуал модального окна по управлению параметрами дашборда.\nВ модуле EDoc скорректированы визуалы ряда карточек по настройке шаблона печатной формы.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.435.5\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.435.5.war\nhttps://downloads.greendatasoft.ru/LTS/lts.435.5.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.435.5-latest.html"
}