{
  "title": "Setting up widget in the main menu",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up widget in the main menu\nMain menu settings\nare not limited to selecting the composition and editing the order of menu items. Once the list is configured, it is also possible to add some widgets, which in turn display data from the external System and allow switching to the external System. For example, in the main menu, you can display the exchange rate or the weather forecast.\nTo add a widget to the main menu, open the \"Widget\" [SYS_MENU_WIDGET] object type by selecting the menu items: Administration → Object management → Object types, and go to the type registry (for more details see\nWorking with the object instance registry\n).\nAdding a new type instance is done using the\nbutton located on the control panel. As a result, a card will open containing the following parameters:\nSetting\nPurpose\nName\nEntering a name for the setting.\nIdentifier\nEntering the identification number of the generated action. The field can be filled in automatically.\nOrder\nEntering the system number of the generated action. The field can be filled in automatically.\nIcon\nSelecting an icon from the drop-down list.\nType\nObject type to display. The field is filled in automatically. The specified value is Widget.\nWidget\nWidget selection. Possible options:\n•\nText\n;\n•\nExternal Frame\n.\nWidget height, px\nThe field is available when the \"\nExternal Frame\n\" widget is selected.\nThis parameter sets the height of the frame, the value is specified in px.\nAlgorithm for external system link\nThe field is available when the \"\nExternal Frame\n\" widget is selected.\nIn this field, you can select an algorithm for setting a link to an external System from the drop-down list with a previously prepared algorithm, or add / edit an algorithm by clicking on the ellipsis icon.\nWidget Text\nThe field is available when the \"\nText\n\" widget is selected.\nEnter text to display.\nLocalization settings. When pressed, a modal window will open, in which the name of the subject area is entered.\nInput is available in different languages.\nDisplay as title\nThe field is available when the \"\nText\n\" widget is selected.\nThe attribute determines the display of text as a title.\nText color\nThe field is available when the \"\nText\n\" widget is selected.\nWhen using the parameter, the text color is set using the opened Color picker with the ability to select a color on the palette or enter a color code in HEX and RGBA formats.\nFont size\nThe field is available when the \"\nText\n\" widget is selected.\nFixing the font size (point size) of the text.\nModule ID\nEntering the ID of the object the card of which you want to display.\nWhen selecting the \"External Frame\" Widget, it should be taken into account that displaying data from an external System is possible only if the external System allows data to be displayed in other Systems (on other sites).\nTo display the created objects and changes made in the settings of the Widgets menu item, refresh the browser page.\nUse example\nIn honor of the holiday, add a congratulation to the main menu, containing a text message and a video clip imported from an external Service.\nIn the \"Widget\" [SYS_MENU_WIDGET] type registry, add two instances. To add a text message, create an object with the following settings:\nTo add a player containing a video, use the following settings:\nThus, after saving objects in the \"Widget\" type registry, two instances will be displayed.\nAfter refreshing the page, widgets will be displayed under the list of menu items:",
  "source": "https://docs.greendata.ru/platform/en/setting-up-widget-in-the-main-menu.html"
}