{
  "title": "Вид контроля прав \"Наследование прав от связанного объекта\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВид контроля прав \"Наследование прав от связанного объекта\"\nВид контроля прав\n\"Наследование прав от связанного объекта\"\nпозволяет разграничить доступ к экземплярам типа объекта на основе прав доступа к\nсвязанному\nобъекту.\nДля определения связанного объекта необходимо в поле \"Атрибут для наследования прав\" указать\nобязательный\nобъектный singleselect-атрибут\n.\nДалее представлен пример настройки данного вида контроля прав.\nТематическая задача\nВ рамках проекта требуется\nсоздать сущность\nдля регистрации заявок от клиентов:\n\"Предварительный заказ\";\nи еще один тип объекта для окончательного оформления договора с клиентом, созданного на основании предварительного заказа:\n\"Заказ\".\nС указанными сущностями будут работать пользователи, входящие в группу доступа \"Клиентский менеджер\".\nИванов;\nФомин.\nТребуется, чтобы\nкаждый\nспециалист смог\nсоздавать, видеть, редактировать\nи\nудалять\nтолько свои\nкарточки \"Предварительный заказ\", а права к карточкам \"Заказ\" должны\nнаследоваться\nот карточек \"Предварительный заказ\", на основании которых они были созданы.\nС информацией по созданию пользователей и групп доступа можно ознакомиться в статье\n\"Основной порядок настройки ролевой модели\"\n.\nАналитическая настройка\nСвязь между типами\nДля решения поставленной задачи требуется связать тип объекта \"Предварительный заказ\" с типом \"Заказ\" с помощью атрибутов.\nВ типе объекта \"Заказ\" требуется\nсоздать объектный атрибут\nсо ссылкой на тип \"Предварительный заказ\".\nВ типе \"Предварительный заказ\"\nсоздать дочерний атрибут\nсо ссылкой на тип \"Заказ\" и выбором созданного ранее\nобъектного атрибута\n(\"Связь с Предварительным заказом\") в качестве связи.\nПрава доступа к типу \"Предварительный заказ\"\nВ родительском типе \"Предварительный заказ\" по умолчанию будет указан \"Системный контроль прав\". В рамках текущей задачи данную настройку менять не будем.\nДалее необходимо\nпредоставить доступ группе пользователей\n\"Клиентский менеджер\" к типу объекта \"Предварительный заказ\". В связи с применением системного контроля прав обязательно раздадим указанной группе права на\nсоздание, редактирование\nи\nудаление\nэкземпляров.\nПрава доступа к типу \"Заказ\"\nПерейдем к настройке вида контроля прав к типу \"Заказ\".\nВ поле \"Вид контроля прав\" установим значение \"Наследование прав от связанного объекта\".\nВ поле \"Атрибут для наследования прав\" выберем созданный ранее объектный атрибут \"Связь с Предварительным заказом\" со ссылкой на тип \"Предварительный заказ\".\nОсуществлять дополнительную раздачу прав группе доступа \"Клиентский менеджер\" для типа \"Заказ\" не будем.\nИзменения вступят в силу только после сохранения настроек.\nРезультат\nТаким образом, при создании экземпляров типа \"Заказ\"\nкаждый\nпользователь сможет работать\nтолько со cвоими\nпредварительными заявками (\nсоздавать, смотреть, редактировать и удалять\n).\nПри создании дочерних объектов (экземпляров типа \"Заказ\") права к ним будут применяться аналогичным образом, то есть наследоваться от родительского объекта.",
  "source": "https://docs.greendata.ru/platform/ru/permission_inheritance_from_related_object.html"
}