{
  "title": "The \"Structural diagram\" dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThe \"Structural diagram\" dashboard\nThe analytical panel of the \"Structural diagram\"\ndashboard\nallows users to create charts based on data dependency. All displayed values are borrowed from the configured\ndata source\n.\nThe structural diagram can be shown as follows:\nWhile editing the dashboard visual, drag and drop the \"Structural diagram\" element from the \"Elements\" panel onto the workspace.\nFurther configuration of the diagram is performed by clicking the\nbutton. Clicking this button opens the modal window, which contains five tabs.\nSetting parameters\nBasic settings\nIn the \"Base\" tab, specify the main dashboard parameters:\nSetting\nPurpose\nName\nEntering/displaying the chart name. This name will be displayed to the end user in the profile.\nData source\nDefining the data source based on which the diagram will be created.\nChart type\nDefining the chart type. Possible values (described below):\n• Donut\n• Pie\n• Bar\n• Horizontal bar\n• Funnel\n• Bubble\nColumn to group\nSelecting an attribute which value will be used to group data.\nThe parameter is displayed when configuring all charts types except \"Bubble\".\nColumn to aggregate value\nSelecting an attribute whose value will be used for value aggregation.\nThe parameter is displayed when configuring all charts types except \"Bubble\".\nNumber of data series\nDefining the number of displayed data series.\nSelection is performed via a toggle switch, possible values:\nOne\nMore than one.\nBy default, the value \"One\" is set\n.\nThe parameter is displayed when configuring \"Column\" or \"Horizontal Column\" type charts.\nColumn for series name\nSelecting the data source field whose value will be used as the name of grouped data.\nThe parameter is displayed when configuring \"Column\" or \"Horizontal Column\" type charts, when the number of data series is specified as \"More than one\".\nColumn to aggregate value\nSelecting  the attribute whose value will be used for value aggregation.\nThe parameter is displayed when configuring all charts types except \"Bubble\".\nAggregation method\nSelecting the aggregation method.\nPossible values:\n• Quantity\n• Maximum\n• Minimum\n• Weighted average\n• Average\nThe parameter is displayed when configuring all charts types except \"Bubble\".\nColumn for radius\nSelecting an attribute whose value will be used to calculate the radius of the bubble chart item (\"bubble\").\nColumn for the X axis\nSelecting an attribute whose value will be used to define the abscissa axis.\nColumn for the Y axis\nSelecting an attribute whose value will be used to define the ordinate axis.\nColumn for caption\nSelecting an attribute whose value will be used for captions on the bubble chart (\"bubbles\").\nShow captions on the chart\nDefining whether there are captions on the bubble chart.\nDecoding the sector of the diagram\nColumn with sector identifier\nParameter required for creating series value breakdown (Drill-down).\nShow table with details\nOpening an explanatory table with data when clicking on a chart sector.\nDashboard table with details\nSelecting the dashboard table that will be displayed when clicking on a dynamics chart sector. The field is displayed when the \"Show breakdown table\" toggle is active.\nSet the Dashboard parameter values when decoding\nDefining values for dashboard parameters during decoding. The ability to set parameter values is available when the toggle is active.\nClicking the button displays fields for adding dashboard parameter values.\nThe button is displayed when the \"Set the Dashboard parameter values when decoding\" parameter toggle is active.\nDashboard parameters\nSelecting a dashboard parameter to set the value.\nThe field is displayed after clicking the add parameter button.\nDashboard parameter values\nSelection of the dashboard parameter value. Possible values:\nDiagram sector identifier;\nConstant.\nBy default, the value \"Diagram sector identifier\" is used.\nThe field is displayed after clicking the add parameter button.\nConfiguring the design style, filtering and additional settings are done similarly to the\nDynamics chart\ndashboard element.\nStyle settings\nOn the \"Style of design\" tab, the user can set the chart size and color scheme.\nThe following design parameters can be configured on this tab:\nSetting\nPurpose\nChart height, %\nSetting the chart height and width. If needed, the \"Maintain aspect ratio\" option can be used by clicking the\nbutton.\nBy default, the following parameters are set: chart height - 100%, chart width - 40%.\nChart width, %\nPalette\nSelecting a\npalette\nfor the chart color style.\nThe selection is made from a dropdown list of standard or previously created palettes. The user can create a new palette or edit the selected one via the parameter action menu.\nBy default, the GreenData corporate color palette is set.\nPalette color cyclicity\nEnabling the cyclic repetition of palette colors for the chart.\nIf colors in the declared palette are exhausted, then with cyclicity disabled, colors from the system palette will be used.\nEnabled by default.\nAccumulation chart\nMethod of presenting chart series for visual data comparison.\nParameters are displayed when configuring \"Column\" or \"Horizontal Column\" type charts.\nGrouping chart\nGroup spacing\nSetting the interval between series groups.\nConfiguration is performed by moving sliders or entering a numerical value from 0 to 100.\nThe parameter is displayed when configuring \"Column\" or \"Horizontal Column\" type diagrams.\nColumn spacing\nSetting the interval between columns of series groups.\nConfiguration is performed by moving sliders or entering a numerical value from 0 to 100.\nThe parameter is displayed when configuring \"Column\" or \"Horizontal Column\" type diagrams, when the \"Grouping chart\" presentation method is selected.\nAdditional settings\nThe configuration on the \"Additional\" tab allows adding JSON code with additional options, which will be displayed on the chart after saving.\nCurrently, JSON expressions are not used to configure dashboard elements.\nFilter settings\nOn the \"Filter\" tab, additional data filtering can be set.\nAfter clicking the add filter button, a field for selecting the column whose data will be filtered is displayed.\nUsing the add filter condition button, parameter pairs are configured where the equality condition (\"Equal\", \"Not equal\", \"Less than\", \"Greater than\", \"Less than or equal\", \"Greater than or equal\") and value must be specified.\nWhen multiple filter conditions are present, the AND/OR switch regulates the relationship between the specified conditions.\nSorting\nThis tab configures data sorting on the diagram.\nThe tab is unavailable when configuring a structural diagram of the \"Bubble\" type.\nSetting\nPurpose\nSort column\nSelecting the column by which data sorting will be performed.\nSelection is made from a dropdown list containing columns previously selected on the\n\"Base\"\ntab in the \"Column to aggregate value\" and \"Column to group\" parameters.\nThe column selected in the \"Grouping column\" parameter is used as the default sorting.\nSort type\nSelecting the sorting direction (ascending or descending).\nBy default, sorting is performed in ascending order.\nIf two conditions are present, the sorting order can be changed using the Drag&Drop method via the\nicon.\nDecryption\nOn this tab, the relationship between two or more analytical panels is configured. In other words, this setting allows real-time changes to the display of data in one analytical panel depending on the selected value of another analytical panel.\nFor more information on decryption configuration, refer to\nData Drill Down Decryption\n.\nResult\nAfter the configuration of the flow chart is complete, the user can save it in a required format and print it out.",
  "source": "https://docs.greendata.ru/platform/en/the-structural-diagram-dashboard.html"
}