{
  "title": "updateLdapEntry",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nupdateLdapEntry\nA function designed for making changes to an existing entry in the Microsoft Active Directory Service when connected via the LDAP protocol.\nSyntax\nupdateLdapEntry\n(obj, entryDn, modifications)\nParameter\nPurpose\nobj\nAn object with settings for connecting to the directory service via the LDAP protocol.\nObject of the \"LDAP Connection Settings\" type [SYS_LDAP_SETTINGS] is selected as a value using the\ndict\nfunctions.\nentryDn\nThe parameter specifies the directory of the record, the value of which needs to be changed\nThe parameter is set as\ntext\n.\nThe parameter specifies the path\nexcluding\nthe root directory defined in the\nLDAP connection settings\n.\nmodifications\nChanges that need to be made to the specified entity.\nNote\nFunctions are added manually.\nSpecial functions are additionally used to update the record. These functions generate a list of necessary changes, which are then applied to an entry in the Active Directory Service:\naddLdapAttribute\n– adds a new attribute value;\naddLdapAttribute\n(name, value)\nParameter\nPurpose\nname\nName of the Active Directory Service attribute to add a value to.\nSpecified as\ntext\n.\nvalue\nRepresenting the passed value. The one attribute can have multiple values.\nreplaceLdapAttribute\n– replaces the value of the specified attribute;\nreplaceLdapAttribute\n(name, value)\nParameter\nPurpose\nname\nName of the Active Directory Service attribute which value is required to be replaced.\nSpecified as\ntext\n.\nvalue\nRepresenting the passed value. The one attribute can have multiple values.\nremoveLdapAttribute\n– deletes the attribute value.\nremoveLdapAttribute\n(name, [value])\nParameter\nPurpose\nname\nName of the Active Directory Service attribute which value is reqiured to be deleted.\nSpecified as\ntext\n.\nvalue\nOptional parameter.\nIf a parameter value is specified, then only the key-value pair will be deleted, in other words, only the specified values will be deleted from the attribute.\nThe user’s password must be passed in quotation marks and encoded format.\nExample\nLet’s take look at an example of an algorithm for replacing the user’s password in the Active Directory Service. To do this, set up a\nconnection to the Active Directory Service\n, and then\ncreate an algorithm\n.\nThe algorithm can look as follows:\nUse the\nreplaceLdapAttribute\nfunction to specify the user’s new password in the algorithm. The made changes are an array that is set via the new\nmodifications\nvariable.\nUsing the\nupdateLdapEntry\nfunction, the specified password must be sent to the Active Directory Service. To do this:\nThe first parameter of the function using the\ndict\nfunction specifies an object with settings for connecting to the Active Directory Service.\nThe second parameter defines the path to the entity to which the changes are made.\nIn the third parameter, changes made to the record are transferred using the modifications function.\nIn this case, the password is transmitted in UTF-16LE encoding.",
  "source": "https://docs.greendata.ru/platform/en/updateldapentry.html"
}