{
  "title": "Собственные мобильные приложения",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСобственные мобильные приложения\nНа основе приложений, разработанных на базе платформы GreenData, можно создавать мобильные приложения с возможностью дальнейшей публикации в магазинах приложений\nGoogle Play\nи\nApp Store\n.\nДанная возможность предоставляется при\nразвертывании платформы\nна решениях SaaS и On-Premise.\nСоздание\nДля создания мобильного приложения необходимо:\nАвторизоваться\nв\nличном кабинете SaaS\n(далее – ЛК).\nОткрыть раздел \"Мобильные приложения\".\nВ открывшейся рабочей области нажать на кнопку \"Создать приложение\".\nМобильное приложение может быть создано и функционировать только на основе приложения:\nв котором пользователь является\nадминистратором или владельцем проекта\n;\nкоторому присвоена активная\nлицензия\n;\nкоторое доступно (не приостановлено).\nПри помощи переключателя выбрать платформу для размещения будущего приложения – App Store/Google Play.\nОпределить параметры настройки.\nApp Store\nПеред созданием мобильного приложения необходимо пройти процесс регистрации приложения в аккаунте на\nApple App Store Connect\n, подробно описанный в статье\n\"Загрузка приложения для iOS в App Store\"\n.\nСоздание мобильного приложения для публикации в App Store предполагает заполнение следующих параметров:\nПараметр\nНазначение\nПлатформа\nВыбор платформы, на которой будет размещаться мобильное приложение – App Store.\nID пакета iOS приложения\nУникальный идентификатор приложения (Bundle ID/SKU),который задается при его регистрации в\nApple App Store Connect\n.\nФормат: com.companyname.appname.\nПодробнее в разделе\n\"Настройка аккаунта Apple Developer\"\n.\nНаименование\nНаименования мобильного приложения, которое будет отображаться в магазине приложений App Store.\nРазмещение\nВыбор\nварианта поставки платформы\n:\nSaaS;\nOn-Premise.\nПосле выпуска мобильного приложения нельзя изменять выбранное значение.\nПриложение\nВыбор приложения, на основании которого будет создано мобильное приложение.\nПри размещении в SaaS, выбор осуществляется из выпадающего списка ранее созданных в личном кабинете активных\nприложений\nс активной лицензией.\nПри размещении в On-Premise, выбор осуществляется из выпадающего списка ссылок на приложения, согласованных с\nотделом продаж\n.\nПомимо указанных\nранее требований\nдля выбора недоступны приложения, у которых имеется созданное мобильное приложение для размещения в App Store.\nApple Team ID\nИдентификатор команды, который выдает компания Apple на этапе регистрации аккаунта разработчика, посмотреть можно в разделе\nMembership\n.\nФормат: A1B2C3D4E5.\nПодробнее в разделе\n\"Регистрация аккаунта Apple Developer\"\n.\nИконка приложения\nИзображение, которое представляет мобильное приложение на устройстве пользователя и в магазине приложений App Store.\nДля иконки приложения разрешено использовать только файлы формата\n*.png\n.\nДля iOS рекомендуется использовать изображение без прозрачных слоев размером 1024х1024 px.\nЛоготип заставки\nИзображение, которое будет отображаться на экране устройства при запуске мобильного приложения.\nРекомендуется использовать изображение размером 600x600 px.\nДля логотипа заставки разрешено использовать только файлы формата\n*.png\n.\nПосле того как все обязательные поля заполнены, достаточно нажать на кнопку \"Создать\" и подтвердить действие в отобразившемся модальном окне:\nВ результате чего запустится процесс по формированию мобильного приложения и выгрузке образа сборки в\nличный кабинет Apple App Store Connect\n.\nОтслеживать статус мобильного приложения можно в ЛК GreenData в его карточке.\nПримерное время сборки образа мобильного приложения занимает 30-60 минут.\nGoogle Play\nДля публикации приложения в Google Play необходимо выполнить следующие действия:\nЗаполнить параметры формы по созданию приложения:\nПараметр\nНазначение\nПлатформа\nВыбор платформы, на которой будет размещаться мобильное приложение – Google Play.\nИдентификатор\nУникальный идентификатор приложения.\nДанный идентификатор будет отображаться в личном кабинете Google Console и в локальном хранилище устройства, на котором будет установлено мобильное приложение.\nВ качестве значения рекомендуется указывать наименование приложения, состоящее из латинских букв и цифр.\nИдентификатор должен быть длиной от 3 до 30 символов и начинаться со строчной буквы.\nИдентификатор устанавливается при создании, его дальнейшее изменение невозможно.\nНаименование\nНаименования мобильного приложения, которое будет отображаться в магазине приложений Google Play.\nРазмещение\nВыбор\nварианта поставки платформы\n:\nSaaS;\nOn-Premise.\nПосле выпуска мобильного приложения нельзя изменять выбранное значение.\nПриложение\nВыбор приложения, на основании которого будет создано мобильное приложение.\nПри размещении в SaaS, выбор осуществляется из выпадающего списка ранее созданных в личном кабинете активных\nприложений\nс активной лицензией.\nПри размещении в On-Premise, выбор осуществляется из выпадающего списка ссылок на приложения, согласованных с\nотделом продаж\n.\nПомимо указанных\nранее требований\nдля выбора недоступны приложения, у которых имеется созданное мобильное приложение для размещения в Google Play.\nИконка приложения\nИзображение, которое представляет мобильное приложение на устройстве пользователя и в магазине приложений Google Play.\nДля иконки приложения разрешено использовать только файлы формата\n*.png\n.\nДля Google Play рекомендуется использовать изображение размером 512x512 px.\nИконка push-уведомлений\nИзображение, которое будет отображаться в панели уведомлений, при получении push-уведомления от мобильного приложения.\nРекомендуется использовать изображение размером 48x48 px.\nДля иконки push-уведомлений разрешено использовать только файлы формата\n*.xml\n.\nСервисный ключ\nФайл, подтверждающий право на публикацию приложения в Google Play.\nЗначение ключа добавляется для возможности обновления приложения напрямую из личного кабинета GreenData.\nСервисный ключ можно получить в личном кабинете\nGoogle Play Console\nпосле первого самостоятельного размещения мобильного приложения.\nФормат: JSON.\nПодробнее в разделе\n\"Настройка Google Cloud для автоматического обновления приложения\"\n.\nПосле того как все обязательные поля заполнены, следует нажать на кнопку \"Создать\" и подтвердить действие в отобразившемся модальном окне:\nДождаться сборки мобильного приложения. При удачной сборке в карточке мобильного приложения появится файл для скачивания первой версии приложения:\nПри возникновении ошибок отобразится соответствующее уведомление:\nПримерное время сборки мобильного приложения занимает 30-60 минут.\nЕсли сборка прошла успешно, но пользователь допустил ошибку в неизменяемых параметрах, то удалить приложение возможно только через обращение в поддержку.\nНеобходимо скачать сформированный файл и добавить его в личном кабинете Google Play Console при загрузке приложения (с инструкцией по установке можно ознакомиться по\nссылке\n).\nПервая выгрузка приложения в\nGoogle Play Console\nосуществляется пользователем самостоятельно.\nВ период формирования и публикации мобильное приложение не может быть отредактировано или удалено.\nДо момента создания мобильного приложения, пользователь может сохранять форму по созданию мобильного приложения как черновик, нажав на одноименную кнопку. В данном случае обязательным для заполнения полем является только наименование будущего мобильного приложения.\nВсе поля черновика доступны для редактирования.\nВсе созданные мобильные приложения пользователя представлены в каталоге на вкладках App Store/Google Play в соответствии с указанной при создании платформой приложения.\nДля удобства раздел оснащен полем поиска и сортировкой по статусу приложения.\nПри выборе приложения в каталоге или нажатию на кнопку редактирования осуществится переход к форме редактирования мобильного приложения. Возможность удаления доступна только для приложения со статусом \"Черновик\".\nОбновление\nВ опубликованном мобильном приложении из личного кабинета GreenData можно изменить:\nнаименование мобильного приложения;\nприложение проекта, на основе которого создано мобильное приложение;\nПри размещении в On-Premise, замена ссылки на приложение доступна только после согласования с\nотделом продаж\n.\nиконку приложения;\nлоготип заставки.\nApp Store\nДля обновления мобильного приложения, размещенного на площадке App Store, после внесения корректировок в карточке приложения, достаточно нажать на кнопку \"Обновить\".\nВ результате чего сформируется новый образ сборки приложения, который автоматически будет подгружен в\nличный кабинет Apple App Store Connect\n, где пользователь сможет протестировать и опубликовать новую версию приложения в AppStore.\nGoogle Play\nДля публикации обновленной версии приложения\nдля внутреннего тестирования\n(автоматизации процесса выгрузки сборки приложения в Google Console) потребуется:\nПроизвести\nнастройки Google Cloud для автоматического обновления приложения\n.\nВ ЛК GreenData в карточке мобильного приложения добавить сервисный ключ.\nПосле внесения корректировок в карточке приложения, нажать на кнопку \"Обновить\".\nТаким образом, после внесения корректировок в карточке мобильного приложения в ЛК GreendData и нажатия на кнопку \"Обновить\", новый образ сборки приложения будет подгружен в личный кабинет Google Console, где пользователь сможет протестировать и опубликовать версию приложения в Google Play для общего доступа.\nПри неудачном обновлении будет отображено уведомление следующего вида:\nВозникла ошибка при обновлении приложения Android.\nЭто может быть связано с отсутствием или неправильным размещением первой версии приложения в личном кабинете Google Play Console, а также с неправильными настройками Google Cloud.\nПерепроверьте, пожалуйста, по инструкции корректность произведенных ранее настроек и перезапустите обновление приложения через личный кабинет GreenData.\nВ случае повторения ошибки обратитесь в службу поддержки.",
  "source": "https://docs.greendata.ru/platform/ru/own-mobile-apps.html"
}