{
  "title": "Общие рекомендации по конструированию экранных форм",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбщие рекомендации по конструированию экранных форм\nНастроенная карточка (визуал) типа объекта позволяет пользователю эффективно осуществлять работу с данными (просматривать и редактировать). Карточка создается для типа объекта. Все экземпляры этого типа объекта будут открываться в единой карточке.\nПо умолчанию визуал карточки для новых типов формируется на основании визуала объекта-родителя, подробнее в статье\n\"Визуал наследуемого типа объекта\"\n.\nНазначение\nОбщие правила настройки визуала необходимы для эффективного расположения элементов интерфейса для дальнейшей комфортной работы пользователя с информацией.\nЦветовое решение может изменяться в зависимости от выбора\nтемы оформления\n.\nВсе представленные примеры настроены в системной\nтеме оформления интерфейса\n\"Material\".\nОсновные принципы конструирования интерфейса\nИспользование текстовых элементов\nСуществует несколько видов текстовых элементов:\nАкцентирующие\n. Такие элементы чаще всего используются для обозначения заголовков, например, для наименования группы атрибутов;\nВспомогательные\n. Предназначены для представления основного текста интерфейса (название атрибутов);\nПоля ввода\n. Соответствующие элементы необходимы для ввода информации пользователем, вывода данных в результате запуска алгоритма.\nДля лучшего восприятия информации рекомендуется использовать шрифты без засечек, например, \"Clear Sans\".\nТакже следует учитывать, что размер заголовков должен быть крупнее основного текста не менее чем на 60%.\nГруппировка\nРазбиение информации в логически связанные категории повышает презентабельность карточки и улучшает восприятие информации. Кроме того, уже готовые группы элементов можно дополнительно группировать или располагать одну в другой в соответствии с иерархией.\nПри необходимости элементы группировки могут быть объедены с указанием обобщающего заголовка.\nВ данном примере представлена группа вкладок, при этом каждая вкладка содержит группы однородных атрибутов, отражающих информацию о заказе клиента.\nЗонирование\nБольшое пространство экрана необходимо правильно разделить. При делении следует руководствоваться функцией контента и потребностями пользователя. Функциональные зоны могут быть справочными, навигационными и зонами взаимодействия с контентом.\nВ представленном примере данные разделены на два тематических блока.\nРациональность подачи\nПри разработке нового интерфейса необходимо придерживаться стандартов настройки, чтобы создать понятную и удобную среду для работы. Важно учитывать следующие моменты:\nсоздание подложки фона\n;\nгруппировка элементов и зонирование карточки\n;\nрациональное распределение\n;\nрасположение атрибутов карточки в 2-4 колонки\n;\nразбиение списка\n;\nвыравнивание элементов\n;\nдублирование в наименованиях атрибутов\n;\nскрытие редко используемых атрибутов\n;\nуказание значений по умолчанию\n;\nобласть предоставления атрибутов\n;\nисключение незначительных для пользователя полей\n;\nструктурированное выравнивание\n.\nСоздание подложки фона\nДля наилучшего представления информации в карточке объекта необходимо соблюдать контраст между цветом элементов и фоном. Для этого рекомендуется использовать подложку белого фона, размещая элементы в\nгруппе атрибутов\n.\nГруппировка элементов и зонирование карточки\nДля удобства восприятия информации рекомендуется использовать зонирование карточки, разделяя ее на блоки с определенными группами атрибутов.\nВ первую очередь атрибуты следует группировать по функциональности, назначению или принадлежности к определенному процессу, затем распределять,\nруководствуясь эстетическим представлением.\nДля горизонтального разделения применяется группировка\n\"Группа атрибутов\"\n.\nДля вертикального разделения можно применять группировку\n\"Колонка\"\n.\nУниверсальным разделителем является использование группировки\n\"Сетка\"\n.\nИнформация, отображаемая в больших формах, делится вертикально и горизонтально, в модальных окнах – горизонтально.\nРациональное распределение\nДля оптимального использования возможностей настройки визуала пользователю необходимо продумать размещение элементов в карточке объекта, при этом следует учитывать несколько важных моментов:\nСтоит избегать размещения малозначительных элементов на больших участках свободного места и не располагать масштабные элементы контента на значительно меньших участках.\nОсмысленно размещать атрибуты, учитывая длину предполагаемых значений. Например, поля для даты или цены не должны быть слишком длинными, а поля для наименования алгоритма чересчур короткими.\nНеобходимо подобрать оптимальную протяженность по ширине для элементов интерфейса, чтобы она была одинаковой для соседних атрибутов.\nРекомендуется избегать пустых участков. При зонировании карточки экземпляра следует распределять элементы интерфейса так, чтобы в карточке не оставалось незаполненных участков.\nПустое пространство в интерфейсе может использоваться как визуальный разделитель или элемент, дополняющий имиджевую подачу материала.\nОднако, для оперативных интерфейсов рекомендуется избегать пустот, чтобы ускорить рутинные операции с большим количеством повторяющихся действий.\nРасположение атрибутов карточки в 2-4 колонки\nПо умолчанию атрибуты типа размещаются построчно во всю ширину экрана, однако для лучшего восприятия информации рекомендуется распределять информацию на несколько колонок.\nПри настройке интерфейса необходимо учитывать совмещение приемлемого количества колонок в каждом ряду. В одном ряду рекомендуется использовать от 2 до 4 колонок.\nНе стоит допускать случаи разделения ряда на четное и нечетное число колонок в одной карточке, чтобы не создать визуальную лестницу.\nРазбиение списка\nЧтобы избежать монотонности в интерфейсе, рекомендуется разделять список из более чем трех строк однотипных атрибутов. Для такого разделения применяется группировка \"Группа атрибутов\".\nВыравнивание элементов\nВыравнивание элементов предполагает создание определенной концепции, где все элементы являются составляющей единой системы. Соответственно, необходимо создать визуал экземпляра таким образом, чтобы одни элементы интерфейса были настроены в соответствии с соседними.\nСтоит отметить, что выравнивание элементов может быть следующих видов:\nвнешнее\nоформление осуществляется в соответствии с настройкой визуализации соседних элементов;\nвнутреннее\nоформление атрибута необходимо для правильного представления значений.\nПо умолчанию текстовые значения отображаются по левому краю текстового поля, числовые – по правому краю.\nДублирование в наименованиях атрибутов\nЕсли в названии множества атрибутов содержится одинаковая фраза, тогда ее рекомендуется вынести в заголовок группы атрибутов.\nСкрытие редко используемых атрибутов\nЕсли в списке атрибутов имеются такие, которые будут использоваться редко и небольшим количеством пользователей, то их следует поместить в отдельный блок, свернутый по умолчанию.\nСгруппированные атрибуты помещаются в группировку \"Группа атрибутов\", для которой\n\"Настройка развернутости\"\nзадается как \"Свернута\".\nУказание значений по умолчанию\nДля повышения оптимизации работы обязательным является заполнение значений атрибутов, в которых возможно указать значение по умолчанию.\nЗначения могут проставляться автоматически посредством создания и настройки алгоритмических\nвыражений\nв карточке типа объекта.\nОбласть предоставления атрибутов\nВ интерфейсе существуют области, достаточные для показа, ввода и выбора элементов, а также есть области, где представлено довольно много вариантов, и при работе с ними требуется особое внимание.\nПри проектировании интерфейса следует учитывать, что норма восприятия – не более семи элементов, в таком случае выбор пользователю рекомендуется представить, используя элемент\n\"Чекбокс\"\n.\nПодробнее с настройкой можно ознакомиться в статье\n«Визуалы для атрибутов типа \"Объект\" и \"Дочерний объект\"»\n.\nЕсли же в одном разделе представлено более семи элементов, то стоит отдать предпочтение выпадающему списку с возможностью выбора.\nВ случае выбора одного из двух возможных вариантов может быть применен элемент\n\"Переключатель\"\n.\nИсключение незначительных для пользователя полей\nКарточка экземпляра должна отображать данные, которые потребуются пользователю для дальнейшей работы. Если тип объекта содержит атрибуты с отвлекающей информацией, то такие атрибуты лучше убрать с карточки или\nскрыть в интерфейсе\n.\nСтруктурированное выравнивание\nСтруктурированное выравнивание элементов благодаря четкой и логичной структуре облегчает восприятие информации и создает более гармоничный и сбалансированный вид.\nДля этого при размещении элементов интерфейса в карточке экземпляра необходимо выравнивать элементы по верхней и левой границам для каждой из колонок, а также использовать одинаковые интервалы между элементами.\nЗначимость данных\nРаспределение информации в карточке осуществляется в зависимости от приоритета данных — от самого важного к менее значимому.\nБолее значимый элемент должен быть:\nярче;\nЯркость контенту можно придать при помощи:\nвеличины и стиля заголовка;\nцветных акцентов (как в группах атрибутов);\nналичия кнопок, если они уместны.\nВажно учитывать, что даже небольшие отличия в цветах могут оказать влияние на восприятие информации пользователями. Поэтому не стоит перегружать интерфейс большим количеством цветов.\nОптимальным вариантом является использование не более 4 оттенков основного цвета с учетом их контрастности и сочетаемости для создания более гармоничного и привлекательного интерфейса.\nЦветовое решение.\nОбщепринято цветовая палитра интерфейса включает в себя два типа цветов:\nОсновные\n. Такие цвета всегда используются при настройке визуала карточки типа объекта.\nДополнительные\n. Цвета, которые применяются для привлечения внимания пользователя к каким-либо элементам: подсказки, ссылки на типы объектов, ограничения Системы.\nОни должны быть использованы с осторожностью, чтобы не создавать избыточной яркости и не отвлекать внимание от основных элементов интерфейса.\nНапример, при настройке визуала может быть использована следующая палитра цветов:\nбольше;\nРазмеры каждого элемента интерфейса должны быть обоснованы.\nМалозначимые элементы можно скрыть с интерфейса или поместить в свернутый блок информации, более важные – размещать в больших областях.\nближе к левому верхнему углу экрана.\nВ первую очередь пользователь обращает внимание на левый верхний угол экрана. Поэтому важно заранее продумать, какая информация будет размещаться в этой области, а какая ниже и правее.\nПри возможности прокрутки страницы необходимо обращать внимание, какой контент попадает в указанные области.",
  "source": "https://docs.greendata.ru/platform/ru/general-recommendations-for-the-screen-form-design.html"
}