{
  "title": "Размещение продукта на Маркетплейсе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРазмещение продукта на Маркетплейсе\nДобавление продукта\nПраво на размещение продукта на маркетплейсе доступно только авторизованному пользователю с верифицированной учетной записью.\nДля размещения продукта пользователю необходимо нажать на кнопку \"Добавить продукт\".\nВ результате чего откроется страница с формой по наполнению продукта.\nОбязательные поля помечены звездочкой.\nДанные о создателе\nИнформация, указанная в данном разделе, будет отображаться в опубликованном продукте на вкладке \"О компании-создателе\", а предоставленные контактные данные будут использоваться для связи с создателем при наличии вопросов в процессе модерации продукта.\nСоздатель:\nЧастное лицо (значение по умолчанию) – размещение продукта от физического лица или самозанятого;\nПредставитель юридического лица – размещение продукта от представителя организации;\nДля размещения продукта от представителя юридического лица в\nпрофиле\nдолжны быть заполнены данные об организации.\nОрганизация – поле с указанием наименования организации, которое отображается при размещении продукта от представителя юридического лица;\nВ качестве наименования организации используется статичное значение, полученное из\nпрофиля пользователя\n.\nФИО или наименование компании;\nE-mail;\nПри размещении\nплатного продукта\n, в случае его продаж, указанная электронная почта будет использована для отправки\nотчета о продажах\n.\nТелефон.\nЗначения полей \"ФИО или наименование компании\", \"E-mail\" и \"Телефон\" предзаполнены данными, полученными из\nпрофиля пользователя\n, которые могут быть изменены.\nЗагрузка продукта и фотографий\nпродукт – файл с расширением guf или zip, содержащий продукт;\nобложка продукта.\nДанные продукта\nназвание продукта (максимальный размер 60 символов);\nкраткое описание – превью продукта, отображаемое в мини-представлении на стартовой странице маркетплейса (максимальный размер 60 символов);\nописание – особенности, возможности и ограничения предоставляемого продукта (ознакомьтесь с подробностями в статье\n\"Рекомендации к описанию продукта\"\n);\nобласть доступности продукта  –  On-Premise и/или On-Cloud.\nOn-Premise – приложения, развернутые на собственных серверах покупателя продукта.\nOn-Cloud – приложения, развернутые в облаке. Все приложения, доступные в\nличном кабинете\nпокупателя продукта.\nфотографии продукта – скриншоты и иллюстрации, демонстрирующие сценарий использования продукта или конечный результат.\nЦеновая политика\nвид продукта – бесплатный/платный продукт;\nРазмещение платного продукта доступно только обладателям активной\nлицензии STANDARD\n.\nДля размещения платного продукта в\nпрофиле пользователя\nдолжна быть выбрана страна \"Россия\", указаны ИНН и платежные реквизиты, а также\nподписан агентский договор\n.\nспособ оплаты – поле с указанием способа приобретения продукта, которое отображается при размещении платного продукта;\nДля оплаты допускается только единоразовая покупка, которая позволяет приобрести продукт в бессрочное пользование.\nцена – стоимость продукта в рублях.\nЮридические документы\nПрикрепление обязательных документов при размещении продукта:\nпользовательского лицензионного соглашения (определяет права использования вашего приложения пользователем; должно содержать название решения и лицензиара);\nполитики конфиденциальности персональных данных (в случае, если ваш продукт предполагает ввод/хранение или иное использование персональных данных пользователей, иначе необходимо добавить отметку в соответствующее поле checkbox).\nДокументы должны быть составлены в соответствии с действующим законодательством региона публикации решения.\nДля вашего удобства рядом с полями размещены ссылки на скачивание шаблонов документов.\nПри загрузке документов осуществляется проверка на заполнение данных шаблона.\nВ нижней части страницы расположены кнопки для предпросмотра карточки будущего продукта и сохранения \"черновика\" продукта:\nДля сохранения черновика обязательным является заполнение поля \"Название продукта\".\nСохраненные черновики размещаются на одноименной вкладке.\nДля редактирования черновика продукта достаточно нажать на строку с нужным продуктом, для удаления – на соответствующую иконку справа от продукта.\nПосле подготовки необходимых документов и полного описания продукта его необходимо\nотправить на модерацию\nнажатием на одноименную кнопку, расположенную в нижней части страницы либо в окне предпросмотра карточки продукта.\nОтправка продукта на модерацию доступна пользователю с верифицированной учетной записью (с подтвержденным E-mail, указанным при\nрегистрации\n).\nПри отправке платного продукта на модерацию (нового или при обновлении версии), система проверяет наличие активной\nлицензии STANDARD\n. При ее отсутствии отобразится модальное окно с возможностью обновления тарифного плана по нажатию на соответствующую кнопку.\nПри отправке на модерацию\nпервого платного продукта\nнеобходимо подтвердить согласие с условиями агентского договора в соответствующем модальном окне:\nАгентский договор считается заключенным после\nпрохождения модерации и публикации\nпродукта и хранится в соответствующем разделе\nпрофиля пользователя\n.\nОтозвать подписанный агентский договор можно только при обращении в\nслужбу поддержки\n.\nМодерация и публикация\nНа период модерации продукт размещается в разделе \"Мои продукты\" на специальной вкладке \"На модерации\":\nПри наличии замечаний по продукту пользователю на указанный ранее e-mail  будет отправлено соответствующее письмо, а рядом с продуктом на вкладке \"На модерации\" отобразится кнопка для внесения правок.\nПри нажатии на кнопку \"Исправить замечания\" откроется страница для редактирования данных продукта, после чего продукт необходимо отправить на повторную модерацию.\nЕсли модерации пройдена успешно, продукт автоматически будет опубликован на маркетплейсе, и перемещен на вкладку “Опубликованные”. На указанный ранее e-mail будет отправлено письмо об успешной публикации.\nРедактирование продукта\nВ случае необходимости внесения изменений в продукт следует нажать на кнопку\nрядом с продуктом на вкладке \"Опубликованные\", в результате чего откроется\nстраница с информацией о продукте\n.\nРедактированию подлежат следующие поля:\nпродукт;\nПри изменении поля \"Продукт\" будет создана\nновая версия продукта\n.\nВ этом случае станет доступно поле \"Изменения и улучшения\" для указания изменений относительно предыдущей опубликованной версии продукта.\nЕсли поле \"Продукт\" не меняется, изменение прочих данных применится к текущей опубликованной версии продукта.\nкраткое описание;\nописание;\nфотографии продукта;\nФИО или наименование компании;\ne-mail;\nтелефон.\nПосле внесения изменений продукт подлежит обязательной\nмодерации\n.\nВ случае создания новых версий продукта все предыдущие опубликованные версии станут доступны для просмотра на вкладке \"Архивные\".\nПри наличии нескольких версий продукта пользователю доступна информация об изменениях в основной карточке продукта на вкладке \"Обновления\":\nПродажа продукта\nВ случае размещения платного продукта на маркетплейсе выплаты осуществляются единовременно за все его продажи, совершенные в течение отчетного месяца, и только\nпосле утверждения отчета\n.\nОтчет по продажам платных продуктов формируется в разделе \"Отчетность\"\nпрофиля пользователя\nв первый рабочий день месяца, следующего за отчетным.\nПосле ознакомления с отчетом пользователь может согласовать или отклонить отчет выбором варианта\n\"Согласен\"\nили\n\"Не согласен\"\n.\nВ случае несогласия с полученными данными необходимо указать замечания или оставить комментарий.\nЕсли пользователь не дал обратную связь в течение трех дней, то согласно агентскому договору отчет считается согласованным.\nПри формировании отчета на электронную почту пользователя, указанную при размещении продукта, поступит уведомление о необходимости согласования отчета.",
  "source": "https://docs.greendata.ru/platform/ru/publishing-marketplace-product.html"
}