{
  "title": "Visuals for \"Boolean\" type attribute",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nVisuals for \"Boolean\" type attribute\nA \"Boolean\" type attribute can take the following values: yes/no (true/false).\nThe System has the following attribute visuals, which can be selected when configuring an attribute on the \"Visual\" tab:\n\"Boolean attribute as a checkbox\" visual\n;\n\"Toggle\" visual\n;\n\"Boolean attribute in the form of a dropdown list\" visual\n.\nBoolean attribute as a checkbox\nThis visual is used by default for \"Boolean\" type attributes.\nWith the \"Boolean attribute as a checkbox\" visual, the display of the Boolean attribute can be shown as a \"checkbox\" element.\nBy default, the attribute provides two states: yes/no (true/false).\nWhen \"The attribute has 3 states\" toggle is active, the following attribute states are provided:\ntrue – correct/yes;\nfalse – incorrect/no;\nnull – empty value.\nAfter configuring the visual, the attribute will appear as follows:\nToggle\nThe \"Toggle\" visual allows displaying attributes as a graphic toggle switch. To configure the visual, simply select it from the list and specify the number of its possible states.\nBy default, the attribute provides two states: yes/no (true/false).\nWhen \"The attribute has 3 states\" toggle is active, the following attribute states are provided:\ntrue – correct/yes;\nfalse – incorrect/no;\nnull – empty value.\nIn the object profile, the Boolean attribute will appear as follows:\nBoolean attribute in the form of a dropdown list\nThe \"Boolean attribute in the form of a dropdown list\" visual allows displaying attributes as a dropdown list with the option to select one value.\nNo additional configuration is required for this visual.\nIn the object profile, the Boolean attribute with this visual is displayed as follows:",
  "source": "https://docs.greendata.ru/platform/en/boolean_attribute_visuals.html"
}