{
  "title": "Подписать файл (CryptoPro)",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПодписать файл (CryptoPro)\nПроцесс работы с файлами может требовать их подписания электронной подписью КриптоПро.\nДля подписания\nфайлов\nиспользуется\nпользовательское действие\nс выбором модуля пользовательского интерфейса \"Подписать файл (CryptoPro)\".\nМодуль \"Подписать файл (CryptoPro)\" может использоваться при создании\nпакетного действия\n.\nДля настройки действия необходимо:\nСоздать\nпользовательское действие\n, при настройке которого указать следующие значения параметров:\nПри настройке действия \"Подписать файл (CryptoPro)\" ключевыми являются значения следующих параметров (остальные указываются опционально):\nПараметр\nЗначение\nМодуль пользовательского интерфейса\nПодписать файл (CryptoPro)\nИдентификатор JS модуля\nactions/files/sign-with-cripto-pro\nОпционально могут быть настроены следующие дополнительные параметры действия:\nПараметр\nНазначение\nНаименование\nВвод наименования настройки\nАлгоритм определения файлов\nВыбор алгоритма, определяющего файлы, доступные для подписания.\nВид подписи\nОпределение вида подписи. Используется в случае загрузки файлов-подписей для их определения. Определяется системным типом\n\"Вид подписи файла\" [FS_FILE_SIGN_KIND]\n.\nПодробнее с настройкой вида подписи можно ознакомиться в статье\n\"Проверка подписи файла\"\n.\nСистема выполняет проверку атрибута типа \"Вид подписи файла\"\nв текущем действии\n. То есть в случае работы с другими кнопками для подписания файла, необходимо учитывать их настройки.\nТолько для подписания PDF-файлов\nОткрепленная подпись\nЛогический атрибут, определяющий создание отсоединенной подписи.\nНастройка применяется при подписании PDF-файлов, в случае работы с файлами другого формата, всегда фиксируется открепленная подпись.\nФон подписи\nОпределение подложки визуальной подписи. Необходимо загрузить требуемое изображение.\nАлгоритм определения подписанта\nВыбор алгоритма, определяющего наименование подписанта.\nАлгоритм получения текста подписи\nВыбор алгоритма, определяющего текст визуальной подписи. Если алгоритмом не учитываются иные данные, по умолчанию текст содержит информацию о:\nподписанте;\nдате подписания;\nпричине подписания;\nместе подписания.\nАлгоритм определения места подписания\nВыбор алгоритма, определяющего наименование места подписания.\nАлгоритм определения причины подписания\nВыбор алгоритма, определяющего текст причины подписания по умолчанию. Если в поле\n\"Показать модальное окно перед подписанием\"\nвыбрано значение \"Да\", то этот текст может быть отредактирован пользователем.\nСохранить внесенные значения.\nКнопка \"\nПодписать файл (CryptoPro)\n\" отобразиться в карточке или реестре типа объекта в зависимости от выбранных настроек действия. Кнопка отображается\nтолько после выбора файла\n, который необходимо подписать.\nТакже действие можно отобразить с помощью\nвиджета \"Кнопка\"\n.\nВ случае работы с атрибутом типа \"Файл\" Система отобразит кнопку \"Подписать\":\nОтображение кнопок работы с файлом зависит от\nвизуала атрибута\n.\nВ зависимости от\nвизуала атрибута\nна подписанный документ может быть добавлена метка о том, что документ подписан –\nПросмотр информации о подписях доступен по кнопке\n:\nТекст и цвет фона результата проверки подписи регулируется объектом типа \"Справочник результатов проверки ЭЦП\", который вернул алгоритм проверки подписи.\nПолученные значения могут быть изменены в объекте типа \"Результат верификации электронной подписи\" [FS_SIGN_VERIFY_RESULT] (подробнее в статье\n\"Проверка подписи файла\"\n).",
  "source": "https://docs.greendata.ru/platform/ru/sign-the-file-using-cryptopro.html"
}