{
  "title": "\"Sprint\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Sprint\" widget\nThe \"Sprint\" widget\nvisually represents instances of the specified object type with a given ranking. The separation of type instances when displayed is implemented by filtering them.\nExample of a customized widget:\nThe given example shows the progress of the \"Purchase application\" object in the business process.\nBefore you start configuring the widget, you need to create a new\nentity\nand proceed to creating instances for this object type.\nThe \"Sprint\" widget can be configured in the editing mode of the\nvisual of an instance\nof an object type. To do this, you need to find the desired widget in the corresponding list in the \"Elements\" window and drag and drop it to the workspace.\nVisual settings\nTo add a\ncolumn\n(object sequence step), click \"Add column\" or\n.\nTo add a\ngroup\n(object sequence sub-step), click \"Add group\" or\n.\nThe name is entered manually inside the widget, in the required element:\nColumn setup\nUsing the\nbutton, user can change the name of the column and determine the color scheme using the style algorithm. The style algorithm is set by the \"Algorithm. Condition for visual\" type.\nThe sprint color scheme is formed automatically. The user can change it if necessary.\nGroup setup\nThe\nof the screen.\nCreating an object model and business process\nFirst you need to create an object type (in the example \"Purchase application\"), which should contain attributes:\nApplication name [APPLICATION_NAME];\nApplication description [APPLICATION_DESCRIPTION];\nApplication status [APPLICATION_STATUS].\nThe last attribute is an object attribute and performs the function of a directory that takes into account the following application statuses:\nProcessing;\nCoordination;\nApproved.\nNow you should create the following\nbusiness process\n.\nThen it is necessary to create instances in the registry of purchase orders. It is assumed that the executor, while completing the task of the business process, will update the status of the application according to the route.\nBasic settings\nTo configure the widget, click the\nbutton. The System will display the widget parameters.\nA previously created entity, including its attributes, and attributes for the start date and end date of the parent object were specified in the widget parameters.\nWidget parameters\nConfiguring the widget involves filling in the following parameters:\nSetting\nPurpose\nObject type\nDetermining the object type whose instances will be displayed in the widget\nAttribute for title\nDetermining the instance title of the previously specified object type. The attribute identifier is required\nAttribute for description\nDetermining the description of an instance of the previously specified object type. The attribute identifier is required\nAttributes for start date and end date\nSelecting attributes to determine the start and end dates for displaying instances of the previously specified object type. The attribute identifier is required\nHeight (in % of the screen)\nDetermining the area to display the widget in % of the\nworkspace\n. The numeric value must be specified\nDisplay the filter\nDetermining filter display for instances of the previously specified object type in the widget\nFilter setup\nFilter of instances of the object type is set using the\nbutton and configured for each column.\nLearn more about\nconfiguring the filter conditions\n.\nAn example of a customized object filter in a widget can be represented as follows:\nAfter saving the settings, the sprint columns will display instances of the specified object type for which a business process was started. There are tasks in the registry of the \"WF.Task in the process\" type. In this case, instances will be displayed in columns according to the filter setting.\nResult\nThe \"Sprint\" widget setting defines only the object type, which instances will be displayed. Columns represent stages of the process and are set manually, so they do not depend on any attributes.",
  "source": "https://docs.greendata.ru/platform/en/sprint-widget.html"
}