{
  "title": "Визуалы атрибута типа \"Файл\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВизуалы атрибута типа \"Файл\"\nАтрибуты типа \"Файл\"\nиспользуются при работе с различными файлами, которые хранятся в Системе в\nтипе объекта \"Файл\"\n[FS_FILE] или дочерних типах.\nВозможность работы с файлами регулируется наличием соответствующих\nправ доступа\n.\nДля файлового атрибута можно гибко настроить отображение и набор доступных действий (загрузка, просмотр, скачивание, удаление, подписание и др.) при помощи:\nвизуала\nатрибута:\nВизуал \"Виджет для файлов\"\n;\nВизуал \"Изображение\"\n;\nВизуал \"Множественные файлы в виде таблицы\"\n;\nВизуал \"Файл в единственном числе\"\n;\nВизуал прикрепления файлов для подписания\n;\nВизуал прикрепления файлов для подписания (с группировкой)\n;\nВизуал для просмотра файлов (без подписи)\n;\nВизуал для просмотра файлов (без действий)\n.\nвиджетов\nна визуале объекта:\nВиджет \"Прикрепление файлов\"\n;\nВиджет \"Проводник\"\n;\nВиджет \"Список файлов\"\n;\nВиджет \"Список файлов по статусам\"\n;\nВиджет \"Иерархия файлов\"\n;\nВиджет \"Согласование файлов\"\n;\nВиджет \"Список файлов с ЭП\"\n.\nВ рамках текущей статьи приведены сведения о визуалах файловых атрибутов, выбор которых осуществляется при настройке атрибута на вкладке \"Визуал\". Все перечисленные ниже визуалы могут быть использованы для объектных атрибутов типа \"Файл\".\nВиджет для файлов\nДанный визуал может быть использован как для\nобъектных\n, так и для\nдочерних\nатрибутов типа \"Файл\".\nВизуал \"\nВиджет\nдля файлов\" является универсальным и может использоваться для работы с любыми файлами. Визуал поддерживает возможность первичной загрузки файлов в файловый атрибут.\nПосле выбора визуала \"Виджет для файлов\" отобразится следующий набор параметров:\nПараметр\nНазначение\nИспользовать алгоритм фильтрации\nВыбор способа прикрепления файла в момент его добавления.\nИспользовать классификацию\nАлгоритм фильтрации\nВыбор/добавление алгоритма фильтрации.\nДоступен при выбранной настройке \"Использовать алгоритм фильтрации\".\nКлассификация\nВыбор имеющегося алгоритма классификации или ввод нового алгоритма классификации.\nДоступен при выбранной настройке \"Использовать классификацию\".\nМожно подписывать файлы\nВозможные варианты:\nДа;\nНет.\nОтображать \"Подписать все\"\nВозможные варианты:\nДа;\nНет.\nДоступен при настройке \"Можно подписывать файлы\"=Да.\nРазрешить удаление файлов\nДанная опция разрешает очистку файлов из элементов пользовательского интерфейса, но не выполняет физическое удаление файлов из хранилища. После удаления файлы продолжают присутствовать в хранилище.\nПри необходимости использования опции следует установить отметку в поле checkbox.\nПоказывать окно для ввода описания к файлу\nПри необходимости использования опции следует установить отметку в поле checkbox.\nОтображать столбец с описанием файла\nДанная опция отображает столбец с описанием файла и доступна.\nДоступен, если установлена отметка в поле checkbox для параметра \"Показывать окно для ввода описания к файлу\".\nСпособ открытия файлов (docx) по умолчанию\nВыбор способа открытия файлов. Доступные варианты:\nпредпросмотр;\nоткрыть в EDoc.\nОграничить список расширений\nОпция, позволяющая ограничить список расширений прикрепляемых файлов.\nРазрешенные расширения\nВыбор расширений файлов, прикрепление которых будет доступно.\nВыбор осуществляется из выпадающего списка объектов типа \"Тип файла\" [FS_FILE_TYPE].\nКогда список расширений ограничен, однако разрешенные расширения отсутствуют, при попытке прикрепления файла будет выведено уведомление вида:\n\"Нет доступных расширений для добавления файлов. Проверьте настройки\".\nПараметр доступен при активной опции \"Ограничить список расширений\".\nПосле настройки визуала атрибут примет следующий вид:\nПо нажатию на кнопку \"Прикрепить файл\" откроется модальное окно для загрузки файла с персонального компьютера.\nПосле выбора файла отобразится модальное окно, в котором необходимо указать дату документа, классификацию для размещения файла и описание к файлу.\nПри выполненных настройках атрибут будет представлен следующим образом:\nДобавление нескольких файлов осуществляется по кнопке\nпри активной опции \"Множественный выбор\" в настройках атрибута.\nИнформацию о подписи можно увидеть в модальном окне, нажав на кнопку\nв поле файла.\nДля скачивания файла необходимо нажать на кнопку\nв поле файла. При наличии подписей при нажатии на кнопку появится выпадающий список с доступными опциями:\nСкачать файл;\nСкачать файл с подписью – при выборе данного варианта будет сформирован архив, содержащий файл и его подпись в формате *.sig.\nДля удаления загруженного файла следует навести курсор мыши на файл и нажать на кнопку\n.\nИзображение\nВизуал \"Изображение\" используется для отображения графического содержимого загруженного файла. Например, для отображения фотографии в карточке пользователя.\nВизуал настраивается при помощи следующих параметров:\nПараметр\nНазначение\nВысота, %\nОпределение высоты загруженного изображения в карточке объекта. Значение указывается в % от высоты экрана.\nДоступен при неактивном параметре \"Растянуть по ширине\".\nРастянуть по ширине\nАвтоматическое выравнивание изображения по ширине в пределах занимаемой области.\nПо умолчанию параметр неактивен.\nСкругление углов\nВ поле задается размер скругления углов изображения посредством выпадающего списка со значениями:\nБез скругления;\nXs – 2px;\nS – 4px;\nM – 8px;\nL – 10px;\nXl – 14px.\nПо умолчанию используется значение \"Без скругления\".\nКлассификация файла\nВыбор\nклассификации файла\nдля изображения, загружаемого с диска.\nПо умолчанию используется значение \"Все файлы\".\nЗагрузка файла\nОпределение способа загрузки файла: с диска и/или из системы.\nПараметр является обязательным для заполнения.\nАтрибут в карточке объекта отображается в виде области для загрузки:\nДобавление изображения осуществляется при помощи перетаскивания (Drag&Drop) файла в данную область или по нажатию на неё с последующим выбором способа загрузки –\nс диска или из системы\n.\nДопустимый формат загружаемого файла: *.png, *.jpg, *.jpeg, *.gif и *.bmp.\nПосле выбора файла откроется модальное окно \"Подготовка изображения\", в котором можно настроить соотношение сторон, обрезать, повернуть и отразить изображение по вертикали/горизонтали.\nПо умолчанию изображение кадрируется в формате 1:1 (фрагмент изображения, расположенный в затемненной области, будет срезан перед вставкой в карточку объекта).\nИзменение размера кадра осуществляется посредством нажатия на границу кадра и перемещения границы с зажатой левой кнопкой мыши. Перемещение кадра осуществляется с зажатой левой кнопкой мыши, зафиксированной в отображаемой области изображения.\nВ нижней части модального окна расположены кнопки управления.\nКнопка\nНазначение\nОтразить по вертикали.\nОтразить по горизонтали.\nПоворот изображения влево на 90°.\nПоворот изображения вправо на 90°.\nПрименение изменений осуществляется по кнопке \"Ок\", после чего изображение отобразится в карточке объекта в соответствии с размером, указанным при настройке атрибута в параметре \"Высота, %\"/\"Растянуть по ширине\".\nПри нажатии на кнопку отмены изображение отобразится в карточке объекта в исходном состоянии.\nВ ховере добавленного изображения при помощи иконок можно:\nзаменить изображение в карточке объекта – загрузка изображения\nс диска/из системы\n;\nвернуться к окну подготовки изображения;\nудалить файл – удаление изображения из карточки объекта, но не из системы;\nскачать изображение (с внесенными изменениями).\nПри повторном открытии окна подготовки изображения нельзя вернуться к прежнему размеру изображения, если ранее оно было обрезано.\nВыравнивание изображения в занимаемой области может настраиваться при помощи опций\nряда/колонки\n.\nМножественные файлы в виде таблицы\nВизуал \"Множественные файлы в виде таблицы\" предполагает\nотображение прикрепленных объектов/ файлов в табличном виде\n.\nПри настройке визуала используется параметр:\nПараметр\nНазначение\nКлассификация по умолчанию\nПозволяет зафиксировать\nклассификацию\nприкрепляемых файлов.\nОграничить список расширений\nОпция, позволяющая ограничить список расширений прикрепляемых файлов.\nРазрешенные расширения\nВыбор расширений файлов, прикрепление которых будет доступно.\nВыбор осуществляется из выпадающего списка объектов типа \"Тип файла\" [FS_FILE_TYPE].\nКогда список расширений ограничен, однако разрешенные расширения отсутствуют, при попытке прикрепления файла будет выведено уведомление вида:\n\"Нет доступных расширений для добавления файлов. Проверьте настройки\".\nПараметр доступен при активной опции \"Ограничить список расширений\".\nАтрибут с данным визуалом отображает прикрепляемые документы следующим образом:\nЗагрузка файла с персонального компьютера осуществляется при помощи нажатия на кнопку \"Прикрепить файлы с ПК\".\nВыбор\nранее загруженного в Систему файла\nдоступен по нажатию на кнопку\n.\nЗакрепление необходимого для отображения реестра осуществляется через\nопцию атрибута\n.\nДля корректной работы следует использовать \"Плоский реестр\" или\n\"Реестр с иерархией\"\n.\nВ процессе прикрепления файлов с зафиксированной классификацией у пользователя имеется возможность ее переопределения (подробнее в статье\n\"Настройка классификаций прикрепленных файлов\"\n).\nВидимость некоторых кнопок на панели управления реестра регулируется через опции атрибута:\nОпция\nНазначение\nОтображение кнопки для добавления объекта.\nОтображение кнопки редактирования объекта.\nОтображение кнопки удаления файла.\nОтображение\nкнопки настройки реестра\n.\nОтображение кнопки экспорта.\nФайл в единственном числе\nВизуал \"Файл в единственном числе\" предназначен для демонстрации одного файла с возможностью его замены.\nВ случае присутствия в файловом атрибуте нескольких файлов будет выбран первый из файлов.\nПараметр\nНазначение\nКлассификация по умолчанию\nВыбор классификации файла, используемой по умолчанию.\nВ карточке объекта атрибут примет следующий вид:\nВизуал подходит для организации работы и обработки данных единственного ключевого файла.\nВизуал прикрепления файлов для подписания\nВизуал прикрепления файлов для подписания используется для отображения документов в табличном виде с возможностью их подписания при помощи ЭП и ПЭП. Файлы могут быть загружены\nиз Системы или с персонального компьютера пользователя\n.\nНастройка визуала содержит следующие параметры:\nПараметр\nНазначение\nКлассификация файлов по умолчанию\nВыбор способа установки классификации по умолчанию для загружаемых файлов:\nклассификация;\nалгоритм.\nКлассификация\nВыбор классификации файла, которая будет установлена по умолчанию для загружаемых файлов.\nЕсли значение параметра не задано, тогда при загрузке файла пользователем будет отображено модальное окно для выбора классификации файла.\nПараметр отображается при выборе значения \"Классификация\" в параметре \"Классификация файлов по умолчанию\".\nАлгоритм определения классификации\nВыбор/добавление алгоритма для определения классификации по умолчанию для загружаемых файлов.\nАлгоритм должен возвращать один объект с классификацией файла.\nПример\nДля установки загружаемым файлам классификации \"Прочее\" следует использовать следующий алгоритм:\nПри помощи функции\ndict\nвыбирается объект типа \"Классификация файла\".\nЕсли указан некорректный алгоритм или значение параметра не задано, тогда при загрузке файла пользователем будет отображено модальное окно для выбора классификации файла.\nПараметр отображается при выборе значения \"Алгоритм\" в параметре \"Классификация файлов по умолчанию\".\nАлгоритм для определения классификаций, входящих в группу \"Основные документы\"\nВыбор/добавление алгоритма для определения классификаций файла, отображаемых пользователю при загрузке файла.\nАлгоритм должен возвращать коллекцию объектов (идентификаторов классификаций).\nВыбор классификации при загрузке файла осуществляется при отсутствии заданного значения классификации по умолчанию либо если значение, заданное алгоритмически, возвращает некорректный результат.\nПример\nКоличество видимых элементов\nОпределение количества видимых файлов в таблице посредством ввода числового значения. Значение \"-1\" определяет безграничное значение, то есть отсутствие пагинации.\nАлгоритм сортировки (возвращает id классификаций в отсортированном порядке)\nВыбор/добавление алгоритма сортировки классификаций.\nПример\nТип отображаемой даты\nВыбор типа отображаемой даты. Доступные варианты:\nотображать дату;\nотображать дату и время.\nПользовательские действия для отображения\nВыбор пользовательских действий для отображения на визуале.\nВыбор осуществляется посредством выпадающего списка из всех пользовательских действий, связанных с типом объектов \"Файл\" [FS_FILE].\nПо умолчанию, если пользовательские действия для отображения не выбраны, доступны такие действия как:\n\"Загрузить файлы\", \"Скачать выбранные\", \"Редактировать\", \"Заменить\", \"Сделать версию актуальной\", \"Подписать файлы (ПЭП)\", \"Удалить\".\nВ результате настройки визуала прикрепления файлов для подписания атрибут \"Прикрепленные файлы\" отобразится следующим образом:\nПолный набор пользовательских действий над файлами доступен при выборе хотя бы одного файла.\nВизуал прикрепления файлов для подписания (с группировкой)\nВизуал прикрепления файлов для подписания (с группировкой) отображает перечень прикрепляемых файлов, распределяя их по классификациям. Загрузка файла в атрибут осуществляется через добавление в выбранную классификацию с дальнейшей возможностью подписания при помощи ЭП и ПЭП.\nНастройка визуала содержит следующие параметры:\nПараметр\nНазначение\nКлассификация файлов по умолчанию\nВыбор способа установки классификации по умолчанию для загружаемых файлов:\nклассификация;\nалгоритм.\nКлассификация\nВыбор классификации файла, которая будет установлена по умолчанию для загружаемых файлов.\nЕсли значение параметра не задано, тогда при загрузке файла пользователем будет отображено модальное окно для выбора классификации файла.\nПараметр отображается при выборе значения \"Классификация\" в параметре \"Классификация файлов по умолчанию\".\nАлгоритм определения классификации\nВыбор/добавление алгоритма для определения классификации по умолчанию для загружаемых файлов.\nАлгоритм должен возвращать один объект с классификацией файла.\nПример\nДля установки загружаемым файлам классификации \"Прочее\" следует использовать следующий алгоритм:\nПри помощи функции\ndict\nвыбирается объект типа \"Классификация файла\".\nЕсли указан некорректный алгоритм или значение параметра не задано, тогда при загрузке файла пользователем будет отображено модальное окно для выбора классификации файла.\nПараметр отображается при выборе значения \"Алгоритм\" в параметре \"Классификация файлов по умолчанию\".\nАлгоритм для списка классификаций\nВыбор/добавление алгоритма для определения классификаций файла, отображаемых пользователю при загрузке файла.\nАлгоритм должен возвращать коллекцию объектов (идентификаторов классификаций).\nАлгоритм для списка обязательных классификаций\nВыбор/добавление алгоритма для определения списка обязательных классификаций файлов. В случае отсутствия файла указанной(ых) классификации(ий) Система уведомит об обязательности прикрепления необходимых документов.\nТип отображаемой даты\nВыбор типа отображаемой даты. Доступные варианты:\nотображать дату;\nотображать дату и время.\nВ результате настройки данного визуала атрибут в карточке объекта может быть отображен следующим образом:\nЗагрузка файла в заданную классификацию осуществляется по нажатию на кнопку\n, расположенную рядом с наименованием классификации:\nОпции \"Подписать файлы\" (ПЭП, ЭП), \"Скачать\", \"Удалить\" доступны для выбранного файла\nпосле наведения курсора мыши на документ.\nНа панели управления расположены кнопки управления документами.\nКнопка\nНазначение\nВыбор файла для загрузки.\nДоступные варианты:\nприкрепить файл с диска;\nвыбрать файл из системы\n.\nСкачивание выбранного файла.\nРедактирование выбранного файла.\nЗамена файла.\nУстановка статуса актуальной версии, используется при наличии нескольких версий файла.\nУдаление файла из таблицы.\nВизуал для просмотра файлов (без подписи)\nВизуал для просмотра файлов (без подписи) отображает прикрепленные файлы в табличном виде аналогично\nВизуалу для просмотра файлов (без действий)\n, но\nбез возможности их подписания\n.\nПри настройке визуала может быть указан параметр:\nПараметр\nНазначение\nТип отображаемой даты\nВыбор типа отображаемой даты. Доступные варианты:\nотображать дату;\nотображать дату и время.\nОграничить список расширений\nОпция, позволяющая ограничить список расширений прикрепляемых файлов.\nРазрешенные расширения\nВыбор расширений файлов, прикрепление которых будет доступно.\nВыбор осуществляется из выпадающего списка объектов типа \"Тип файла\" [FS_FILE_TYPE].\nКогда список расширений ограничен, однако разрешенные расширения отсутствуют, при попытке прикрепления файла будет выведено уведомление вида:\n\"Нет доступных расширений для добавления файлов. Проверьте настройки\".\nПараметр доступен при активной опции \"Ограничить список расширений\".\nВизуал для просмотра файлов (без действий)\nВизуал для просмотра файлов (без действий) используется для отображения\nранее прикрепленных в Систему файлов\nв табличном виде.\nПараметр\nНазначение\nТип отображаемой даты\nВыбор типа отображаемой даты. Доступные варианты:\nотображать дату;\nотображать дату и время.\nВ карточке объекта атрибут с данным визуалом может принять следующий вид:\nПри наведении курсора мыши на файл пользователь может его скачать по кнопке\n.\nИные действия (такие как \"Загрузка файлов с диска\", \"Подписание файла\", \"Удаление\" и т.д.) при выборе данного визуала недоступны.",
  "source": "https://docs.greendata.ru/platform/ru/file_attribute_visuals.html"
}