{
  "title": "Приемник. Внутренний на основе SQL",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПриемник. Внутренний на основе SQL\nПриемник типа \"Внутренний на основе SQL\" является универсальным инструментом, который совмещает в себе функционал\nисточника типа \"Внешняя БД\"\nи\nприемника типа \"Внутренний\"\nс возможностью пакетной обработки данных.\nПакетная обработка особенно эффективна при работе с большими объемами данных, так как она позволяет минимизировать время обработки, расходовать меньший объем памяти и улучшить общую производительность ETL-процессов.\nПриемник типа \"Внутренний на основе SQL\" не принимает входную динамическую структуру (далее – ДС) с предшествующего этапа и не передает сформированные на приемнике данные на последующий этап схемы ETL-процесса.\nПриемник взаимодействует напрямую с базой данных, выполняя SQL-запросы для извлечения нужной информации, и сохраняет полученные данные в Систему.\nДинамическая структура, поступающая на этап данного приемника, будет передаваться на вход последующего этапа (по аналогии с\nсистемным действием\n).\nДля использования приемника необходимо при настройке\nсхемы ETL-процесса\nс панели действий и компонентов перетащить (Drag&Drop) в рабочую область элемент задачи.\nПосле чего определить добавленный этап как\nПриемник. Внутренний на основе SQL\n:\nПараметры настройки\nДля перехода к параметрам настройки приемника необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего в новой вкладке откроется страница с набором параметров для настройки.\nНастройка приемника осуществляется на двух вкладках:\nSQL запрос\n– используется для получения данных из внешней или текущей БД по SQL-запросу.\nГенерация объектов\n– используется для определения объектов Системы, в которые будут сохраняться полученные данные.\nSQL запрос\nНастройка параметров вкладки предполагает написание SQL-запроса для получения данных из БД и описание полей запроса для формирования ДС.\nБольшинство настроек вкладки аналогичны настройкам\nисточника типа \"Внешняя БД\"\n.\nПараметр\nНазначение\nСоединение с внешней БД\nВыбор\nсоединения с внешней БД\n, с которой настраивается взаимодействие.\nВыбор ранее созданного соединения с внешней БД осуществляется из выпадающего списка, создание нового соединения доступно через меню действий параметра.\nПри пустом значении атрибута база данных определяется как текущая, с которой работает Система.\nSQL запрос для получения данных\nВвод запроса к базе данных для получения данных.\nДля динамической обработки данных могут использоваться параметризованные запросы, значения параметров которых осуществляется при\nзапуске процесса\n.\nРазмер пакета загрузки данных\nОпределяет количество объектов, полученных в результате выполнения SQL-запроса, подлежащих обработке приемником за одну итерацию.\nОптимально подобранный размер пакета данных позволяет эффективно использовать ресурсы системы, снижая нагрузку на память и увеличивая скорость обработки данных.\nОписание структуры курсора (XML)\nОписание полей запроса для генерации\nДС\n.\nСформированная ДС доступна на вкладке \"Генерация объектов\".\nЗаполнять отсутствующие элементы пустыми значениями\nЛогический атрибут, определяющий необходимость заполнения отсутствующих в БД элементов ДС пустыми значениями.\nПараметры запроса\nПараметры позволяют сделать запрос к БД более динамическим и гибким, заполняя значения переменных во время выполнения (рассмотрено\nдалее\n).\nЧаще всего параметры используются в случаях, когда запрос выполняется многократно, но каждый раз с разными значениями.\nПараметры запроса\nДобавление параметров запроса осуществляется во встроенном реестре \"Параметры запроса\" нажатием на кнопку\n. При создании параметра запроса указываются:\nПараметр\nНазначение\nНаименование\nВвод наименования параметра.\nВид параметра\nОпределение вида параметра. Возможные значения:\nпараметр SQL-запроса – использование значения из БД;\nПараметр используется во время выполнения запроса.\nВ качестве данного параметра не может быть использовано, например, имя таблицы БД.\nПараметр SQL указывается в запросе через знак \":\", например:\nwhere date_report >= :date_start\nsql\nCopied!\nподстановочный параметр – замена подстроки в запросе.\nПараметр используется до выполнения запроса.\nИдентификатор\nОпределение идентификатора параметра.\nУказанный идентификатор используется в запросе к БД.\nАлгоритм\nОпределение алгоритма, результат работы которого будет передан в параметр. Алгоритм должен возвращать:\nстроку, число или дату – в случае настройки параметра вида \"Параметр SQL-запроса\";\nПример алгоритма\nДля заполнения параметра значением кода объекта может быть использован следующий алгоритм:\nстроку, содержащую текст запроса (подстроку) – при настройке подстановочного параметра.\nПример алгоритма\nДля заполнения параметра подстрокой запроса может быть использован следующий алгоритм:\nВ зависимости от результата выполнения условия в параметр может быть передана подстрока\nand status = 1\nили пустая строка.\nВ алгоритмах формирования параметров на приемнике допустимо использование функции\netlValue\nдля обращения к входной ДС, но при этом необходимо указывать полный путь до нужной ноды, начиная с корня.\nЭлемент динамической структуры\nАтрибут\nне используется\nпри настройке параметров запроса на приемнике типа \"Внутренний на основе SQL\".\nГенерация объектов\nБольшинство настроек вкладки аналогичны настройкам\nприемника типа \"Внутренний\"\n.\nНа вкладке \"Генерация объектов\" в первую очередь рекомендуется в параметре \"Базовый тип объектов\" выбрать тип объектов, в который будут сохраняться полученные данные. После выбора типа объектов его атрибутивный состав отобразится в таблице для настройки связи.\nДалее необходимо определить, в какие атрибуты типа сохранять получаемые значения. Для этого следует настроить пары связей: выбирается элемент ДС, сформированной на основании описания полей запроса на вкладке\n\"SQL запрос\"\n, и соответствующий ему атрибут типа, после чего нажимается кнопка «Связать с».\nЛогика актуализации данных в Системе для\nдочерних\nи объектных\nmultiselect\nатрибутов регулируется настройками, доступными после нажатия на кнопку\n.\nДля\nmultiselect\nатрибутов доступны следующие варианты:\nзаменять значение – значения в Системе будут заменяться данными, полученными через ДС;\nдополнять значение – подразумевает пополнение данных Системы недостающими значениями, при этом значения, которые отсутствуют в ДС, но имеются в Системе, удалены не будут.\nДля\nдочерних\nатрибутов доступны следующие варианты:\nвыполнить алгоритм по отсутствующим объектам – при выборе данного варианта отобразится поле для выбора/создания алгоритма, который будет выполнен по каждому объекту Системы сохраняемого типа объектов, отсутствующему в ДС;\nудалить, если дочерний объект отсутствует – из Системы будет удаляться объект, если в ДС отсутствуют данные его дочернего объекта;\nдополнять значение – подразумевает пополнение данных Системы недостающими значениями, при этом значения, которые отсутствуют в ДС, но имеются в Системе, удалены не будут.\nСвязь с объектным\nmultiselect-атрибутом\nдолжна настраиваться с полем ДС по конкретному ID, который нужно получить заранее, например, используя\nпреобразователь данных\n.\nДля того чтобы система могла определить, как произвести сохранение данных: обновить значения атрибутов существующего объекта или создать новый экземпляр объекта, – осуществляется настройка связей типа.\nЕсли требуется сохранить значение дочернего атрибута, необходимо добавить соответствующую настройку для типа объектов, с которым связан дочерний атрибут.\nДля этого во встроенном реестре \"Настройка связей типов\" следует нажать кнопку\n.\nВ открывшемся модальном окне в поле \"Базовый тип объектов\" необходимо указать тип объектов, для которого будет настраиваться выбранный в одноименном поле тип связи приемника:\nВсегда новая запись\nДля сохранения полученных данных будет создаваться новый экземпляр объекта.\nПервичный ключ\nДля сохранения полученных данных Система будет осуществлять поиск существующего объекта по\nдефолтному первичному ключу\n. Если искомое значение найдено, тогда будут обновлены данные существующего объекта, иначе для сохранения данных будет создан новый экземпляр объекта.\nАльтернативный ключ\nСохранение данных при данном типе связи приемника аналогично типу связи \"Первичный ключ\", за исключением того, что поиск существующего в Системе объекта осуществляется по\nключу\n, указанному в поле \"Альтернативный ключ\", ранее созданному пользователем в типе объектов.\nСвязующая таблица\nДанный тип связи приемника предполагает использование дополнительного типа объектов, так называемой \"связующей таблицы\", в котором будут фиксироваться связи между ID динамической структуры и ID объекта Системы.\nПри получении данных Система проверяет наличие связи в данном типе объектов. Если связь найдена, тогда обновляется соответствующий объект базового типа, иначе создается экземпляр новой связи в связующей таблице и для сохранения полученных на приемник данных – экземпляр объекта базового типа.\nНесомненным преимуществом данного типа связи приемника является возможность настраивать и отслеживать наличие связей, не добавляя ключи в базовый тип объектов. Например, если настраивается связь с системным типом объектов, где создание такого ключа невозможно.\nНастройка типа связи приемника \"Связующая таблица\" осуществляется при помощи следующих параметров:\nПараметр\nНазначение\nНастройка связи через связующую таблицу\nТип связующей таблицы\nОпределение типа объекта, который будет использоваться для проверки наличия связи между идентификаторами объектов текущей Системы и, полученными из внешней БД.\nАтрибут с внутренним ключом\nВыбор атрибута, содержащего идентификатор объекта Системы.\nАтрибут с внешним ключом\nВыбор атрибута с идентификатором объекта, полученного из внешней БД, соответствующим выбранному ранее идентификатору объекта Системы.\nЭлемент динамической структуры с внешним ключом\nОпределение элемента ДС, через который будет передаваться значение идентификатора объекта, полученного из внешней БД.\nАтрибут с типом связи\nВыбор атрибута связующей таблицы, в котором хранятся виды связей. Настройка опциональна, используется в случае хранения в связующей таблице нескольких видов связей.\nПри настройке интеграции с внешним сервисом или базой данных для получения данных каждой сущности настраивается свой приемник, при этом связующая таблица может быть единой.\nОднако в данном случае потребуется осуществлять контроль, с какой именно сущностью устанавливается связь, так как идентификаторы получаемых данных могут дублироваться.\nНапример, из внешней системы можно получить как данные сотрудников, так и данные контрагентов, при этом нумерация ID несквозная (имеется контрагент с ID 1 и сотрудник с ID 1).\nНеобходимо создать тип объектов для определения вида связи (экземпляры типа – сущности внешней системы), после чего в связующей таблице добавить объектный атрибут, ссылающийся на данный тип объектов.\nЕсли значение параметра задано, в обязательном порядке указывается значение поля \"Тип связи\".\nТип связи\nВыбор типа связи (экземпляра типа, в котором хранятся сущности внешней системы/БД), по которому устанавливается связь для получения данных.\nВыбранное значение проверяется Системой только при заполненном параметре  \"Атрибут с типом связи\".\nПри необходимости устанавливаются параметры обработки этапа, расположенные в верхнем блоке настроек приемника:\nПараметр\nНазначение\nБазовый тип объектов\nОпределение типа объектов, в который осуществляется сохранение данных.\nАлгоритм определения даты актуальности\nПараметр используется для определения даты актуальности\nисторических атрибутов\n.\nАлгоритм возвращает дату, на которую будут устанавливаться значения атрибутов, зависимых от времени.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, создание нового или редактирование выбранного\nалгоритма\nвозможно через меню действий параметра.\nЕсли значение не указано, то по умолчанию используется текущая дата.\nОтправить данные в открытые в браузере карточки\nДанный признак позволяет пользователям в режиме реального времени видеть актуальные данные сразу после их обработки и сохранения на ETL, без необходимости ручного обновления страницы или объектов.\nИспользовать признак рекомендуется  только при явной необходимости отображения обновленных данных на открытых в браузере экземплярах, поскольку при обновлении большого количества объектов признак может замедлить работу ETL.\nПо умолчанию настройка неактивна.\nИгнорировать ошибки при сохранении\nПризнак, определяющий сохранение типа объекта в случае возникновения ошибок при загрузке данных.\nПо умолчанию настройка неактивна.\nСохранять только измененные объекты\nПризнак, позволяющий сохранять только измененные объекты.\nНеобходимость применения признака для улучшения производительности ETL-процесса зависит от используемого сценария.\nНапример, если получаемые данные редко содержат изменения, а на типе обновляемых объектов настроен долгий жизненный цикл, расчет выражений, автокалькуляций и т.п., то пересохранение всех объектов нецелесообразно. Для повышения производительности рекомендуется осуществлять проверку изменения значений и сохранять только измененные объекты.\nВ случаях, когда проверка наличия изменений занимает больше времени, чем пересохранение объектов, использование данного признака может привести к снижению общей производительности ETL-процесса.\nПо умолчанию настройка неактивна.\nОчистить лог при успешном выполнении этапа\nПризнак, используемый для оптимизации хранения в базе данных. При активации параметра в случае успешного выполнения этапа лог текущего этапа очищается.\nПо умолчанию настройка активна.\nИспользовать блокировки при сохранении\nПризнак позволяет завершить выполнение ETL-процесса, прежде чем запускать другой ETL-процесс, в случае использования в данных процессах приемников типа \"Внутренний\" с одним и тем же базовым типом объектов.\nПризнак используется для предотвращения возможных конфликтов и несоответствия данных, которые могут возникнуть, если несколько процессов одновременно пытаются модифицировать одни и те же объекты. Однако стоит учитывать, что использование блокировок может привести к увеличению времени ожидания для процессов, поэтому важно определить целесообразность применения признака в рамках используемого сценария.\nПо умолчанию настройка неактивна.\nПример\nРассмотрим пример выгрузки данных  из внешней БД по контрагентам с основным ОКВЭДом, заданным в процессе запуска ETL-процесса.\nПредварительные настройки:\nДля того чтобы при\nзапуске процесса\nуказать необходимый ОКВЭД, потребуется создать дочерний тип объектов от типа \"ETL. Экземпляр объекта ETL\". В атрибутивный состав данного типа добавляется соответствующий параметр, который необходимо вынести на визуал объекта.\nПри создании ETL-процесса данный тип выбирается в настройке\n\"Тип стартового объекта\"\n.\nВ Системе данные контрагентов будут сохраняться в типе объектов \"Контрагент\". Чтобы идентифицировать объекты для обновления информации в существующих объектах, создадим\nключ\nпо атрибуту \"ИНН\".\nПри настройке\nсхемы ETL-процесса\nнеобходимо добавить этап \"Приемник. Внутренний на основе SQL\" и заполнить параметры настройки:\nНа вкладке\n\"SQL запрос\"\nнеобходимо:\nвыбрать из выпадающего списка настроенное ранее\nсоединение с внешней БД\n, к которой настраивается интеграция для получения данных;\nсоздать параметр запроса для динамического получения данных по заданному значению основного ОКВЭДа контрагента;\nСоздается параметр вида \"Параметр SQL-запроса\", в котором посредством алгоритма возвращается значение атрибута типа, выбранного в качестве \"Типа стартового объекта\" ETL-процесса.\nнаписать SQL-запрос для получения данных контрагентов (ИНН и наименования) из таблицы ранее заданной внешней БД, ОКВЭД которых будет соответствовать указанному значению параметра p_okved;\nустановить размер пакета загрузки данных для оптимизации процесса (предполагается, что БД вернет большое количество объектов);\nв поле \"Описание структуры курсора (XML)\" описать поля ДС для передачи полученных по SQL-запросу данных ИНН и наименования контрагентов в строковом виде.\nНа вкладке\n\"Генерация объектов\"\nнеобходимо:\nвыбрать базовый тип объектов, в который будут сохраняться полученные данные – \"Контрагент\";\nнастроить связи между полями динамической структуры, сформированной на основании описания полей запроса на вкладке\n\"SQL запрос\"\nи атрибутами типа \"Контрагент\".\nчтобы настроить поиск существующих объектов типа для обновления данных, необходимо во встроенном реестре \"Настройка связей типов\" по кнопке\nсоздать настройку для базового типа объектов \"Контрагент\" по типу связи приемника \"Альтернативный ключ\". В качестве ключа выбирается ранее созданный ключ по атрибуту \"ИНН\".\nпри необходимости определяются\nпараметры выполнения этапа\n, например, активировать признак \"Отправить данные в открытые в браузере карточки\".\nСохранить настройки этапа нажатием на кнопку\nв панели управления.",
  "source": "https://docs.greendata.ru/platform/ru/receiver-internal-sql.html"
}