{
  "title": "Основной порядок настройки ролевой модели",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОсновной порядок настройки ролевой модели\nОтображение интерфейса и функционал Системы, предоставляемый конкретным пользователям или определенному кругу лиц, может быть различен.\nЭто достигается за счет применения настроенных учетных записей и групп доступа, в которые включен пользователь. Работа пользователя в приложении возможна после\nавторизации\n:\nот лица конкретного пользователя, для этого потребуется\nучетная запись пользователя\n;\nпод анонимным пользователем (при активном\nанонимном режиме\n).\nВ системе пользователей разделяют на две категории:\nОсновные – пользователи, которые осуществляют настройку и поддержку системы, а также сотрудники организаций, работающие с обращениями от конечных пользователей.\nМассовые – конечные пользователи, которые взаимодействуют с приложением как с готовым продуктом, создавая обращения/оставляя заявки.\nПользователь считается массовым, если в его\nучетной записи\nили в любой из\nгрупп доступа\n, в которые он включен, активен признак массового субъекта.\nДля массовых субъектов безопасности отсутствует возможность управления\nправами доступа к объектам системы\n, даже при наличии соответствующего\nразрешения\nили принадлежности к системной группе доступа \"Административная группа\" [ROLE_ADMIN].\nСвязанные понятия\nДля настройки доступа требуется упорядочить данные в связанных элементах Системы:\nпользователь\n– аккаунт (учетная запись) сотрудника;\nсотрудник\n– работник компании (запись);\nгруппа доступа\n– именованная группа со специфическими полномочиями.\nПредставим связанные элементы Системы на упрощенной модели данных ниже.\nВ случае когда у системных типов (например, \"Пользователь\", \"Группа доступа\") имеются дочерние типы, при создании экземпляров системных типов  Система откроет модальное окно для уточнения выбора типа.\nДля решения узких специальных задач алгоритмической проверки и SQL извлечений данных пользователей следует учитывать расположение объектов в таблицах Системы:\nТип объекта\nНаименование таблицы Системы\nПерсональные данные\nSYS_EMPLOYEE\nПользователи\nSYS_USER\nГруппа доступа\nSYS_SEC_GROUP\nВ случае использования дочерних типов для хранения экземпляров объектов наименования таблиц задаются бизнес-аналитиком при проектировании дочерних типов.\nНастройка ролевой модели\nСоздание и настройка нового пользователя Системы содержит несколько этапов, последовательность выполнения которых может быть изменена.\nДалее представлена рекомендуемая настройка ролевой модели.\nПример настройки пользовательского доступа по представленных этапам доступен по\nссылке\n.\nЭтап 1. Группа доступа\nНа данном этапе осуществляется определение групп доступа, в которые в дальнейшем будет включен пользователь.\nПример настройки представлен в статье\n\"Создание групп доступа\"\n.\nШаг 1.1. Уточнение типа группы доступа\nПредварительное уточнение типа происходит при наличии у типа \"Группа доступа\" [SYS_SEC_GROUP] дочерних типов.\nСоздание дочерних типов от системных осуществляется для расширения атрибутивного состава типа.\nШаг 1.2. Создание новой группы\nСоздание новой группы доступа происходит в случае отсутствия в действующем реестре групп доступа подходящей для пользователя группы. Наименование группы доступа не является аналогом должности или структурного подразделения и выбирается с учетом специфики задачи.\nШаг 1.3. Вложение группы доступа\nВложение групп позволяет систематизировать правила заимствования полномочий. Если группа доступа А полностью обобщается (агрегируется) более широкой группой B, то следует выполнить добавление группы А в существующую группу B.\nВложенность групп доступа должна использоваться, только если это определяется спецификой решаемой задачи.\nОсобыми группами доступа являются:\nВсе пользователи\n(BASE_ACCESS_USERS) –\nне системная\nгруппа доступа предоставляющая базовый доступ к объектам Системы, в которую по умолчанию включаются все создаваемые пользователи.\nТак как группа не является системной, бизнес-аналитик может настроить права группы на любые типы объектов, в том числе системные. Например, скрыть отображение отдельных пунктов меню или настроить специализированную стартовую страницу.\nАдминистративная группа\n(ROLE_ADMIN) – группа предполагает предоставление пользователю полномочий по выполнению настройки Системы. Сопоставленный административной группе пользователь может выполнять расширенные действия: создание новых типов, настройку алгоритмов и визуалов.\nБизнес-аналитик должен быть отнесен именно к административной группе. Административная группа предоставляет возможности настройки (кастомизации) функционала Системы, но не доступ к техническим компонентам, с которыми взаимодействуют разработчики.\nНапример, запрещены действия по созданию новых экземпляров:\nсистемных справочников, которые относятся к ядру платформы\nнекоторых родительских системных типов (например, \"Дашборд\", \"Параметры\"), так как следует создавать экземпляры наследуемых типов, а не родительских.\nИнициатор\n(MANAGER) – специализированная группа доступа, тематически ориентированная на запуск бизнес-процессов. Пользователи, в обязанности которых входит инициирование бизнес-процессов предприятия, должны быть сопоставлены этой группе.\nДля настройки групп доступа могут потребоваться расширенные возможности.\nПараметр\nНазначение\nДобавить субъект безопасности\nСубъектами безопасности Системы являются пользователи и группы.\nРежим настройки конкретной группы доступа позволяет добавить/включить в нее конкретного пользователя или группу доступа.\nДобавить группу в обновление\nПоявление на тестовом стенде любых новых элементов (в том числе групп доступа) может потребовать перемещения созданных объектов на стенд промышленной эксплуатации, где они должны функционировать в реальных условиях. Группы доступа, как и созданные пользователи, могут быть добавлены в файл обновления.\nУдалить группу доступа\nДействие может потребоваться при переориентации деятельности подразделений бизнеса.\nУдаление группы доступа предварительно исключает всех пользователей из состава группы, а затем происходит удаление неактуальной группы.\nПри коррекции группы доступа в реестре пересчет эффективных прав пользователя должен быть вызван в ручном режиме.\nПодробнее можно ознакомиться в статье\n\"Создание пользователя в Системе\"\n.\nЭтап 2. Запись сотрудника\nСоздание и настройка записи сотрудника определяет,\nдля кого настраивается доступ\n.\nДанный этап рекомендуется настраивать при создании\nучетной записи\n.\nПример настройки представлен в статье\n\"Создание сотрудников в системе\"\n.\nШаг 2.1. Уточнение типа сотрудника\nПредварительное уточнение типа происходит при наличии у типа \"Персональные данные\" дочерних типов. Такими типами могут быть \"Сотрудник организации\", \"Сотрудник ГД\", \"Сотрудники контрагента\" и т.п.\nШаг 2.2. Внесение данных сотрудника\nНа данном шаге предполагается заполнение персональных данных сотрудника (ввод значений атрибутов \"Фамилия\", \"Имя\", \"Отчество\" и добавление фотографии сотрудника), а также устанавливаются связи с занимаемой должностью (необязательно) и с подразделением (обязательно).\nПри настройке записи сотрудника могут быть задействованы расширенные возможности.\nПараметр\nНазначение\nНастройка контактных данных\nПозволяет зафиксировать контактные данные skype, email и телефон для последующей связи с сотрудником.\nДля использования сервисами Системы контактный email сотрудника должен быть подтвержден контрольным сообщением.\nНомер телефона сотрудника подтверждается контрольным SMS.\nУстановка часового пояса\nВ случае территориальной удаленности сотрудника может быть полезно уточнение часового пояса. Например, для Перми актуально значение \"UTC+5\".\nСтрана\nСтрана совместно с выбранным языком интерфейса определяют формат отображения значений атрибутов типа \"Дата\", \"Время\", \"Дата и Время\", \"Число\", \"Целое число\", \"Денежный\" в Системе в соответствии со стандартом выбранной страны.\nПо умолчанию значение параметра определяется автоматически (используются настройки браузера пользователя либо IP-адрес) при первой авторизации пользователя.\nЭтап 3. Учетная запись\nСоздание аккаунта (учетной записи) пользователя Системы. Настройки учетной записи определяют, какой аккаунт будет назначен сотруднику.\nПример настройки представлен в статье\n\"Создание пользователя в Системе\"\n.\nШаг 3.1. Уточнение типа пользователя\nПредварительное уточнение типа при создании учетной записи пользователя происходит при наличии у (системного) типа \"Пользователь\" [SYS_USER] дочерних типов. Такими типами могут быть \"Пользователи организации\", \"Внешние специалисты\" и т.п.\nДочерний тип с родителем \"Пользователь\" создается при необходимости расширения атрибутивного состава, используемого в Системе по умолчанию.\nШаг 3.2. Параметры аккаунта пользователя\nПредполагают заполнение параметров уникального логина, пароля пользователя и определение\nкатегории пользователя\n. Хотя бизнес-аналитик может первоначально задать пароль пользователя, рекомендуется (в рамках описанной\nниже\nполитики безопасности) назначить актуальный пароль силами самого пользователя при первом подключении к Системе.\nШаг 3.3. Включение в группы\nХотя учетная запись создаваемого пользователя автоматически будет включена в группу доступа \"Все пользователи\", в большинстве случаев бизнес-аналитику следует вручную добавить пользователя в одну или несколько специализированных групп.\nЕсли пользователь не включен ни в одну группу доступа (удален из группы доступа \"Все пользователи\", которая была установлена по умолчанию), перед ним отобразится следующая страница:\nВ данном случае пользователю доступен функционал:\nсмены языка интерфейса;\nредактирования профиля (карточки сотрудника);\nсмены пароля от учетной записи пользователя;\nпросмотр сведений о программе.\nПри решении реальных задач администрирования доступа могут быть полезны следующие расширенные настройки.\nПараметр\nНазначение\nБлокировка пользователя\nАтрибут со значениями \"Да/Нет\" определяет статус аккаунта и предоставляет возможность заблокировать/разблокировать вход пользователя в Систему. Возможность удобна и полезна для оперативного ограничения/допуска пользователей в Систему.\nНастройка парольной аутентификации\nВ рамках\nполитики безопасности\nможет быть заполнен календарный атрибут \"Дата истечения действия\", после наступления которой аккаунт пользователя считается недействительным, а работа в Системе становится невозможной. Атрибут даты истечения удобен для предоставления временного доступа к Системе.\nОпция \"Необходимо сменить пароль\" позволяет при авторизации заставить пользователя установить вручную новый индивидуальный пароль.\nВ случае установки нового пароля атрибут \"Дата изменения пароля\" заполнится автоматически.\nРегистрация Hook токенов\nПозволяет задать сформированный с помощью методик шифрования ключ пользователя, подтверждающий его действия в Системе.",
  "source": "https://docs.greendata.ru/platform/ru/general-procedure-for-role-model.html"
}