{
  "title": "Виджет \"Изображение\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Изображение\"\nВиджет \"Изображение\"\nпредназначен для размещения и отображения изображений в карточке объекта системы.\nПример настроенного виджета:\nНастройка\nДобавление виджета в карточку объекта осуществляется в режиме редактирования\nвизуала\n. На панели \"Элементы\" необходимо перейти на вкладку \"Виджеты\" и из раздела \"Информация для пользователя\" перетащить (Drag&Drop) виджет \"Изображение\" в рабочую область карточки.\nПосле нажатия на кнопку\nоткроется модальное окно для настройки виджета.\nПараметры\nНастройка виджета осуществляется по следующим параметрам:\nПараметр\nНазначение\nОбласть загрузки и просмотра изображения с указанием масштаба отображения изображения в виджете относительно рабочей области карточки экземпляра.\nПри нажатии на кнопку\nотобразится контекстное меню для выбора способа добавления файла:\n\"Файл с диска\" – параметр, при нажатии на который откроется проводник для загрузки файла с устройства пользователя.\nПри добавлении изображения с диска в Системе создается новый экземпляр типа \"Файл\" [FS_FILE].\n\"Файл из системы\" – параметр, при нажатии на который откроется реестр типа \"Файл\" [FS_FILE] для выбора изображения, ранее загруженного в Систему.\nИзображение может быть добавлено в область параметра методом Drag&Drop.\nДопустимый формат загружаемого файла: *.png, *.jpg, *.jpeg, *.gif и *.bmp.\nВысота, %\nУстановка высоты области изображения в процентах относительно высоты экрана.\nПри изменении высоты масштаб изображения будет автоматически изменен с сохранением пропорций.\nПо умолчанию используется значение 20%.\nСкругление\nВ поле задается размер скругления углов изображения посредством выпадающего списка со значениями:\nXs – 2px;\nS – 4px;\nM – 8px;\nL – 10px;\nXl – 14px.\nПо умолчанию значение параметра отсутствует – углы изображения без скругления.\nРастянуть по ширине\nМасштабирование изображения по ширине до размера рабочей области с сохранением пропорций.\nПри активации переключателя блокируется поле для настройки высоты.\nПо умолчанию переключатель не активен.\nПосле выбора добавляемого изображения откроется модальное окно \"Подготовка изображения\", в котором можно настроить соотношение сторон, обрезать, повернуть и отразить изображение по вертикали/горизонтали.\nПо умолчанию изображение кадрируется в формате 1:1 (фрагмент изображения, расположенный в затемненной области будет срезан перед вставкой в виджет).\nИзменение размера кадра осуществляется посредством нажатия на границу кадра и перемещения границы с зажатой левой кнопкой мыши. Перемещение кадра осуществляется с зажатой левой кнопкой мыши, зафиксированной в отображаемой области изображения.\nВ нижней части модального окна расположены кнопки управления.\nКнопка\nЗначение\nОтразить по вертикали.\nОтразить по горизонтали.\nПоворот изображения влево на 90°.\nПоворот изображения вправо на 90°.\nПрименение изменений осуществляется по кнопке \"Ок\", после чего изображение отобразится в виджете в области просмотра. При нажатии на кнопку отмены изображение отобразится в виджете в исходном размере и без изменений.\nВ ховере добавленного изображения при помощи иконок можно:\nзаменить изображение в виджете – загрузка изображения с диска/из системы;\nвернуться к окну подготовки изображения;\nудалить файл – удаление изображения из области виджета, но не из системы;\nскачать изображение (с внесенными изменениями).\nПри повторном открытии окна подготовки изображения нельзя вернуться к прежнему размеру изображения, если ранее оно было обрезано.\nПример\nНеобходимо в карточке заявки клиентов разместить эмблему ветеринарной клиники.\nДля этого при\nнастройке визуала\nкарточки заявки в рабочую область добавляется виджет \"Изображение\", после чего по кнопке\nосуществляется переход к окну настройки.\nВ открывшемся модальном окне нажмем на кнопку\nи выберем способ загрузки изображения \"Файл с диска\", после чего через проводник локального устройства добавим необходимое изображение:\nВ результате чего откроется модальное окно \"Подготовка изображения\", в котором в рамках примера настроим кадрирование изображения и отразим его по вертикали.\nПосле внесения изменений нажимается кнопка \"Ок\"\nДалее в окне настроек виджета укажем высоту, которую будет занимать эмблема ветеринарной клиники в карточке заявки.\nПосле сохранения визуала настроенный виджет отобразит выбранное изображение в карточке объекта:",
  "source": "https://docs.greendata.ru/platform/ru/image-widget.html"
}