{
  "title": "Multidimensional Cube (OLAP)",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nMultidimensional Cube (OLAP)\nMultidimensional cube or OLAP (Online Analytical Processing) is a powerful tool for efficient processing and analysis of a large amount of data in a convenient structured form.\nThe method got its name due to the fact that the obtained data is structured in the form of multidimensional cubes. Each face of the cube represents a dimension that allows the user to explore the data in the context of selected parameters.\nCreating a Cube\nTo create or configure the new version of a multidimensional cube, go to the main menu items: Multivariative analysis → Cube.\nOn the page that opens, click\nto create a new instance in which the following parameters are set:\nSetting\nPurpose\nCube settings\nName\nThe name of the multidimensional cube object to be created.\nData source\nSelecting/adding the\nsource\nwhose data will be used for analysis.\nThe previously created data source is selected from the drop-down list, and the creation of a new data source is available in the parameter action menu.\nIn the\nSaaS solution\n, the number of rows returned by the data source cannot exceed 10000.\nWhen deploying the platform in the\nOn-Premise\nmodel, the data volume returned by the source is defined in the\nconfiguration file\n.\nFurther configuration is carried out on four tabs:\nDimenions\n;\nFacts\n;\nParameters\n;\nOLAP Views\n.\nDimensions tab\nOn this tab, dimensions are created and configured – these are the aspects by which data can be analyzed.\nA dimension can be thought of as a time period, location, product groups, customers, various products, etc.\nTwo tables are used for this purpose:\nThe left \"Dimensions\" table is used to create measurements;\nThe right \"Source –\nsource name\n\" table contains the generated source fields that can be used to configure the connection with measurements.\nThe list of possible cube dimensions is formed using the buttons above the left table:\nSetting\nPurpose\nCreating a new dimension.\nSee more\nunder this table\n.\nSelecting a previously created dimension..\nAfter clicking the button, a modal window opens, the dimension is selected from the drop-down list.\nViewing the registry of previously created dimensions is available by selecting the main menu items: Multivariative analysis → Cube dimensions.\nEditing the settings of the selected dimension.\nDeleting the selected dimension.\nViewing the registry data of the type specified in the dimension settings.\nAfter clicking the button, the type registry will be opened in a modal window.\nThe button is available when selecting the dimension of the type \"Dimension: object type\".\nWhen creating a new dimension, a modal window opens to select the dimension type, each type has its own settings:\n\"Dimension: source\" – used to analyze data in the context of attributes obtained from another source.\n\"Dimension: object type\" – used to analyze data in the context of attributes of the object type.\nThe settings for the \"Dimension: object type\" and \"Dimension: source\" types are similar and include:\nSetting\nPurpose\nName\nName of the dimension.\nObject type\nSelecting object types where attributes are to be analyzed for the data obtained from the data source.\nThe previously created object type is selected from the drop-down list, the creation of a new object type is available in the actions menu of the setting.\nThis setting is available when selecting \"Dimension: object type\".\nSource\nSelecting the\ndata source\n, where it is necessary to analyze the data obtained from the data source added in the cube settings.\nThe previously created data source is selected from the drop-down list, the creation of a new data source is available in the actions menu of the setting.\nThis setting is available when selecting \"Dimension: source\".\nTabs\nAttributes\nOn this tab, the dimension attributes are created.\nWhen adding an attribute, specify:\nAttribute name;\nAttribute role:\nKey – the key by which, through the dimension attribute, the relationship between the attribute of the object type/source field and the source field added in the cube settings will be configured;\nName – the name of the dimension attribute;\nAdditional information – the additional attribute that can later be used as a sorting field or parent attribute of the hierarchy.\nOnly one attribute with the \"Name\" role can be created.\nField links\nOn this tab, the user configures links between:\nDimension attributes and object type attributes – when setting up the dimension of the \"Dimension: object type\" type;\nDimension attributes and source fields – when setting up the dimension of the \"Dimension: source\" type .\nLearn more about setting up the connection.\nTo create a link, select the dimension attribute in the left table and the object type attribute/source field in the right table, then click\n.\nThe created relationship will be displayed next to the source field in the right table.\nEach table element can be linked to another element only once.\nSortings\nThis tab allows sorting data by dimension attributes in a future cube visual.\nThe sorting is created using the\nbutton, followed by selecting the dimension attribute and indicating the sorting direction:\nIn ascending order;\nIn descending order.\nBy default, the added sorting direction is set to \"In ascending order\".\nHierarchy\nThis tab allows displaying data in the cube visual as a hierarchy.\nUse hierarchy\nThe switch that controls the ability to configure the hierarchy.\nBy default, the parameter is inactive.\nHierarchy attribute\nSelecting an attribute containing the Object ID.\nThis parameter is available when the \"Use hierarchy\" switch is active.\nHierarchy attribute parent\nSelecting an attribute that references the parent attribute.\nThis parameter is available when the \"Use hierarchy\" switch is active.\nParameters\nThis tab allows creating measurement parameters that are linked with the parameters of the data source (the process of creating links is described\npreviously\n).\nThe tab is displayed when the \"Cube dimension: source\" type is selected.\n\"Dimension: calendar\" – used to analyze data in the context of dates and is configured using the settings:\nSetting\nPurpose\nName\nThe name of the dimension.\nDynamics\nSelecting the dimension dynamics type. The selection is made from the drop-down list:\nYear;\nYear-quarter;\nYear-month;\nYear-quarter-month;\nYear-quarter-month-day;\nYear-month-day.\nThe default dynamic type is \"Year\".\nLower border\nMinimum periods until the current date\nEntering the number of minimum periods up to the current date.\nThe default value is 5.\nThe parameter is available when the \"Set algorithm\" switch is inactive.\nSet algorithm\nThe switch that defines how to determine the number of minimum periods before the current date:\nwhen the switch is inactive, by entering a numeric value in the \"Minimum periods until the current date\" field.\nwhen the switch is active, using the algorithm.\nBy default, the parameter is inactive.\nAlgorithm\nDefining an algorithm that returns the number of minimum periods up to the current date.\nThe previously created algorithm is selected from the drop-down list, and the creation of a new algorithm is available through the setting’s action menu.\nThe parameter is available when the \"Set by algorithm\" switch is active.\nUpper border\nMinimum periods after the current date\nEnter the number of minimum periods after the current date.\nThe default value is 5.\nThe parameter is available when the \"Set algorithm\" switch is inactive.\nSet algorithm\nThe switch that defines how to determine the number of minor periods after the current date:\nwhen the switch is inactive, by entering a numeric value in the \"Minimum periods after the current date\" field.\nwhen the switch is active, using the algorithm.\nBy default, the parameter is inactive.\nAlgorithm\nDefining an algorithm that returns the number of minimum periods after the current date.\nThe previously created algorithm is selected from the drop-down list, and the creation of a new algorithm is available through the setting’s action menu.\nThe parameter is available when the \"Set algorithm\" switch is active.\nResult\nSelecting the date on which the cube view should be displayed:\nStart date of the period\nStart date of the next period (as of the date)\nBy default, the value \"Start date of the period\" is selected as the result.\nThe link must be set up between the created dimension attributes and the source fields (the creation process is described\npreviously\n).\nFacts tab\nThis tab is designed to determine the quantitative indicators by which data will be aggregated for analysis.  For example, the number of orders, the volume or the amount of sales.\nCurrently, there is only one way to aggregate data – the amount.\nTwo tables are used for this purpose:\nThe left \"Facts\" table is used to create facts;\nThe right table \"Source -\nName of the source\n\" contains generated source fields that can be used to set up relations with dimensions.\nTo create a fact, click\n, place the cursor in the added field of the \"Facts\" table and enter the name of the fact.\nNext, to create the link, select the fact in the left table, the source field in the right table and then click\n.\nParameters tab\nThis tab is designed to add parameters which filter data for the cube visual.\nIt uses two tables:\nThe left \"Dimension parameters\" table is used to create parameters that will be added to the cube visual;\nThe right \"Parameters\" table contains the parameters of the data sources used. These parameters are divided into two groups:\n\"Source\" – parameters of a data source that provides data for analyzing a multidimensional cube.\n\"Dimension\" – previously added\n\"Source\" cube type dimension\nparameters.\nTo create a parameter, click\nand fill in the necessary parameters in the modal window that opens:\nA connection must be set up between the created parameters and the parameters of the data sources (the process of creating a connection is described\npreviously\n).\nOLAP Views tab\nThis tab is used to directly create visuals of a multidimensional cube for structuring, analyzing, and visualizing data.\nThe construction is based on the data source selected in the cube settings and the previously set parameters in\n\"Dimensions\"\n,\n\"Facts\"\nand\n\"Parameters\"\ntabs.\nTo create a new view, simply click the\nbutton. The created object will then automatically open in a new browser tab.\nThe object name is set in the input field located in the control panel. In addition to standard buttons, the control panel also includes:\nbutton for configuring OLAP cells and columns;\nLearn more.\nClicking the button opens a modal window with the following set of parameters:\nSetting\nPurpose\nType of column width setting\nDetermining the column width. Possible options:\nMatch column widths to content – the width of the columns is adjusted depending on the content, but within the specified boundaries of the minimum and maximum width;\nSame width of all columns – a fixed width is set for all columns.\nMinimum column width (px)\nEntering a numeric value to set the minimum allowed column width.\nThe parameter value must be greater than or equal to 20 px.\nBy default, the value is set to 20 px.\nThe parameter is displayed when selecting the column width \"_Match column widths to content\"\nsetting.\nMaximum column width (px)\nEntering a numeric value to set the maximum allowed column width.\nThe parameter value must be greater than or equal to the minimum column width.\nBy default, the value is set to 600 px.\nThe parameter is displayed when selecting the column width \"_Match column widths to content\"\nsetting.\nColumn width (px)\nThe parameter value must be greater than or equal to 100 px.\nBy default, the value is set to 200 px.\nThe parameter is displayed when you select the column width \"Same width of all columns\"\nsetting.\nHide empty cells (rows)\nIndicates whether rows with missing contents are hidden in the cells.\nHide empty cells (columns)\nIndicates whether to hide columns with missing content in their cells.\nShow fact names\nThe feature that regulates the display of cells with the fact names in the OLAP visual.\nbutton for saving the OLAP view;\nLearn more.\nThe export button is displayed in the control panel only after the OLAP view has been rendered in the main workspace.\nClicking the\nbutton downloads an *.xlsx format file to the local device with the name <Cube name>.<View name>.\nbutton for opening cube settings in a new tab;\ntoggle for hiding the header and sidebar of the OLAP view in the page workspace.\nView settings\nThe main part of the page is devoted to building an OLAP visual based on facts and dimensions moved to the interface of the header and sidebar of the OLAP visual.\nThe view is configured using:\nselecting the required fact and dimension values for the report form from dropdown lists.\nAll available fact and dimension values are selected by default.\ndragging and dropping (Drag&Drop) facts and dimensions from the \"Fixed dimensions\" block into the header and sidebar interface of the OLAP view;\nDragging and dropping is performed by holding down the\nicon.\nfiltering data by selecting parameter values.\nThe order in which facts and dimensions are placed in the header and sidebar area of the OLAP view affects data display and grouping. Different arrangement combinations of facts and dimensions allow for effectively structuring information for analysis and informed decision-making.\nData visualization in the table is built according to the hierarchy of the selected fact and dimension values chosen from the dropdown lists.\nTime series labels correspond to the dynamics selected in the\ncube settings\n.\nAdditionally, data formatting takes into account the interface language set in the browser.\nLearn more about data formatting.\nData Type\nComment\nExample\nNumber\nData is right-aligned with digit grouping.\nThe separator between integer and decimal parts depends on the interface language set in the browser.\n10,000.54\nDate and time\nData is left-aligned.\nThe separator and format depend on the interface language set in the browser.\n01/10/2025 12:00 PM\nDate\nData is left-aligned.\nThe separator and format depend on the interface language set in the browser.\n01/10/2025\nTime\nData is left-aligned.\nThe format depends on the interface language set in the browser.\n12:00 PM\nText\nData is left-aligned.\nHello!\nBoolean\nData is left-aligned.\nThe value is displayed as text according to the interface language set in the browser.\nYes\nFor a compact and focused view of the data, the dashboard can be minimized by clicking on the\nicon, and the header and sidebar of the OLAP view can be minimized via the “Hide sidebar and header” switch.\nThe custom OLAP visual can be embedded into the dashboard via the\nOLAP dashboard\n.",
  "source": "https://docs.greendata.ru/platform/en/multidimensional-cube-olap.html"
}