{
  "title": "\"Control panel\" tab",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Control panel\" tab\nThis tab contains settings responsible for what will be displayed in the registry control panel.\nOn the \"Control panel\" tab, configuration is done using the following parameters:\nSetting\nPurpose\nSetting buttons on the control panel in the registry\nSelecting an object of type \"Setting buttons of the control panel in the registry\", which fixes a set of preset buttons to be displayed in the\ncontrol-panel\nof the registry in the specified sequence.\nThis parameter allows reusing the same setting object for different registries.\nAdding custom buttons is done directly in\nbutton settings\nof the corresponding registry.\nIf changes are saved to an object that is used as a setting in other registries, the system will display a notification.\nWhen click the \"Ok\" button, the edits made will be applied to all registries that use this object for setup.\nPreviously created objects are selected from the drop-down list, creating/viewing/editing an object is done via the parameter action menu.\nPossibilities when opening an object profile\nIn the object profile there is a possibility to:\nsetting preset buttons;\nsetting the current object as a default object for all new registers. To do this, set a checkbox in the corresponding checkbox field.\nThe system will display a notification when saving:\nWhen clicking the \"Ok\" button, the current object automatically becomes the default object for all new registries (the change does not apply to existing registries). The previously used default object is unchecked automatically.\nIf a registry with a configuration object set as default for all registries is transferred using\nan update\n, and a configuration object with the \"Default for all registries\" flag already exists in the production instance, this flag will be removed from the transferred object.\nto view the list of registries in which this setting object is used. To do this, go to the \"Registries\" tab.\nSearch filed\nVisibility of the search field on the right side of the control panel.\nModal window title when creating a new object\nThis parameter is not supported.\nThe method for displaying the object name in the modal window can be defined in the \"Name display settings\" parameter in the\ninstance visual settings\n.\nTitle in the detail profile\nDisplaying the title in the detail profile (name of the object profile).\nButton setup\nTo specify the full set of buttons in\ncontrol panel\nfor a particular registry, the buttons on the current tab can be set up.\nThe list of\npreset buttons\nis system, but they can be hidden if needed. In addition, the hint can be changed for some buttons.\nMore about preset buttons\nThis settings block defines the visibility of the following actions (buttons):\nAdd - creating an object (by default, the\nbutton);\nEdit - editing an object (by default, the\nbutton);\nRefresh – updating the data of the current registry (by default, the\nbutton);\nData\nin the registry\ncan be\nautomatically updated\n.\nAn exception is the\nedit mode\n- in this mode, all changes made to the object are saved after clicking the\nbutton.\nIf the\nsystem setting\n\"Save entered data when closing the object profile\" is active, the\nbutton\nin the object profile\ncan be used to\nclear pre-filled fields\n.\nCopy - creating a copy of the object (by default, the\nbutton);\nDelete - deleting the object (by default, the\nbutton);\nSave - saving the changes (by default, the\nbutton);\nClear filter - clearing the configured\nfilter\n(by default, the\nbutton);\nExport - downloading the registry data to the user’s personal device in *.xlsx format (by default, the\nbutton);\nSettings - opening the\nregistry settings\n(by default, the\nbutton);\nAudit - displaying\nchanges\nmade to the selected object in the registry (by default, the\nbutton);\nSorting configuration - adding a\nsorting condition\n(by default, the\nbutton);\nCreating folder – creating a new folder in the\n\"Folders registry\"\ntype registry (default button\n)\nMode switch - switching between\nview/edit modes\nof the registry data;\nCustom filters - adding a\ncustom filter\n;\nAdvanced search;\nReorder;\nShow child types - enabling viewing the hierarchy of the current registry type in a dropdown list and allows switching to the registry of the selected object type.\nIf there are\nactions\navailable for the registry, custom buttons can be added to the registry control panel. This is done by clicking on the Add button, then selecting an available action, icon, and specifying a hint for the button.\nRegardless of the settings in the action itself, a custom button must be added to display in the registry.\nThe buttons display sequence is changed by dragging and dropping the rows (it is not allowed to mix preset and custom buttons).\nButtons may be displayed in the control panel, but may not be accessible to the user if the user does not have the appropriate access permissions:\nthe \"Create\" and \"Copy\" buttons are locked if there is no permission to \"Create type instances\";\nthe \"Edit\" button is locked if there is no permission to \"Edit type instances\";\nthe \"Delete\" button is locked if there is no permission to \"Delete type instances\".\nAfter saving changes by clicking the\nbutton, the registry will be updated according to the applied settings.\nControl panel settings are saved in the object selected in the \"Control panel button settings in the registry\" parameter. The saved changes will be applied to all registries that use this button settings object.\nWhen displaying the buttons of a registry added to an object’s visual as an object or child attribute (for example, using the\n\"Registry for multiselect attribute\"\nvisual), the button visibility settings defined via\nattribute options\ntake precedence.",
  "source": "https://docs.greendata.ru/platform/en/tab_control_panel.html"
}