{
  "title": "Task Scheduler. Launch of algorithm",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nTask Scheduler. Launch of algorithm\nThe System allows you to configure\nthe scheduled launch of an algorithm\n.\nIn the \"Action run schedule\" object type\nIn order to create a\nlaunch schedule\nof the algorithm, create an instance in the \"Action run schedule\" object type [\nSYS_ACTION_SCHEDULE\n].\nIn the schedule settings, you should specify the name of the schedule, the type of system action \"Starting the algorithm\", the time of the algorithm launch. In the \"Schedule is valid\" field, you must select the value \"\nYes\n\". The fields \"Last execution was successful\" and \"Date of last execution\" will be filled in automatically.\nIf necessary, you can create a new algorithm start time (for more information, see\nCRON Scheduler\n).\nAfter selecting the system action, the \"Object with parameters for the action\" field will be displayed in the instance card. It is necessary to click on the \"Create new\" button to configure the parameters for the automatic start of the algorithm..\nBy clicking the button, the user needs to select the type of configurable object \"Parameters for automatic algorithm startup\".\nA new instance of the selected type will be created automatically by the user.\nDepending on the selected object type, the settings will change. In this case, we configured the algorithm at the launch of which employees are informed about birthdays in the chat.\nSetting\nPurpose\nAlgorithm to be executed\nSelecting the algorithm(s) to execute. Multiple algorithms can be selected.\nType of objects to run\nSelecting the type of objects to run. Possible values:\nSelecting a list of objects Here, you need to specify by which object(s) the algorithm should run. You can specify the technical object type with the definition of objects and their filtering in the executed algorithm;\nSelecting the object type and filtering algorithm Without filtering – a configurable algorithm launch will be performed for all objects of the type.\nObject type to define objects to run\nSelecting the object type to execute the algorithm. Specified when selecting objects type to run:\nObject type to specify the objects to run\nObject filtering algorithm\nSelecting the object type filtering algorithm (if necessary). Specified when selecting objects type to run:\nObject type to specify the objects to run\nWhen the algorithm is configured, save the data. The algorithm for performing the action will be displayed in the schedule profile.\nIn the \"Launch schedule\" object type\nIn order to create a\nlaunch schedule\nof the algorithm, create an instance in the \"Launch schedule\" object type [\nSYS_START_SCHEDULE\n].\nIn the schedule settings, specify the name of the schedule and the start time of the algorithm. Set \"\nThe schedule is active\n\" switch to active position.\nClick\nto create a \"Task scheduler\" child attribute.\nBy clicking on the button, the user should select the type of scheduler \"Task Scheduler. Launch of algorithm\".\nSimilarly to the example of setting parameters for the automatic start of the algorithm, you need to fill in the following fields:\nWhen the scheduler configuration is completed, save the data using\n. The created algorithm launch scheduler will be presented in the \"Task Scheduler\" child attribute in the schedule profile.\nIf necessary, the user can create several automatic tasks for one schedule.",
  "source": "https://docs.greendata.ru/platform/en/task-scheduler-launch-of-algorithm.html"
}