{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРелиз LTS.475.6 от 26.01.2026\nНовые возможности\nТеперь при настройке пользовательского действия с модулем \"Установить фокус на атрибут/объект\" элемент визуала можно задавать алгоритмом при помощи функции\nvisualItemUuid\n.\nРасширена функциональность оператора \"⊂ Включает\" при настройке\nдерева условий\n: добавлена явная настройка режима «Включает 1 и более элементов» / «Включает все элементы».\nВнедрен централизованный механизм\nуправления правами на экземпляры\n: теперь через действие в типе объекта можно добавить/удалить конкретные права у выбранных ролей сразу для всех существующих и будущих экземпляров, не затрагивая при этом права других пользователей.\nРеализована возможность\nудаления объектов через обновления\n. Теперь в обновление можно собрать как логически удаленные объекты из корзины, так и объекты, удаленные физически (по UUID), для их переноса на целевые стенды.\nДля повышения безопасности входа в Систему реализована возможность настройки\nдвухфакторной аутентификации\nс подтверждением по электронной почте.\nПоявилась возможность выбора стратегии хранения секретных переменных в Vault через\nконфигурационный файл приложения\n: раздельное хранение каждого значения или объединение всех секретов в одну сущность.\nsecurity:\nsecretManager:\nvaultStorage:\nsecretStoringStrategy:\nSECRET_PER_APP\nyaml\nCopied!\nДобавлена возможность\nотправки логов в Logstash\n.\nВ\nGreenData Messenger\nи\nGreenData Meet\nреализован механизм оценки качества связи после звонка.\nИзменения и улучшения\nТеперь в сообщениях системных ошибок вместо технических идентификаторов отображаются понятные названия типов объектов и прав доступа.\nИсправлена работа\nкоммуникационной панели\nв мобильном браузере: панель остается доступной после раскрытия любого раздела.\nТеперь при запуске приложения\nглавное меню\nпо умолчанию представлено в развернутом виде и закреплено, что делает навигацию более очевидной для пользователя.\nОбновлен вид модального окна настройки\nпериодов рабочего времени\n.\nНалажено отображение реестра\nпользователей\nСистемы.\nВ типах объектов \"Меню\" и \"Визуал\" добавлены выражения для наименований экземпляров.\nВосстановлен признак \"Доступен только для чтения\" для унаследованных атрибутов типа \"ДО. Задача на процессе\" [WF_PROCESS_TASK].\nИсключено дублирование системного атрибута [EMP_ID].\nСкорректированы наименования типов объектов:\n\"Источник данных. Объектный источник данных\" → \"Объектный источник данных\";\n\"Источник данных. Удаленный SQL источник данных\" → \"Внешний SQL-источник данных\".\nСтабилизирована работа объектных multiselect-атрибутов с\nдвусторонней связью\n.\nОтлажен процесс удаления дочерних объектов типа\n\"Примитивный объект без суррогатного ключа\"\n.\nСтабилизирована работа пагинации в объектных атрибутах.\nСкорректировано поведение необязательного числового атрибута с визуалом\n\"Поле ввода с пошаговым слайдером\"\n: теперь при создании экземпляра значение атрибута остается пустым (null).\nСтабилизирована работа\nавтокалькуляции\nна дочернем атрибуте без пересохранения родителя.\nМодальное окно удаления связи на схеме предметной области теперь поддерживает перемещение.\nСкорректировано отображение перечня доступных типов объектов при добавлении типа на предметную область.\nРасширен перечень типов объектов, отображаемых по умолчанию в укороченном\nреестре \"Тип объекта\"\n.\nПри настройке реестра по умолчанию добавлена фильтрация — теперь в списке отображаются только реестры, соответствующие выбранному типу объекта.\nУлучшена работа поисковых фильтров в реестрах: при переключении между реестрами поле поиска автоматически очищается для корректной работы фильтрации в новом контексте.\nУскорена работа\nреестров с иерархией\n.\nВ\nплиточном реестре\nиерархического типа отлажен поиск по всем уровням иерархии.\nНалажен экспорт реестра при наличии атрибута типа \"Файл\".\nСтабилизированы URL и контекст\nреестра задач\nпри переключении между его представлениями.\nВосстановлена работа поиска в\nплиточном реестре\n.\nДля\nреестра с иерархией\nдобавлена поддержка функции агрегации.\nСтабилизировано отображение значения атрибута типа \"Дата\" с визуалом\n\"Календарное изменение с иерархией, с ограничением типа динамики по другому объекту\"\n.\nИсправлена работа алгоритмов видимости для элемента группировки\n\"Фрейм\"\n.\nСтабилизировано отображение содержимого виджета\n\"Текст\"\nи атрибутов\nтипа \"Текст\"\nс визуалами \"Текст с поддержкой сложного форматирования\" и \"Многострочный ввод\".\nВ модальном окне настройки прав доступа добавлена сортировка по наименованию субъекта безопасности и унифицировано отображение реестров субъектов.\nНалажена работа с изображениями на мобильных устройствах.\nСтабилизирована работа редактора изображений в виджетах и атрибутах при повторном редактировании или загрузке нового изображения.\nДля системного отображения кнопок в панели управления ограничена возможность\nпереопределения\nдействия кнопки \"Сохранить\" в настройках визуала экземпляра.\nДобавлена возможность создания классификации файла из модального окна настройки визуала файлового атрибута.\nСтабилизирована работа с карточкой объекта при наличии\nфрейма\n.\nВ модальном окне редактирования алгоритма, открываемого с визуала, скрыта кнопка удаления.\nИсправлена логика форматирования и отображения значений строкового атрибута с визуалом\n\"Телефон\"\n.\nПри открытии объекта в ссылке фрейма отлажено переключение между вкладками на визуале.\nОтлажен перенос элемента \"Ряд\" с\nбоковой панели\n.\nОптимизирована\nнастройка отображения наименования объекта и кнопок\nпри открытии объекта в модальном окне.\nНалажено применение заданной ширины виджета\n\"Кнопка\"\nс действием \"Открыть реестр\".\nВ виджете\n\"Точка на карте\"\nотлажен пересчет значений координат при размещении атрибута с адресом на другой вкладке.\nСтабилизирована работа виджета\n\"Дашборд\"\n.\nОтлажено создание типа объекта из окна настроек виджета\n\"Спринт\"\n.\nСтабилизирована настройка фильтрации в виджете\n\"Статус бар\"\n.\nОтлажено отображение настроек виджета\n\"Статус бар\"\n.\nНалажено отображение заданного числа экземпляров в виджете\n\"Реестр объектов\"\nпри наличии группировки в реестре.\nСтабилизирована работа виджета\n\"Дашборд\"\nпри смене выбранного ранее шаблона.\nСтабилизировано редактирование пользовательских\nтем оформления\n: настройки теперь сохраняются и корректно отображаются при переключении между темами в режиме редактирования.\nОтлажено отображение логотипа страницы загрузки и фавикона, установленных в пользовательской теме оформления.\nВосстановлена блокировка маршрутного объекта после завершения связанной с ним задачи бизнес-процесса.\nОтлажено обновление статуса задачи при ее завершении с помощью функции\nexecuteTask\n.\nСтабилизирован доступ к задачам бизнес-процессов для пользователей, не включенных в группу доступа \"Административная группа\".\nВосстановлена возможность завершения задач при наличии\nmultiselect-атрибутов\n.\nСтабилизирована работа с\nпользовательскими задачами\n.\nВ\nпредставлении OLAP\nдобавлен скролл при отображении данных в графическом виде.\nОтлажено отображение измерений в\nпредставлении OLAP\nпри смене локали.\nДобавлен горизонтальный скролл при перетаскивании (Drag&Drop) задачи между этапами на\nканбан-доске\n.\nОтлажена блокировка возможности переноса задач на\nканбан-доске\nпри помощи настройки прав на атрибуты типа.\nСтабилизирована настройка параметров канбан-доски.\nНалажено отображение шапки аналитической панели\n\"Таблица\"\nпри закреплении столбца.\nОтлажено отображение дочерней панели на дашборде при использовании\nрасшифровки\nс активной опцией \"Показывать на месте родителя\".\nСкорректировано отображение кнопок на дашборде в соответствии с выбранной темой оформления.\nСкорректировано отображение наименований полей источника данных.\nОптимизирован парсинг кода в редакторе алгоритмов при вводе синтаксически некорректных конструкций.\nДля функции\nnewVerEDoc\nдобавлен опциональный параметр, позволяющий указать базовую версию документа, от которой будет создана новая версия.\nДобавлена возможность использования нескольких функций\nisInTreeObjects\nв одном алгоритме фильтрации.\nОтлажена работа алгоритма блокировки для\nпользовательского действия\nс активной опцией \"Можно запустить без выбора объекта\".\nСтабилизирована работа действия\nудаления дубликата объекта\n.\nВосстановлена возможность редактирования действия \"Маршрут\" [SYS_SHOW_WAY].\nОтлажена фильтрация значений объектного атрибута с визуалом\n\"Множественный выбор объектов в виде listbox\"\n.\nСтабилизирована работа оператора \"⊄ Не включает\" для строковых полей в\nдереве условий\n.\nОтлажена возможность настройки\nуведомлений\nо системных событиях.\nСтабилизирован\nзапуск ETL-процесса\nчерез API.\nВ карточке\nобъекта ETL\nдобавлена фильтрация значений атрибута \"Тип стартового объекта\".\nВ настройках\nиерархического отображения файлов\nпри выборе родительской вершины добавлена фильтрация значений для более удобного поиска.\nСкорректирована логика работы с версиями файлов и их подписями.\nВосстановлены права по умолчанию для административной группы на \"Чтение\" классификаций файлов.\nСистемная настройка \"Подключение сервиса GreenPy\" переименована в \"Подключение сервиса выполнения Python скриптов\".\nСкорректирована логика сортировки\nсессий пользователей\n.\nОтлажено отображение подсказки на странице входа в мобильном браузере.\nСтабилизирована проверка прав доступа при выполнении различных алгоритмов в Системе.\nПри установке обновлений с измененным\nисточником данных\nего поля теперь полностью заменяются, а не дополняются старыми, что предотвращает их дублирование.\nОтлажена возможность создания обновления, содержащего тип объекта при наличии атрибута с визуалом \"Поле ввода с пошаговым слайдером\".\nСтабилизирована установка обновлений при наличии\nрасширений\nдля типов объектов.\nОптимизирована работа\nаудита действий\n.\nВ GreenData Messenger и GreenData Meet реализована автоматическая активация новогодней темы оформления, управление которой осуществляется с помощью параметров конфигурации.\nПри\nимпорте отчетности из файла\nзагруженные данные теперь корректно отображаются без перезагрузки страницы.\nИсключена возможность вставки данных при фокусе на заблокированной ячейке формы отчетности.\nВ редакторе шаблона документа реализовано создание и удаление разрывов страниц и разделов.\nСтабилизирована возможность открытия документа, сформированного по шаблону, после сравнения версий.\nПри загрузке версии документа из файла отлажено отображение межстрочных интервалов и нумерованных списков.\nВ шаблоне документа формата *.xlsx налажена проверка значений при вставке данных в расширенный диапазон.\nОтлажено скрытие пустых таблиц при экспорте документа.\nСтабилизировано открытие документа в новой вкладке после удаления из него таблицы в другой вкладке.\nИсправлено отображение значений отступов в модальном окне настроек как при выделении пункта списка, так и при установке курсора в абзац.\nОтлажена логика определения времени последнего посещения пользователя.\nДоработана синхронизация данных о пользователе и группах доступа.\nСтабилизирована работа звонков в групповых чатах после сворачивания приложения или переключения между вкладками/рабочими столами.\nСтабилизирована работа приложения на базе iOS.\nОптимизировано управление медиапотоками в видеозвонках.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:lts.475.6\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.475.6.war\nhttps://downloads.greendatasoft.ru/LTS/lts.475.6.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.475.6-latest.html"
}