{
  "title": "Настройка объекта-фильтра",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка объекта-фильтра\nВ Системе реализована сложная логика фильтрации данных при помощи настройки объекта-фильтра. Данная настройка применяется для фильтрации коллекции данных.\nНапример, посредством объекта-фильтра может быть настроена автоматическая фильтрация счетов указанного клиента.\nПри этом клиент выбирается пользователем в той же карточке в режиме реального времени.\nДля настройки фильтра необходимо перейти в режим редактирования\nвизуала экземпляра\nнажатием на кнопку\n. Затем в\nобъектном атрибуте\n, для которого настраивается фильтрация, следует нажать на кнопку\nи в открывшемся модальном окне добавить фильтр в поле \"Фильтр на основе SQL при добавлении\".\nРанее созданный фильтр выбирается из выпадающего списка.\nВ открывшемся модальном окне фильтрация настраивается по следующим параметрам:\nПараметр\nНазначение\nНаименование\nНаименование объекта-фильтра.\nБазовый тип объекта\nТип объекта, экземпляры которого будут отфильтрованы.\nИсточник\nИсточник данных\n, на основе которого настраивается фильтрация экземпляров выбранного ранее типа посредством обозначенных параметров фильтра. Источник должен возвращать ID объекта.\nПараметры фильтра\nРеестр подстановочных параметров, используемых в источнике данных.\nПример\nВ рассмотренном далее примере будет настроена фильтрация субъектов РФ в зависимости от выбранного федерального округа.\nДопустим, в карточке типа \"Объект имущества\" необходимо настроить фильтрацию выпадающего списка атрибута \"Субъект РФ\" в зависимости от выбранного значения атрибута \"Федеральный округ\".\nШаг 1. Создание объектной модели\nВ примере используются три типа объектов \"Объект имущества\", \"Субъект РФ\" и \"Федеральный округ\".\nВ реестре типа \"Федеральный округ\" создаются экземпляры с указанием наименований федеральных округов РФ.\nАтрибутивный состав типа \"Субъект РФ\" содержит объектный атрибут, ссылающийся на тип \"Федеральный округ\", поэтому при создании экземпляров указывается наименование субъекта и выбирается соответствующий ему федеральный округ.\nВ типе \"Объект имущества\" создаются объектные атрибуты, ссылающиеся на типы \"Субъект РФ\" и \"Федеральный округ\".\nШаг 2. Добавление объекта-фильтра\nВ режиме редактирования\nвизуала экземпляра\nтипа \"Объект имущества\" необходимо настроить фильтрацию атрибута \"Субъект РФ\". Для этого следует добавить объект-фильтр:\nШаг 3. Настройка объекта-фильтра\n3.1. При создании объекта-фильтра указывается наименование фильтра и определяется тип объекта, объекты которого необходимо отфильтровать.\n3.2.\nДобавление источника, который осуществляет фильтрацию.\nДля данного примера создается источник данных на основе SQL.\nВ источнике данных:\nдобавляется запрос для определения условий фильтрации, возвращающий код выбранного федерального округа;\nсоздается параметр с идентификатором \"fed_district\".\nНастройки источника данных необходимо сохранить.\n3.3. Создается параметр фильтра, который будет использоваться для передачи значений в источник данных.\nВ рамках примера для параметра с наименованием \"Федеральный округ\" указывается идентификатор идентичный идентификатору параметра источника, созданного\nранее\nЗначение параметра определяется посредством алгоритма, добавленного в одноименном параметре:\nПри создании алгоритма в качестве базового типа объектов указывается тот тип, в экземпляре которого настраивается фильтрация.\nШаг 4. После определения всех параметров объекта-фильтра необходимо сохранить внесенные изменения, после чего данный объект фильтр будет выбран в соответствующем поле атрибута.\nШаг 5. Сохранить настройки визуала экземпляра.\nДанные настройки позволят отфильтровать выпадающий список субъектов РФ в зависимости от выбранного федерального округа без сохранения карточки объекта.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-filter-object.html"
}