{
  "title": "ETL. Трансформатор. Поиск объекта в справочнике",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nETL. Трансформатор. Поиск объекта в справочнике\nТрансформатор \"ETL. Трансформатор. Поиск объекта в справочнике\" используется для поиска объекта выбранного типа по заданному значению одного или нескольких атрибутов.\nНастройка\nТрансформаторы ETL настраиваются в\nпреобразователе данных\n, добавленном на\nсхему\nETL-процесса.\nНабор параметров настройки зависит от выбранного вида поиска в справочнике:\nпо одному атрибуту (простой ключ);\nпо нескольким  атрибутам (составной ключ).\nПараметр\nНазначение\nНаименование\nНазвание созданного трансформатора.\nПорядок\nВвод порядкового номера трансформатора для определения последовательности запуска при наличии нескольких трансформаторов.\nВид поиска\nВыбор вида настраиваемого поиска:\nпоиск по атрибуту (простой ключ);\nпоиск по атрибутам (составной ключ).\nКоллекция входных данных\nВыбор элемента динамической структуры, по значению которого будет производиться поиск.\nПри виде поиска \"Поиск по атрибуту (простой ключ)\" параметр отображается в виде поля, при виде поиска \"Поиск по атрибутам (составной ключ)\" – в виде динамической структуры, элементы которой необходимо связать с атрибутами ключа.\nТип объекта\nВыбор типа объекта, в котором будет осуществляться поиск.\nАтрибут типа\nУникальный атрибут указанного типа, в котором будет осуществляться поиск значения, полученного через коллекцию входных данных.\nВ качестве значения должен быть выбран только атрибут, для которого в типе объектов создан\nключ\n.\nНапример, \"Идентификатор\".\nПоле доступно при виде поиска \"Поиск по атрибуту (простой ключ)\".\nКлюч\nПараметр, предназначенный для определения полей поиска в указанном типе объектов.\nВыбор осуществляется из выпадающего списка\nключей\nуказанного типа объектов.\nПоле доступно при виде поиска \"Поиск по атрибутам (составной ключ)\".\nКоллекция выходных данных\nВыбор элемента динамической структуры, в который будет передаваться полученное значение (из параметра \"Атрибут с необходимым значением\").\nАтрибут с необходимым значением\nВыбор атрибута, значение которого необходимо получить из найденного объекта и записать в указанный элемент коллекции выходных данных.\nПродолжить работу ETL при возникновении ошибки\nПризнак, используемый для игнорирования ошибок работы трансформатора.\nСвязь коллекции входных данных и атрибутов ключа\nСопоставление значений, по которым будет осуществляться поиск, с атрибутами составного ключа.\nПараметр доступен при виде поиска \"Поиск по атрибутам (составной ключ)\".\nПримеры\nПоиск по атрибуту (простой ключ)\nНапример, поиск валюты по идентификатору в рамках трансформации данных имеет следующие настройки:\nВ типе объекта \"Валюта\" производится поиск объекта, в котором значение атрибута \"Идентификатор\" соответствует значению элемента динамической структуры \"curr_ident\".\nКод найденного объекта записывается в элемент динамической структуры \"app_currency\".\nПоиск по атрибутам (составной ключ)\nПредположим, что в качестве данного примера необходимо найти объект, содержащий паспортные данные, по указанному номеру и серии.\nВ данном случае поиск будет осуществляться в типе объекта \"Паспортные данные\", где необходимо создать\nключ\n, содержащий атрибуты паспортных данных \"Серия\" и \"Номер\":\nДалее при создании\nсхемы ETL\nдобавляются этапы:\nИсточник данных. Внешняя БД\n– для формирования динамической структуры, через элементы которой передается поисковое значение.\nПодробнее.\nПри настройке этапа \"Источник данных. Внешняя БД\":\nчерез SQL запрос указываются значения для будущего поиска: серия 5711, номер 756000;\nв параметре WSDL/JSON формируется динамическая структура.\nПреобразователь данных\n– для поиска объекта, соответствующего заданным значениям элементов динамической структуры.\nВ первую очередь  на вкладке \"Основное\" следует сформировать динамическую структуру, в которой добавить элемент для записи искомого значения (кода будущего найденного объекта).\nДалее на вкладке \"Дополнительно\" добавляется \"Трансформатор. Поиск объекта в справочнике\" со следующими настройками:\nВ настройках указывается наименование трансформатора и при необходимости порядок его запуска. Далее выбирается вид поиска \"Поиск по атрибутам (составной ключ)\".\nВ соответствующих параметрах указываются тип объектов \"Паспортные данные\", в котором будет осуществляться поиск объекта по\nранее\nсозданному в данном типе ключу \"Ключ по серии и номеру\". После чего настраивается связь элементов динамической структуры, содержащих поисковые значения, с атрибутами составного ключа.\nДалее необходимо в параметре \"Атрибут с необходимым значением\" выбрать атрибут, значение которого необходимо получить из найденного объекта, в данном случае это атрибут \"Код\". После чего в параметре \"Коллекция выходных данных\" указывается элемент динамической структуры, в который будет передано найденное значение атрибута.\nВ результате произведенных настроек в элемент динамической структуры \"passport_id\" будет записан код объекта, серия и номер паспортных данных которого – 5711 и 756000.",
  "source": "https://docs.greendata.ru/platform/ru/etl-transformer-searching-for-object-in-registry.html"
}