{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.466.13 of September 17, 2025\nNew features\nFor\nOn-Premise\nand\nPrivate Cloud\nsolutions, it is now possible to install a new application version directly from the \"Platform updates\" modal window by clicking the\nbutton in the navigation panel.\nWhen switching to the compact view of the\nmain menu\n, the company logo will change to the favicon, and if absent, will be adapted to its size.\nIt is now possible to change the\nparent type\nif there are no objects of the customized object type and no links with other objects.\nWhen working with the\nsubject area\n, it is now possible to delete association relations between System objects.\nIn addition, a\nbutton appeared for quick access to the object registry of the selected type.\nThe\nescapeJsonMbcs\nand\nunescapeJsonMbcs\nfunctions were implemented for escaping string characters into JSON format and extracting text from a JSON-formatted string, respectively.\nThe\nrenameLdapEntry\nfunction was implemented to rename the existing entry in the Microsoft Active Directory directory service.\nThe function to run an algorithm by object and the setting for recalculation of expression/auto-calculation for all type instances can now be added to an\nupdate\n.\nAccess control for the\nwebhook plugin of external chats\nis now managed via the corresponding\npermission\n.\nThe ability to\nauthenticate using the AppRole\nmethod when storing secret variables in Vault was implemented.\nThe method of receiving updates from the Telegram server for chatbot operation can now be configured via the\nconfiguration file parameter\n.\nThe\nuserInfoUrl\nparameter in the OAuth2 setup is now optional: if it is not specified, the custom data from the accessToken will be used.\nAs part of the new terminology introduction, the concept of \"Printed Form\" was replaced with \"Document Template\".\nWhen working with a document generated from a template, it is now possible to switch between edits without accepting or rejecting them.\nChanges and improvements\nThe generation of the\nsubstitution\nnotification sent by email was adjusted in accordance with the employee’s locale.\nWhen creating an\nauto-calculation\n, both its own attributes and attributes of the\nparent object type\nare now available in the \"Attribute with object list\" parameter.\nFor an object attribute with the\n\"Multiple objects as a table\"\nvisual, the tooltip text \"Remove from the list of attribute values\" is now fixed for the\nbutton, regardless of the\nbutton settings in the registry\n.\nSaving an object was restored when the configured\nrestriction\nconditions are violated.\nWhen deleting an object from the\nsubject-area\nusing the\nDel\nkey, it is now possible to choose the deletion method.\nAn automatic generation of field names for tables when creating an associative relation between types in the\nsubject-area\nwas debugged.\nIn the modal window of\nattribute settings\nfor the \"String\" and \"Text\" types, the parameter responsible for defining the maximum value length was renamed to \"Character count\".\nData filtering in the child attribute registry was adjusted.\nFor attributes of \"Date\" type with the\n\"Calendar change with hierarchy, with type dynamics restriction by another object\"\nvisual, the filter operation in the registry was adjusted.\nInstance filtering in the registry using an SQL-based filter was stabilized.\nThe operation of search filters in the registry was debugged.\nThe opening of the registry with configured filtering was stabilized.\nFor a nested group of attributes, the color scheme configuration was adjusted.\nThe tooltip display was corrected when\nchanging the user password\n.\nThe grammatical forms in the\nmultiselect attributes\nvalues were corrected.\nThe inheritance of visuals from the\nparent object type\nto child types was adjusted.\nFor the\n\"Attribute Group\"\nvisual grouping element, label text longer than 3 characters is automatically shortened.\nThe display of the registry embedded using a\nframe\nwas debugged.\nThe operation of the\nuser input saving\noption was stabilized when closing an unsaved object.\nFor the\n\"Quick Access Toolbar\"\nwidget, a placeholder was added that will be displayed when no search results are found.\nThe proportion saving of the\n\"Horizontal Registry\"\nwidget was adjusted depending on the number of displayed objects and the width of the container.\nIn the\n\"Text Message\"\nwidget, working with hyperlinks was adjusted.\nThe naming algorithm in the\n\"Tabs Management\"\nwidget was adjusted.\nThe color determination algorithm for the\n\"Voting Status and Results\"\nwidget was stabilized.\nAccess permissions required for configuring the\n\"Rating\"\nwidget were added to the default package.\nWhen working with the\n\"Financial statements\"\nwidget, the report generation process was stabilized, taking into account the reporting form’s dynamic type.\nFor\nSQL-based data sources\n, support for Cyrillic in column aliases was added.\nTo improve compactness of display, the\naction\nnames were changed:\nSuspend regulatory term → Suspend;\nResume regulatory term → Resume.\nThe operation of the\ncustom action\nfor invoking an algorithm with saving of the current object was debugged.\nThe algorithm launch using the\nschedule\nwas stabilized.\nThe batch action for attaching/detaching files to a \"File\" type attribute was debugged.\nThe operation of the\nredefined action for the \"OK\" button\nwas stabilized.\nThe operation of the\nitab\nfunction was adjusted.\nThe selection of individual symbols/functions/strings of algorithms and deletion of selected elements using the\nDel\nand\nBackspace\nkeys were stabilized.\nThe warning about entering Cyrillic letters similar to Latin ones was disabled.\nNow, when calling the\nsetTaskExecutor\nand\nwriteWfLog\nfunctions, dummy variables will be added to the algorithm code to simplify working with parameters.\nCopying of compiled algorithm code generated on the \"Tech. Information\" tab was adjusted.\nParsing of algorithms with an unclosed parenthesis was stabilized.\nThe error message for an empty \"user\" parameter in the\nuserHasGroup\nfunction was corrected.\nIn the algorithm editor, navigation between\nattributes\nusing the arrow keys was debugged.\nThe operation of the\nsecretVariable\nfunction was stabilized.\nThe behavior of the\ncondition tree\nwhen working with object attribute values was fixed.\nLogging of errors of asynchronously launched ETL processes was added.\nThe launch of the ETL process using the algorithm was debugged.\nThe system behavior when\nterminating one of the user’s sessions\nwas improved.\nThe ability to customize the frequency of audit normalization was added.\nAudit saving was accelerated.\nA number of security improvements was implemented in the System.\nThe connection parameters to speech recognition services are now specified in the\napplication configuration file\n.\nIn the\nconfiguration file\n, the parameter for managing\nuser\ndata synchronization with an external provider during\ndomain authentication via LDAP\nwas repositioned.\nThe process of locking/unlocking users based on data received from Microsoft Active Directory was adjusted.\nSwitching between tabs in a document was stabilized when the system setting\n\"Display change indication in the object\"\nis active.\nThe ability to preview files containing comments and/or corrections added in a third-party program was adjusted.\nCollaborative work with a document generated from a template was stabilized when adding a section break.\nWorking with a document when adding/removing images in table cells was adjusted.\nThe hotkeys\nCtrl+F\nfor text search in a document was enabled.\nThe acceptance of edits made by other user when deleting text with a comment was adjusted.\nEditing of headers and footers in an EDoc document was adjusted.",
  "source": "https://docs.greendata.ru/platform/en/LTS.466.13-latest.html"
}