{
  "title": "Main menu settings",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nMain menu settings\nThe configuration of the composition and order of\nmain menu\nitems can be set by an administrator through the side menu.\nEach user can personalize the\ndisplay\nof configured items according to their needs.\nMenu Settings\nManaging the main menu items is available in the\nmenu customization mode\n, accessed by clicking the\nbutton located at the bottom of the panel.\nIf the user has the \"Run\"\npermission\nfor \"Configuring the side menu\", they can edit the\ncontent\nand the\norder\nof the menu items for all users, as well as control the visibility of items for their personal needs.\nA user without the mentioned permission in menu settings mode can only configure the\nvisibility\nof menu items.\nCreating a menu item\nA menu item can be created by clicking the corresponding button, which will display a modal window, where the user can select the new menu item type according to the data to which quick access is required:\nFAQ\n- displaying the frequently asked questions registry;\nWidget\n- displaying a widget in the main menu (for more details, see\n\"Setting up a widget in the main menu\"\n);\nDashboard\n- configured\ndashboard\n;\nKanban board\n- configured\nkanban board\n;\nObject profile\n- displaying the visual of a specific object;\nReport\n- displaying a reported form;\nFolder\n- a menu item representing a top-level name. This setting is not a full-fledged menu item and is used to reveal a lower-level list;\nCustom form\n- displaying a custom visual defined by the object ID;\nRegistry\n-\nobject registry\nof the specified type.\nCreating menu items is available to users with the\npermission\nto create instances of the corresponding object type.\nAfter selecting the type, the corresponding configuration parameters should be specified:\nSetting\nPurpose\nMain\nName\nInputting a menu item name to be displayed in the navigation panel.\nIdentifier\nInputting an attribute identifier (the name of the field for the database table). The field can be filled in automatically.\nOrder\nDetermining an ordinal number of the created menu item. If a parent item is specified, the order will be set within the subsection. The field can be filled in automatically.\nIcon\nSelecting an icon for the configured menu item from the dropdown list. Some options can be viewed on the\n\"Menu settings icons\"\npage.\nExpanded by default\nLogical attribute defining the menu item representation.\nParent menu item\nSelecting a parent menu item. This means the configured menu item will be a subitem (subsection) for the parent menu item.\nReport form\nSelecting a report form to be displayed. After selecting the configured menu item, the System will display the selected type of report form.\nThis setting is available when the \"Report\" menu item type is selected.\nDashboard\nDefining a dashboard to be displayed. After selecting the configured menu item, the System will display the specified dashboard.\nThis setting is available when the \"Dashboard\" menu item type is selected.\nObject type for display\nDefining an object type to be displayed. After selecting the configured menu item, the System will display a registry of objects of the selected type.\nThe full list of types in the parameter’s drop-down list becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nThis setting is available when the \"Registry\" or the \"Object\" menu item type is selected, and the \"Manual\" option is set for object definition.\nRegistry\nSelecting\nbasic registry\nof the object type specified above (for more details, see\n“Visual”\n).\nIf the field is filled in and the user has\npermissions\nto the specified basic registry, then:\nif the user has selected a different\nbasic registry\nor a child of it by default, the basic registry specified in the “Registry” field will be displayed;\nif the user has selected\ncustom registry\nby default, a child of the one specified in the “Registry” field - the default custom registry will be displayed.\nIf the user does not have\npermissions\nto the basic registry specified in the “Registry” field or the “Registry” field is not filled in, the default registry will be displayed.\nThis setting is available when the \"Registry\" menu item type is selected.\nDefine object\nSelecting a method of object definition. Possible options:\nAlgorithm;\nManually.\nThis setting is available when the \"Object\" menu item type is selected.\nObject type instance\nDefining an instance of the selected object type for display.\nThis setting is available when the \"Object\" menu item type is selected, and the \"Manually\" option is set for object definition.\nObject type visual\nDefining a visual for the selected object type instance.\nThis setting is available when the \"Object\" menu item type is selected, and the \"Manually\" option is set for object definition.\nObject detection algorithm\nDefining an algorithm for assigning the object to be displayed. The algorithm must return an object (reference value); for this,\nreturn\nand\ndict\nfunctions are used.\nThis setting is available when the \"Object\" menu item type is selected, and the \"Algorithm\" option is set for object definition.\nAlgorithm to determine visual\nDefining an algorithm for configuring the visual (find more details in\n\"Visual by algorithm\"\n).\nThis setting is available when the \"Object\" menu item type is selected, and the \"Algorithm\" option is ser for object definition.\nWidget\nSelecting a widget. Possible options:\nText\n;\nExternal frame\nThis setting is available when the \"Widget\" menu item type is selected.\nKanban board\nDefining a\nKanban board\nfor display.\nThe selection is made via a dropdown list. Creating a new Kanban board or editing the selected one is possible through the action menu of the parameter.\nThis setting is available when the \"Kanban board\" menu item type is selected.\nAdditional\nModule ID\nIdentifying an object the profile of which must be displayed in the main menu.\nEditing the menu composition\nWhen hovering the cursor over a menu item, the following options are available:\nModifying an item by clicking the\nbutton followed by selecting an action:\nEdit – similar to creating a new item, the item configuration parameters will be displayed in the current window;\nHide/Show for myself – configuring the\nvisibility\nof the menu item (applies only to the user performing the configuration);\nDelete – removing the item from the main menu;\nWhen selecting an action, a modal window will open to choose the deletion method or cancel the action.\nManaging the order of menu item placement, including nesting, by clicking\nand dragging (Drag&Drop) the item:\nHiding and restoring visibility of menu items by dragging between the main section and the \"Hidden Menu Items\" section using Drag&Drop is not supported.\nThe visibility of items in users' main menus is controlled by the \"Read\" permission for each item.\nAccess to the content of a menu item is determined by the presence of appropriate permissions.\nItem Visibility\nEach user can manage the visibility of the main menu composition\nconfigured\nby the administrator.\nTo do this, navigate to customization mode by clicking the\nbutton, after which hovering the mouse cursor over a menu item will reveal the hide option\n.\nHiding a selected menu item also hides all its nested items.\nWhen hidden, the item is moved from the main menu composition to the \"Hidden menu items\" section, where visibility restoration is available by clicking the\nicon.\nThe \"Hidden Menu Items\" section is displayed only in edit mode if there is at least one hidden item.\nClicking the\nbutton located next to the\nmenu view\nselection buttons allows resetting the menu display to the administrator’s configuration.\nClicking the button opens a modal window to confirm the action.",
  "source": "https://docs.greendata.ru/platform/en/main-menu-settings.html"
}