{
  "title": "Опции атрибутов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОпции атрибутов\nЛюбой атрибут типа может быть отображен или скрыт на визуале объекта.\nРазмещение атрибута в карточке объекта осуществляется в режиме редактирования\nвизуала\n. На панели \"Элементы\" необходимо перейти на вкладку \"Атрибуты\" и перетащить (Drag&Drop) атрибут в рабочую область карточки.\nДля быстрого поиска необходимого атрибута используется поле\n.\nПеремещение атрибутов между областями группировки осуществляется посредством перетаскивания (Drag&Drop).\nВ режиме редактирования визуала отображается наименование и идентификатор атрибута (в режиме просмотра карточки объекта – только\nнаименование атрибута\n).\nНаименование атрибута, отображаемое на визуале объекта, может быть изменено. Для этого следует кликнуть по наименованию атрибута на визуале, после чего – указать необходимое значение. Также наименование атрибута можно настроить при помощи опции\n.\nНастройка опций атрибутов\nФормирование набора опций атрибута осуществляется с помощью кнопки\n, расположенной справа от наименования атрибута. Перечень возможных опций зависит от типа атрибута (подробнее в статье\n\"Атрибуты\"\n).\nОсновными опциями при работе с атрибутами являются:\nРабота с атрибутом\nОпция\nНазначение\nУдаление атрибута с карточки объекта.\nПеремещение атрибута на позицию вверх/вниз.\nОпределение условия видимости атрибута (задается\nалгоритмом\n).\nНастройка наименования атрибута.\nСпособ отображения наименования атрибута: слева от значения или над значением.\nСкрывать наименование атрибута.\nОпределение цвета наименования (заголовка) атрибута (задается\nалгоритмом\n).\nОпределение условия отображения предупреждения (динамическое предупреждение; задается\nалгоритмом\n).\nОпределение условия блокировки атрибута (задается\nалгоритмом\n).\nОпределение возможности переноса текста в строке наименования атрибута (не значения атрибута).\nОпределение условия (алгоритма) обязательности поля на визуале. Используется в случае настройки обязательности полей при разных видах карточек. Например, для \"карточек кредита\" вида \"Овердрафт\" поле \"Лимит выдачи\" является обязательным; для карточек иных видов – не заполняется.\nОпределение возможности ввода комментария.\nОпределение идентификатора визуального элемента. Чаще всего используется при работе с одним атрибутом, отображенным в карточке два и более раза. Заданный идентификатор используется в алгоритмах настройки визуала.\nДобавление текста плейсхолдера в поле атрибута.\nРабота с комментарием атрибута\nОпция\nНазначение\nОпределение алгоритма блокировки комментария атрибута. Комментирование доступно, в том числе при блокировке самого атрибута.\nНастройка доступна в случае выбора любого значения параметра \"Ввод комментария к значению атрибута\"\nатрибута в типе объекта\n. Работа с комментарием отобразится пиктограммой\nу атрибута.\nЕсли\nалгоритм блокировки комментария\nне указан, то учитывается и применяется\nалгоритм блокировки атрибута\n. При этом в приоритете права на редактирования всего объекта: если разрешено только чтение объекта, то ввод комментария невозможен в любом случае.\nОпределение места расположения комментария относительно атрибута. В случае выбора настройки, комментарий отображается\nпод атрибутом\n.\nОпределение способа отображения комментария в случае его расположения ''\nпод\nкомментируемым атрибутом'' при активной опции\n.\nРабота со значением атрибута\nОпция\nНазначение\nНастройка отображения атрибута. При выборе опции откроется модальное окно с параметрами настройки:\nполужирного и наклонного начертаний текста;\nцвета текста и фона;\nпреобразования текста в прописные/строчные символы;\nвыравнивания текста по центру, левому или правому краю;\nпрозрачности фона — плотность цвета фона, которая определяется числовым значением от 0 до 100, где:\n0 — полная прозрачность;\n100 — сплошной цвет;\nотображения стилизации в режиме \"Только для чтения\" — при активной настройке стилизация подсветки будет применяться для заблокированного атрибута.\nПо умолчанию стилизация к заблокированному атрибуту не применяется.\nОпределение условий фильтрации.\nОтображение значения гиперссылкой. Например, наименование контрагента может являться гиперссылкой и открывать карточку Клиента.\nОпределение отображения действия для удаления значения атрибута.\nОчистка визуальных опций.\nОпределение возможности изменять размер поля для пользователя (для текстовых атрибутов).\nРазрешение отображения значения атрибута в несколько строк (многострочное отображение).\nРабота с объектным атрибутом\nОпция\nНазначение\nСохранение иерархии отображения данных.\nОтображение кнопки для добавления объекта. Кнопка активна для атрибута типа multiselect.\nОтображение кнопки редактирования объекта.\nИспользование данной опции для атрибута\n\"Временный результат расчета (UUID)\"\nопределяет видимость кнопки \"Рассчитать\".\nОтображение кнопки для открытия объекта.\nОтображение кнопки для выбора объекта посредством\nвсплывающего диалогового окна\n.\nОпределение отображения действия для открытия реестра объектов в модальном окне.\nОпределение отображения действия для открытия реестра объектов в новой вкладке.\nИспользование данной опции для атрибута\n\"Временный результат расчета (UUID)\"\nопределяет видимость кнопки \"Экспортировать расчет\".\nОпределение отображения\nкнопки настройки реестра\n.\nНастройка способа и возможности открытия объектов в дочерних атрибутах по двойному клику мыши (настройка DoubleClick).\nПри нажатии на пиктограмму откроется модальное окно, в котором:\nдля определения\nспособа открытия объекта\nпо двойному клику следует в поле \"Открыть\" выбрать из выпадающего списка необходимый вариант;\nПодробнее\nВозможные значения:\nПо умолчанию – способ открытия объектов, указанный в пункте\n\"Настройки оформления реестра\"\nменю профиля пользователя;\nВ модальном окне;\nВ новой вкладке;\nВ этом окне.\nдля\nблокировки открытия объекта\nпо двойному клику следует активировать параметр \"Блокировать DoubleClick\" и задать\nалгоритм блокировки\n, результатом которого является:\ntrue – запрет на открытие объекта из реестра (в том числе запрет работы в\nрежиме редактирования реестра\n);\nfalse – открытие объекта из реестра доступно.\nПодробнее\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, редактирование выбранного алгоритма возможно через меню действий параметра. Для создания нового алгоритма блокировки необходимо нажать на одноименную кнопку рядом с полем.\nПри активной опции \"Алгоритмы, привязанные к визуалу\" выпадающий список будут содержать только алгоритмы, используемые на текущем визуале.\nУдаление алгоритма, определяющего запрет открытия экземпляров дочернего объекта по двойному клику мыши. Кнопка активна в случае ввода алгоритма для запрета открытия экземпляров\n.\nОпределение возможности удаления файла для пользователя (при работе с прикрепляемыми файлами).\nОтображение кнопки \"Загрузить файлы\" (при работе с прикрепляемыми файлами).\nОпределяет отображение значений иерархического списка (то есть конечные экземпляры, включая иерархию (папки)) объектного атрибута. Соответственно, после настройки атрибута в раскрывающемся списке в карточке объекта, Система отобразит только значения, удовлетворяющие заданной фильтрации.\nОпределение возможности выбора родительского значения объектного атрибута вида \"Иерархический список\". При этом отображение всех значений атрибута представлено списком.\nЗакрепление необходимого для отображения\nвизуала\nобъектного атрибута.\nДля атрибута с визуалом\n\"Множественные файлы в виде таблицы\"\nопция используется для выбора и закрепления реестра.\nДля корректной работы следует использовать \"Плоский реестр\" или\n\"Реестр с иерархией\"\n.\nРазрешение редактирования объектных атрибутов без открытия карточки объекта (в текущей таблице).\nОпределение порядка сохранения данных дочерних и мультиселект атрибутов. В случае выключенной настройки сохранение карточки объекта происходит сразу после снятия курсора с поля ввода (одного дочернего или мультиселект атрибута). В случае включенной настройки сохранение данных дочерних и мультиселект атрибутов выполнятся только в момент явного сохранения родительской/ текущей карточки объекта.\nИспользование данной опции для атрибута\n\"Временный результат расчета (UUID)\"\nопределяет видимость кнопки \"Рассчитать и сохранить\".\nОпределение содержимого модального окна при отображении\nлокального атрибута\n. В настройке задается измерение для модального окна, которое определяется\nтипом \"Измерение: источник\"\n. В экземпляре этого типа настраиваются поля, блоки, необходимые сортировки и индексы.\nОтображение количества экземпляров сингл-/мультиселект/дочернего атрибута в табличном представлении.\nПо умолчанию признак не активен.\nПосле выбора признака в правом нижнем углу таблицы отобразится числовое значение – количество экземпляров атрибута. При подсчете количества элементов таблицы учитывается фильтрация экземпляров реестра.\nОтображение столбца подписей файлов в атрибуте\n\"Исходящие документы\"\n.\nПри этом дополнительные функциональные возможности пользователя будут вынесены к отображению в наименование атрибута (в режиме редактирования визуала).\nУстановка фокуса на первой строке при отображении дочернего атрибута в табличном представлении.\nПо умолчанию признак активен.\nАвтоматическое определение классификаций, подробнее в статье\n\"Настройка классификаций прикрепленных файлов\"\n.\nОтображение кнопки экспорта.\nНабор установленных опций может:\nбыть отображен в виде ряда иконок справа от наименования атрибута (в режиме редактирования визуала):\nотвечать за отображение действий в контекстном меню действий атрибута:\nопределить возможности пользователя при работе с атрибутом \"Прикрепленные файлы\":\nрегулировать видимость кнопок атрибута, например, при настройке опций атрибута \"Временный результат расчета (UUID)\" для\nработы с карточкой расчета\n.\nФильтрация значений атрибута\nДанные в\nобъектных и дочерних\nmultiselect-атрибутах  могут фильтроваться согласно заданным условиям. Фильтрация задается посредством кнопки\n(подробнее о\nнастройке условий фильтрации\n).\nВ Системе доступна\nреализация сложной логики фильтрации данных\n. Для этого используются объекты-фильтры:\nпример настройки сложной фильтрации\n.\nНастройка пропорций заголовка и значения\nДля того чтобы настроить пропорции наименования и области для выбора/ввода значения атрибута, следует открыть свойства колонки, в которой размещен атрибут.\nВыбор соотношения определяется в параметре \"Пропорции заголовка и значения\". Доступен выбор следующих пропорций (%):\n20 / 80;\n40 / 60;\n50 / 50;\n60 / 40;\n80 / 20.\nС общими рекомендациями по конструированию экранных форм можно ознакомиться в\nстатье\n.",
  "source": "https://docs.greendata.ru/platform/ru/attribute-options.html"
}