{
  "title": "Working with a calculation profile",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nWorking with a calculation profile\nThe calculation profile allows you to calculate the methodology within the parameters specified (for more information, refer to\nCreating a calculation profile\n), such as:\nReporting date\nRelevance date\nMethodology\nThe administrator can independently configure the visualization of any type of the System object (for more information, refer to\nConfiguring the visual\n).\nThe methodology is calculated on the same tab of the profile.\nThe \"Calculation\" tab will display the stages of the calculated methodology and its calculated indicators; after the calculation, it will show the indicator values. To work with the methodology, the following commands are used:\n– to calculate the methodology without saving the output values;\n– to calculate the methodology and save the values obtained;\n– to export the calculation in XLSX format.\nButton visibility is controlled in the\nvisual\nediting mode using\nattribute options\nof the \"Temporary calculation result (UUID)\" attribute:\n— visibility of the \"Calculate\" button;\n— visibility of the \"Calculate and save\" button;\n— visibility of the \"Export calculation\" button.\nThe following features are available for the indicators calculated within the framework of the methodology:\n– expert value adjustment; a configurable capability for the indicator (for more information, refer to\nCreating and configuring calculated indicators\n). After changing the value, the button will change to\n;\n– displaying the dynamics of the indicator\n– table view of the indicator values on the calculation date\nThe calculation profile displays the formula according to which the indicator is calculated. To do this, select the value of the indicator, the System will display the formula.\nYou can return to the previous calculation using the \"Back\"\n, button, or by selecting the indicator/stage of the methodology in the address bar of the calculation.\nIf after adjusting the attributes of local objects within the calculation, you fail to save the profile (when you click the\nbutton on the calculation profile), you need to make a space in the \"Name\" field after the name of the profile, then re-save the object.",
  "source": "https://docs.greendata.ru/platform/en/working-with-a-calculation-profile.html"
}