{
  "title": "Viewing the route map",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nViewing the route map\nWhen working with a route object, the user can view its running and completed business processes.\nViewing the business process route map is available:\nclicking the\nbutton in the\ncontrol panel\n;\nselecting an instance in the object registry whose route needs to be displayed and clicking the\nbutton in the control panel;\nwhen clicking the\nbutton in the control panel of the\nroute object\nprofile;\nThe conditions for visibility and blocking of the \"Route\" button in the route object profile are regulated by the\n\"Route\" [SYS_SHOW_WAY]\naction\nsettings.\nBy default, the System uses action\npermissions\nfor the \"All Users\" group.\nThe\nbutton in the route object profile and when selecting an instance in the registry of the\nrelated\nobject type is available to user if a business process is running for the selected object and at least one of the following conditions is met:\nThe user has available items in the business process;\nThe user has the\n\"Route administration\"\nand/or\n\"View technical information for the route\"\npermissions.\non the\nroute object\nvisual.\nExample of visual settings\nWhen setting up the related object type, add the existing \"Route\" (WF_WAY_VIEW) attribute from the list of existing attributes:\nThen go to\nvisual settings\nand drag and drop the \"Route\" attribute from the \"Attributes\" tab of the \"Elements\" panel to the profile workspace.\nAfter saving the visual settings, the route will be displayed in the profile:\nThe system will display the progress of the route object with the stage name, performer, start/end time of the stage, as well as its duration:\nThe diagram shows the tasks:\n/\nicons  – completed/active processes and subprocesses;\ngreen – completed tasks.\nred – active/incomplete tasks are shown.\nIn this case, the route progress can be displayed according to the selected attributes in the upper part of the workspace:\n\"Show backlog only\" – displays only the unfinished stages of the business process;\n\"Of the whole department\" – displays the stages of the business process (the progress of the route object) within the departments;\n\"Show technical info\" – displays technical information on the route diagram, including\nservice tasks\n,\nservice operators (gateways)\n,\nintermediate events\n.\nExample of displaying technical information\nWhen the \"Show technical info\" option is enabled, the process diagram will display not only the main information but also the process start method, the initiator, and service actions:\nDisplaying technical information on the process diagram is available only to users with the\n\"Route administration\"\nand/or\n\"View technical information for the route\"\npermissions.\nClicking the stage performer will open the corresponding\nemployee profile\n, and clicking the task name will lead to the\ntask profile\n.\nClicking the process/subprocess name will display the diagram of that business process:\nThe diagram shows:\ngreen – the completed route stages;\nyellow – the\nskipped\nroute stages that failed;\nred – the active route stages.\nThe control panel contains the following buttons:\n– the button to save the diagram generated in the workspace on the user’s device in *.svg format;\n– the button for accessing the\nbusiness process diagram\nsetting.\nThe\nbutton is displayed only with the active \"Route administration\"\npermissions\n.",
  "source": "https://docs.greendata.ru/platform/en/viewing-the-route-map.html"
}