{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.431.2 от 27.09.2024\nНовые возможности\nРасширены возможности настройки\nстартовых страниц\n.\n1. Появилась возможность создания двусторонней связи между объектными атрибутами в разных типах объектов для создания отношения \"один-к-одному\".\n2. Пересчет значений атрибутов по\nвыражению или автокалькуляции\nдля всех экземпляров типа объекта производится независимо от выбранной настройки в поле \"Автоматический пересчет выражения\", также доступен пересчет системных выражений.\n1. При работе с\nаналитической панелью дашборда \"Канбан доска\"\nнастройка отображения карточки задачи стала более гибкой: расширены возможности в части настройки отображения атрибутов, доработана фильтрация.\n2. Реализована возможность отображения без фона и рамок аналитических панелей дашборда\n\"Таблица\"\n,\n\"Структурная диаграмма\"\n,\n\"Диаграмма динамики\"\n,\n\"Линейный график\"\n,\n\"Универсальный график\"\n, \"Карточка объекта\".\nУпрощен процесс настройки\nвиджета \"Финансовая отчетность\"\n, теперь диапазон дат отчетности для формирования таблицы может быть задан автоматически.\nВ аудите действий появилась возможность просмотра данных удаленных объектов.\nПоявилась возможность настройки отображения\nдополнительных атрибутов задачи\nв соответствии с заданной областью применения: для мобильного приложения или веб-версии.\nОптимизирован процесс сохранения объектов в алгоритмах, выполняемых на маршруте бизнес-процесса. Теперь на сохранение отправляются только значения атрибутов, используемые в коде алгоритма,  а не весь объект целиком.\nДоступ к значениям объектных атрибутов при отсутствии прав на них регулируется в зависимости от заданного\nрежима настройки\n.\ngreendata-core:\nrestrictions:\nobj-attr-access-mode:\nstrict\nyaml\nCopied!\nПоявилась возможность блокировки части текста документа для внесения изменений.\nТеперь отображение\nвизуала по алгоритму\nдоступно в мобильном приложении.\nИзменения и улучшения\nДоработана проверка на уникальность при создании уникального ключа.\nСтабилизирована работа Системы при попытке открыть пустой файл.\nВ реестре с множественным выбором в режиме редактирования стабилизировано сохранение значений логических атрибутов.\nСтабилизирована работа строковых фильтров при открытии реестра в модальном окне.\nСтабилизировано отображение данных в реестре в результате фильтрации и при переключении режимов чтения/редактирования.\nСтабилизирована фильтрация по датам в\nплиточном реестре\n.\nПри работе с реестрами стабилизирована регулировка ширины колонок.\nДоработано объединение данных в виртуальной колонке реестра.\nУвеличено быстродействие при работе с реестром в режиме редактирования, а также при настройке кнопок в панели управления реестра.\nСтабилизирована проверка прав доступа на редактирование логических атрибутов в режиме редактирования реестра и для работы с задачей.\nСтабилизировано отображение объектов при работе с\nвиджетом \"Реестр объектов\"\n.\nУлучшена визуализация\nвиджета \"Реакции и комментарии к объекту\"\nи усовершенствована подсказка для работы с\nвиджетом \"Финансовая отчетность\"\n.\nСтабилизировано отображение виджета\n\"Информация о сотруднике\"\n.\nПри работе с\nвиджетом \"Управление вкладками\"\nотлажено отображение счетчика.\nСтабилизировано отображение\nвиджета \"Иерархия файлов\"\nв режиме снапшота в карточке задачи бизнес-процесса.\nПри экспорте в Excel\nаналитической панели дашборда \"Таблица\"\nстабилизировано отображение столбцов.\nОтлажен процесс создания объекта посредством\nпользовательского действия (по кнопке)\n.\nСтабилизированы отображение списка задач и содержимое вкладок \"Исходящие документы\" и \"Входящие документы\" в карточке задачи.\nДоработано отображение обновленного списка активных задач при попытке удаления этапа бизнес-процесса.\nОптимизирована настройка схемы бизнес-процесса.\nОтлажен процесс очистки всех маршрутов бизнес-процесса.\nСтабилизирована работоспособность сигналов бизнес-процесса.\nПри работе с бизнес-процессами стабилизирован расчет в днях\nтаймера типа \"Относительное время\"\n.\nДля функции\ndelete\nдоработана возможность удаления объекта с использованием функции\ngetObject\n.\nУвеличено быстродействие функции\ngetPlainObject\n.\nДоработана возможность передачи переменной в качестве аргумента функции\nattrOldValue\n.\nСтабилизирована работа функции\nattr\nдля логических атрибутов.\nОтлажена работа целевой матрицы доступа и стабилизирована возможность добавления в неё группы доступа.\nОптимизирована работа с аудитом, добавлена запись о завершении сеанса, а процесс аутентификации администратора, необходимый для различных серверных процессов, теперь фиксируется только при старте приложения.\nОптимизирован процесс разбора динамической структуры при помощи ETL трансформатора \"Разбор XML\".\nСтабилизирован процесс переноса обновлений посредством guf-файлов. В частности, объекта, на визуале которого имеется фрейм с выбранными значениями атрибутов, пользовательских действий в настройке реестра, а также настройки кнопок панели управления в реестре.\nСтабилизирована возможность настройки\nшаблона уведомлений\n.\nСкрытие конфиденциальной информации, предоставляемой в логах, теперь настраивается при помощи\nфайла настройки\nсистемы логирования.\nВ модуле EDoc оптимизировано отображение текстового атрибута с визуалом \"Текст с поддержкой сложного форматирования\" печатной формы при работе с закладками, в режиме рецензирования и экспорте документа.\nВ модуле EDoc  при экспорте печатной формы в режиме сравнения версий стабилизировано отображение процентных значений, а также отображение документа при добавлении изображения. Помимо этого, отлажено открытие прикрепленного файла версии печатной формы.\nВ модуле EDoc улучшена группировка списка по экземплярам вложенных шаблонов в печатных формах.\nСтабилизировано сохранение наименования ранее созданной\nкомнаты для звонков\n.\nВ мобильном приложении GreenData отлажена работа карточки задачи бизнес-процесса при настройке дополнительных атрибутов по вариантам перехода. Кроме того, стабилизировано отображение наименования в легком реестре.\nСкорректирован визуал типа \"Связь параграфов документа и согласующих групп\" [RF_PAR_CONFORM_GROUP] и реестр типа \"Визуал\" [SYS_VISUAL].\nДля корректной работы режима полнотекстового поиска в легких и плоских реестрах, для версии PostgreSQL 12 и ниже, добавлено postgresql-расширение\n\"pg_trgm\"\n, а также созданы отсутствующие индексы \"sys_au_session\".\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.431.2\nДля war-файла:\nhttps://downloads.greendatasoft.ru/LTS/lts.431.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.431.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.431.2-latest.html"
}