{
  "title": "setMultiSelectIsReplaceValues",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nsetMultiSelectIsReplaceValues\nThe function determines how to save the value of the\nmultiselect attribute\n.\nSyntax\nsetMultiSelectIsReplaceValues\n(obj, ident, booleanValue)\nSetting\nPurpose\nobj\nAn object with a multiselect attribute.\nident\nAn identifier of the multiselect attribute.\nThe parameter can be passed as text\nattribute\n, text\nvariable\n, or\ntext\n.\nbooleanValue\nA logical parameter that determines whether to save the value in the multiselect attribute. If:\nfalse\n, objects will be added to or removed from the attribute’s value while considering objects previously saved in the database;\ntrue\n, the value of the attribute stored in the database will be overwritten - the current list of added objects will be set as the attribute’s value. Objects previously saved in the database will be removed.\nBy default, the value is set to false.\nNote\nAdding the function is done through manual input.\nTo save the attribute value in the database, use the\nsave\nfunction.\nExamples\nExample 1\nFor instance, a list of employees eligible for a bonus is gradually formed based on sales performance. As employees meet sales targets, they are added to the \"Bonuses\" attribute along with previously added employees.\nIn this case, the method of saving the value of the\nmultiselect attribute\nis determined by the\nsetMultiSelectIsReplaceValues\nfunction using the following parameters:\nFor the current object, the\nsetMultiSelectIsReplaceValues\nfunction sets the saving sign with\nfalse\nvalue for the \"Bonuses\" attribute with the \"BONUSES_ID\" identifier.\nSetting the\nfalse\nvalue for the \"booleanValue\" parameter of the\nsetMultiSelectIsReplaceValues\nfunction is advisable only if it was previously intentionally changed to\ntrue\n; otherwise, such a need is unnecessary as the default value is\nfalse\n.\nOther functions used to write this algorithm.\nUsing a\nloop\nover the collection of\nobjects\nof \"Employees\" type, the\ncondition\nis checked for each employee’s sales performance (the \"Sales\" attribute added using\nattrByVar\nis compared with the \"Sales target\" attribute added through\nattr\n).\nIf an employee meets the sales target, he is added to the value of the \"Bonuses\" attribute using the\nattr\nfunction with the \"Set value\" option.\nTo save the value of the \"Bonuses\" attribute in the database, use the\nsave\nfunction.\nAs a result of executing the algorithm, the \"Bonuses\" attribute will contain a list of outstanding employees as sales targets are achieved:\nExample 2\nImagine, the Employee of the Month is determined by the highest sales volume. Since multiple employees may have the same sales volume, a list may be formed that needs to be recorded in the \"Hall of Fame \"\nmultiselect attribute\n.\nThis list is updated monthly with new data, while the previous data is removed.\nWhen the attribute value needs to be overwritten by the added objects, use the\nsetMultiSelectIsReplaceValues\nfunction with the following parameters:\nTo ensure that the attribute values are overwritten when the algorithm is called, for the current object, the \"Hall of Fame\" attribute with the \"BEST_EMPLOYEE_ID\" identifier is set with the\nsetMultiSelectIsReplaceValues\nfunction and the\ntrue\nvalue.\nOther functions used to write this algorithm.\nNew variables are set using the\nvar\nfunction.\nA\nloop\nover the collection of\nobjects\nof the \"Employee\" type is used to check for a\ncondition\nto find the maximum sales volume (the \"Sales\" attribute of the \"Employee\" object inserted into the algorithm code using the\nattrByVar\nfunction).\nSince only one value can be stored in the \"Hall of Fame\" attribute subsequently, a collection of \"employeeList\" objects needs to be created.\nThis collection, through a\nloop\nover the collection of\nobjects\nof the \"Employee\" type, will be filled with employees with the maximum sales volume.\nOnce the value of the \"Hall of Fame\" attribute is set to the obtained collection of \"employeeList\" objects, use the\nsave\nfunction to save it to the\ncurrent object\n.",
  "source": "https://docs.greendata.ru/platform/en/setmultiselectisreplacevalues.html"
}