{
  "title": "\"Map point\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Map point\" widget\nThe \"Map point\" widget\nis a tool that allows users to add a map inside of an object profile. It is used to show objects on the map with the ability to place points (further referred to as placemarks) on the specified address or specified coordinates.\nExample of a configured widget\n:\nIn order to fully implement the functionality of the widget, the\nattribute\ncomposition of the object type or its parent type should contain:\n\"String\" type attribute for entering/displaying the address;\nnumeric type attribute for entering/displaying the latitude;\nnumeric type attribute for entering/displaying the longitude;\nThe widget is added to the object profile in the editing mode of the\nvisual of an instance\n. Drag-and-drop the \"Map point\" widget from the \"Widgets\" tab of the \"Elements\" window to the working area.\nThe widget can be dragged only into the \"Row\" grouping element that can be found in the \"Groupings\" tab of the \"Elements\" window.\nSettings\nClick \"Settings\" to start the widget configuration.\nA modal window opens in which the following settings are available:\nSetting\nPurpose\nHeight, px\nSets the height of the widget in the profile.\nThe numeric value is entered in the range from 150 to 1500.\nReading mode\nWhen the switch is in active position, moving the placemark on the map via the mouse cursor will be disabled. Changing the placemark position will be possible through latitude, longitude and address parameters\nLatitude, degrees\nSelecting a numeric type attribute that displays the value of the geographical coordinate that determines the position of the placemark on the map in the North-South direction.\nLongitude, degrees\nSelecting a numeric type attribute that displays the value of the geographical coordinate that determines the position of the placemark on the map in the West-East direction.\nType of map\nSelecting the map display type from the following options:\n1. Google;\n2. OpenStreetMap.\nAPI key\nThe field for entering API keys required to work with \"Google\" maps. Keys are not required for the \"OpenStreetMap\" map type, its fields are displayed in an encrypted form.\nMarker image\nThe image for the placemark can be selected via the list or added manually. To add an image, click the options button on the right side of the field, click \"Add\", select an image and click \"Open\". Acceptable file formats: jpg, png.\nAddress\nSelecting an attribute of the \"String\" type which is displaying the address of the placemark on the map.\nTo save changes, click \"OK\".\nThe display of the map and the placemark on the map depends on the selected settings, for example, when the \"OpenStreetMap\" map type is selected, the widget for the end user will be presented as shown below:\nThe map sclae is changed using:\nzoom buttons located in the lower right corner of the map;\ncomputer mouse scroll wheel;\n\"+\" and \"—\" buttons on the keyboard.\nTo determine the current location on the map, click on the corresponding button on the map.\nThe button for determining the current location is active when GreenData is granted access to location data.\nFor example, the instructions for configuring access in the Chrome browser are provided\nin the following link\n. Instructions for the Opera browser\nare here\n.\nTo move around the map, you need to click and hold the mouse cursor on the map area, and drag the cursor in the desired direction. You can also use the keyboard arrows.\nExample\nLet’s create the \"Location\"\nobject type\nwith \"Latitude\", \"Longitude\" and \"Address\" attributes.\nAfter opening the\nregistry\nof the created type, add an\ninstance of the type\nand proceed to\nsetting up the visual\n.\nDrag-and-drop type attributes and the \"Map point\" widget from the \"Elements\" panel to the workspace.\nAfter opening the widget settings, specify the corresponding attributes in the \"Longitude\", \"Latitude\" and \"Address\" fields.\nAdd a png file as a marker image (the image has no background). In this case, we will specify \"Google\" as the map type, and add the network key in the \"API key\" field.\nAfter saving the widget and visual settings, the profile will take the following form:\nThe placemark on the map can be set:\nby clicking on the area of the map;\nby entering a value in the \"Address\" field and pressing Enter;\nby specifying the coordinates of the longitude and latitude of the location in the appropriate fields, then pressing Enter.\nThe numeric value of the attribute that is passed to the \"Latitude\" setting is entered in degrees as a decimal fraction in the range from -90 to 90.\nThe numeric value of the attribute that is passed to the \"Longitude\" parameter is entered in degrees as a decimal fraction in the range from -180 to 180.\nThese methods are interrelated, i.e. when one value changes, the others automatically change as well.",
  "source": "https://docs.greendata.ru/platform/en/map-point-widget.html"
}