{
  "title": "Signal intermediate throw event",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSignal intermediate throw event\nThe \"Signal intermediate throw event\" element is a\nsignal source\nand is used for synchronizing parallel flows and exchanging information.\nThe signal source in the system is implemented by the\n\"WorkFlow. Initiator event Signal\"\ntype.\nIn the business process diagram, the signal source is represented by\n.\nSignal transmission can be configured both within elements of the same business process as well as across different business processes (subprocesses).\nTo configure the signal, the following are required:\nsignal source (intermediate event):\nsignal receiver (e.g.,\nStart Signal Event\nor\nSignal Intermediate Catch Event Handler\n).\nTo configure the signal parameters, save the business process diagram, then click the\nbutton in the stage menu: a modal window with the set of parameters for configuration will open.\nSetting\nPurpose\n\"Signal settings\" tab\nObject state\nSelecting the object state from the System directory.\nAlgorithm to define an object\nSelecting\nalgorithm\nto define the object that will receive the signal.\nIf no algorithm is specified, the signal handler will search for all objects with active processes.\nSignal\nDefining the relation with the\nhandler\nfor signal transmission configuration.\nThe source and signal handler are matched according to the value specified in the \"Signal\" field. If no values are provided in this field,\nthe element names in the diagram must be identical\n.\nActs within a process instance\nBoolean parameter that restricts signal distribution outside the process instance:\nwhen the switch is active, signal handling occurs within this diagram (the source and receiver must be in the same business process diagram);\nwhen the switch is inactive, signal handling occurs in multiple diagrams (source and receiver can be in different business processes).\n\"Service information\" tab\nIdentifier\nDisplaying the element identifier.\nThis parameter is defined by the System.\nEvent type\nDisplaying the event type name of the element.\nThis parameter is defined by the System.\nLast modified by (employee)\nSystem employee who made the last changes to the element configuration.\nThis parameter is defined by the System.\nProcess\nDisplaying the business process name in which the element is used.\nThis parameter is defined by the System.\nProcess stage\nDisplaying the business process stage name.\nThis parameter is defined by the System.\nLast modified date\nDate when the last changes were made to the element configuration.\nThis parameter is defined by the System.",
  "source": "https://docs.greendata.ru/platform/en/signal-intermediate-throw-event.html"
}