{
  "title": "Deadlines directory",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nDeadlines directory\nSome tasks may be limited in time during the business process (\nBP\n). To control the time limit for completing tasks, you need to specify the\ndeadlines\n.\nDeadlines\ndefine rules to control time limits to complete tasks in the business process.\nTo set a deadline, you need to:\n1. Select the following items in the navigation menu: WorkFlow → Deadlines. The System will display the\ntype registry \"WorkFlow. Deadline\"\n.\n2. Add a custom deadline by clicking the\nbutton. The System will display a profile \"WorkFlow. Deadline\".\nThe visual profile of\nany object type of the System\ncan be configured by the administrator independently (for more information, refer to\nConfiguring the visual\n).\n3. To specify deadlines, you need to set the following:\nSpecify the setting name\nSpecify the relations of this deadline with the object type in the context of which it will be applied (\nthe \"Relations with object types\" block of fields\n)\nSet the conditions that will be used to define how the deadline will be applied to the process (\nthe \"Deadline countdown conditions\" block of fields\n)\nSpecify the time limit for sending notifications about the approach of the deadline (\nthe \"Configuring notification sending\" block of fields\n)\nThese blocks are described below.\n4. Save the data entered by clicking\nor\nin the custom object instance profile.\nThe deadline has been set.\nTo work with deadlines, actions are used (\nboth planned and actual time is taken into account\n):\n— The action recalculates information in the instance of\n\"WorkFlow. Deadline instance\"\n— Recalculation of deadline for the route object Recalculation of deadline is performed for a specific route object specified in the settings. Recalculation of deadlines is performed for the object types (associated with the route object specified):\n\"\nWorkFlow. Deadline instance\n\"\n\"\nWorkFlow. Deadline\n\"\nThe \"Relations with object types\" block of fields\nThe\n\"Relations with object types\"\nblock of fields binds the deadline settings to the object type. The same deadline may be applied to several object types at the same time.\nTo create a relation, click\nbutton in the \"\nRelations with object types\n\"table. The System will display a form where you need to specify:\nSetting\nPurpose\nName\nEntering the name of the relation of the deadline and the object type.\nDeadline\nDisplaying the setting name (object type instance \"WorkFlow. Deadline\").\nSystem object type directory\nSelecting the object type from the drop-down list that you want to set up a deadline for.\nAlgorithm to define a relation with the parent object\nSelecting an algorithm to define a relation with the predefined parent object. Learn more about\nalgorithms\n. It is usually used to calculate the technical deadline for all related processes.\nThe \"\nCount as one deadline for all related processes\n\" option allows you to take into account the\ntechnical deadline\n, within which the working time spent on processes started by different BP instances and for different objects is calculated. Possible values:\nYes – time spent is calculated:\nfor the current object (the deadline for which is configured) and related objects that are identified by the\nAlgorithm to define the relation with the parent object\n.\nby the processes specified in the settings (the \"\nDeadline countdown conditions\n\" block of fields of the current profile).\nNo – the time spent is calculated within the process instance (used by default).\nAt the same time, taking into account the deadline for all related processes assumes that there are no calculations of parallel deadlines. If multiple BP instances are generated, a single deadline calculation will be carried out for all related processes. If the\nAlgorithm to define the relation with the parent object\noperated with an error or failed, the deadline is not calculated.\nThe \"Deadline\" and \"Configuring notification sending\" blocks of fields\nThe\n\"Deadline\"\nand\n\"Configuring notification sending\"\noptions contain the following fields:\nDeadline type / Type of notification period\nSelect the deadline type / type of notification period from the directory.\nPossible values:\nCalculated deadline in minutes – calculated based on the calendar settings and working hours. The number that the algorithm returns (the \"Algorithm for calculated deadline\" attribute) will be equal to the number of minutes.\nCalculated deadline in hours – calculated based on the calendar settings and working hours. The number that the algorithm returns (the \"Algorithm for calculated deadline\" attribute) will be equal to the number of hours.\nCalculated deadline in days – calculated without reference to calendars or business days. The number that the algorithm returns (the \"Algorithm for calculated deadline\" attribute) will be equal to the number of days.\nCalculated deadline in business days – calculated based on the calendar settings and working hours. The number that the algorithm returns (the \"Algorithm for calculated deadline\" attribute) will be equal to the number of business days.\nWhen selecting calculated types, select a pre-defined algorithm in the \"Algorithm for calculated deadline\" field to define the final value of the deadline.\nFixed deadline in minutes – calculated based on the calendar settings and working hours. The number specified in the \"Due date\" field will be equal to the number of minutes.\nFixed deadline in hours – calculated based on the calendar settings and working hours. The number specified in the \"Due date\" field will be equal to the number of hours.\nFixed deadline in days – calculated without reference to calendars and working hours. The number specified in the \"Due date\" field will be equal to the number of days.\nFixed deadline in working hours – calculated based on the calendar settings and working hours. The number specified in the \"Due date\" field will be equal to the number of business days.\nIf you select this type, you need to enter a value for the deadline in the \"Due date\" field.\nSetting\nPurpose\nDue date/Notification period\nEnter the number of time units for a fixed definition of the deadline.\nCalculated period algorithm\nChoose the pre-defined algorithm in case of setting the calculated deadline. Learn more about\nalgorithms\n.\nAlgorithm to calculate the notification period\nChoose the pre-defined algorithm to calculate the period of sending the notification. Learn more about\nalgorithms\n.\nTechnical deadline\nSpecify a boolean attribute that defines the purpose of the deadline. Possible options:\nNo – the deadline is configured for users and will be calculated based on related objects; however, you can configure notifications for the user about the approach and delay of the deadline. This is a default value.\nYes – the deadline is set for technical purposes (for example, for reporting or routes monitoring). In this configuration, fixed deadlines are not set, notifications about the approach or end of the deadline are not sent.\nObject type to be initiated\nSpecify the object type of the deadline instance created. At the same time:\nThis field specifies the type\n\"WorkFlow. Deadline instance\" [WF_NORMATIVE_INSTANCE]\nor its child types.\nIf this field is not filled in, a deadline instance will be created using the type\n\"WorkFlow. Deadline instance\"\n[WF_NORMATIVE_INSTANCE].\nThe technical deadline_ sets the time for completing a task so that data can be displayed in reports. The System functions to work with such deadlines are limited. The technical deadline does not fix the deadline for completing the task. Therefore, when searching for a deadline to suspend/resume, only non-technical deadlines are calculated.\nThe \"Deadline countdown conditions\" block of fields\nThe\n\"Deadline countdown conditions\"\nblock of fields contains the following subgroups of defined data:\nProcesses\n– select the business process (s) (BP) that will start the deadline for task completion for the object. The BP execution time is the end of the deadline. If you need to exclude the time spent for some specific BP stages from the deadline, specify these stages in the table \"Process stage to exclude\" of the Stages block;\nStages (stages of the business process) – select the stage(s) at which the deadline will/will not be counted\nThe specified setting will be transmitted to the corresponding BP stage (\nTask\n, \"Due date\" field);\nAccess groups – select a user group/role to specify the deadline. In this case, the deadline will apply to all BP stages where this user group/role is specified as responsible;\nStatuses.\nWhen working with BP stages and/or access groups, you need to specify the business processes that use these stages and access groups in setting up the deadline calculation conditions.",
  "source": "https://docs.greendata.ru/platform/en/deadlines-directory.html"
}