{
  "title": "Этапы настройки печатных форм",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЭтапы настройки печатных форм\nСтатья предполагает предварительное знакомство читателя с обзорной публикацией\nЭлектронные документы\n.\nВ рамках настоящей статьи рассматривается принцип последовательной поэтапной настройки электронного документа в Системе. Статья НЕ описывает варианты использования опций и различных дополнительных настроек (их множество), а демонстрирует именно принципиальную ЦЕПОЧКУ ключевых действий по созданию и подключению электронного документа.\nЧто мы хотим сделать?\nНам\nпредстоит создать несложный электронный документ\n, выполнить его настройку и внедрить в интерфейс конечного пользователя Системы. Для этого потребуется разработать структуру шаблона, внедрить перечень закладок, создать и настроить источники данных, создать алгоритм, раздать права на объекты Системы.\nЧтобы систематизировать и упорядочить настройку мы будем сочетать обзорные сведения с прикладными действиями. Наш пример состоит из строго упорядоченных частей - цепочек практических действий, которые показаны в зеленых блоках описания.\nВ статье рассматриваются именно ключевые настройки eDoc, но кроме них в Системе существует множество дополнительных настроек, описания которых следует смотреть в специализированных статьях.\nПоэтапная настройка\nПроцесс настройки EDoc состоит из трех ключевых этапов:\nЭтап\nподготовки шаблона\n[\n1\n]\nотвечает на вопрос - \"\nКакой файл станет заготовкой электронного документа?\n\" и формирует шаблон с подходящей структурой.\nНастройка\nресурсов и режимов\nопределяет правила - \"\nКаким образом и откуда будет происходить подстановка данных и их коррекция?\n\" при формировании и работе с eDoc.\nНастройка доступности\nопределяет возможность работы с документом - \"\nКому будут выданы права на документ и какие элементы появятся в интерфейсе (UI)\n?\" для обращения к документу.\nСохранение вносимых изменений в режиме настройки шаблона печатной формы и в режиме рецензирования электронного документа осуществляется автоматически.\nИндикатор автосохранения\nотображается в правой части панели инструментов.\nВ качестве собирательного примера приведем настройку электронного документа для проекта автоматизации отеля.\nСуть проблемы Заказчика\nКлиент отеля по результатам обслуживания может оставить (анонимную и неподписанную) анкету отзыва об отеле, в которой проставляются оценки шкале 0..10 за уровень комфорта, уровень сервиса, уровень чистоты. Усредненная оценка вычисляется автоматически. На бланке отзыва может присутствовать комментарий клиента и (в некоторых случаях) пояснение персонала.\nВсе сведения сохраняются в реестр типа данных \"Оценка клиента\" [CLIENT_EVALUATION], но некоторые из регистрируемых отзывов должны распечатываться для бумажного архива (для обоснования кадровых и управленческих решений).\nСуть задачи бизнес-аналитика\nТребуется разработать электронный документ, который:\nОтображает данные в печатной форме (MS Word, формат А4) из актуальной записи \"Оценка клиента\";\nПозволяет управляющему отеля выполнять коррекцию атрибута \"пояснение персонала\" (с последующим сохранением исправленных данных в соответствующих записях таблицы \"Оценка клиента\").\nСтруктура маршрутного объекта\nДля возможности реализации примера создадим новый тип объекта \"Оценка клиента\" [CLIENT_EVALUATION] со следующим составом атрибутов:\nДата регистрации оценки (EVALUATION_REG_DATE)\nКомментарий клиента (CLIENT_COMMENT_TEXT)\nОценка уровня комфорта (COMFORT_LEVEL_VALUE)\nОценка уровня сервиса (SERVICE_LEVEL_VALUE)\nОценка уровня чистоты (CLEANLINESS_LEVEL_VALUE)\nПояснение персонала (EXPLANATION_TEXT)\nУсредненная оценка (AVERAGE_LEVEL_VALUE)\nАтрибут \"Усредненная оценка\" будет заполняться алгоритмом. Поэтому на вкладке \"Выражения\" создадим алгоритм \"Расчет средней оценки (отель)\" с установленными опциями:\nУстановить результат в атрибут\nАтрибут: Усредненная оценка (AVERAGE_LEVEL_VALUE)\nАвтоматический перерасчет выражения: При изменении атрибутов, используемых в алгоритме\nВ дальнейшем тип объекта \"Оценка клиента\" станет базовым для печатной формы, но возникнет новый вопрос о месте хранения/фиксации документа, который будет формироваться Системой.\nГде будет сохраняться сформированный документ?\nДля большинства задач предпочтительным и наиболее удобным способом хранения сгенерированных документов является карточка текущего объекта. Поэтому в режиме добавления существующего атрибута создадим в структуре типа \"Оценка клиента\" атрибут для сохранения результирующего документа в карточку.\nВ результате в перечне атрибутов типа \"Оценка клиента\" [CLIENT_EVALUATION] появится дополнительная строка:\nДля максимальной функциональности и удобства последующей работы с атрибутом \"Прикрепленные файлы\" рекомендуется настроить визуальное представление, установив значение \"Множественные файлы в виде таблицы\".\nВ дальнейшем в этот атрибут будет происходить сохранение электронного документа, который будет формироваться для каждой записи типа \"Оценка клиента\".\nТеперь можно перейти к поэтапной реализации самого электронного документа.\nЭтап 1. Подготовка шаблона\nДля ответа на вопрос - \"\nКакой файл станет заготовкой документа и какова будет структура шаблона\n?\" нужно определиться с предпочтительным форматом:\nDOCX\n- является наиболее гибким форматом и рекомендуется для всех типовых случаев реализации электронных документов. Поддерживает режимы правки в опросном листе, комментирования, согласования.\nXLSX\n- может оказаться предпочтительным для некоторых табличных документов со сложными внутренними расчетами данных (с использованием формул).\nXLSX выдается только как файл для скачивания и не поддерживает расширенные режимы (например, правку в опросном листе).\nШаг 1.1. Подготовка файла шаблона\nПредположим, что для решения задачи был выбран рекомендуемый в большинстве случаев формат DOCX.\nПоэтому с помощью актуальной версии MS Word следует создать образец (прототип) офисного документа без подстановки в него реальных данных.\nВместо данных в области подстановки целесообразно вставить декоративные обозначения (например, с помощью трех символов подчеркивания \"\n_\n\").\nДекоративные обозначения, которые в дальнейшем будут оформлены как закладки\n[\n2\n]\n, могут размещаться в любых областях документа: заголовках, области основного текста, колонтитулах, выносках и пр.\nНапример, образец бланка оценки клиента задает взаимное расположение элементов, подразумевает подстановку реальных данных в места декоративных обозначений и принимает следующий вид:\nОбласти подстановки данных в образце документа должны быть помечены закладками. Для этого декоративное значение предварительно выделяется, после чего в окне закладок выделенной области назначается индивидуальное имя. Имена закладок не могут содержать специальных и пробельных символов.\nНапример, для вставки новой закладки выделим декоративное значение в строке даты регистрации оценки, после чего в окне \"Закладка\" укажем имя закладки\nзакл_дата_рег_оценки\nи нажатием кнопки \"Добавить\", убедимся в появлении закладки.\nДействуя по аналогии, создадим все закладки образца документа:\nзакл_дата_рег_оценки;\nзакл_фио_сотрудника;\nзакл_уровень_комфорта;\nзакл_уровень_сервиса;\nзакл_уровень_чистоты;\nзакл_средняя_оценка;\nзакл_комментарий_клиента;\nзакл_пояснение_персонала;\nПо умолчанию закладки могут упорядочиваться по алфавиту. Для последовательного контроля внедряемого набора вкладок рекомендуется включить опцию \"положение\".\nВ случаях сомнений проверить точное расположение проблемной закладки в структуре документа можно с помощью кнопки \"Перейти\".\nНастоятельно рекомендуется изначально задавать наименования закладок\nмаксимально точно\n, не полагаясь на возможность уточнения имен закладок в дальнейшем.\nДело в том, что при любом изменении структуры шаблона он должен быть повторно проанализирован Системой. В этот момент неизбежно произойдет автоматическая перенумерация параграфов (ключевых текстовых областей) с потерей связи параграфов с ответственными сотрудниками и некорректной работой алгоритмов управления видимостью частями документа.\nПосле размещения в шаблоне всех закладок результат сохраняется как локальный файл формата\n.docx\nи ожидает загрузки в Систему. Сохраним полученный файл с наименованием\nБланк оценки клиента (отель).docx\nШаг 1.2. Загрузка и парсинг файла шаблона\nПодготовленный файл шаблона должен быть загружен в Систему. Для этого следует в реестре по умолчанию для типа \"Шаблон печатной формы\" [RF_PATTERN] создать новый экземпляр, заполнив ключевые атрибуты:\nНаименование шаблона;\nБазовый тип объекта;\nФайл шаблона.\nВ рамках рассматриваемого примера следует создать новую запись реестра, указав наименование \"Шаблон оценки клиента (отель)\", выбрав тип \"Оценка клиента\" и загрузив ранее подготовленный файл \"Бланк оценки клиента (отель).docx\".\nПосле сохранения новой записи необходимо убедиться, что файл шаблона успешно распознан, а в результате автоматического парсинга (разбора структуры) документа выявлены и пронумерованы параграфы. Знание нумерации параграфов в дальнейшем (при необходимости) может помочь в действиях:\nпо согласованию отдельных частей документа;\nалгоритмического управлении видимостью частей документа.\nВ нашем примере в карточке шаблона следует кнопкой \"Скачать файл\" убедится, что структура файла успешно разделена на параграфы с уникальными номерами.\nВ Системе предусмотрена возможность через интерфейс редактирования шаблона действием \"открыть шаблон\" выполнить коррекцию разметки документа и управлять настройкой закладок и алгоритмов видимости.\nДалее на вкладке \"Настройки шаблона\" требуется привязать шаблон печатной формы к типам объектов. Для этого следует создать новую запись привязки шаблона к актуальному типу объекта, а также уточнить ключевые опции прикрепления.\nВ рамках нашего примера следует создать привязку к типу \"Оценка клиента\" с установленными опциями \"Прикреплять документ EDoc к объекту автоматически\" и \"Прикреплять сформированный файл к объекту\"\nБазовые действия по подготовке шаблона завершены, но в решении специфических задач подготовки печатных форм могут потребоваться различные расширенные настройки, некоторые из которых представлены ниже.\nРасширенные возможности\nНастройка конвертации в другой формат\nВключается в случаях необходимости предоставления документа в готовом (не подлежащем случайной правке конечными пользователями) виде. В этом случае в качестве шаблона может использоваться обычная заготовка DOCX документа, но итоговым результирующим форматом документа может быть выбран формат\nPDF\n. За возможность назначения результирующего формата отвечает атрибут \"Формат\" [RF_CONVERT_TO] объекта \"Шаблон печатной формы\" [RF_PATTERN].\nПреобразования формата шаблона\nНастоятельно рекомендуется для создания шаблонов электронных документов использовать именно средства\nMS Office\n2010+. Однако в случае использования иного офисного программного обеспечения (например, LibreOffice, Open Office, Star Office), поддерживающего формат ODS (OpenDocument Spreadsheet), средствами этих пакетов могут быть разработаны шаблоны преобразованные в DOCX (действиями \"Сохранить как\"). При этом совместимость и последующая работоспособность шаблона может оказаться не полной.\nАвтонумерация и колонтитулы\nПодстановку данных в электронный документ выполняют алгоритмы. Но не всегда алгоритм знает порядковый номер своего вызова (например, алгоритм заполняющий данными структуру дочернего шаблона для подстановки данных в основной шаблон). Поэтому, чтобы не усложнять алгоритмическую логику нумерацией записей, строк, позиций, страниц, блоков, настоятельно рекомендуется использовать штатные средства сквозной нумерации MS Word.\nНе забывайте, что повторяющиеся на разных страницах протяженного документа блоки информации (символика, реквизиты, контакты, ссылки, элементы нумерации страниц и пр.) должны быть внедрены в область колонтитулов шаблона.\nПри необходимости нумерации вложенной печатной формы XLSX рекомендуем в ячейку автонумерации внести формулу \"=СТРОКА()-Число\" (без кавычек), где \"Число\" – размер шапки в основном шаблоне.\nПо итогам первого этапа нами создан и загружен в систему файл шаблона, который автоматически структурно проанализирован и упорядочен (нумерация параграфов выполнена).\nЭтап 2. Настройка ресурсов и режимов\nДействия этого этапа должны ответить на вопрос \"\nКак и откуда будет происходить подстановка данных\n?\". Если электронный документ предполагает возможность последующей коррекции или согласования, то также обязательно выполняются настройки актуальных режимов.\nШаг 2.1. Настройка ресурсов шаблона\nДля подстановки данных в экземпляр конкретного электронного документа необходимо сопоставить закладки (которые после парсинга уже выявлены в структуре шаблона) источникам данных, которые потребуется создать и настроить. При этом тип данных закладок и источников должен совпадать либо быть совместимым.\nПри работе с БОЛЬШИМ количеством закладок в документе настоятельно рекомендуется включать опцию \"Создавать источники автоматически\" (в блоке \"Файл\" шаблона печатной формы). В результате Система при загрузке файла шаблона сгенерирует перечень одноименных (для всех выявленных закладок) источников данных.\nПоследующая настройка источников данных неизбежно должна выполняться вручную. Но экономия времени на создании большого количества источников данных может быть значительной.\nИсточник данных может быть создан вручную или автоматически. При настройке источников данных потребуется (с помощью расширений) учесть их специфику получения и извлечения данных.\nПри работе с НЕБОЛЬШИМ количеством закладок, чтобы исключить неоднозначные ситуации в наименованиях различных объектов рекомендуется использовать интуитивно понятные префиксы в наименованиях связанных пар объектов \"закладка\" и \"источник\".\nТак, например, для закладки\nзакл_ИНН\nпри настройке лучше создать созвучный источник\nист_ИНН\n, избегая использования упрощенного наименования\nИНН\n(ведь так называется атрибут).\nВ рамках рассматриваемого примера в карточке шаблона оценки клиента убедимся, что все закладки (заявленные в документе формата DOCX) были распознаны и уже размещаются в разделе \"Закладки\". Однако для закладок не назначены источники данных, для создания которых нужно перейти на вкладку \"Источники данных\".\nСоздадим новый источник данных\nист_дата_рег_оценки\nи в блоке основной информации заполним \"Наименование\", \"Идентификатор\", \"Основной источник данных\", \"Печатная форма\". Далее перейдем к выбору расширения и укажем, что создается источник данных на основе атрибута. После сохранения расширения появится возможность выбрать конкретный атрибут (из базового типа печатной формы). Выберем \"Дата регистрации оценки\" и нажмем кнопку \"Ок\".\nПо аналогичной схеме, но с учетом актуального типа создадим и другие источники данных:\nист_дата_рег_оценки\n(Дата);\nист_уровень_комфорта\n(Число);\nист_уровень_сервиса\n(Число);\nист_уровень_чистоты\n(Число);\nист_средняя_оценка\n(Число);\nист_комментарий_клиента\n(Строка);\nист_пояснение_персонала\n(Строка);\nВ шаблон печатной формы необходимо подставить ФИО (достаточно имени и фамилии) сотрудника, который зарегистрировал документ. Эти данные имеются в составе атрибутов типа \"Оценка клиента\" [CLIENT_EVALUATION], так как \"Оценка клиента\" наследует от родительского типа \"Объект\" цепочечный атрибут \"Сотрудник, создавший объект\" (со ссылкой на тип \"Персональные данные\"). Поэтому данные для источника ФИО должны быть извлечены алгоритмически из цепочечного атрибута.\nНам требуется реализовать:\nист_фио_сотрудника\n(Строка);\nСоздадим этот источник на основе алгоритма (см.схему ниже). При этом придется разработать и подключить новый алгоритм \"Получить ФИО сотрудника из оценки (отель)\" с базовым типом объектов \"Оценка клиента\".\nПосле создания источников данных они должны быть назначены закладкам печатной формы. Назначение источников выполняется для каждой закладки индивидуально в режиме редактирования карточки. Подлежит заполнению атрибут \"Источник данных шаблона печатной формы\".\nВ рамках примера подключим соответствующий источник данных для закладки\nзакл_дата_рег_оценки\n. Прочие источники данных назначим закладкам аналогичным образом.\nШаг 2.2. Настройка режимов работы\nЭлектронный документ поддерживает не только подстановку и демонстрацию данных, но и предоставляет пользователям возможность коррекции данных, комментирования и согласования.\nВозможность оперативной коррекции данных поддерживается благодаря настройке опросного листа, элементы которого могут обеспечить диалоговый режим опроса и возможность коррекции данных.\nВ рамках примера реализуем возможность коррекции пояснения персонала (строковый атрибут) в опросном листе документа. Для этого требуется на вкладке \"Опросный лист\" создать новый элемент\nПояснение персонала\n, который сопоставлен типу \"Атрибут\" и источнику данных \"ист_пояснение_персонала\". При этом следует разрешить ввод в многострочную область редактирования с фиксацией изменений в исходной таблице (см.схему ниже).\nРасширенные возможности\nНастройка ответственных за части документа\nПараграфы документа (за счет ранее выполненной числовой нумерации \\{@GP_P_N}) могут индивидуально согласовываться с другими пользователями. При необходимости согласования на вкладке \"Связь параграфов и ответственных\" регистрируются записи с указанием на числовой номер параграфа и согласующие роли (группы доступа).\nАлгоритмическое управление видимостью\nВыполняется настройкой правил отображения на вкладках \"Алгоритмы видимости\" и \"Алгоритмы скрытия\" карточки печатной формы. Позволяет включать/выключать видимость отдельных фрагментов документа в зависимости от значений или условий. Поддерживает функционал фронтовых и серверных алгоритмов.\nУправление перерасчетом формул\nПрименяется в случаях присутствия в печатной форме (например, формата XLSX) расчетных выражений. Формулы могут требовать коррекции диапазонов подставляемых в шаблон и обрабатываемых ячеек. Поэтому модуль поддерживает возможность управления перерасчетами.\nПо итогам второго этапа созданы (и дополнены с помощью расширений) источники данных, которые сопоставлены закладкам, а также настроен элемент опросного листа для возможности последующей правки пояснения персонала.\nЭтап 3. Настройка доступности\nНастройка доступности отвечает на вопрос - \"\nКому будут выданы права на документ и какие элементы появятся в интерфейсе (UI)\n?\". Данные действия являются взаимодополняющими и предполагают понимание ключевых принципов\nдоступа к Системе\nи\nдоступа к объектам Системы\n.\nШаг 3.1. Выдача прав доступа к объектам\nДля пользователей административной группы весь функционал Системы доступен изначально (права на все объекты и действия выдаются автоматически), но для конечных пользователей Системы права на работу с печатными формами/электронными документами должны быть выданы отдельно.\nНе забывайте, что доступ ко всем объектам Системы должен назначаться именно через группы доступа, а не индивидуально для отдельных аккаунтов пользователей.\nДля технической возможности формирования печатной формы или электронного документа требуются:\nдоступ к типам объектов\n, из которых берутся данные (комплекс прав - настраивается для базового типа и, при необходимости, для различных типов связанных справочников);\nдоступ к экземпляру шаблона\nиз реестра \"Шаблон печатной формы\" (чтение);\nдоступ к типу\n\"Документ, сформированный по шаблону\" (комплекс прав).\nВ рамках примера требуется обеспечить доступ управляющему отелем Петрову Николаю Михайловичу (аккаунт пользователь petrov) к печатной форме \"Оценка клиента\".\nУбедившись, что пользователь petrov уже сопоставлен группе доступа \"Управляющий отелем\", в разделе \"Доступ к объектам системы\" последовательно настроим доступ для группы \"Управляющий отелем\":\nДоступ к типу объекта\n\"Оценка клиента\" (дочерних типов нет);\nДоступ к шаблону печатной формы\n\"Шаблон оценки клиента (отель)\";\nДоступ к типу\n\"Документ, сформированный по шаблону\" (чтение);\nНазначенных прав достаточно, для возможности формирования и последующей работы с печатной формой любого пользователя, входящего в группу \"Управляющий отелем\".\nШаг 3.2. Настройка элементов интерфейса\nВ стандартных пользовательских интерфейсах Системы переход к печатной форме происходит из карточки объекта или из реестра по кнопке \"\nПечатная форма\n\" (действие PRINT_FORM_ACTION) с командной панели. Соответствующая кнопка действия должна быть также сопоставлена связанным типам объектов.\nСледует учитывать, что функционал Системы способен запускать печатную форму с помощью алгоритмических действий (без использования элементов интерфейса).\nДля появления и функционирования кнопки в интерфейсе обычного пользователя (не относящегося к административной группе) необходимо разрешить доступ группе пользователя к соответствующему действию, для чего достаточно разрешить режим чтения по отношению к действию \"Печатная форма\".\nВ рамках рассмотренного примера разрешим доступ группе \"Управляющий отелем\" к действию \"Печатная форма\".\nТакже необходимо сопоставить действие \"Печатная форма\" (через связанные типы объектов) типу \"Оценка клиента\". Для этого перейдем к разделу \"Типы объектов\", к с помощью фильтра найдем тип \"Действие\", откроем реестр действий, в реестре действий с помощью фильтрации найдем элемент \"Печатная форма\". В карточке элемента \"Печатная форма\" в разделе \"Связанные типы объектов\" создадим запись сопоставления, наличие которой определяет появление кнопки \"Печатная форма\" при работе с данными типа \"Оценка клиента\".\nРасширенные возможности\nСохранение сформированного документа в карточку\nФиксация сгенерированных электронных документов происходит в едином реестре \"Документ, сформированный по шаблону\" [RF_DOCUMENT]. Но значительно удобнее фиксировать сформированный документ в карточку типа объекта. Именно так мы и поступили в примере, изначально добавив в структуру типа атрибут \"Прикрепленные файлы\" [SYS_FILE_ID].\nДоступность согласования\nВ модели электронного документа поддерживается режим согласования изменений.\nЗа\nсогласование источников данных\nотвечают элементы \"Необходимо согласование\" и \"Согласующие роли\" в карточке источника данных.\nЗа\nсогласование параграфов\nдокумента (за счет ранее выполненной числовой нумерации \\{@GP_P_N}) отвечает вкладка \"Связь параграфов и ответственных\", где регистрируются записи с указанием на числовой номер параграфа и соответствующие согласующие роли (группы доступа).\nВозможность создания новых объектов\nПри заполнении элементов опросного листа EDoc имеется возможность организовать выбор значения атрибута документа из справочника. В случае отсутствия нужного значения в справочнике, из структуры опросного листа может быть разрешено добавление нового значения в справочник.\nПо итогам третьего этапа группе доступа \"Управляющий отелем\" выданы необходимые права доступа, а также выполнена настройка кнопки действия \"Печатная форма\".\nРезультат работы\nВ результате выполненных действий в интерфейсе пользователя Петров Н.М. (группа \"Управляющий отелем\") при работе с реестром (и карточкой экземпляра) типа \"Оценка клиента\" появилась и стала функциональной кнопка \"Печатная форма\", нажатие на которую для выделенной записи распахивает (отдельное) окно работы с электронным документом. Настроенные возможности окна EDoc позволяют реализовать (см.схему ниже):\nпросмотр формы документа (на экране);\nзагрузку документа в офисном формате (скачивание в DOCX/PDF);\nраспечатку документа на принтере (в типовом формате А4);\nсохранение сформированного документа (в атрибуте \"Прикрепленные файлы\").\nОписание прочих дополнительных и расширенных возможностей работы с печатными формами смотрите в специализированных статьях раздела\n\"Модуль Электронные документы\"\n.\n1\n.\nШаблон\n– проект документа, содержащий неизменяемую часть и определение динамических полей. Шаблон определяет основную структуру документа и содержит необходимые настройки, такие как шрифты, параметры страницы, форматирование и стили.\n2\n.\nЗакладка\n– настраиваемый и переиспользуемый объект текста для транслирования данных из заявки.",
  "source": "https://docs.greendata.ru/platform/ru/edoc-set-up-stages.html"
}