{
  "title": "Data source parameters",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nData source parameters\nParameters of the\nsource\nrestrict (filter) the data it displays.\nYou can set parameters for any type of source.\nIn the case of working with the\nSQL-based data source\n, the parameters are set within the code.\nWhen working with the\nobject data source\n, you should specify the parameters on the tab\nFilter condition\n.\nLet`s consider the object source of data of customer profile. You need to specify the brand of the car to analyze the data on customers who prefer the selected brand.\n1. Create a data source (\nmore about this\n).\nIn this case, the parameter by which the data will be filtered is included in the sources. The example considered includes the source of the\nCar brand\n. Be careful: the filter algorithm which containes the parameter was previously created. See more about it here\nobject data source\n.\n2. Click on the tab\nFilter condition\n.\n3. Click\nin the group\nSource parameter\nto create the source parameter.\n4. Enter the parameter data. For this example, specify the following values.\nSetting\nPurpose\nName\nEnter the setting name. This name is displayed when viewing the data source.\nSystem object type\nSelect the object type by which the data in the source will be filtered. Let`s choose the\nCar brand\nfor this example.\nValue parameter type\nSpecify the type of the parameter value. The parameter type must match the value in the\nSystem object type\nfield.\n5. Link data source parameter with the filter algorith parameter.\n6. Save the settings you made.\nAccording to the settings, you need to select the reporting form to view the source data. After that, the source will display the corresponding data. The fields to display are specified by the\nsource\nsettings on the\nFields\ntab.",
  "source": "https://docs.greendata.ru/platform/en/data-source-parameters.html"
}