{
  "title": "Control panel",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nControl panel\nThe\ncontrol panel\n(toolbar) is located above the workspace and contains functional buttons that allow the user to operate with\nSystem objects\n.\nExample of the control panel in the object type profile:\nExample of the control panel in the object registry:\nThe set of control panel buttons depends on the System object displayed and is formed automatically. Additionally, the administrator can configure the display of additional buttons (for example, the printed form button for a specific object).\nIf the screen width does not accommodate the entire list of tools, some of them will be available after clicking the\nbutton.\nThe\nbasic controls\nare provided as follows:\nButton\nPurpose\nCreating a new object. Creating an object is available in the following modes:\nIn this window – entering data for the new object in the current browser window;\nIn modal window – entering data for the new object in the modal window;\nIn a new tab – entering data for the new object in a new browser tab.\nEditing the selected object. Working with the object is available in the following modes:\nIn this window – editing the object in the current window;\nIn modal window – editing the object in the modal window;\nIn a new tab – editing the object in a new browser tab.\nSaving the changes made to the object profile / object type.\nCopying the selected object. A copy of the selected object will be created, and its profile will be shown in the current browser window.\nDeleting the selected object. Available deletion options:\nDelete permanently;\nMove to\nRecycle Bin\n.\nPermanent object deletion and clearing the recycle bin are available to users with the\n\"Delete objects without possibility of recovery\"\npermission.\nForced update of data in the presented registry / object profile.\nData in the\nregistry\ncan be updated\nautomatically\n.\nThe exception is the\nedit mode\n– when working in this mode, all changes made to the object are saved after clicking the\nbutton.\nWhen the \"Save entered data when closing a new (unsaved) object\"\nsetting\nis active, the\nbutton\nin the object profile\ncan be used to\nclear the pre-filled fields\n.\nViewing changes to the selected object. Working with\nchange audit\nis available in the following modes:\nIn this window – viewing data in the current window;\nIn modal window – viewing data in the modal window;\nIn a new tab – viewing data in the new tab.\nViewing the object’s relations and dependencies. Find more in\n\"Dependent objects\"\n.\nThis button is available if the user has \"Read\" access for the \"Dependent objects\" [SYS_DEPENDENT_OBJECTS]\naction\n.\nViewing the object’s\ntags\npanel.\nThis button is available if the user has the following permissions:\n\"Read\" for the \"Tag management\" [SYS_TAG_MANAGEMENT]\naction\n;\n\"Run\" for\n\"View tags\"\n[VIEW_TAGS].\nViewing the full list of available types in the\n\"Object type\"\nregistry.\nThe visibility of the button is controlled by the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nIn addition to this permission, the following access permissions may also be required:\n\"Read\" permission for \"Show all types\" [SHOW_ALL_TYPES]\naction\n– to display the button in the \"Object type\" registry;\n\"Run\" permissions for\n\"View metadata\"\nand/or\n\"Edit metadata\"\n– to work with the \"Object type\" registry.\nThe button is available in the \"Object type\" registry, as well as in other parts of the System interface where the functionality to select a type from the full list is implemented.\nFind the list and purpose of the registry control panel elements in\n\"Working with the Object Registry\"\n.",
  "source": "https://docs.greendata.ru/platform/en/control-panel.html"
}