{
  "title": "\"Advanced slider\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Advanced slider\" widget\n\"Advanced slider\" widget\n- is an interface tool that allows to display various visual elements (grouping elements, widgets, attributes) on a slide. The Advanced Slider combines the capabilities of the following widgets:\nSlider\nis an element designed to display text and graphic content and switch between slides. The widget assumes manual control and does not contain settings of the automatic slide flipping timer;\nFigure\nis a widget needed to customize a profile with different information (indicators, graphs, icons, etc.). However, it is not possible to configure the presentation of several profiles and switching between them in the widget.\nExample of the customized widget:\nAnalytical setting\nThe \"Advanced slider\" widget is configured in the object type profile. To do this, go to visual editing mode and find the desired widget in the tab with the same name in the \"Elements\" window.\nThe selected widget should be dragged to the workspace.\nGo to the general settings of the widget by clicking the\nbutton.\nThe widget can be configured using the following parameters:\nSetting\nPurpose\nAuto width\nLogical attribute. When active, it hides the field \"Width, px\" and allows you to automatically adjust the width of the slider so that it fills all the space of the visual row. The user can choose the height of the widget himself. When inactive, it allows the user to manually adjust the slider size.\nWidth, px\nSpecifying the width of the slider in pixels.\nHeight, px\nSpecifying the height of the slider in pixels.\nSet border radius individually for each corner\nLogical attribute. When active, it allows you to specify the rounding for each slider corner individually. In the inactive state it displays the \"Corners rounding, px.\" field.\nCorner rounding, px.\nSpecifying the rounding value for all slider corners.\nBorder\nSelects the format of the slider’s border.\nThickness, px\nSpecifying the thickness of the slider border in pixels.\nColor\nSelecting the border color\nShow footer buttons\nSetting up the display of switch buttons between slides of the widget.\nShow arrows\nSetting up the display of side arrows for switching between neighboring slides of the widget.\nAutomatic slide flipping\nA setting that connects the ability to auto-flip between slides with a specified time delay. When active you can set the switching time in the \"Slide delay, sec\" field. If the setting is disabled, the switching between slides should be done manually.\nSlide delay, sec\nA numeric field defining the time it takes to switch to the next slide. The setting is displayed when the \" Automatic slide flipping\" switch is active.\nYou can delete a slide by clicking the\n, button located under the slide name. To create a new slide, click on the\nbutton.\nBy clicking the\nbutton, the user can open a modal window with the slide settings, where the background is specified.\nYou can choose a color or a gradient (linear, radial, conical, square) as the background fill.\nThe user can also upload an image that will be displayed on the slide. When selecting an image, the following options will be available:\nsetting the image size;\nsetting the image transparency in percent;\nchoosing the position of the image within the figure.\nPlacing objects (widgets and object type attributes) on a slide is possible using visual elements (rows, columns, etc.).\nAn example of the advanced slider using the\n\"Picture\"\n,\n\"Text\"\n, and\n\"Button\"\nwidgets can be presented as follows:\nThe widget has been configured to automatically flip slides with a slide delay of 2 seconds.",
  "source": "https://docs.greendata.ru/platform/en/advanced-slider-widget.html"
}