{
  "title": "Creating an event in the Outlook calendar",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCreating an event in the Outlook calendar\nThe system allows\nconfiguring a notification\nto automatically create an event in the user’s Outlook calendar.\nSending a notification with calendar event creation is configured using the\nsendMsgToSubject\n,\nsendMsgToEmail\nand\ngetOrCreateCalEvent\nfunctions when using the appropriate notification template.\nIn these functions, the template must be of the \"Calendar notification\" [SYS_CALENDAR_NOTIFY] type (or its child type).\nThe System will automatically create an \"iCalendar event\" [SYS_ICALENDAR_EVENT] object, which will allow the event to be displayed in the user’s Outlook calendar.\nTo create a notification template, sequentially select the menu items: Administration → Object management → Notification template.\nIn the opened registry, create an instance by clicking the\nbutton on the control panel. The System will display a modal window where the \"Calendar notification\" type should be selected:\nConfiguring an instance of the \"Calendar notification\" [SYS_CALENDAR_NOTIFY] type involves specifying the following parameters:\nSetting\nPurpose\nName\nEntering the notification template name.\nIdentifier\nEntering the notification template ID.\nHeader template editor\nEntering the notification header template using the\neditor\n.\nThe user can add dynamic data to the subject template, retrieved from an attribute of any object type or the result of an algorithm execution, find more\nhere\n.\nMessage template editor\nCreating a message template using tools provided in\nthe editor\n.\nThe user can add dynamic data to the message template, retrieved from an object type attribute or the result of an algorithm execution, find more\nhere\n.\nTemplate description of the event\nCreating an event description template.\nSending a separate e-mail to each recipient\nA boolean attribute that defines the generating of a single email for all users or a separate message for each. Possible values:\nYes – generating a separate letter for each recipient. For example, use the\nrecipientEmp\nfunction;\nNo – generating a single letter for distribution to the entire group of users. In this case, using the recipientEmp function is not allowed (it will result in an error).\nSignature\nSelecting an algorithm that determines a signature added at the end of the letter.\nThe signature is added by the custom \"Signature to the email notification\" type [SYS_EMAIL_SIGNATURE].\nObject parameters\nAdding parameters of the used objects. Parameters are applied, for example, to configure filtering.\nAlgorithm for determining files to attach to an event\nSelecting an algorithm that determines the files to be attached to the message.\nAlgorithm for determining the start date of an event\nSelecting an algorithm that determines the start date of the event fixed in the Outlook calendar.\nExample\nTo set a current date as the event start date, write an algorithm of the following type:\nThe current date is determined using the\ncurrentDate\nfunction.\nAlgorithm for determining the end date of an event\nSelecting an algorithm that determines the end date of the event fixed in the Outlook calendar.\nExample\nTo set the event end date to 7 days from the current date, the following algorithm can be used:\nUsing the\nplusDays\nfunction, 7 days are added to the current date (\ncurrentDate\n); the resulting value is then formatted using the\ndateFormat\nfunction.\nAlgorithm for determining the event location\nSelecting an algorithm to add the event location to the letter. This entry will be displayed in the Outlook calendar.\nExample\nTo determine an event location, the following algorithm is used:\nA base-type attribute is selected using the\nattr\nfunction.\nAlgorithm for determining the initiator of the meeting\nSelecting an algorithm to display the meeting initiator.\nExample\nTo determine the meeting initiator, an algorithm of the following type can be used:\nA base-type attribute is selected using the\nattr\nfunction.\nWhen sending an email generated from a template (an instance of the \"Calendar notification\" type), an event will automatically appear in the Outlook calendar for all users included in the mailing. The initiator retains the ability to cancel the event.",
  "source": "https://docs.greendata.ru/platform/en/creating-an-event-in-outlook-calendar.html"
}