{
  "title": "Модуль АФХД",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nМодуль АФХД\nАнализ финансово-хозяйственной деятельности (АФХД) – это комплексная оценка деятельности организации, направленная на изучение ее финансовых показателей, а также прогнозирование будущих результатов.\nОсновой для АФХД служит оборотно-сальдовая ведомость (ОСВ) и данные карточек счетов (КС), которые потребуется загрузить в Систему для дальнейшего анализа:\nОСВ позволяют проанализировать обороты по счетам;\nзаписи КС используются для детализации операций в разрезе субконто\n[\n1\n]\n, позволяя провести более точную оценку платежеспособности организации, уровня рентабельности, структуры активов и пассивов организации.\nДля использования модуля в приложении GreenData потребуется:\nПодготовить объектную модель в соответствии с сущностями структуры загружаемых документов\n.\nНастроить действия по распознаванию данных\n.\nНастроить визуал для отображения данных (опционально)\n.\nЗагрузить документы\n.\nДанные действия позволят автоматизировать загрузку ОСВ и КС для дальнейшего использования полученных данных в расчетах, планировании и анализе финансовых операций.\nНастройка объектной модели\nДля хранения и работы с данными загружаемых файлов необходимо подготовить объектную модель, в которую входят:\nтипы объектов для загрузки данных субконто\n[\n1\n]\n;\nДля документов ОСВ и КС не предусмотрена единая форма.\nВ связи с тем, что организации утверждает её самостоятельно, атрибутивный состав типов по распознаванию данных субконто индивидуален и подготавливается в соответствии с фиксированным и обязательным набором сущностей формы загружаемого документа.\nтип объекта для владельца файла;\nПод владельцем файла понимается участник, для которого формируется документ (наименование организации в шапке документа).\nтип объекта для агрегации загруженных данных – некий промежуточный контейнер, используемый для размещения кнопок загрузки документов и отображения полученных данных в разрезе необходимых субконто.\nВ дальнейшем при настройке действий атрибутивный состав данных типов будет\nсопоставляться\nс сущностями структуры загружаемых документов.\nПодробнее с описанием объектной модели можно ознакомиться в статье\n\"Настройка распознавания файлов ОСВ и КС (АФХД)\"\n.\nНастройка действий\nРаспознавание данных из загружаемых документов ОСВ и КС настраивается при помощи\nпользовательских действий\n.\nВыбор модуля пользовательского интерфейса при создании действия устанавливается в зависимости от способа загрузки будущего документа:\nдля загрузки документа ОСВ:\nс персонального устройства – \"Пакетная загрузка ОСВ\";\nиз атрибута системы – \"Пакетная загрузка ОСВ (по атрибуту с файлами)\";\nПодробнее с настройкой действий можно ознакомиться в статье\n\"Пакетная загрузка ОСВ\"\n.\nдля загрузки документа КС:\nс персонального устройства – \"Пакетная загрузка карточек счетов\";\nиз атрибута системы – \"Пакетная загрузка карточек счетов (по атрибуту с файлами)\".\nПодробнее с настройкой действий можно ознакомиться в статье\n\"Пакетная загрузка карточек счета\"\n.\nНастройка визуала контейнера\nДля удобства проведения анализа деятельности организации в типе, созданном в качестве промежуточного контейнера, можно настроить специальный\nвизуал\n.\nВизуал настраивается с учётом приоритетов, задач и визуальных предпочтений. Рекомендуется добавить кнопки для загрузки документов и настроить отображение полученных данных по соответствующим аналитическим разрезам (субконто).\nВизуал может принять следующий вид (подробнее о настройке в\nстатье\n):\nЗагрузка файлов\nВ Системе доступно распознавание файлов форматов *.xls и *.xlsx.\nНаименование загружаемого в Систему файла значения не имеет – при загрузке учитываются его\nструктура\nи\nсодержание\n. Определение владельца файла осуществляется по наименованию клиента внутри файла.\nПри загрузке документов\nважно соблюдать последовательность – первоочередно загружаются документы ОСВ, затем КС\n. Это необходимо для того, чтобы в первую очередь сопоставить контрагентов, а затем на их основе система будет производить  поиск данных в карточках счета.\nЕсли загрузка файла сопровождается окном предварительной загрузки, то при его отображении можно выбрать загружаемые файлы и сопоставить контрагента вручную.\nВидимость модального окна с информацией о выбранных для загрузки файлов регулируется с помощью параметра загрузки \"Модальное окно предварительной загрузки\" при настройке\nдействия\n.\nПри загрузке документов система автоматически проверяет наличие дубликатов, при обнаружении дубликаты не загружаются.\nВидимость модального окна с результатами загрузки документов регулируется с помощью параметра загрузки \"Скрывать модальное окно результатов загрузки\" при настройке\nдействия\n.\nФайл считается абсолютным дубликатом в случае идентичности указанных ниже полей загружаемого файла с полями файла, ранее загруженного в систему.\nПроверка осуществляется на уровне всего файла, то есть по следующим полям структуры загружаемого файла, по которым настроен\nмаппинг с системным типом \"Субконто счет (примитив)\"\n:\nНомер счета (из источника, строковый);\nВладелец;\nНачальный период;\nКонечный период [FINISH_PERIOD];\nСальдо на начало периода (Дебет) [INPUT_BALANCE_DEBIT];\nСальдо на начало периода (Кредит) [INPUT_BALACE_CREDIT];\nОборот по Дебету [TURNOVER_DEBIT];\nОборот по Кредиту [TURNOVER_CREDIT];\nСальдо на конец периода (Дебет) [OUTPUT_BALANCE_DEBIT];\nСальдо на конец периода (Кредит) [OUTPUT_BALANCE_CREDIT];\nТип ОСВ [CORRECT_TYPE];\nСсылка на контейнер загрузки [LINK_LOAD_VAL_ID].\n1\n. Субконто – это справочник уровней детализации данных в файлах ОСВ/КС для группировки однотипных операций.",
  "source": "https://docs.greendata.ru/platform/ru/afea_module.html"
}