{
  "title": "Working with data sources",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nWorking with data sources\nIn the System, you are able to create, edit and delete data sources (\nData source [RF_SOURCE]\n).\nThe following data sources are configured:\nSQL-based data source\n, the\nSQL-based data source\nobject type [RF_SQL_DATA_SOURCE]\nObject data source\n, the\nData source. Object data source\nobject type [RF_DATA_SOURCE]\nAfter creating the data source (regardless of its type), the following buttons are available to work with it:\nButton\nPurpose\nCreating a file to update the System. Learn more about working with updates:\nCreating updates from the object profile\n.\nView data source (described below). Possible options:\nIn modal window;\nIn new tab;\nIn this window.\nViewing the data source is available to users with the \"Run\" permission for the corresponding data source instance.\nDownloading a representation (report) of the data source (according to the settings of your browser).\nDownloading a representation (report) of the data source (according to the settings of your browser). In this case, the data source profile will remain available for operation.\nWhen viewing a data source\n, the System will allow you to upload the generated report (representation of the source generated) in ''*.xlsx format''.\nTo add a new data source parameter, you need to specify:\nFor example, if the source contains a parameter – a list of identifiers (ID) of car models (\nsee details about setting a parameter\n), you will be able to see them and choose for display.\nTo limit data representation by parameter you need to link data source parameter with parameter of data filtering algorithm:\nYou are able to select reporting forms for display from a drop-down list:\nExporting the data source view is available to users with the \"Run\" permission for the corresponding data source instance.",
  "source": "https://docs.greendata.ru/platform/en/working-with-data-sources.html"
}