{
  "title": "Управление политикой безопасности",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nУправление политикой безопасности\nПолитика безопасности – это набор правил, направленных на повышение безопасности сохранности данных. На платформе GreenData уделяется особое внимание к данной части информационной безопасности, пользователю предоставляется возможность настройки и управления собственной политикой безопасности.\nСоздание политики безопасности\nДля создания политики безопасности приложения необходимо:\nПоследовательно выбрать пункты меню:\nАдминистрирование → Управление доступом → Управление политикой безопасности.\nВ открывшемся реестре типа \"Управление политикой безопасности\" создать новый экземпляр при помощи нажатия на кнопку\nв панели управления (подробнее о\nработе с реестрами\n).\nВ открывшейся форме указать параметры настройки политики безопасности:\nПараметр\nНазначение\nОбщие настройки\nДанные настройки распространяются на всех пользователей Системы.\nНаименование\nНаименование объекта политики безопасности.\nПризнак активности\nПрименение условий текущего объекта политики безопасности при\nпарольной аутентификации\nпользователя в приложении.\nУстановка признака активности политики безопасности доступна пользователям при наличии разрешения\n\"Управление парольными политиками\"\n.\nПо умолчанию может быть активна\nтолько одна\nполитика безопасности.\nПри попытке сохранения другой политики безопасности с данным свойством система оповестит о наличии уже активной политики безопасности и предложит заменить её.\nДля отдельных субъектов безопасности, обладающих\nуровнем привилегированности\n, заданная по умолчанию политика безопасности может быть переопределена.\nДата включения данного признака при определенных условиях может являться опорной датой для других свойств.\nБлокировать пользователя при отсутствии входа в систему\nАктивация свойства блокировки учетной записи пользователя при отсутствии входа в систему в течение заданного времени.\nДопустимый период отсутствия входов в систему, дней\nКоличество дней отсутствия авторизации пользователя, после истечения которых учетная запись будет заблокирована.\nОтсчёт дней начинается от даты последней авторизации, если пользователь ни разу не проходил процесс авторизации, то датой последней активности считается дата изменения данных пользователя.\nПо умолчанию параметр принимает значение 5 дней.\nПараметр отображается при активной опции \"Блокировать пользователя при отсутствии входа в систему\".\nНастройки парольной аутентификации\nДанные настройки\nне распространяются\nна пользователей, осуществляющих вход по\nдоменному логину\nили посредством протокола\nOAuth 2\n.\nЗадать периодичность обязательной смены пароля\nАктивация свойства периодичности обязательной смены пароля.\nПериод действия пароля, дней\nКоличество дней действия пароля, после истечения которых данный пароль будет недействителен и потребуется его замена.\nОтсчёт дней начинается от последней даты изменения пароля, при её отсутствии – от даты включения признака активности политики безопасности.\nПо умолчанию параметр принимает значение 90 дней.\nПараметр отображается при активной опции \"Задать периодичность обязательной смены пароля\".\nБлокировать учетную запись при неудачных попытках ввода\nАктивация свойства блокировки учетной записи пользователя при неудачных попытках ввода пароля.\nКоличество допустимых неудачных попыток\nОпределение количества попыток ввода неправильного пароля, после истечения которых пользователь будет заблокирован.\nПо умолчанию параметр принимает значение 3.\nПараметр отображается при активной опции \"Блокировать учетную запись при неудачных попытках ввода\".\nМаска ввода пароля\nОпределение набора правил, регулирующих допустимый формат  пароля пользователя.\nМаска ввода пароля определяется типом \"Маска ввода пароля пользователя\" [SYS_PASSWORD_MASK].\nВыбор ранее созданных объектов настройки осуществляется из выпадающего списка, добавление новой настройки доступно через меню действий параметра.\nВ Системе предварительно настроены 3 уровня сложности пароля:\nминимальная сложность;\nне менее 8 символов;\nсодержит цифры;\nсодержит строчные и прописные буквы;\nне содержит визуально неоднозначные символы.\nсредняя сложность;\nне менее 11 символов;\nсодержит цифры;\nсодержит строчные и прописные буквы;\nсодержит специальные символы;\nне содержит визуально неоднозначные символы.\nмаксимальная сложность.\nне менее 14 символов;\nсодержит цифры;\nсодержит строчные и прописные буквы;\nсодержит специальные символы;\nне содержит 3 и более повторяющихся или последовательных символов.\nПо умолчанию в качестве маски ввода пароля установлено значение \"Текущие настройки\", включающее в себя ранее используемые в Системе параметры настройки пароля: не менее 8 символов, содержит цифры, строчные и прописные буквы, а также специальные символы.\nПри выборе маски ввода пароля соответствующие\nнастройки\nотобразятся в нижней части экрана.\nСброс паролей для всех пользователей Системы.\nПри нажатии на кнопку отобразится соответствующее предупреждение, в окне которого следует нажать на кнопку \"Да\" для сброса всех паролей пользователей.\nКнопка доступна только для активной политике безопасности.\nКоличество паролей с запретом повторения\nОпределение количества ранее использованных паролей пользователя, которые не могут быть использованы.\nПо умолчанию параметр принимает значение 1.\nДлительность блокировки\nОпределение времени блокировки учетной записи пользователя при неудачных попытках ввода пароля. По истечении указанного времени учетная запись будут разблокирована автоматически.\nДля настройки длительности блокировки необходимо указать единицу измерения в одноименном поле.\nЕсли длительность блокировки указана, то при попытке входа в Систему заблокированный пользователь увидит соответствующее предупреждение с датой окончания блокировки.\nПример\nЕсли длительность блокировки не указана, то пользователь останется заблокированным, пока администратор вручную не снимет блокировку в\nнастройках парольных учетных данных пользователя\n.\nПример\nПо умолчанию длительность блокировки составляет 30 минут.\nЕдиница измерения\nОпределение единицы измерения для длительности блокировки. Возможные варианты:\nСекунда;\nМинута;\nЧас;\nДень.\nНажать на кнопку\nв панели управления для сохранения изменений.\nНастройка маски ввода пароля\nНастройка маски ввода пароля предполагает определение следующих параметров:\nПараметр\nНазначение\nДлина пароля\nОпределение минимальной длины пароля.\nПо умолчанию минимальная длина пароля должна составлять 8 символов.\nВключить числа\nОбязательность использования цифр в пароле.\nПри активном параметре пароль должен содержать не менее одной цифры.\nПо умолчанию параметр активен.\nВключить строчные символы\nОбязательность использования в пароле строчных букв.\nПри активном параметре пароль должен содержать не менее одной строчной буквы.\nПо умолчанию параметр активен.\nВключить прописные символы\nОбязательность использования в пароле прописных букв.\nПри активном параметре пароль должен содержать не менее одной прописной буквы.\nПо умолчанию параметр активен.\nИсключить визуально неоднозначные символы\nЗапрет использования в пароле визуально неоднозначных символов:\ni, I, 1, l, o, 0, O\n.\nПри активном параметре использование указанных символов в пароле не допускается.\nПо умолчанию параметр неактивен.\nВключить специальные символы\nОбязательность использования в пароле специальных символов.\nПри активном параметре пароль должен содержать не менее одного специального символа.\nПо умолчанию параметр активен.\nИсключить пароли, состоящие из повторяющихся или последовательных символов\nЗапрет использования паролей, состоящих из повторяющихся или последовательных символов.\nПри активном параметре использование 3 и более повторяющихся или последовательных символов в пароле не допускается.\nПо умолчанию параметр неактивен.\nПрименение настроек парольной аутентификации\nЗаданная по умолчанию политика безопасности применяется для\nпользователей системы\n, осуществляющих вход в приложение по паролю.\nДля отдельных субъектов безопасности, обладающих\nуровнем привилегированности\n, заданная по умолчанию политика безопасности может быть переопределена.\nЕсли пользователь входит в разные группы доступа, относящиеся к разным уровням привилегированности, то за ним остается право наивысшего приоритета из доступных.\nВ карточке учетной записи \"Парольная аутентификация\" система фиксирует данные активности пользователя, такие как:\nдата изменения пароля;\nдата последнего входа;\nколичество ошибочных вводов пароля.\nПри активной опции \"Блокировать пользователя при отсутствии входа в систему\" пользователь, превысивший допустимое количество дней отсутствия авторизации в системе, при попытке входа увидит уведомление следующего вида:\nПри активной опции \"Задать периодичность обязательной смены пароля\" пользователю, вводившему пароль с истекшим сроком действия, будет выведено уведомление следующего вида:\nПри активной опции \"Блокировать учетную запись при неудачных попытках ввода\" пользователю при неудачной аутентификации будет выведено соответствующее уведомление, содержащее количество допустимых попыток ввода пароля до блокировки учётной записи:\nПосле того как пользователь превысит допустимое количество попыток ввода пароля, его учетная запись будет заблокирована и система выдаст соответствующее уведомление:",
  "source": "https://docs.greendata.ru/platform/ru/security_policy_management.html"
}