{
  "title": "Приемник. Внутренний",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПриемник. Внутренний\nПриемник типа \"Внутренний\" на основе полученной информации позволяет обновлять данные существующих объектов Системы и при необходимости создавать новые.\nДля использования приемника необходимо при настройке\nсхемы ETL-процесса\nс панели действий и компонентов перетащить (Drag&Drop) в рабочую область элемент задачи.\nПосле чего определить добавленный этап как\nПриемник. Внутренний\n:\nПараметры настройки\nДля перехода к параметрам настройки приемника необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего в новой вкладке откроется страница с набором параметров для настройки.\nПри настройке приемника необходимо определить тип объектов, в который будут сохраняться получаемые на вход этапа данные. После выбора типа объектов его атрибутивный состав отобразится в таблице для настройки связи.\nСуществующий в Системе тип объектов выбирается из выпадающего списка параметра \"Базовый тип объектов\",\nсоздание нового типа объектов\nосуществляется через меню действий параметра.\nДалее настраиваются пары связей: выбирается элемент входной динамической структуры (далее  – ДС) и соответствующий ему атрибут типа, в который будут сохраняться полученные данные, после чего нажимается кнопка «Связать с».\nЛогика актуализации данных в Системе на основании входной структуры для\nдочерних\nи объектных\nmultiselect\nатрибутов регулируется настройками, доступными после нажатия на кнопку\n.\nДля\nmultiselect\nатрибутов доступны следующие варианты:\nзаменять значение – значения в Системе будут заменяться данными, полученными из входной структуры;\nдополнять значение – подразумевает пополнение данных Системы недостающими значениями, при этом значения, которые отсутствуют во входной структуре, но имеются в Системе, удалены не будут.\nДля\nдочерних\nатрибутов доступны следующие варианты:\nвыполнить алгоритм по отсутствующим объектам – при выборе данного варианта отобразится поле для выбора/создания алгоритма, который будет выполнен по каждому объекту Системы сохраняемого типа объектов, отсутствующему во входной структуре;\nудалить, если дочерний объект отсутствует – из Системы будет удаляться объект, если во входной структуре отсутствуют данные его дочернего объекта;\nдополнять значение – подразумевает пополнение данных Системы недостающими значениями, при этом значения, которые отсутствуют во входной структуре, но имеются в Системе, удалены не будут.\nСвязь с объектным\nmultiselect-атрибутом\nдолжна настраиваться с полем ДС по конкретному ID, который нужно получить заранее, например, используя\nпреобразователь данных\n.\nДля того чтобы система могла определить, как произвести сохранение данных: обновить значения атрибутов существующего объекта или создать новый экземпляр объекта, – осуществляется настройка связей типа.\nЕсли требуется сохранить значение дочернего атрибута, необходимо добавить соответствующую настройку для типа объектов, с которым связан дочерний атрибут.\nДля этого во встроенном реестре \"Настройка связей типов\" следует нажать кнопку\n.\nВ открывшемся модальном окне в поле \"Базовый тип объектов\" необходимо указать тип объектов, для которого будет настраиваться выбранный в одноименном поле тип связи приемника:\nВсегда новая запись\nДля сохранения полученных данных будет создаваться новый экземпляр объекта.\nПервичный ключ\nДля сохранения полученных данных Система будет осуществлять поиск существующего объекта по\nдефолтному первичному ключу\n. Если искомое значение найдено, тогда будут обновлены данные существующего объекта, иначе для сохранения данных будет создан новый экземпляр объекта.\nАльтернативный ключ\nСохранение данных при данном типе связи приемника аналогично типу связи \"Первичный ключ\", за исключением того, что поиск существующего в Системе объекта осуществляется по\nключу\n, указанному в поле \"Альтернативный ключ\", ранее созданному пользователем в типе объектов.\nСвязующая таблица\nДанный тип связи приемника предполагает использование дополнительного типа объектов, так называемой \"связующей таблицы\", в котором будут фиксироваться связи между ID динамической структуры и ID объекта Системы.\nПри получении данных Система проверяет наличие связи в данном типе объектов. Если связь найдена, тогда обновляется соответствующий объект базового типа, иначе создается экземпляр новой связи в связующей таблице и для сохранения полученных на приемник данных – экземпляр объекта базового типа.\nНесомненным преимуществом данного типа связи приемника является возможность настраивать и отслеживать наличие связей, не добавляя ключи в базовый тип объектов. Например, если настраивается связь с системным типом объектов, где создание такого ключа невозможно.\nНастройка типа связи приемника \"Связующая таблица\" осуществляется при помощи следующих параметров:\nПараметр\nНазначение\nНастройка связи через связующую таблицу\nТип связующей таблицы\nОпределение типа объекта, который будет использоваться для проверки наличия связи между идентификаторами объектов внешней и внутренней Систем.\nАтрибут с внутренним ключом\nВыбор атрибута, содержащего идентификатор объекта Системы.\nАтрибут с внешним ключом\nВыбор атрибута с идентификатором объекта внешней системы, соответствующим выбранному ранее идентификатору объекта Системы.\nЭлемент динамической структуры с внешним ключом\nОпределение элемента ДС, через который будет передаваться значение идентификатора объекта внешней системы.\nАтрибут с типом связи\nВыбор атрибута связующей таблицы, в котором хранятся виды связей. Настройка опциональна, используется в случае хранения в связующей таблице нескольких видов связей.\nПри настройке интеграции с внешним сервисом для получения данных каждой сущности настраивается свой приемник, при этом связующая таблица может быть единой.\nОднако в данном случае потребуется осуществлять контроль, с какой именно сущностью устанавливается связь, так как идентификаторы получаемых данных могут дублироваться.\nНапример, из внешней системы можно получить как данные сотрудников, так и данные контрагентов, при этом нумерация ID несквозная (имеется контрагент с ID 1 и сотрудник с ID 1).\nНеобходимо создать тип объектов для определения вида связи (экземпляры типа – сущности внешней системы), после чего в связующей таблице добавить объектный атрибут, ссылающийся на данный тип объектов.\nЕсли значение параметра задано, в обязательном порядке указывается значение поля \"Тип связи\".\nТип связи\nВыбор типа связи (экземпляра типа, в котором хранятся сущности внешней системы), по которому устанавливается связь для получения данных.\nВыбранное значение проверяется Системой только при заполненном параметре  \"Атрибут с типом связи\".\nПри необходимости устанавливаются параметры обработки этапа, расположенные в верхнем блоке настроек приемника:\nПараметр\nНазначение\nБазовый тип объектов\nОпределение типа объектов, в который осуществляется сохранение данных.\nАлгоритм определения даты актуальности\nПараметр используется для определения даты актуальности\nисторических атрибутов\n.\nАлгоритм возвращает дату, на которую будут устанавливаться значения атрибутов, зависимых от времени.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, создание нового или редактирование выбранного\nалгоритма\nвозможно через меню действий параметра.\nЕсли значение не указано, то по умолчанию используется текущая дата.\nОтобразить результаты ETL без сохранения\nПризнак, используемый для отладки этапа. При активации параметра сохранение данных в базу данных не производится, результат выполнения этапа отображается только в логе выполнения ETL.\nПо умолчанию настройка активна.\nОчистить лог при успешном выполнении этапа\nПризнак, используемый для оптимизации хранения в базе данных. При активации параметра в случае успешного выполнения этапа лог текущего этапа очищается.\nПо умолчанию настройка активна.\nСохранять только измененные объекты\nПризнак, позволяющий сохранять только измененные объекты.\nНеобходимость применения признака для улучшения производительности ETL-процесса зависит от используемого сценария.\nНапример, если получаемые данные редко содержат изменения, а на типе обновляемых объектов настроен долгий жизненный цикл, расчет выражений, автокалькуляций и т.п., то пересохранение всех объектов нецелесообразно. Для повышения производительности рекомендуется осуществлять проверку изменения значений и сохранять только измененные объекты.\nВ случаях, когда проверка наличия изменений занимает больше времени, чем пересохранение объектов, использование данного признака может привести к снижению общей производительности ETL-процесса.\nПо умолчанию настройка неактивна.\nИспользовать блокировки при сохранении\nПризнак позволяет завершить выполнение ETL-процесса, прежде чем запускать другой ETL-процесс, в случае использования в данных процессах приемников типа \"Внутренний\" с одним и тем же базовым типом объектов.\nПризнак используется для предотвращения возможных конфликтов и несоответствия данных, которые могут возникнуть, если несколько процессов одновременно пытаются модифицировать одни и те же объекты. Однако стоит учитывать, что использование блокировок может привести к увеличению времени ожидания для процессов, поэтому важно определить целесообразность применения признака в рамках используемого сценария.\nПо умолчанию настройка неактивна.\nИгнорировать ошибки при сохранении\nПризнак, определяющий сохранение типа объекта в случае возникновения ошибок при загрузке данных.\nПо умолчанию настройка неактивна.\nОтправить данные в открытые в браузере карточки\nДанный признак позволяет пользователям в режиме реального времени видеть актуальные данные сразу после их обработки и сохранения на ETL, без необходимости ручного обновления страницы или объектов.\nИспользовать признак рекомендуется  только при явной необходимости отображения обновленных данных на открытых в браузере экземплярах, поскольку при обновлении большого количества объектов признак может замедлить работу ETL.\nПо умолчанию настройка неактивна.\nПример\nДопустим, в Системе на основании полученных из внешней системы данных необходимо пополнять базу контрагентов – создавать новый объект при отсутствии контрагента и добавлять недостающие данные в имеющихся.\nВ Системе данные контрагентов сохраняются в типе объектов \"Контрагент\", при этом номера телефонов фиксируются в связанном типе объектов \"Контакты контрагентов\".\nТип объектов \"Контрагент\" имеет следующий атрибутивный состав:\n\"Наименование\" – атрибут родительского типа, используемый для сохранения ФИО/названия организации контрагента;\n\"ИНН\" – строковый атрибут для ввода индивидуального номера налогоплательщика;\n\"Номер телефона\" –\nдочерний атрибут\n, ссылающийся на тип объектов \"Контакты контрагентов\", со связью по атрибуту \"Контрагент\", который используется для отображения всех номеров телефона контрагента.\nАтрибутивный состав типа объектов \"Контакты контрагентов\":\n\"Номер телефона\" – строковый атрибут для ввода номера телефона контрагента;\n\"Контрагент\" – объектный атрибут, ссылающийся на тип объектов \"Контрагент\", используется для привязки номера телефона к конкретному контрагенту.\nПрежде чем настроить интеграцию с внешней системой, необходимо определить способ, по которому Система будет идентифицировать данные контрагентов.\nПредположим, что для получения данных могут быть задействованы несколько внешних систем. Для того чтобы не расширять атрибутивный состав типа \"Контрагент\" дополнительными атрибутами, по которым впоследствии потребуется создавать и настраивать ключи, для проверки и фиксирования связи между системами рекомендуется использовать отдельный тип объектов \"Связующая таблица\".\nАтрибутивный состав типа объектов \"Связующая таблица\".\n\"Внешний ID\" – строковый атрибут для добавления идентификатора объекта внешней системы;\n\"Внутренний ID\" – объектный атрибут, ссылающийся на тип объектов \"Объект\", используемый для добавления идентификатора объекта в текущей системе.\nДля обновления номеров телефонов в типе объектов \"Контакты контрагентов\" следует создать\nсоставной ключ\nпо атрибутам \"Контрагент\" и \"Номер телефона\".\nДалее можно перейти к настройке этапа\nсхемы ETL-процесса\n\"Приемник. Внутренний\".\nПоскольку обновление данных может осуществляться в типе \"Контрагент\" и через дочерний атрибут в типе объектов \"Контакты контрагентов\", в настройках приемника в реестре \"Настройка связей типов\" необходимо создать два объекта:\nОдин объект связи настраивается для базового типа объектов \"Контрагент\" по типу связи приемника \"Связующая таблица\".\nВ данном случае настройка типа связи через таблицу настраивается по следующим значениям параметров:\n\"Тип связующей таблицы\" – созданный ранее тип объектов для хранения связей между системами  \"Связующая таблица\";\n\"Атрибут с внутренним ключом\" – атрибут типа объектов \"Связующая таблица\", в котором хранится идентификатор объекта текущей системы \"Внутренний ID\";\n\"Атрибут с внешним ключом\" – атрибут типа объектов \"Связующая таблица\", в котором хранится идентификатор объекта внешней системы \"Внешний ID\".\n\"Элемент динамической структуры с внешним ключом\" – выбирается поле ДС \"id\", через которое будет передаваться значение идентификатора объекта внешней системы.\nПри поступлении данных будет осуществляться поиск значения атрибута \"Внутренний ID\" в типе \"Связующая таблица\", где значение атрибута \"Внешний ID\" соответствует значению поля ДС \"id\".\nЕсли значение внутреннего ID найдено, то в соответствующем объекте Системы будут обновлены данные тех атрибутов, по которым настроена связь (рассмотрено\nдалее\n).\nЕсли искомое значение не найдено, то в типе объектов \"Связующая таблица\" создается новый объект, где в атрибут \"Внутренний ID\" записывается искомое значение, в атрибут \"Внешний ID\"  – значение внешнего ключа из поля ДС \"id\".\nПоля \"Атрибут с типом связи\" и \"Тип связи\" заполняются при использовании связующей таблицы для интеграции данных нескольких сущностей внешней системы, например, когда необходимо получить данные не только контрагентов, но и поставщиков.\nВ данном случае потребуется:\nСоздать еще один тип объекта \"Виды связи\", экземплярами которого станут все необходимые сущности, в данном случае – \"Контрагенты\" и \"Поставщики\".\nВ типе \"Связующая таблица\" добавить объектный атрибут \"Вид связи\", ссылающийся на тип объекта \"Виды связи\".\nВ настройках связующей таблицы в поле \"Атрибут с типом связи\" указать атрибут \"Вид связи\", а в \"Тип связи\" выбрать значение необходимого вида связи, в рамках текущего примера – это \"Контрагенты\".\nВо втором объекте связь настраивается для базового типа объектов \"Контакты контрагентов\" по типу связи приемника \"Альтернативный ключ\". В качестве ключа выбирается\nранее\nсозданный составной ключ по атрибутам \"Контрагент\", \"Номер телефона\".\nДанная настройка позволит дополнять базу недостающими номерами телефонов в разрезе конкретного контрагента.\nДопустим, входные данные приемника соответствуют представленной далее ДС. При настройке приемника базовым типом объектов необходимо указать \"Контрагент\" и между отобразившимися атрибутами типа и полями входной ДС настроить связи:\nДля атрибутов \"Наименование\" и \"ИНН\" с соответствующими полями ДС.\nАтрибутивный состав типа \"Контрагент\" не содержит внешний ключ, поэтому связь с полем ДС \"id\" напрямую с атрибутом типа не настраивается. Это реализуется через связанную таблицу.\nПоскольку проверка наличия номеров телефонов контрагентов будет осуществляться по альтернативному ключу, следует настроить связь между полем ДС \"number\" и атрибутом \"Номер телефона\", представленным в атрибутивном составе в выпадающем списке дочернего атрибута \"Номер телефона\".\nПри этом настраивать связь с атрибутом \"Контрагент\" не требуется, поскольку объект с номером телефона уже привязан к определенному контрагенту через дочерний атрибут.\nДля того чтобы поддерживать актуальность базы контрагентов в Системе и удалять неактуальные номера (отсутствующие  во входной структуре), следует в настройках дочернего атрибута \"Номер телефона\" выбрать соответствующий вариант:\nДалее необходимо определить\nпараметры выполнения этапа\n.\nВ рамках настраиваемого примера достаточно снять отметку признака \"Отобразить результаты ETL без сохранения\" и сохранить внесенные изменения при помощи кнопки\nв панели управления.",
  "source": "https://docs.greendata.ru/platform/ru/receiver-internal.html"
}