{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.464.12\nот 20.08.2025\nНовые возможности\nПоявилась возможность гибкой\nнастройки разрешенных уведомлений\nна электронную почту сотрудника.\nВ расширенной версии канбан-доски добавлена поддержка\nWIP-лимитов\n.\nПоявилась возможность вынесения в пункт меню настроенной канбан-доски.\nРасширены параметры учетной записи пользователя: добавлено отображение причины\nблокировки пользователя\n, а также история блокировок.\nБлагодаря новой функции\ndeleteLdapEntry\nпоявилась возможность удаления записей из службы каталогов Active Directory.\nРеализовано отображение пользователей, работающих с документом в текущий момент времени. Кроме того, добавлена подсветка курсоров и выделение текста другими пользователями.\nТеперь при загрузке новой версии документа из файла Система сохранит все существующие в ранних версиях блокировки текста, а изменения блокировок, сделанные в файле, будут проигнорированы.\nИзменения и улучшения\nСкорректирован текст подсказки в модальном окне при добавлении нового адреса электронной почты в карточке сотрудника.\nСтабилизирована работа при редактировании карточки\nпримитивного объекта\n.\nДобавлено ограничение на смену логотипа компании в\nSaaS решении\nпри использовании\nлицензии\nCommunity Edition\n.\nСкорректировано отображение наименования шаблона при установке продукта из\nкаталога готовых решений\n.\nУсовершенствован процесс покупки лицензии.\nСтабилизирована работа модальных окон в Системе.\nСтабилизирована автоматическая генерация наименований таблиц/полей для таблиц.\nОтлажено сохранение значений атрибутов объекта, отображение которого настроено с помощью\nфрейма\n.\nСтабилизирована работа при заполнении значения атрибута с настроенной\nмаской ввода\n.\nДля атрибута типа \"Файл\" с визуалом\n\"Множественные файлы в виде таблицы\"\nналажена возможность переключения типа реестра.\nСтабилизирована работа\nOnChanged событий\nпри наличии в типе объекта дочерних атрибутов.\nНалажен процесс создания экземпляров в реестре с папками.\nОптимизирован процесс загрузки\nплиточного реестра\nпри его открытии.\nСтабилизировано применение настройки высоты атрибута типа \"Файл\" с визуалом\n\"Изображение\"\n.\nОбеспечено единообразие иконок задач в веб-версии и мобильном приложении GreenData.\nВ карточке типа объекта скорректирована логика настройки\nиерархического типа\n.\nНа визуле типа \"Регулярные выражения для проверки обновлений\" добавлена опция создания SQL-запроса. Кроме того, для типа \"Типы объектов, включаемые в чек-лист проверки информационной безопасности\" скорректированы визуал и реестр по умолчанию.\nДоработано скрытие пустых папок на атрибуте с визуалом\n\"Множественные объекты в виде таблицы\"\n.\nСкорректировано отображение значения строкового атрибута с визуалом\n\"Телефон\"\nв реестре объектов.\nУпрощен процесс удаления файлов, размещенных с помощью виджета\n\"Проводник\"\n.\nПри работе с виджетом\n\"Финансовая отчетность\"\nотлажено применение настроек ширины/высоты колонок.\nОтлажена фильтрация объектов в реестре, отображенном с помощью виджета\n\"Реестр объектов\"\n.\nСкорректирована логика работы виджета\n\"Панель быстрого доступа\"\n.\nПри работе с\nдиаграммой Ганта\nотлажен выбор даты с помощью календаря.\nДоработана логика настройки аналитической панели дашборда\n\"Элемент управления\"\n: теперь алгоритм автоматического заполнения значения может возвращать пустой список или список кодов объектов.\nПри настройке колонок аналитической панели дашборда\n\"Таблица\"\nстабилизировано применение алгоритмов форматирования, а также отлажено отображение наименований колонок таблицы при экспорте.\nОтлажена возможность визуализации информации с помощью аналитической панели дашборда\n\"Линейный график\"\nнезависимо от количества данных.\nДоработана логика создания\nдерева условий\nпри наличии несохраненных ранее данных: теперь добавленные ранее операторы и условия не будут сохранены в качестве черновика.\nСтабилизирована настройка\nдерева условий\nпри работе в браузере\n\"Mozilla Firefox\"\n.\nСтабилизирован процесс завершения задачи пользователем, в том числе после возобновления нормативного срока.\nНалажено сохранение данных в атрибутах карточки задачи после прикрепления файла.\nОтлажено назначение задач при запуске бизнес-процесса.\nОтлажен вызов алгоритма с помощью\nпользовательского действия\n, в дополнительных параметрах которого настроено сохранение объекта до выполнения алгоритма (было внедрено в релизе\nLTS.463.8\n).\nСтабилизирована работа модального окна для ввода параметров.\nОтлажен процесс удаления экземпляра дочернего объекта с последующим сохранением родительского объекта при использовании\nпользовательских действий\n.\nДоработана функция\ncopyAndSave\nдля копирования данных форм отчетности.\nОтлажена работа функции\nattr\nс признаком \"Установить значение\" для\nисторических атрибутов\n.\nСкорректировано отображение списка атрибутов в модальном окне при вызове функции\nobjectsWithOptions\n.\nОтлажена работа функции\nprintEDoc\n.\nОтлажен процесс сохранения\nалгоритма источника\nдля дашборда.\nДля алгоритмов\nтипа\n\"Алгоритм. Условие для визуала\" восстановлена возможность выбора контекстного типа объекта.\nНалажена работа алгоритма при наличии в нем сравнения значений с\nатрибутом переменной\n.\nОтлажено отображение предупреждения о попытке сохранения алгоритма с ошибкой.\nСкорректировано отображение ошибок при компиляции алгоритма.\nПри работе с параметрами алгоритма отлажена возможность фильтрации значений на основе источника данных.\nВ\nнастройках подключения чат-бота для Telegram\nпоявилась возможность выбора языка, на котором осуществляется отправка сообщений от бота.\nТеперь при возникновении ошибки обработки отдельных элементов динамической структуры работа трансформатора, настроенного на\nпреобразователе данных ETL\n, может быть продолжена по другим его входным данным.\nНалажена возможность\nзапуска ETL-процесса по файлу\n.\nОтлажена возможность переноса\nиерархического типа объекта\nс помощью обновлений.\nНа странице\nсоздания обновлений\nдобавлена возможность фильтрации объектов по тегу.\nОптимизирован процесс записи в\nаудит изменений значений атрибутов\nпри наличии\nнастройки прав на атрибуты типа\n.\nДоработана возможность управления\nполитикой безопасности\nнезависимо от наличия прав на администрирование пользователей.\nСкорректирована логика\nблокировки пользователей при отсутствии входов в Систему\n: теперь данный параметр учитывает использование hook-токенов.\nОтлажено применение\nконтроля прав по дереву условий\n, основанного на\nпримитивных объектах\n.\nПосле окончания\nзамещения\nвосстановлен возврат задач исходному исполнителю, а также налажена возможность смены исполнителя.\nВ\nконструкторе страницы входа\nотлажена функциональность по выравниванию подзаголовка компонента стартовой страницы.\nСтабилизировано создание\nпрофилей для регистрации пользователей\n.\nОптимизирован процесс\nочистки временных файлов\n.\nНалажена\nагрегации значений отчетной формы\n.\nСтабилизирована возможность удаления строк формы отчетности.\nПри работе с документом, сформированным по шаблону, скорректированы названия действий по кнопке \"Прикрепить к объекту\".\nОтлажено отображение непечатаемых символов табуляции в соответствии с настроенными в документе полями, налажено применение подчеркнутого стиля к маркерам и пунктам списков.\nСтабилизирована возможность добавления сноски к выделенному тексту.\nОтлажено отображение кнопки для добавления комментария при выделении фрагмента текста документа нажатием на кнопку\nShift\nи последующим кликом мыши.\nСтабилизировано\nсравнение версий документа\nв режиме работы с закладками при наличии комментариев в документе.\nОптимизирована работа при раскрытии свернутой группы атрибутов в опросном листе документа.\nОтлажена возможность экспорта документа при отсутствии у пользователя прав на его редактирование.\nНалажена работа с текстом комментария в документе.\nВ документе, сформированном по шаблону, отлажена работа с закладками, в том числе возможность копирования текста закладок.\nСтабилизирован процесс создания новой версии документа.\nНалажено отображение содержимого документа при работе\nв режиме сравнения значений закладок\n.\nПри обновлении значений из источника данных стабилизировано отображение значений элементов опросного листа.\nСтабилизировано отображение комментариев в документе.\nОтлажено отображение результата сравнения версий документа.\nВ документе EDoc отлажена настройка формата листа.\nИзменено положение иконки \"Выключить уведомления\".\nОтлажена возможность настройки\nсервиса транскрибации\n.\nВ информационной панели скорректирована ссылка для перехода на страницу платформы GreenData в социальной сети\nВКонтакте\n.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.464.12\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.464.12.war\nhttps://downloads.greendatasoft.ru/LTS/lts.464.12.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.464.12-latest.html"
}