{
  "title": "Виджет \"Реакции и комментарии к объекту\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Реакции и комментарии к объекту\"\nВиджет \"Реакции и комментарии к объекту\"\nприменяется для получения быстрой обратной связи по выбранному объекту посредством добавления пользователями реакций и комментариев.\nПример настроенного виджета:\nПеред тем как приступить к настройке виджета, необходимо сформировать\nсущность\nи перейти к созданию\nэкземпляров\nдля данного типа объекта.\nДобавление виджета в карточку объекта осуществляется в режиме настройки\nвизуала экземпляра\n. При переходе на панели \"Элементы\" на вкладку \"Виджеты\" необходимо из раздела \"Взаимодействия\" перетащить (Drag&Drop) виджет \"Реакции и комментарии к объекту\" в рабочую область карточки. Система отобразит параметры для настройки виджета.\nВиджет \"Реакции и комментарии к объекту\" можно перетаскивать только в контейнер пространства \"Ряд\", предварительно добавленный в рабочую область карточки с вкладки \"Группировки\" панели \"Элементы\".\nНастройка виджета\nДля управления виджетом необходимо нажать на кнопку \"Настройки\", в результате чего откроется модальное окно.\nВ настройках по умолчанию добавлены два элемента: \"Реакция\" и \"Комментарий\" к текущему объекту. При необходимости элементы по умолчанию можно удалить или отредактировать.\nДля изменения объекта следует перевести соответствующий переключатель в неактивное положение, в следствии чего отобразится поле с выбором объектного атрибута, для которого будут проставляться реакции.\nЕсли объект не указан, в карточке экземпляра будет отсутствовать возможность поставить реакции и оставить комментарии.\nДобавление новой реакции осуществляется по кнопке\n. После чего добавится элемент, у которого необходимо выбрать действие и указать наименование, которое будет использовано в качестве хинта к реакции.\nВ рамках одного виджета можно добавить только один элемент с действием \"Оставить комментарий\", создание последующих элементов возможно только с выбором действия \"Реакция\".\nА также:\nдля управления отображением счётчика реакций и комментариев для конечного пользователя используется переключатель \"Отображать счетчик\":\nпри активном положении переключателя \"Отображать счетчик\" реакция, оставленная конечным пользователем, подсвечивается, а количество реакций увеличивается на 1:\n;\nпри неактивном положении переключателя \"Отображать счетчик\" реакция, оставленная конечным пользователем, подсвечивается, количество реакций при этом не отображается\n;\nДля просмотра количества оставленных реакций следует повторно перейти в настройки виджета в режиме редактирования визуала экземпляра типа объекта и перевести переключатель \"Отображать счетчик\" в активное положение.\nвыбор иконки осуществляется на панели, доступной после нажатия на иконку;\nчтобы упорядочить элементы следует посредством кнопки\nосуществить захват и перенести (Drag&Drop) элемент согласно необходимой последовательности.\nДля сохранения внесенных изменений необходимо нажать на кнопку\nв нижней части окна настроек. После сохранения визуала пользователям будет представлена возможность оставлять реакции и писать комментарии согласно настройкам виджета.\nПример использования виджета\nНапример, для сбора обратной связи по товарам каталога пользователям предоставили возможность оставлять комментарий к товару и две реакции (\"Нравится\" и \"Рекомендовать\").\nДля того чтобы оставить реакцию следует нажать на соответствующую иконку, при наведении курсора отобразится подсказка к реакции.\nДля просмотра или добавления комментариев пользователю следует нажать на соответствующую иконку, в результате чего откроется окно, в котором добавление нового комментария осуществляется в поле ввода, после чего нажимается кнопка \"Отправить\". Для ответа на имеющийся комментарий следует воспользоваться аналогичным полем ввода, доступным после нажатия на количество ответов под выбранным комментарием.",
  "source": "https://docs.greendata.ru/platform/ru/reactions-and-comments-to-the-object-widget.html"
}