{
  "title": "Dashboard set up guide",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nDashboard set up guide\nLet’s take a closer look at how to set up the dashboard to display the data source-generated visual.\nCreate a data source to be displayed using the dashboard. By using a\ndata source based on an sql query\nthat generates employee data. The selected parameter is employee’s department. The parameter is set as \"param_org_structure\".\nAfter saving the data, the table on the Fields tab will be filled in automatically.\nAfter selecting the department, the source will display a list of its employees.\nTo create a dashboard for displaying data:\n1. Select Reports → Dashboards menu items. As a result, the registry opens, in which a new instance is created using the button on the control panel.\n2. Click\non the control panel, which opens a profile for a new instance, which displays a modal window for entering the dashboard name  (a full description of the dashboard settings is available\nhere\n).\nAfter clicking \"OK\", the dashboard is ready for set up.\n3. To edit the dashboard visual, click\nin the control panel or\nin the profile workspace.\nThe dashboard control panel and the visual editing button in the workspace are displayed when the user has appropriate permissions.\n\"Reading type instances\" and \"Editing type instances\" of the \"Dashboard template\" object type.\n\"Write\" for an instance of the \"Dashboard template\" type that the user is working on.\nFor more information about configuring the visual, see the\nSetting up a visual of instance\narticle.\n4. The visual is configured by dragging the necessary elements from the Elements panel into the visual profile.\n4.1. Add following\ngrouping elements\nto the dashboard visual from the \"Groupings\" tab: Row and Attribute group.\n4.2. Add the\nThe \"Table\" dashboard\nto the visual (the table will display the data generated by the source).\n4.3. Add the\n\"Control element\" analytical dashboard\nto the visual (for setting up of the data source parameter).\n5. Set up of the control element to work with the table. The data source parameter is used as the control element. To set up the parameter selection:\n5.1. Click\nto go to the element settings and specify the following parameters:\nname\nis the name of the setting that will be displayed to the user;\ntype of control\ndefines how the parameter is displayed. In the current example, it is specified as a \"drop–down list by object type\";\nobject type\ndefines the type whose objects will be provided to the user for selection.\n5.2. Save the item settings by clicking \"Save\"  in the modal the \"Control element settings\" window.\n5.3. Click \"Save\" on the \"Elements\" panel. This action will create a dashboard parameter. To go to the settings of the parameter, click\nto open a modal window.  To edit the parameter, double-click on the desired registry line or select a registry line and click\non the control panel:\nThe following fields must be filled in the dashboard parameter settings:\nname\nis the setting’s name;\nparameter value type\n;\nsystem object type\ndefines the type whose objects will be provided to the user for selection.\nWhen opening the control settings, the \"Parameter Connection\" field will be filled in automatically:\n6. Next, click\n, which opens a modal window, where the source is added.\nWhen adding a source based on a data source, specify the \"Name of the source\" and select the \"Data source\" generated earlier. In the \"Parameters\" panel, specify \"Parameter reference\" as the value type, and in the \"Dashboard Parameter\" field select the previously created parameter (as mentioned in paragraph 5).\n7. To set up the table:\n7.1. Click\nto configure the table, specify the \"Table name\" in the modal window and select the \"Data Source\" added in paragraph 5 and save.\n7.2. Configure the filter to debug the data display.\n7.2.1. To do this, add the visual by clicking\n. The system will display the filtering settings.\nClick\nto add all fields..\nClick\nto add fields selectively.\n7.2.2. To edit the names of the fields, select the field and click\nto go to the editing window. For more information about the field display options, see the\narticle\n.\n7.2.3. Save the changes by clicking\n. The system will display the configured dashboard table, if necessary, the filter visual can be edited or deleted. To do this, open the list of visuals and click on the corresponding icon next to the selected visual:\n8. Click \"Save\" and \"Ok\" buttons on the \"Elements\" panel.\nAfter setting up the required elements, the system will display the dashboard. The data limited by the selected parameter will be displayed on the dashboard in tabular form.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-dashboard-set-by-step.html"
}