{
  "title": "Релиз LTS.399",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРелиз LTS.399\nПатч LTS.399.1 от 19.02.2024\nИзменения и улучшения\nСтабилизирована возможность работы с группировками при настройке визуала экземпляра.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.399.1\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.399.1.war\nhttps://downloads.greendatasoft.ru/LTS/lts.399.1.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nПакет обновлений LTS.399.0\nНовые возможности\nРеализован новый компонент \"Коммуникационная панель\", предназначенный для быстрого доступа к часто используемым данным без дополнительных переключений между объектами.\nУсовершенствован интерфейс настройки Стартовой страницы: теперь создать собственную стартовую страницу еще проще!\nВ\nизбранном\nпоявилась возможность фильтрации.\nВ предметной области появилась возможность добавления связи типа \"Расширение\".\nРеализована новая функция sendMsgToSubjects для отправки сообщений произвольному списку получателей с возможностью указания получателей для копии и скрытой копии письма.\nПоявилась возможность добавлять цвет границ реестра.\nТеперь скачивание и печать электронного документа EDoc поддерживает отображение сравнения версий.\nИзменения и улучшения\nУсовершенствованы настройки реестра при работе с несколькими колонками одновременно.\nСтабилизировано отображение поисковых фильтров в реестре после установки обновлений.\nСтабилизирован процесс установки обновлений при помощи zip-архива и GUF-файла, в частности при переносе карточки экземпляра, содержащим различные элементы визуала.\nОптимизированы настройки для установки высоты аналитической панели.\nДля корректной работы с показателями через виджет финансовой отчетности скорректированы права доступа для административной группы.\nОптимизирована работа стартового события типа \"Signal Start Event\".\nСтабилизировано добавление строковых атрибутов в тип объектов с заполненными значениями необходимых полей.\nТеперь значения атрибутов типа \"Числовой\" и \"Целое число\" отображаются без разделителя (пробела).\nДоработана возможность подсветки значений атрибутов с различными визуалами.\nОтлажен процесс выдачи прав на атрибут при проверке на пустоту в дереве условий.\nСтабилизировано отображение наименований атрибутов, вставленных в код алгоритма.\nДоработана возможность установки значений при помощи функции attrByVar для атрибутов, в наименовании которых фигурировал символ\"/\".\nВ электронных документах EDoc улучшена иконка для перехода к объекту, по которому сформировано значение закладки.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.399.1-details.html"
}