{
  "title": "Сигнал-обработчик (Signal intermediate catch event)",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСигнал-обработчик (Signal intermediate catch event)\nЭлемент \"Обработчик промежуточного события-сигнала\" является\nприемником сигнала\nи обрабатывает события, полученные от\nисточника\n. Его выполнение блокируется до момента получения соответствующего сигнала, что обеспечивает синхронизацию потоков.\nОбработчик сигнала в Системе реализован типом\n\"ДО. Событие-обработчик. Сигнал\"\n.\nНа схеме бизнес-процесса обработчик сигнала обозначается\n.\nНастройка обработки сигнала может быть реализована как между элементами одного бизнес-процесса, так и для различных бизнес-процессов (подпроцессов).\nДля настройки параметров сигнала необходимо сохранить схему бизнес-процесса, после чего в меню этапа нажать на кнопку\n: откроется модальное окно с набором параметров для настройки.\nПараметр\nНазначение\nВкладка \"Настройка сигнала\"\nСостояние объекта\nВыбор состояния объекта из справочника Системы.\nДействует в рамках экземпляра процесса\nЛогический параметр, который ограничивает распространение сигнала за границами экземпляра процесса:\nпри активном положении переключателя отработка сигнала действует внутри данной схемы (источник и приемник должны находиться на схеме одного бизнес-процесса);\nпри неактивном положении переключателя обработка сигнала действует в нескольких схемах (источник и приемник могут находиться на разных бизнес-процессах).\nСигнал\nОпределение связи с\nисточником\nдля настройки передачи сигнала.\nИсточник и обработчик сигнала сопоставляются согласно значению, указанному в поле \"Сигнал\". Если значения в этом поле не указываются, то\nнаименования элементов схемы должны иметь одинаковое значение\n.\nРаспространяется на параллельно запущенные БП по другим маршрутным объектам\nЛогический параметр, определяющий распространение действия сигнала на параллельно запущенные бизнес-процессы по другим маршрутным объектам.\nАлгоритм для определения объекта\nВыбор\nалгоритма\nдля определения объекта, которому будет отправлен сигнал.\nЕсли алгоритм не указан, то осуществляется поиск сигнала-обработчика по всем объектам, имеющим активные процессы.\nОжидать обработку всех сигналов\nЛогический параметр, регулирующий ожидание обработки сигналов:\nпри активном положении переключателя приемник ожидает поступления всех сигналов от источника для продолжения процесса;\nпри неактивном положении переключателя приемник ожидает поступления первого сигнала со связанного источника для продолжения процесса.\nОткатывать маршрут по таймауту\nЛогический параметр, запускающий механизм автоматического отката маршрута процесса, если ожидаемый сигнал-источник не получен в течение заданного времени:\nпри активном положении переключателя обработчик будет ждать поступления сигнала в течение времени, указанного в параметре \"Таймаут до отката, сек\";\nЕсли сигнал не получен до истечения указанного времени, то произойдет откат бизнес-процесса на этап, указанный в параметре \"Откатить на элемент схемы\".\nпри неактивном положении переключателя обработчик ожидает сигнал без ограничения по времени.\nТаймаут до отката, сек\nВремя ожидания получения сигнала (в секундах).\nПо умолчанию используется значение 300.\nПараметр доступен при активном положении переключателя \"Откатывать маршрут по таймауту\".\nОткатить на элемент схемы\nВыбор этапа бизнес-процесса, на который будет осуществлен откат маршрута по истечении указанного времени.\nПараметр доступен при активном положении переключателя \"Откатывать маршрут по таймауту\".\nВкладка \"Служебное\"\nИдентификатор\nОтображение идентификатора элемента.\nПараметр определяется Системой.\nТип события\nОтображение наименования типа события элемента.\nПараметр определяется Системой.\nСотрудник, внесший последние изменения\nСотрудник Системы, который вносил последние изменения в настройки элемента.\nПараметр определяется Системой.\nПроцесс\nОтображение наименования бизнес-процесса, в котором используется элемент.\nПараметр определяется Системой.\nЭтап процесса\nОтображение наименования этапа бизнес-процесса.\nПараметр определяется Системой.\nДата последнего изменения\nДата внесения последних изменений в настройки элемента.\nПараметр определяется Системой.",
  "source": "https://docs.greendata.ru/platform/ru/signal-intermediate-catch-event.html"
}