{
  "title": "Release details, version LTS.399.1",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.399.1\nPatch LTS.399.1 of February 19, 2024\nChanges and improvements\nWorking with tab group when configuring the visual was stabilized.\nUpdate package LTS.399.0 of February 13, 2024\nNew features\nNew\nCommunication panel\nfeature was added: it is designed for quick access to frequently used data with no additional switching between objects.\nStart page customization was improved: now it’s even easier to create your own start page!\nFavorites\nfilter for search filters was added.\nNow the\nExtension\ntype connection can be added directly to the subject area.\nNew column settings and style settings for displaying registry borders and names were added.\nNew sendMsgToSubject functions was added: the user can now send emails to an arbitrary set of participants with a copy and a hidden copy of the email.\nEdoc: the possibility to download documents with text with changes in the document comparison mode was added.\nChanges and improvements\nWorking with settings for displaying analytical panel height in dashboards was improved;\nDisplay of columns in registries was improved;\nWorking with business processes was improved: Signal Start Event function was stabilized;\nSetAttr function was stabilized;\nSearch filters functioning was optimized;\nPossibility of highlighting attributes under different visuals was improved;\nNow for \"Numeric\" and \"Integer\" attributes there is no formatting with value separation (no space or comma);\nAttribute permissions granting when checking a field for an empty value was stabilized;\nAttribute names display was stabilized;\nWorking with guf files when installing updates was stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.399.1-details.html"
}