{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.405.3\nот 01.04.2024\nНовые возможности\nПоявилась возможность расчета эффективных прав, позволяющая анализировать фактические и плановые права.\nТеперь при просмотре схемы маршрутного объекта можно перейти к настройке схемы бизнес-процесса.\nТеперь возможность создания новых источников данных на основе SQL может регулироваться настройкой в конфигурационном файле.\nВ модуле EDoc появилась возможность:\nперехода между взаимосвязанными элементами опросного листа и закладками;\nприкрепления электронного документа к объекту в заданном пользователем формате;\nформирования наименования скачиваемого документа при помощи алгоритма.\nИзменения и улучшения\nУсовершенствовано формирование объектного источника данных.\nСтабилизирована актуализация схемы базы данных.\nОтлажен процесс создания нового экземпляра в multiselect-атрибуте при наличии выбранного значения.\nВ настройках элементов визуала стабилизировано отображение привязанных визуальных алгоритмов.\nСтабилизировано применение стилей в виджете \"Заголовок по атрибуту\".\nДоработана логика открытия ссылок через виджет \"Текстовое сообщение\".\nСтабилизирован процесс компиляции алгоритмов, в которых присутствует построчный перенос параметров функций.\nСтабилизированы положение и размер выпадающих списков различных элементов Системы.\nОптимизированы настройки и стабилизирована работа с модулем форм отчетности.\nСтабилизирована работа с реестрами.\nДоработана логика удаления реестра с наличием зависимостей.\nСтабилизированы настройки создания и установки GUF-файлов.\nДоработаны настройки при копировании темы оформления в конструкторе тем.\nСтабилизировано применение прав доступа при работе с объектом.\nВ модуле EDoc усовершенствован ряд настроек связанных с формированием и прикреплением файла к объекту, а также скачиванием документов в режиме работы с закладками или рецензирования.\nВ модуле EDoc доработаны настройки интервалов и стабилизировано сравнение версий документов.\nОптимизирована производительность Системы.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.405.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.405.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.405.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.405.3-latest.html"
}