{
  "title": "Copying object attributes",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCopying object attributes\nCreating a new instance of an object type using the copy option can be accompanied by filling in object attribute values in several ways:\nusing the object attribute value from the copied instance;\ncreating a copy of a linked object. In this case, the System will automatically create an identical copy of the object instance referenced by the object attribute.\nBy default, the “-copy” suffix will be added to the name of the created object.\nIf the copied instance has multiple values (in\nmultiselect attributes\n) selected as the object attribute value, then, in the object type registry referenced by the given object attribute, copies of instances are created for each selected object.\nThe selection of method depends on the definition of the “Create a copy of the value when copying the main object” parameter value available in the attribute settings on the “Optional” tab.\nThis parameter is used when creating a copy of a business process, which allows creating copies of algorithms without creating copies of other object values (for example, roles, file classifications, processes, etc.)\nExample\nLet’s say that when working with previously serviced clients, new requests are created by copying a previously created one. It is necessary to make a setting in which the values of the \"Client\", \"Responsible Employee\" and \"Product\" object attributes are inherited from the main copied object, and copies of objects are created for the values of the \"Approval document\" attribute.\nTo implement this task, when creating an object model of the \"Application\" type, in the settings of the \"Client\", \"Responsible employee\" and \"Product\" object attributes, the \"Create a copy of the value when copying the main object\" switch is inactive:\nAnd for the \"Approval document\" object attribute the specified switch is moved to the active position.\nThis will allow creating an independent copy of the object, further changes to which will be made only to this application.\nAfter saving the settings, go to the object registry of the \"Application\" type, where the values are copied from the associated object when copying instances (from the object profile or in the registry of objects) for the \"Client\", \"Responsible employee\" and \"Product\" attributes, and for the \"Approval document\" attribute value, the system will create and use a copy from the associated object.\nThe “Approval document” object attribute refers to the “File” object type.\nAfter creating a copy of the \"Application\" type instance, for the objects selected in the copied object as the value of the \"Approval document” object attribute, the system will create corresponding copies of instances in the \"File\" type registry.",
  "source": "https://docs.greendata.ru/platform/en/copying_object_attributes.html"
}