{
  "title": "Часто используемые алгоритмы (кейсы)",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЧасто используемые алгоритмы (кейсы)\nДостаточно часто требуется автоматизация выполнения определенных действий в процессе настройки бизнес-схемы. Необходимые формулы фиксируются в\nкарточке алгоритма\n. Сам алгоритм привязывается к типу объекта. Чаще всего алгоритмы фиксируются:\nна вкладке\n\"выражения\"\nв\nкарточке типа объекта\n;\nв\nпользовательских действиях\n;\nв\nзадачах бизнес-процесса\n.\nДалее приведены подробные примеры написания алгоритмов для реализации автоматического выполнения часто встречающихся действий.\nЗаполнение атрибутов\nАвтоматическое заполнение атрибута реализуется алгоритмом\n. Алгоритм представляет в Системе соответствующий тип объекта и его\nкарточку\n. Чтобы атрибут текущего объекта присвоил необходимое значение нужно:\n1. Выбрать функцию\ncurrentObject\nна вкладке \"Объекты\" редактора алгоритмов. Система отобразит выбранную функцию в карточке объекта.\n2. Выбрать атрибут при помощи функции\nattr\nс выбранным признаком \"Установить значение\". Это значение будет присвоено атрибуту после выполнения алгоритма.\n3. Сохранить текущий объект, изменения которого выполняются, посредством функции\nsave\n.\n4. В случае выполнения алгоритма, Система выполнит присвоение значения атрибуту в выбранной карточки. Результат выполнения алгоритма можно просмотреть в карточке объекта. Выполнение алгоритма можно проверить по кнопке\n. Чтобы обозначить корректное выполнение алгоритма, необходимо задать возвращаемое им значение функцией\nreturn\n, например, \"111\".\n5. Сохранить алгоритм по кнопке\nи проверить его выполнение. Для этого:\n5.1. Нажать\nв панели управления карточки.\n5.2. Выбрать способ указания объекта \"Выбор из списка\".\n5.3. Указать тип объекта (обычно тот, что указан в карточке алгоритма как\nБазовый тип объекта\n) и объект (экземпляр типа, значение которого будет корректироваться/ заполняться).\n5.4. Нажать кнопку\n. Система выполнит алгоритм. Так как алгоритм возвращает некоторое значение, отобразится соответствующий\nРезультат\n.\nТаким образом выполняется присваивание значения атрибуту и проверка алгоритма.\nСоздание объекта\nЧасто бизнес-логика предполагает\nавтоматическое создание объекта\n(экземпляра типа). Например, требуется автоматическое создание заявки. Для создания алгоритма генерации новой заявки необходимо:\n1. Задать переменную, которая присвоит значение нового объекта посредством\nфункции\nvar\n.\n2. Выбрать оператор присваивания\nи функцию\nnewInstance\nдля создания экземпляра типа, например, заявки на банковскую гарантию. В карточке алгоритма тип объекта выделяется голубым цветом.\n3. Указать атрибуты типа, которые будут заполнены автоматически. Атрибуты указываются при помощи функции\nattrByVar\n. Справочные значения в алгоритме подсвечиваются коричневым цветом.\n4. Сохранить созданный экземпляр объекта при помощи функции\nsave\n.\n5. Сохранить алгоритм по кнопке\nи проверить его выполнение (аналогично пункту выше). Выполнение алгоритма проверяется по кнопке\n.\nТаким образом настраивается автоматическая генерация нового экземпляра типа в Системе.\nЗапуск бизнес-процесса\nСистема позволяет настроить автоматический запуск\nбизнес-процесса\nпосредством алгоритма.\nЗапуск\nбизнес-процесса\nпредполагает создание\nнового экземпляра бизнес-процесса\n. Маршрутный тип объекта является\nбазовым типом объекта\nдля\nалгоритма\n. Для настройки автоматической генерации бизнес-процесса необходимо выполнить следующее:\n1. Задать переменную, которая присвоит значение нового экземпляра бизнес-процесса посредством функции\nvar\n. Выбрать оператор присваивания\nи функцию\nnewInstance\nдля создания экземпляра типа. Работа аналогична созданию экземпляра объекта.\n2. Указать атрибуты типа, которые будут заполнены автоматически. Атрибуты указываются при помощи функции\nattrByVar\n. Необходимо указать запускаемый процесс (посредством функции\ndict\n) и маршрутный объект (функция\nAttr\n).\n3. Сохранить созданный экземпляр бизнес-процесса при помощи функции\nsave\n.\n4. Сохранить алгоритм по кнопке\nи проверить его выполнение (аналогично пункту выше). Чтобы обозначить корректное выполнение алгоритма, необходимо задать возвращаемое им значение функцией\nreturn\n, например, \"111\".\nТаким образом настраивается автоматический запуск бизнес-процесса.\nАвтоматически запускаемый бизнес-процесс имеет ряд ограничений\n, а именно:\nне должен иметь\nстартовую страницу\n;\nне должен содержать какие-либо первоначальные проверки.\nНапример, когда необходимо запустить бизнес-процесс \"Старт бизнес-процесса. Основной процесс\" для заявок со статусом \"Согласовано с Кредитным подразделением\" и \"Согласовано с головным офисом (ГО)\", алгоритм настройки выглядит следующим образом:\nРаздача прав\nПрава на работу (запись и/ или чтение) с объектом могут присваиваться или отниматься в рамках алгоритма. Для этого используется функция\nsetPermission\n.\nНапример, в процессе определения участников сделки (рассмотренных в заявке на принятие решения, далее ЗПР), отбираются необходимые пользователи Системы. Эти пользователи определяются переменной \"\nUser_for_task_1\n\". Затем им присваиваются права на чтение и запись текущего объекта.\nВ рассматриваемом случае пользователь (user_for_task1) вычисляется из коллекции экземпляров типа \"Пользователь\" посредством функции\nobjectsWithOptions\nс условием – алгоритмом фильтрации\nfilterAlg\n.\nФункция\nsetPermission\nнаделяет определенного пользователя \"user_for_task1\" правами на чтение и запись текущего объекта.\nКопирование данных из карточки в карточку\nПеренос данных из карточки объекта в карточку может выполняться путем копирования как ''\nнабора атрибутов\n'', так и точечно (копирование каждого атрибута? рассмотрено далее).\nНапример, для точечного копирования атрибутов из Заявки на принятие решения в Заявку на оформление кредитно-обеспечительной документации (КОД), необходимо сформировать алгоритм следующего вида:\nАлгоритм копирования должен обязательно содержать функции:\nnewInstance\n– создание нового объекта;\nsave\n– сохранение созданного объекта.\nЗапуск процесса ETL\nЗапуск\nпроцесса ETL\nпредполагает создание\nнового экземпляра процесса ETL\n.\nНапример, необходимо запустить процесс ETL для создания Заявки на оформление кредитно-обеспечительной документации (далее КОД) в сторонней Системе на основании имеющейся \"Заявки на КОД\". Алгоритм настройки выглядит следующим образом:\nАлгоритм автоматического запуска процесса ETL должен обязательно содержать функции:\nnewInstance\n– создание нового экземпляра объекта;\nsave\n– сохранение созданного экземпляра объекта.\nВ случае запуска ETL (создания экземпляра процесса ETL) по объекту\nв рамках алгоритма жизненного цикла\nс его сохранением, Система выполнит ETL отложено. То есть когда в алгоритме жизненного цикла создается экземпляр объекта ETL и текущий объект устанавливается в атрибут \"Объект, по которому запускается ETL\", Система сначала выполнит сохранение основного объекта. После этого выполняется процесс ETL. Иначе говоря,\nзапуск указанного процесса ETL происходит не во время выполнения алгоритма жизненного цикла – до сохранения текущего объекта, а после его сохранения.\nОтправка сообщений\nИнформирование пользователей Системы\nвыполняется различными способами. Например, автоматическая отправка сообщений в\nчат\nнастраивается посредством функции\nsendChatMsgToSubject\n, а формирование информационных всплывающих уведомлений настраивается посредством функции\nsendPopUpMsg\n.\nДля отправки сообщений на электронную почту используются следующие функции:\nsendMsgToEmail\n– автоматическая отправка сообщения на указанный (любой) адрес электронной почты;\nsendMsgToSubject\n– автоматическая отправка сообщения по электронной почте пользователю Системы.",
  "source": "https://docs.greendata.ru/platform/ru/frequently-used-algorithms-use-cases.html"
}