{
  "title": "Setting up a custom action (via a button)",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up a custom action (via a button)\nCurrently, the System has a wide range of custom actions that can be quickly configured if needed.\nThe\ncustom action\ninvolves displaying the corresponding button in a specific object profile and/or in the registry.\nTo configure a custom action (via a button), you need to:\n1. Select an action from the corresponding registry (\nmore about working with the registry\n).\n2. Use the\nbutton to edit the selected action.\n3. Specify the required parameters for the custom action. Learn more about\naction parameters\n.\n4. Click\nto save the values entered.\nOnce the settings are made, the System will display the ability to perform the action (button) in a pre-defined visibility area:\nNote, that a user\nwith no editing permissions, but with reading permissions for the object\n, where the button is located,\ncan click it and view the profile\n. This automatic setting is available both for the generated buttons in action and for the\nWidgets\nbutton when working with the following modules:\nEntering data of a dashboard\nEntering adjustments for all forms of methodology\nConsolidation by the group of companies\nAdjustments to financial reporting\nReporting Consolidator\nThe ability to view the object using the button (\nview-only\nif the user has\nread-only\npermissions) is available for all actions related to the display of reports (the\nOpen\nbutton, multiple forms viewing, adjustment mode, transformation and consolidation of reports).\nIt means,\nthe user is always able to open the reporting forms or dashboards associated with the object, with read-only permissions, using the button configured and view the data\n. But the user is not able to make adjustments and save data.\nExamples of setting up custom actions",
  "source": "https://docs.greendata.ru/platform/en/setting-up-a-custom-action-via-a-button.html"
}