{
  "title": "Обновления в платформе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбновления в платформе\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.395.1\nот 23.01.2024\nНовые возможности\nВ алгоритме фильтрации для списка объектов, участвующих в автокалькуляции, появилась возможность обработки функций \"diffDate\" и \"employeeOnSubordination\".\nВ новом редакторе EDoc появилась возможность создания и работы с алгоритмами видимости, ранее реализованная только в старом редакторе шаблона.\nОбновлены пункты меню для базовой поставки – исключен пункт \"Реестр объектов\", пункт \"Алгоритмы визуалов\" перемещен в раздел \"Управление объектами\", добавлен новый пункт \"Алгоритмы визуалов\".\nТеперь имя участника, указанное при первом входе в комнату для внешнего звонка, автоматически может применяться при звонке во всех комнатах на текущем стенде.\nИзменения и улучшения\nСкорректирован состав элементов, собираемый в guf-файла сокращенного обновления, а также стабилизирован процесс формирования guf-файлов.\nТеперь блокировка добавления объектов в файл обновления сопровождается уведомлением с пояснением, а визуал экземпляра  автоматически собирается в guf-файл со всеми элементами.\nЗначение портов отправки и получения для учетной записи электронной почты теперь может быть заполнен автоматически.\nУсовершенствованы настройки аналитической панели \"Канбан-доска\".\nОптимизирована работа виджетов \"Чекбокс с гиперссылкой\",  \"Статус бар\" и  \"Реакции и комментарии к объекту\".\nПри настройке визуала экземпляра из списка атрибутов панели элементов скрыты атрибуты потенциального (возможного) расширения.\nСтабилизирован процесс загрузки и скачивания файлов через атрибут.\nОпция многострочного отображения теперь доступна и для multiselect-атрибутов.\nИзменение обязательности атрибута теперь не влияет на параметр значения по умолчанию.\nОптимизирована работа редактора алгоритмов при выделении фрагмента алгоритма и отображении подсказок.\nОптимизирована функция getComment.\nСтабилизировано выполнение алгоритмов видимости.\nДля алгоритмов типа \"Алгоритм. ETL\" восстановлена возможность полноценного использования функций attrByVar и attr.\nПри работе с ETL изменен процесс прикрепления сформированного файла.\nУсовершенствования в модуле EDoc распространяются на сравнение версий при работе с закладками, добавление нескольких комментариев к закладке, работе с документом после разрыва связи.  Также стабилизирован процесс отображения элементов списка при отклонении правок в документе и выгрузки документа из режима работы с закладками.\nОтлажен процесс настройки связей в источнике данных.\nПри выходе из конструктора страницы входа без сохранения внесенных изменений добавлено диалоговое окно с соответствующим уведомлением.\nНормализован процесс сортировки данных при работе с реестрами.\nСтабилизирован процесс сохранения данных карточки с дочерними атрибутами.\nОптимизированы настройки ETL при настройке соединения с внешней БД.\nСтабилизирован процесс определения текущей даты и времени пользователя по настройкам ПК.\nСоединение с комнатой внешнего звонка теперь более устойчиво.\nУлучшена производительность открытия карточек объектов.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.395.1\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.395.1.war\nhttps://downloads.greendatasoft.ru/LTS/lts.395.1.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.395.1-latest.html"
}