{
  "title": "Атрибуты",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАтрибуты\nАтрибут типа объекта\n— это именованная характеристика, являющаяся некоторым свойством объекта. Атрибуты используются для идентификации, классификации, выражения количественной характеристики или состояния объекта.\nВ\nтипе объекта\nна вкладке \"Атрибуты\" в виде таблицы представлен его атрибутивный состав, включая:\nатрибуты, унаследованные от родительского типа, просмотр которых доступен при активации признака \"Показать атрибуты родительского типа\";\nсобственные атрибуты (специально созданные или добавленные из другого типа объекта).\nДля настройки атрибутивного состава используются следующие действия, расположенные над таблицей:\nДействие\nНазначение\nСоздание\nнового атрибута.\nРедактирование\nнастроек\nдобавленного атрибута.\nПросмотр и редактирование настроек также доступно после двойного клика по наименованию атрибута в таблице.\nУдаление атрибута из атрибутивного состава типа.\nЕсли удаленный атрибут имеет связи с иными объектами системы, то при сохранении типа объекта будет отображено модальное окно, в котором необходимо указать\nдействие для связанных объектов\n.\nДобавление в атрибутивный состав настраиваемого типа объекта\nатрибута, ранее созданного в другом типе\n.\nПоказать атрибуты родительского типа\nОтображение атрибутов родительского типа\n.\nСистема позволяет отобразить любой атрибут объекта на\nвизуале\nили обратиться к нему в\nалгоритме\n.\nВ алгоритмах стилизации, сортировки, группировки и фильтрации данных не используются цепочечные атрибуты\n[\n1\n]\n.\nСоздание атрибута\nСоздание\nнового атрибута осуществляется по кнопке\n, в результате чего откроется модальное окно для настройки характеристик атрибута (тип хранимых данных, визуальное представление, обязательность и т.д.).\nВ дальнейшем, изменить или дополнить заданные характеристики позволит возможность\nредактирования\nатрибута, однако стоит учитывать, что некоторые настройки могут быть определены только лишь при создании атрибута.\nПодробнее с параметрами и нюансами настройки атрибута можно ознакомиться в статье\n\"Настройка атрибута\"\n.\nДобавление существующего атрибута\nПри формировании атрибутивного состава типа не обязательно всегда создавать новые атрибуты — можно использовать атрибут другого типа.\nДля этого следует нажать на кнопку \"Добавить существующий\" с последующим выбором атрибута:\nуказанного типа:\nПолный перечень типов в выпадающем списке поля \"Тип объекта\" доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nиз полного списка атрибутов системы:\nПоиск атрибута можно осуществить путем ввода наименования или идентификатора атрибута.\nПосле выбора атрибута будет отображена информация, в каких типах объектов он используется.\nПри помощи параметра \"Обязательный\" для добавляемого атрибута можно сразу определить обязательность ввода значения.\nДля добавления выбранного атрибута в атрибутивный состав настраиваемого типа объекта необходимо нажать на кнопку\n.\nАтрибуты родительского типа\nКаждый тип объекта наследует атрибуты родителя, для отображения которых необходимо активировать признак \"Показать атрибуты родительского типа\".\nВ таблице можно увидеть иерархию наследования атрибута, раскрытие/сворачивание которой регулируется кнопками\n/\n, расположенными слева от наименования атрибута.\nВ колонке \"Контекст (Тип)\" отображается тип объекта, от которого был унаследован атрибут, а в колонке \"Владелец (Тип)\" – тип объекта, где этот атрибут изначально был создан (первоначальный владелец атрибута).\nПри настройке унаследованного (родительского) атрибута можно\nпереопределить\nего\nпараметры\nотносительно исходных значений. Рядом с измененным значением отобразится кнопка\n, по нажатию на которую значение вернется к первоначальному виду:\n1\n. Цепочечный атрибут — атрибут, представленный в виде конструкции, обеспечивающей последовательный доступ к вложенным атрибутам объекта через оператор точки (.)",
  "source": "https://docs.greendata.ru/platform/ru/attributes.html"
}