{
  "title": "Целевая матрица доступа",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЦелевая матрица доступа\nЦелевая матрица доступа — это эталонная модель того, какими правами доступа к объектам Системы должны обладать субъекты безопасности с точки зрения бизнес-логики и политики безопасности.\nДля создания целевой матрицы доступа необходимо последовательно выбрать пункты главного меню:\nАдминистрирование → Управление доступом → Анализ прав доступа → Определение целевых прав\n.\nВ открывшемся реестре \"User Story\" необходимо создать экземпляр нажатием на кнопку\nв панели управления (подробнее о\nработе с реестрами\n), задать наименование, после чего сохранить нажатием на кнопку\n.\nВ результате чего на панели управления станет доступна кнопка\n, при нажатии на которую осуществится переход к настройке целевой матрицы доступа по следующим параметрам:\nполе \"User Story\" предназначено для выбора одной или нескольких целевых матрицы доступа из выпадающего списка.\nПо умолчанию поле заполнено ссылкой на текущий экземпляр целевой матрицы.\nПри выборе нескольких матриц в поле \"User Story\" Система формирует обобщенную целевую матрицу доступа путем агрегации всех объектов и групп доступа.\nВ этом случае матрица\nдоступна только для просмотра\n.\nдобавление сущностей в целевую матрицу осуществляется при помощи кнопки\nс последующим выбором варианта:\n\"добавить объект для выдачи прав\" – открытие модального окна для выбора\nобъектов\nСистемы, права на которые необходимо зафиксировать в целевой матрице;\n\"добавить группу доступа\" – открытие модального окна для определения\nгрупп доступа\n, которые необходимо наделить правами на выбранные ранее объекты Системы.\nВыбор групп доступа возможен только после добавления хотя бы одного объекта в матрицу.\nс помощью переключателя \"Отображать значение UUID\" регулируется отображение/скрытие\nUUID\nдля объектов в матрице.\nдля удаления объекта из матрицы необходимо выбрать его в реестре, затем нажать на кнопку\n. Удаление группы доступа осуществляется нажатием на кнопку\nрядом с наименованием группы.\nЦелевая матрица доступа представляет собой таблицу. Выбранные\nгруппы доступа\nдобавляются в виде новых столбцов, а\nобъекты\n— в виде строк. На пересечении строк и столбцов настраиваются необходимые привилегии посредством выбора значений из выпадающего списка:\nВыбранные привилегии отобразятся в таблице в виде сокращений, с расшифровкой которых можно ознакомиться в\nстатье\n.\nЭкспорт файла с целевой матрицей доступа в формате *.xlsx осуществляется нажатием на кнопку\nв панели управления.",
  "source": "https://docs.greendata.ru/platform/ru/target_access_matrix.html"
}