{
  "title": "Виджет \"Вопросы электронной повестки\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Вопросы электронной повестки\"\nВиджет \"Вопросы электронной повестки\"\n– это инструмент, посредством которого председателем осуществляется визирование перечня вопросов повестки. При этом список вопросов повестки может быть подписан одновременно при помощи нажатия на кнопку \"Подписать все\", либо решение по каждому вопросу может быть рассмотрено индивидуально, в результате чего вопрос может быть подписан или отправлен на доработку секретарю с добавлением комментария.\nПример настроенного виджета:\nДля настройки виджета необходимо, чтобы в типе объекта настраиваемой карточки был добавлен дочерний атрибут типа с подготовленным атрибутным составом.\nДобавление виджета в карточку объекта осуществляется в режиме настройки\nвизуала экземпляра\n. При переходе на панели \"Элементы\" на вкладку \"Виджеты\" необходимо из раздела \"Коллегиальные органы\" перетащить (Drag&Drop) виджет \"Вопросы электронной повестки\" в рабочую область карточки.\nВиджет \"Вопросы электронной повестки\" можно перетаскивать только в контейнер пространства \"Ряд\", предварительно добавленный в рабочую область карточки с вкладки \"Группировки\" панели \"Элементы\".\nСистема отобразит параметр\n\"Атрибут из типа \"наименование типа объекта\", содержащий список вопросов\"\nдля настройки виджета.\nПеречень остальных параметров виджета будет доступен после определения значения параметра ''\"Атрибут из типа \"наименование типа объекта\", в котором необходимо выбрать атрибут дочернего типа.\nНаименование выбранного дочернего атрибута будет отображаться в параметрах виджета (далее по тексту – НДА).\nПараметры\nНастройка виджета осуществляется по следующим параметрам:\nПараметр\nНазначение\nАтрибут из типа \"наименование типа объекта\" содержащий список вопросов\nОпределение атрибута типа \"дочерний объект\", содержащего список вопросов повестки для визирования.\nВыбор осуществляет посредством выпадающего списка.\nАлгоритм фильтрации вопросов повестки\nВыбор алгоритма фильтрации отображения вопросов повестки.\nВыбор осуществляется из выпадающего списка заранее подготовленных алгоритмов. Для добавления нового алгоритма необходимо нажать на меню действий в правой части поля и выбрать опцию \"Добавить\" в контекстном меню, после чего откроется модальное окно по созданию алгоритма.\nАтрибут из типа \"НДА\" содержащий основной документ\nВыбор объектного атрибута, содержащего файл решений (объектный атрибут ссылается на реестр типа \"Файл\"[FS_FILE]).\nАтрибут из типа \"НДА\" содержащий список файлов для приложения\nВыбор объектного мультиселект-атрибута, в котором содержится список файлов приложения (объектный атрибут ссылается на реестр типа \"Файл\"[FS_FILE]).\nВыбор осуществляется посредством выпадающего списка.\nАтрибут из типа \"НДА\" содержащий текст вопроса повестки\nВыбор текстового атрибута, содержащего текст описания вопросов повестки.\nВыбор осуществляется посредством выпадающего списка.\nАтрибут из типа \"НДА\" содержащий принятый статус по вопросу (на доработку/подписать)\nВыбор объектного атрибута для записи принятого решения. Вопросу может быть присвоен статус \"на доработку\" или \"подписать\".\nАтрибут из типа \"НДА\" содержащий комментарий\nВыбор текстового атрибута, для записи комментария по вопросу.\nВыбор осуществляется посредством выпадающего списка.\nАлгоритм видимости кнопки комментирования при просмотре файла\nВыбор алгоритма для определения видимости кнопки комментирования при просмотре файла.\nВыбор осуществляется из выпадающего списка заранее подготовленных алгоритмов. Для добавления нового алгоритма необходимо нажать на меню действий в правой части поля и выбрать опцию \"Добавить\" в контекстном меню, после чего откроется модальное окно по созданию алгоритма.\nПод перечнем параметров для настройки виджета отображается макет виджета по текущим настройкам.\nПример использования\nНеобходимо настроить карточку типа объектов \"Заседание\", содержащую вопросы повестки для визирования председателем с перечнем файлов по вопросу, таким образом, чтобы имелось возможность подписания всех вопросов одновременно по одному клику, а также отправки вопроса на доработку.\nНастройка\nДля реализации поставленной задачи разработан виджет \"Вопросы электронной повестки\". Для его последующего использования необходимо удостовериться, что атрибутивный состав типа объекта \"Вопрос для принятия решения\" содержит набор атрибутов:\n\"Заседание\" – объектный атрибут ссылающийся на реестр типа \"Заседание\", необходимый для настройки связи между типами \"Заседание\" и \"Вопрос для принятия решения\";\n\"Вопрос для председателя\" – текстовый атрибут, содержащий текст вопроса повестки;\n\"Решение\" – объектный атрибут, ссылающийся на тип \"Файл\" [FS_FILE], посредством которого будет добавляться файл с решением;\n\"Файлы для подписания\" – объектный мультиселект-атрибут, ссылающийся на тип \"Файл\" [FS_FILE], посредством которого будут добавляться файлы по вопросу повестки (приложения).\nДля записи решения председателя необходимо также добавить атрибуты:\n\"Результат визирования председателя\" – объектный атрибут, ссылающийся на реестр типа с объектами:\n\"Решение подписано\" (с Сист. Идентификатором – SIGNED);\n\"Доработка решения\" (с Сист. Идентификатором – REWORK);\n\"Комментарий к подписанию\" – текстовый атрибут для добавления комментария решения со статусом \"на доработку\".\nВ типе объектов \"Заседание\" необходимо добавить атрибут дочернего типа \"Вопросы повестки\" типа объектов \"Вопрос для принятия решения\" со связью по атрибуту \"Заседание\":\nПосле сохранения внесенных изменения следует открыть\nреестр типа\nи создать экземпляр объекта.\nВ карточку объекта в режиме настройки\nвизуала экземпляра\nнеобходимо очистить визуал, после чего перетащить (Drag&Drop) в рабочую область карточки группировку \"Ряд\", а в образовавшийся контейнер группировки виджет \"Вопросы электронной повестки\".\nВ качестве параметра \"Атрибут из типа \"Заседание\" содержащий список вопросов\" выбирается дочерний объект \"Вопросы повестки\", после чего в виджете отобразятся остальные параметры настройки, значениями которых указываются атрибуты, как показано далее:\nПосле сохранения экземпляра объекта, его можно будет выбрать в атрибуте \"Заседание\" в карточке объекта типа \"Вопросы электронной повестки\", где также задается значение атрибута \"Вопрос для председателя\" и прикрепляются необходимые файлы по вопросу в атрибутах \"Решение\" и \"Файлы для подписания\". После чего в настроенном виджете в карточке объекта типа \"Заседание\" будут отображены соответствующие данные для визирования.\nРабота с виджетом\nПри наведении курсора мыши на наименование вопроса отобразится хинт с полным наименованием.\nПри нажатии на файл решения или приложения, он откроется в модальном окне.\nДля подписи решения по вопросу повестки следует нажать на кнопку\nв соответствующей строке.\nКнопка\nавтоматически подписывает весь перечень принятых решений по вопросам повестки.\nПри нажатии на кнопку доработки откроется модальное окно для обоснования принятого решения. Добавленный комментарий записывается в атрибут, указанный в параметре \"Атрибут из типа \"НТО\" содержащий комментарий\". После добавления комментария в строке вопроса отображается статус\n.\nРешение, принятое председателем будет отражено в качестве значения атрибута \"Результат визирования председателя\" :\nдля подписанного вопроса будет определен статус \"Решение подписано\";\nдля вопроса, отправленного на доработку, установится статус \"Доработка решения\", а в поле \"Комментарий к подписанию\" будет отображен оставленный председателем комментарий.",
  "source": "https://docs.greendata.ru/platform/ru/electronic-agenda-widget.html"
}