{
  "title": "Setting up business process flowcharts",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up business process flowcharts\nBusiness process is a flowchart of interaction, an algorithm that users apply to achieve a result (including the execution of system automatic actions).\nSwitching to configuring the business process flowchart is possible from the\nbusiness process profile\nafter selecting the\nprocess version\nby clicking the\nbutton.\nDebugging of the business process flowchart is performed on the workspace of the business process profile by dragging and dropping the necessary elements from the panel.\nTo\ncreate a new element\nin the business process flowchart, drag it from the panel on the left.\nTo\nconnect elements in the flowchart\n, select the starting element and drag an arrow to the target element.\nThe names of elements are set on the business process flowchart itself after double-clicking on it.\nThe following features are provided in the control panel:\n– the button for saving the BPMN flow chart;\n– the button for saving the flow chart created in the workspace on the user’s device in .svg format;\n– the button that will open\nbusiness process settings\nin the modal window;\n\"Make version up to date\" – the button to assign the \"Up to date\" status to the current version (more information about\nversioning of business processes\n);\nThe button is available  the business process object when it’s opened with the \"Draft\" or \"Archive\" status.\nWith permissions to \"Edit\" the business process object, the name of the business process can be changed in the \"Name\" field.\n\"Process version status\" displays the status of the current version;\n\"Process version\" is an element for changing/creating a version of a business process.\nSwitching between existing versions of the process is done via a drop-down list, creating a new version of the process is available via the actions menu.\nThe business process profile is opened from the current window.\nTo avoid data loss, if changes have been made to the business process flowchart, they should be saved before opening the business process profile.\nEach element of a business process has a set of parameters.\nTo view the parameters\nof a business process element, click on the corresponding flowchart element and select the\nbutton in the displayed action icons.\nViewing element properties is only available after saving the business process for the first time.\nIf the list of icons for an element is not displayed, then:\nthe scale is too small, in this case it is necessary to increase the scale of the chart (by scrolling the mouse wheel);\npop-up windows are blocked in the browser.\nAfter clicking on the settings\nbutton, the system will display the profile of the selected element of the business process flowchart. The settings depend on the element group.\nThe business process flowchart is implemented in BPMN 2.0 and consists of the following groups of elements:\nelements of the \"Event\" flow (StartEvent)\n;\nstart\n;\nintermediate\n;\nend\n;\ngateways (ExclusiveGateway)\n;\nactions (Task)\n;\nareas of responsibility (pools and lanes)\n;\nartifacts (annotations)\n.\nThe DataObjectReference element (DataObjectReference)\nis\nnot used\nin the System.\nThe \"Lasso\" tool\nis  used to simultaneously select several objects on the chart.\nThe configured stages of the business process are defined in the System as the \"\nWorkFlow. Business process stage\n\"\nobject type\n(or its child type).\nThe running business process will be defined as the \"\nWorkFlow. Instance of the running process\n\"\nobject type\n(or its child type). These types of objects contain both system and user attributes.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-business-process-flowcharts.html"
}