{
  "title": "Загрузка объектов из файлов Excel",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЗагрузка объектов из файлов Excel\nПостановка задачи\nДопустим, у сотрудника отдела кадров имеется список кандидатов, а также история проведенных собеседований в формате *.xls. Требуется произвести импорт кандидатов для дальнейшей работы в Системе.\nВ качестве шаблона используется файл, представленный на двух листах:\nна листе \"Данные\" размещена информация о кандидатах;\nна листе \"История собеседований\" – информация о проведенных собеседованиях.\nОбъектная модель\nВ рамках примера создадим тип объектов \"Импорт кандидатов\" со следующими атрибутами:\nФамилия;\nИмя;\nОтчество;\nДолжность;\nПодразделение;\nДата рождения;\nНомер телефона;\nE-mail;\nСобеседования.\nАтрибут \"Собеседования\" является дочерним и содержит информацию о проведенных собеседованиях по каждому кандидату.\nНастройка\nНастройка процесса загрузки данных состоит из следующих этапов:\nНастройка шаблона загрузки данных из файла\n.\nНастройка отображения кнопки для загрузки данных\n(настройка действия \"Загрузка локальных объектов из Excel\").\nЗагрузка данных пользователем\n.\nНастройка шаблона загрузки данных из файла\nПосле создания объектной модели необходимо настроить шаблон загрузки данных из файла (подробнее, в статье\n\"Настройка шаблона загрузки xls-файлов\"\n).\nПосле настройки шаблон примет следующий вид:\nВ разделе \"Импорт кандидатов\" производится сопоставление ячеек листа \"Данные\" с атрибутами типа объектов \"Импорт кандидатов\", в разделе \"Собеседование\" – сопоставление ячеек листа \"История собеседований\" с атрибутами типа объектов \"Собеседование\" соответственно.\nНастройка отображения кнопки для загрузки данных\nСоздание пользовательского действия\nДля создания пользовательского действия необходимо обладать\nправом\nна создание экземпляров типа \"Действие\" [SYS_ACTION].\nДля загрузки данных из файла Excel в соответствии с шаблоном настроим\nпакетное действие\n, состоящее из следующих действий:\nВ первую очередь настраивается\nпользовательское действие\n\"Загрузить отчет\", посредством которого будет производиться импорт данных из файла.\nВ качестве модуля пользовательского интерфейса необходимо выбрать \"Загрузка локальных объектов из Excel\".\nПосле этого в поле \"Дополнительные параметры действия\" нажать на кнопку \"Создать\":\nв поле \"Родительский шаблон\" необходимо выбрать заранее подготовленный шаблон;\nпри необходимости можно выбрать алгоритм определения объекта.\nАлгоритм будет выполнен по объекту, на карточке которого было вызвано действие, и должен возвращать \"Код\".\nПри несоответствии загружаемого файла шаблону будет выполнен поиск\nуточненного шаблона\nдля объекта, возвращаемого алгоритмом.\nНажать на кнопку \"OK\" и сохранить действие.\nЗатем настраивается действие, выполняющее\nалгоритм\nсопоставления собеседований с кандидатами по атрибуту \"E-MAIL\", который является уникальным для каждого кандидата.\nПодробнее об алгоритме.\nВ качестве базового типа объектов указывается тип объектов \"Импорт кандидатов\".\nВ данном алгоритме:\nс помощью функции\nobjects\nвозвращаем коллекцию экземпляров типа \"Импорт кандидатов\";\nаналогичным образом с помощью функции\nobjects\nвозвращаем коллекцию экземпляров типа \"Собеседование\";\nс помощью цикла\nfor\nпроизводим поиск экземпляров типа \"Собеседование\", в которых не заполнен атрибут \"Кандидат\" и заполнен \"E-MAIL\";\nпроверка условия осуществляется с помощью оператора\nif\n;\nесли условие выполняется, с помощью цикла\nfor\nосуществляем поиск экземпляров типа \"Импорт кандидатов\", у которых значение атрибута \"E-MAIL\" совпадает со значением атрибута \"E-MAIL\" экземпляра типа \"Собеседование\";\nприсваиваем найденное значение атрибуту \"Кандидат\" объекта типа \"Собеседования\" с помощью оператора\nsetAttr\n;\nсохраняем собеседование с помощью функции\nsave\n;\nпосредством функции\nbreak\nпрерываем цикл при нахождении подходящего кандидата.\nНастройка отображения кнопки для загрузки данных\nВ рамках примера создадим\nстартовую страницу\n, на которой будут расположены кнопка для загрузки файла,  реестр кандидатов, а также реестр проведенных собеседований.\nДля этого вынесем на визуал страницы\nвиджет \"Кнопка\"\n, а также два\nвиджета \"Реестр объектов\"\n(подробнее, о\nнастройке визуала\n).\nДля более наглядного представления данных рекомендуется располагать виджеты \"Реестр объектов\" на разных вкладках посредством\nэлемента \"Группа вкладок\"\n.\nПо кнопке необходимо настроить запуск\nранее созданного\nдействия.\nВ настройках первого виджета \"Реестр объектов\" следует выбрать\nранее созданный\nтип объектов \"Импорт кандидатов\".\nВ настройках второго виджета \"Реестр объектов\" следует аналогичным образом выбрать\nранее созданный\nтип объектов \"Собеседования\".\nПо окончании настройки стартовая страница примет следующий вид:\nЗагрузка данных пользователем\nДля загрузки данных пользователь должен обладать\nправом\nна создание и редактирование экземпляров типов объектов \"Импорт кандидатов\" и \"Собеседование\".\nДля загрузки данных из файла пользователю необходимо перейти на\nранее созданную\nстартовую страницу и нажать на кнопку\n.\nВ результате отобразится модальное окно для выбора файла. Выбор файла осуществляется нажатием на кнопку\n, загрузка данных – нажатием на кнопку\n.\nПо окончании загрузки согласно настроенному шаблону в реестрах типа \"Импорт кандидатов\" и \"Собеседования\" будут будут отображены экземпляры, созданные на основе импортируемых данных.\nВозможные ошибки настройки\nВ случае некорректной настройки процесса загрузки объектов Система уведомит об этом.\nФайл не подходит под шаблон\nВ случае обнаружения различий в структуре шаблона и загружаемом файле отобразится следующее окно:\nДля перехода к\nуточнению шаблона\nнеобходимо нажать на кнопку\n, внести необходимые изменения, после чего продолжить загрузку файла.\nНельзя уточнить шаблон\nПри возникновении ошибки \"Шаблон уточнить нельзя – алгоритм определения уникального ключа объекта не указан\", необходимо вернуться к настройке\nдействия \"Загрузить отчет\"\n.\nДля решения этой ситуации необходимо указать \"Алгоритм определения объекта\" в блоке \"Дополнительные параметры действия\".",
  "source": "https://docs.greendata.ru/platform/ru/excel_loader_use_case.html"
}