{
  "title": "Setting up hierarchical display of files",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up hierarchical display of files\nHierarchical file display setting is used to define rules (conditions) of filtering (classification) of attached files when displaying them. It is represents as an object type\n“Configuring hierarchical representation of files” [FS_HIER]\nThis configuration type is used to work with the\n“File Hierarchy”\nand\n“Explorer”\nwidgets, which display a hierarchy of attached files.\nHierarchical representation\nConsider a (simplified) scheme for organizing hierarchical file representation.\nConfiguring the hierarchical representation of files [FS_HIER] assumes:\ncreating a named hierarchy record with object type specification;\nmapping a hierarchy of multiple tops related to attribute types, classifications, and file tags.\nThe algorithmic effect on the hierarchy elements is variable and depends on the nature of the task to be solved .\nSetup\nTo customize the hierarchical file representation is required to:\nGo to the registry type\n“ Configuring the hierarchical representation of files” [FS_HIER]\n, create a new type instance by clicking on\nand fill in the settings:\nSetting\nPurpose\nName\nEntering the setting name.\nObject type\nDefining the object type whose hierarchical file representation is to be configured.\nDefault view mode\nSelecting the default file viewing mode. Possible values:\nTile;\nTable.\nWhen working with\nExplorer widget\nto display files, this setting is not taken into account.\nVisibility algorithm for the \"Delete tags\" button\nSelecting/entering an algorithm to determine the conditions for displaying the \"Delete tags\" button. Used in\nExplorer widget\n.\nVisibility algorithm for the \"Assign tags\" button\nSelecting/entering an algorithm to determine the conditions for displaying the \"Assign tags\" button. Used in\nExplorer widget\n.\nAlgorithm to name downloaded files\nSelecting/entering algorithm for naming files when downloading multiple files as an archive.\nAlgorithm to name the downloaded archive\nSelecting/entering algorithm for naming archive when downloading multiple files as an archive.\nThen it is necessary to configure the display of nodes. Each top (node) represents a child object type.\nTo set a hierarchy node, click\nand fill in the following basic parameters:\nSetting\nPurpose\nName\nEntering the name of the setting (top). This name will be displayed to the user if the node is not hidden.\nConfiguring hierarchical representation of files\nSelecting the hierarchy setting from the drop-down list. This hierarchy is set by the object type\n“Configuring hierarchical representation of files” object type [FS_HIER]\nobject type for which the top is configured.\nParent\nSelecting the parent node of the hierarchy.\nSetting up file definitions\nObject type\nDefining an object type with an attribute containing files to be displayed in a configurable top.\nSelection is made using a drop-down list from all types of objects of the System.\nAlgorithm for determining objects\nSelecting an algorithm for determining objects. In this case, the basic type of this algorithm must be equal to the type of the object on the visual of which the widget is used.\nThe algorithm should return an object or a collection of objects containing the files.\nType attribute\nDetermining the type attribute containing the files to be displayed in the configurable top.\nAlgorithm for determining files\nSelecting an algorithm to determine the files to be displayed in the configurable top.\nThe algorithm will be run on the objects that were returned by the algorithm specified in the “ Algorithm for determining objects” field.\nUsed when the “Type attribute” field value is empty.\nSetting up the classification definition*\nClassification\nSelecting the classifications of attached files to display.\nThe selection is made by means of a drop-down list of instances of\n\"File classification” [FS_FILE_KIND]\ntype.\nAlgorithm for determining classification\nSelecting an algorithm to determine the classifications.\nThe algorithm will be executed on the objects that were returned by the algorithm specified in the “ Algorithm for determining objects ” field.\nUsed when the value of the “Classifications” field is empty.\nIf necessary, in the “Setting up restrictions on actions with files” block restrictions on actions with files can be set, and in the “Setting up top visualization in explorer” block the following parameters are used to set up top visualization in explorer:\nSetting\nPurpose\nSetting up restrictions on actions with files\nSet file movement limit\nSpecifying how to set the file move restriction. Possible options:\nalgorithm with classifications;\nalgorithm with files.\nAlgorithm with classifications for which moving files is not available\nSpecifying the algorithm by which the file movement restriction will be set.\nThe algorithm should return classifications.\nAlgorithm with files for which file replacement is not available\nSpecifying the algorithm by which the file movement restriction will be set.\nThe algorithm should return a collection of files.\nSet file replacement limit\nSpecifying how to set the file replacement restriction. Possible options:\nalgorithm with classifications;\nalgorithm with files.\nAlgorithm with classifications for which file replacement is not available\nSpecifying the algorithm by which the file replacement restriction will be set.\nThe algorithm should return classifications.\nAlgorithm with files for which file replacement is not available\nSpecifying the algorithm by which the file replacement restriction will be set.\nThe algorithm should return a collection of files.\nSet the current version selection restriction\nSpecifying how to set a restriction to select the current version of the files. Possible options:\nalgorithm with classifications;\nalgorithm with files.\nAlgorithm with classifications for which current version selection is not available\nSpecifying the algorithm by which the restriction on the selection of the current version of files will be set.\nThe algorithm should return classifications.\nAlgorithm with files for which current version selection is not available\nSpecifying the algorithm by which the restriction for selecting the current version of the files will be set.\nThe algorithm should return a collection of files.\nSet file deletion limit\nSpecifying how to set the file deletion restriction. Possible options:\nalgorithm with classifications;\nalgorithm with files.\nAlgorithm with classifications for which deleting files is not available\nSpecifying the algorithm by which the file deletion restriction will be set.\nThe algorithm should return classifications.\nAlgorithm with files for which deleting files is not available\nSpecifying the algorithm by which the file deletion restriction will be set.\nThe algorithm should return a collection of files.\nAlgorithm with classifications for which adding files is not available\nSpecifying the algorithm by which the restriction on adding files will be set.\nThe algorithm should return classifications.\nAlgorithm with classifications for which versioning is not available\nSpecifying the algorithm by which the file versioning restriction will be set.\nThe algorithm should return classifications.\nSetting up top visualization in explorer\nCollapse top\nDetermining the display of the top files.  When set, the top files will be hidden, while folders will be displayed.\nHide on the right side of the classification folder\nDetermining the display of classification folders. When set, the classification folders will be hidden in the right part of the explorer and the files from these folders will be displayed.\nHide node\nDefining the display of the parent node name in the widget.\nHide title\nDetermining the display of the node title name in the widget.\nBuild a hierarchy of classification folders\nDetermining the hierarchy structure of classifications folders when displayed. When set, the system considers the received classifications up to the first common folder, after which it will display their structure: from the common folder to the specified classifications.\nDisplay folder icon\nDetermining the display of the folder icon.\nHide top if there are no related objects\nDetermining the display of the top depending on the presence of objects. When set, the top will be hidden if no objects containing files were found using the algorithm specified in the “ Algorithm for determining objects” field.\nDisallow attaching files\nDetermining the possibility of attaching files. When set, file attachment will be prohibited for the current top. The checkbox does not apply to child tops.\nFolder styling algorithm\nDefining a folder styling algorithm.\nThe selection is made from a drop-down list of pre-made\nformatting styles\n.\nStyling algorithms for files\nDefining an algorithm to visually highlight files. Using the algorithm, it is possible, for example, to set highlighting of files added after a specified date.\nThe selection is made from a drop-down list of pre-made\nformatting styles\n.\nIf it is necessary to customize separate sets of classifications (for example, for Surety-Physical Person and Surety-Legal Person) it is necessary to add\ntwo\ntops with corresponding algorithms for determining objects for the current node.\nIf the configured algorithm for determining objects for the current node returns an empty collection, that node is not displayed in\nFile hierarchy widget\n.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-file-hierarchical-view.html"
}