{
  "title": "\"Electronic agenda\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Electronic agenda\" widget\nThe \"Electronic agenda\" widget\nis a tool that the chairman uses to approve the list of agenda issues. At the same time, the list of agenda issues can be signed simultaneously by clicking on the \"Sign all\" button, or the decision on each issue can be considered individually, as a result, the issue can be signed or sent for revision to the secretary with the comment.\nExample of a customized widget:\nTo configure the widget it is necessary to add a child attribute of the type with the prepared attribute composition in the object type of the profile being configured.\nAdding a widget to the object profile is performed in the editing mode of the\nvisual of instance\n. When switching to the \"Widgets\" tab on the \"Elements\" panel, it is necessary to drag the \"Electronic agenda\" widget from the \"Collegiate bodies\" section to the workspace of the profile.\nThe \"Electronic agenda\" widget can only be dragged into the container of the \"Row\" space, previously added to the workspace of the profile from the \"Groupings\" tab of the \"Elements\" panel.\nThe system will display the\nAttribute from the \"object type name\" type containing a list of issues\"\nparameter to configure the widget.\nThe list of other parameters of the widget will be available after determining the value of the\nAttribute from the \"object type name\ntype\" parameter, where you need to select the attribute of the child type.\nThe name of the selected local (child) attribute will be displayed in the widget parameters (hereinafter referred to as LAN).\nSettings\nThe widget is configured according to the following settings:\nSetting\nPurpose\nAttribute from the \"name of the object type\" type containing a list of issues\nDetermining an attribute of the \"local (child) object\" type containing a list of agenda issues to be sighted.\nThe selection is made using a drop-down list.\nAlgorithm for filtering agenda issues\nSelection of an algorithm for filtering the display of agenda issues.\nThe selection is made from a drop-down list of pre-prepared algorithms. To add a new algorithm, click on the kebab menu on the right side of the field and select the \"Add\" option in the context menu. The modal window for creating an algorithm will be opened.\nAttribute from \"LAN\" type containing the main document\nSelecting an object attribute containing a decision file (the object attribute refers to a registry of the \"File\" type [FS_FILE]).\nAttribute from \"LAN\" type containing a list of files for the attachment\nSelecting an object multi-select attribute that contains a list of attachment files (the object attribute refers to a registry of the \"File\" type [FS_FILE]).\nThe selection is made using a drop-down list.\nAttribute from \"LAN\" type containing the text of the agenda issues\nSelecting a text attribute containing the description text of the agenda issues.\nThe selection is made using a drop-down list.\nAttribute from \"LAN\" type containing the accepted status on the issue (for revision/sign)\nSelecting an object attribute to record the decision made. The issue can be assigned the \"for revision\"or \"sign\" status.\nAttribute from \"LAN\" type containing a comment\nSelecting a text attribute to record a comment on the issue.\nThe selection is made using a drop-down list.\nAlgorithm of visibility of the comment button when viewing a file\nSelecting an algorithm to determine the visibility of the comment button when viewing a file.\nThe selection is made from a drop-down list of pre-prepared algorithms. To add a new algorithm, click on the kebab menu on the right side of the field and select the \"Add\" option in the context menu. The modal window for creating an algorithm will be opened.\nUnder the list of parameters for configuring the widget, the widget layout is displayed according to the current settings.\nUse case\nIt is necessary to configure the \"Meeting\" profile object type containing the agenda issues for the chairman to sight with a list of files on the issue, so that it is possible to sign all the issues simultaneously with one click, as well as send the issue for revision.\nSet up\nTo implement this task, the widget \"Electronic agenda\" has been developed. For its subsequent use, it is necessary to make sure that the attribute composition of the \"Decision making issue\" object type contains a set of attributes:\n\"Meeting\" is an object attribute referring to the register of the \"Meeting\" type, necessary for setting up the connection between the \"Meeting\" and \"Decision making issue\" types;\n\"Issue for the chairman\" is a text attribute containing the text of the agenda issues;\n\"Decision\" is an object attribute referring to the \"File\" type [FS_FILE], using it the file with the decision will be added;\n\"Attachment files\" is an object multi-select attribute referring to the \"File\" type [FS_FILE], through which files on the agenda issues (attachment) will be added.\nTo record the chairman’s decision, you must also add following attributes:\n\"Result of the chairman’s sighting\" is an object attribute referring to a registry of the type with objects:\n\"Decision is signed\" (with System ID – SIGNED);\n\"Revision of the decision\" (with System ID – REWORK);\n\"Signing commentary\" is a text attribute for adding a decision comment with the \"for revision\" status.\nIn the \"Meeting\" object type, you need to add an attribute of the child type \"Agenda issues\" of the \"Decision making issue\" object type with a link to the \"Meeting\" attribute:\nAfter saving the changes made, open the\nregistry type\nand create an instance of the object.\nIn the object profile in the editing mode of the\nvisual of instance\nit is necessary to clear the visual, then drag (Drag-and-drop) the \"Row\" grouping to the workspace of the profile, and the \"Electronic agenda\" widget into the grouping container.\nThe \"Attribute from \"Meeting\" type containing a list of issue\" parameter is selected as the \"Agenda issues\" local object, and then the widget displays the rest of the configuration options, with the values of the attributes as shown below:\nAfter saving an instance of the object, it can be selected in the \"Meeting\" attribute in the \"Electronic agenda\" type object profile, where the value of the \"Issue for the chairman\" attribute is also set and the necessary files on the issue are attached in the \"Decision\" and \"Attachment files\" attributes. After that, in the configured widget in the \"Meeting\" object profile type, the corresponding data for sighting will be displayed.\nWorking with the widget\nWhen you hover the mouse cursor over the name of the issue, a hint with the full name will be displayed.\nWhen you click on the decision or attachment file, it opens in a modal window.\nTo sign the decision on the agenda issue, click on the\nbutton in the corresponding line.\nThe\nbutton automatically signs the entire list of decisions taken on the agenda issues.\nWhen you click on the revision button, a modal window will open to justify the decision. The added comment is written to the attribute specified in the \"Attribute from the \"LAN\" type containing a comment\" parameter. After adding a comment, the status is displayed in the issue line\n.\nThe decision made by the chairman will be represented as the value of the \"Result of the chairman’s sighting\" attribute :\nfor the signed issue, the \"The decision is signed\" status will be determined;\nfor the issue sent for revision, the \"Revision of the decision\" status will be set, and the comment left by the chairman will be displayed in the \"Signing commentary\" field.",
  "source": "https://docs.greendata.ru/platform/en/electronic-agenda-widget.html"
}