{
  "title": "\"Outgoing documents\" component",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Outgoing documents\" component\nWhen executing a business process, tasks assigned to users may require not only filling in the task profile fields but also preparing (drafting, generating, attaching) the required files in office or specialized formats. The appearance of a file during task processing implies linking (attaching) the file to the corresponding task.\nPossible solutions\nIn automation projects, two fundamentally different approaches are typically used in such scenarios:\nOption 1. Linking to a file\nThe file is placed on an external network resource, and a link to it is registered in the System.\nThis option is strongly discouraged in advanced automation practice, since the System does not control document availability or file attributes. There is a risk of uncontrolled and unmonitored content deletion, damage, or loss of critical information. Such solutions cannot guarantee data integrity.\nOption 2. Attaching a file to the task\nIn this case, the file itself is uploaded and registered in the System.\nTo implement this option in\n\"WF. Process task\"\n[WF_PROCESS_TASK] business process tasks, a special\n\"Outgoing documents\"\nattribute (\"Custom\" type) is provided as a configurable software component. This attribute is considered a system (custom) attribute and supports custom actions with files.\nBy default, the used task visual is a system object (\"Visual\" [SYS_VISUAL]) and cannot be modified or reconfigured.\nIf visual customization is required, a user visual (a copy of the system one) should be created.\nVisual\nTo enable the \"Outgoing documents\" custom attribute, create a user visual for the task and configure the attribute.\nThen, by clicking the \"Edit object\" button, the visual opens in edit mode in a new tab, where key file management actions can be assigned to the \"Outgoing documents\" attribute.\nAttribute setup\nTo configure the attribute, the user needs to define available options. For example, when enabling the actions:\nshow file upload button – to upload outgoing files from the user’s device;\nshow file delete button – to delete outgoing files from the registry;\nallow adding files from the system – to add outgoing files previously uploaded to the System;\nalways show file control buttons – for static display of file control buttons.\nIf the \"Always show file control buttons\" option is disabled, available file control buttons appear when hovering over the field or hierarchy node.\nAs a result of the configuration, the \"Outgoing documents\" attribute becomes fully functional and takes the form of a software component as follows:\nThe widget control panel provides the following features:\nButton\nPurpose\nAttach a file.\nThis button is available when the \"Show file upload button\" attribute option is active.\nFiles can also be added in the name field of a hierarchy node by clicking\n.\nDownload all files shown in the widget as a single archive.\nDownload all files preserving hierarchy (in folders named after hierarchy nodes) as a single archive.\nFind more details in file versioning configuration.\nTo manage files, the following buttons can be used:\nButton\nPurpose\nSign file. This button is active if the document signing action is configured.\nFind more details in\nconfiguring the document signing action\n.\nSystem signals for signed documents (signature display is controlled via the attribute option).\n– file signed by the current user;\n– file signed by another user;\n– file not signed.\nClicking the signed file icon shows signature details:\nDownload file. The System downloads the selected file in its current format.\nDelete file. The System deletes the selected file after user confirmation.\nThis button is available when the \"Show file delete button\" attribute option is active.\nClicking the file name opens it in preview mode.\nThe set of available actions depends on access permissions.",
  "source": "https://docs.greendata.ru/platform/en/component-outgoing-docs.html"
}