{
  "title": "Настройка действия для установки значения атрибута для нескольких объектов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка действия для установки значения атрибута для нескольких объектов\nВ Системе реализуется возможность установки значения(ий) атрибута(ов) для ряда объектов одновременно.\nДля этого необходимо настроить Действие \"Установка значения атрибута для нескольких объектов\".\nРассматривается настройка возможности указать ответственного сотрудника для проведения мониторинга клиентов.\nОдин и тот же ответственный может быть назначен как для одного клиента, так и для нескольких. Назначение настраивается для каждого фактора мониторинга, которых у одного клиента может быть несколько. То есть для нескольких объектов \"Фактор мониторинга\" необходимо заполнить атрибут \"Ответственный сотрудник\".\nДля настройки действия \"Установка значения атрибута для нескольких объектов\" необходимо:\nПеред настройкой действия для рассматриваемого примера необходимо подготовить\nвизуальное представление\nдля выбора ответственного сотрудника (указанное значение атрибута будет фиксироваться для выбранных объектов). Этот визуал будет выбран в процессе настройки\nДействия\n(см.\nп. 3\n).\n1. Создать новое\nпользовательское действие\n. Система отобразит карточку для настройки пользовательского действия.\n2. Указать необходимые настройки для\nДействия\n.\nПараметр\nНазначение\nНаименование\nВвод наименования настройки, например \"\nУстановка значения атрибута для нескольких объектов\n\".\nМодуль пользовательского интерфейса\nВыбор модуля пользовательского интерфейса \"\nУстановка значения атрибута для нескольких объектов\n\".\nТип действия\nПодтвердить отображение кнопки – выбрать значение \"\nДействие\n\".\nОтображать в карточке\nПодтвердить отсутствие кнопки в карточке – выбрать значение \"\nНет\n\".\nОтображать в реестре\nПодтвердить отображение кнопки в реестре – выбрать значение \"\nДа\n\".\nДополнительные параметры действия\nВ данном случае настройка не требуется.\nТипы объектов\nВыбор типа объекта, в реестре которых настраивается отображение кнопки – выбрать значение \"\nФакторы мониторинга\n\". Рассмотрено далее (пункт 3).\n3. Указать тип объекта, из реестра которых будет отображаться настраиваемая кнопка. Минимальные настройки:\nПараметр\nНазначение\nНаименование\nВвод наименования настройки (формируется автоматически в случае пустого значения).\nДействия\nОтображение наименования настраиваемого действия.\nСист. Аттр. Тип объекта\nОпределение типа объекта, с которым связывается действие. В рассматриваемом случае необходимо выбрать значение \"\nФакторы мониторинга\n\".\nАлгоритм видимости действия в дочернем объекте\nВвод/ выбор алгоритма, определяющего видимость кнопки для дочерних объектов (указывается при необходимости).\nПереопределение параметров действия\nОпределение параметров действия для типа объекта.\nВ рассматриваемом случае в качестве определения параметров действия для типа объекта необходимо указать:\nв поле \"Наименование\" – наименование настройки (может быть сформировано автоматически);\nв поле \"Тип объекта\" – используемый тип объекта; указать значение \"\nФакторы мониторинга\n\";\nв поле \"Визуал\" – указать используемый\nвизуал\nдля выбора ответственного. Достаточно простейшего визуального представления с одним атрибутом для выбора ответственного сотрудника.\nБез использования отдельного визуала, необходимый атрибут (значение которого будет устанавливаться) может размещаться в текущей карточке.\n4. Сохранить внесенные настройки\nДействия\nпо кнопке\nв карточке текущего объекта.\nПосле выполнения настройки\nДействия\nв реестре типа \"Факторы мониторинга\" отобразится кнопка \"\nУстановка значения атрибута для нескольких объектов\n\". Это позволит указать ответственного сотрудника для работы с факторами мониторинга. Возможность выбора нескольких объектов настраивается в реестре (\nподробнее об этом\n).\nПосле нажатия на кнопку \"Установка значения атрибута для нескольких объектов\" Система отобразит диалоговое окно (визуальное представление) для выбора ответственного представления.\nВыбранное значение (\"ФИО сотрудника\") будет присвоено атрибуту (\"Ответствнный сотрудник\") для указанных объектов (выбранные в реестре \"Факторы мониторинга\").",
  "source": "https://docs.greendata.ru/platform/ru/setting-the-attribute-value-for-multiple-objects.html"
}