{
  "title": "Setting up an attribute input mask",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up an attribute input mask\nThe mask is specified when it is necessary to have a single format for input of attribute values (e.g. input fields for series and number of passport or ten-digit phone number).\nThe input mask is defined by a regular expression\n, that is, by a string of characters indicating the format of valid input data values.\nMost characters in regular expressions represent themselves. The exception is a group of special characters \"[ ] \\ / ^ $ . | ?\n+ ( ) \\{ }\". If these characters need to be represented as text, use a backslash \"\\\" escape character.\nCharacter\nName\nDefinition\n^\nCaret\nThe beginning of a string or line.\n$\nDollar sign\nThe end of a string or line.\n.\nDot\nAny character.\n+\nPlus sign\nPlus sign\n?\nQuestion mark\n0 or 1 previous characters.\n( )\nRound brackets (Parentheses)\nGrouping of structures.\n┃\nVertical bar\n\"Or\" operator.\n[ ]\n\"Or\" operator.\nAny of the listed characters, range. If the first character of construction is \"^\", then array works in reverse. The characters being checked must not match the ones in brackets.\n\\{ }\nCurly brackets (Braces)\nRepeating a character several times.\n\\\nBackslash\nEscaping service characters.\nSpecial metacharacters of regular expressions allow to replace some prepared constructions.\nCharacter\nDefinition\n\\b\nIndicates the boundary between characters (not a character).\n\\d\nDigital character.\n\\D\nNon-digital character.\n\\s\nSpace character.\n\\S\nNon-space character.\n\\w\nAn alphabetic or numeric character. It can also be an underscore.\n\\W\nAny character other than an alphabetic or numeric character, and underscore.\nFrequently used masks of string attributes are implemented in the System as\nvisuals\n,\nexamples of string attribute visuals\n.\nExamples\nExample 1\nThe mask for entering the \"Passport: Series\" attribute may look as follows:\nThe attribute mask configured will allow to enter only four-digit values.\nExample 2\nThe mask for entering the TIN of a legal entity will look like this:\nThe configured attribute mask in will allow to enter ten-digit values.\nExample 3\nAdding e-mail is specified using the following input mask:\nThe \\S{1,} entries specify the need to enter a string at least one character long by adding “@” and “.” between these entries. As a result, the configured attribute mask will allow to specify the e-mail address in the following form:\nExample 4\nIt is necessary to specify the mask of technical certificate, where two additional characters\nmay possibly\nbe entered.\nThe entry \\{0,2} implies that 0 or 2 characters can be entered in the field. The [A-Z0-9] expression implies that numbers and/or English capitol letters can be entered. The configured attribute mask will allow to enter only six-digit number.\nMore information on attribute display features is available\nhere\n.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-an-attribute-input-mask.html"
}