{
  "title": "getWorkDay",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ngetWorkDay\nФункция возвращает дату рабочего дня, следующую/ предшествующую переданному дню в соответствии с календарем и указанным сдвигом.\nСинтаксис\ngetWorkDay\n(date, calendar, [shiftDays])\nПараметр\nНазначение\ndate\nДата, от которой осуществляется расчет.\nПо умолчанию установлена текущая дата - currentDate().\nДата может задаваться в виде атрибута, переменной (внутри алгоритма), вычислимого показателя или алгоритма.\ncalendar\nГодовой календарь, содержащий данные о рабочих и выходных днях. Указывается вместо фиктивной переменной\n\"calendar\"\n.\nshiftDays\nКоличество дней сдвига. Параметр задается, как целочисленное значение. При вызове функции по умолчанию установливается число 1.\nЕсли число не задано, оно считается равным 0 и возвращает значение параметра\ndate\n.\nПримечание\nВызов функции осуществляется по кнопке\n, расположенной в редакторе алгоритмов на вкладке \"Даты\".\nПосле чего в добавленной конструкции следует указать дату для расчета и годовой календарь  посредством функции\ndict\n.\nВ Системе годовой календарь представлен\nтипом Календарь\n[\nSYS_CALENDAR\n] (возможна пользовательская настройка дочернего типа объекта).\nПример\nДля получения даты рабочего дня, являющегося третьим рабочим днем от даты, записанной в переменную \"date\", необходимо записать:\nПредположим, дата 02.03.2023 попадает на рабочий день – четверг.\nТретий рабочий день от четверга – это вторник следующей недели (где в расчете: первый рабочий день от четверга – пятница, второй – понедельник).\nТаким образом функция вернет дату вторника.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nОбъявление переменной date выполняется функцией\nvar\n.\nФункция\nparseDate\nпозволяет из строки получить дату.\nВыбор календаря осуществляется при помощи функции\ndict\n.",
  "source": "https://docs.greendata.ru/platform/ru/getworkday.html"
}