{
  "title": "Релиз LTS.411",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРелиз LTS.411\nПатч LTS.411.3 от 21.05.2024\nИзменения и улучшения\nВ модуле EDoc оптимизировано формирование и обновление значений печатной формы.\nВ модуле EDoc стабилизировано открытие документа при наличии некорректного удаления объекта, связанного с экземпляром вложенного шаблона.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.411.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.411.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.411.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nПатч LTS.411.2 от 20.05.2024\nИзменения и улучшения\nДоработана возможность настройки отображения кнопки для просмотра зависимых объектов.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.411.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.411.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.411.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nРелиз LTS.411.1 от 17.05.2024\nНовые возможности\nДля более эффективной коммуникации в GreenData Messenger появилась возможность взаимодействовать с пользователями Telegram.\nВ реестре появилась возможность отображения пользователей, работающих с карточкой объекта в текущий момент.\nВ типе объекта теперь доступен просмотр зависимых объектов.\nДля On-Premise решения появилась возможность настройки таймаута для\nрасчета алгоритма на кластере на нескольких нодах\n.\nИзменения и улучшения\nДля объектного цепочечного атрибута типа \"Файл\" доработано отображение содержимого в карточке объекта.\nСтабилизирован функционал автозаполнения карточки объекта данными посредством алгоритмов.\nВ алгоритмах отлажено использование функции\nparentAttr\n.\nДля экспортирования в файл обновленных данных электронного документа оптимизирована функция exportEDocToFile.\nПри настройке пользовательского\nдействия\n\"Открыть реестр\" появились дополнительные настройки для модуля пользовательского интерфейса.\nСтабилизирована возможность фильтрации в\nаналитической панели \"Таблица\"\n.\nВ базовой поставке усовершенствованы дефолтные страницы авторизации и регистрации, скорректированы права доступа для работы с сервисом\nDaData\nи на видимость пункта меню \"Сообщения\".\nДоработаны настройки по отправке почтовых сообщений.\nСтабилизирован процесс настройки схемы ETL-процесса.\nВ реестре доработано отображение пустых значений вместо атрибута с изображением и выделение выбранной строки.\nВ окне фильтрации значений налажен процесс поиска.\nСтабилизировано применение настроек пользовательской темы оформления.\nСтабилизирована проверка условий маршрутного объекта.\nСтабилизировано отображение предметных областей.\nОтлажен процесс сохранения изображений, полученных в чате web-версии приложения GreenData Messenger.\nВ модуле EDoc улучшено управление межстрочным интервалом, стабилизирована возможность объединения ячеек, доработан функционал сравнения версий документов в режиме работы с закладками, а также повысилось удобство работы – теперь пользователь может регулировать ширину панели по настройке опросного листа.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.411.1\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.411.1.war\nhttps://downloads.greendatasoft.ru/LTS/lts.411.1.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.411.3-details.html"
}