{
  "title": "SaaS personal account",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSaaS personal account\nThe SaaS personal account (instances for Software as a Service) is a special section of the site that allows users to:\ncreate and manage projects and applications;\ncreate teams to collaborate on projects;\npurchase and manage licenses to expand the capabilities of the GreenData Low-code platform;\ncustomize the\nuser profile\n;\ncreate and publish your own mobile applications in the\nGoogle Play\nand\nApp Store\nstores based on project applications;\nnavigate to GreenData company resources such as the\nMarketplace\n,\nplatform documentation\n, and\nforum\n;\ncontact the sales and technical support department specialists.\nGetting Started\nTo explore the platform during the first authorization in the SaaS personal account, a modal window for creating the first project and application will be displayed.\nThis capability is provided based on a free\nlicense\n; the user only needs to specify names for the project and application, then click the \"Create\" button. Clicking the \"Skip\" button allows using this capability later.\nThe specified names can be changed later.\nAfter clicking the \"Create\" button, a feature tour of the Account will be launched. By clicking \"Next\" in the pop-up hints, the user can familiarize themselves with all sections of the Account. The tour can be ended at any time by clicking the corresponding button and can be returned to later in the \"Explore\" section.\nPersonal Account Elements\nIf a non-verified account was used for authorization, an informational banner will be displayed at the top of the page indicating the period within which the email address provided during registration must be confirmed:\nIf the user does not confirm the account within the specified period, the profile will be blocked.\nThe Account interface is organized so that the main control elements are located in the page header and the\nside panel\n. The header contains:\n— the company logo, clicking which returns to the Account main page;\n\"License Management\" – a section for viewing, purchasing, and managing licenses that allow expanding the capabilities of using the GreenData Low-code platform (see the\n\"SaaS Licensing\"\narticle for details);\n\"Projects and Invitations\" – a section for viewing the user’s project list and organizing collaboration on a project by sending and accepting invitations (see the\n\"Projects and Applications\"\narticle for details);\n\"Mobile Applications\" – a section for creating and publishing your own mobile applications in the\nGoogle Play\nand\nApp Store\nstores (see the\n\"Mobile Applications\"\narticle for details);\n\"Explore\" – a section for viewing onboarding tours; by clicking the corresponding buttons, user can restart the onboarding from the beginning or continue the demonstration from the step previously interrupted by clicking the \"Skip\" button;\nthe user account, through whose context menu user can:\nnavigate to\nuser profile\nsettings;\nopen the GreenData\nMarketplace\nwith a catalog of ready-made products for solving various tasks;\nopen the\ndocumentation\ncontaining up-to-date information about the GreenData platform’s capabilities and settings;\nopen the\nforum\nto communicate with other users and find answers to common questions related to working on the GreenData platform;\nlog out of the current user profile;\nthe Account interface language – the language in which the Account is displayed (Russian, English, or French can be selected).\nProjects and applications are created in the sidebar located on the left side of the personal account.\nThis panel provides convenient access to all available user projects and applications (for more details, see the\n\"Projects and Applications\"\narticle).\nTo manage project/application settings, select it from the sidebar list. To open an application, click the\nbutton located next to the application.\nFor detailed information about offered services, it is recommended to contact a sales department specialist. To reach technical support, use the online chat (for more details, see the\n\"Feedback\"\narticle).\nAdditional Capabilities\nThree days after creating the first application, the user will be prompted to fill out a form to get the ability to create a second free application.\nIf the form is not filled out, the reminder will reappear in the Account with increasing frequency: after a week, then after two weeks, and subsequently every 14 days, until the questionnaire is completed.\nAfter the two-week trial period, if no paid\nlicenses\nare acquired, the user will be offered to expand capabilities by purchasing a \"Standart\" license.\nA notification highlighting the benefits and offering the option to purchase a license via tariff configuration will be displayed in the Account daily until the first paid license is acquired.",
  "source": "https://docs.greendata.ru/platform/en/saas-personal-account.html"
}