{
  "title": "Release details, version LTS.397.4",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.397.4\nPatch LTS.397.4 of February 7, 2024\nChanges and improvements\nImprovements in adding/removing nested template instances to/from all document versions.\nPatch LTS.397.3 of February 5, 2024\nChanges and improvements\nImprovements in the algorithm for comparing bookmark values.\nPatch LTS.397.2 of February 2, 2024\nChanges and improvements\nOptimizations in attribute creation settings.\nPatch LTS.397.1 of February 1, 2024\nChanges and improvements\nThe process of exporting diagrams when working with dashboards was stabilized;\nImprovements in the \"Control element\" analytical panel on dashboards transferred to the application with GUF files.\nUpdate package LTS.397.0 of January 30, 2024\nNew features\nA new field with API was added to the mobile app to show video duration.\nIt’s now possible to use images instead of the \"graph\" chart.\nA closeModalWindow action was added.\nA possibility to easily switch between bookmark parent objects was added to electronic documents.\nA possibility to redefine action by clicking \"OK\" was added to modal windows.\nChanges and improvements\nA reference search was implemented through localObject deleting;\nObject management improvements: it’s not more possible to clear mandatory attributes of object and child object types when deleting linked objects;\nCorrections in attribute visual names and descriptions;\nChain attributes will now be hidden for attrByVar function when using the \"Set value\" sign;\nFavorites were added to search filter settings;\nImprovements in creating child attribute instances;\nStabilization in subject area viewing;\nImprovements in numberToWords function;\nImprovements in editing filtering algorithms in modal windows;\nSetting updates in viewing algorithms in calculated indicator registry;\nOptimizations in settings for tasks with deferred start;\nStabilizations in message editing in GreenData messenger.",
  "source": "https://docs.greendata.ru/platform/en/LTS.397.4-details.html"
}