{
  "title": "\"Navigation panel\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Navigation panel\" widget\nThe \"Navigation pane\" widget\nis a tool for navigation in the System.\nPlacing the widget on the\nstart page\nwill allow the user to quickly navigate to the selected menu item, registry, or object.\nExample of a customized widget:\nThe System has 7 navigation panel templates:\nA preview of the template is available by hovering over the\nicon next to the template name. Available template options:\nSetup\nThe widget is added to the object profile in\ninstance visual settings\nmode. Drag-and-drop the required widget template from the \"Navigation Panel\" section of the \"Widgets\" tab in the \"Elements\" panel to the workspace.\nSettings\nTo set up the widget, click the \"Settings\" button, which opens a modal window with the following settings:\nSetting\nPurpose\nPanel editing\nPanel size\nDetermining the panel size. Possible options:\nXS;\nS;\nM;\nL.\nBy default, all templates are set to XS.\nMobile app panel size\nDetermining the panel size in the mobile app. Possible options:\nXS;\nS;\nM;\nL.\nBy default, each template has its own value.\nAuto width\nIndicating that the width of the panel will be automatically adjusted to the available area.\nThe setting is inactive by default.\nRounding corners\nDetermining the size of the rounded corners of the panel. Possible options:\nNo rounding;\nXS;\nS;\nM;\nL.\nBy default, each template has its own value.\nShadow\nDetermining the shadow size. Possible options:\nNo shadow;\nS;\nM;\nL.\nPanel style\nDetermining the style of the panel background. Possible options:\nStatic;\nAlgorithm.\nBy default, all templates are set to \"Static\".\nFill\nDetermining the fill of the background. Possible options:\nNo fill;\nColor;\nWhen selecting this option, a color picker is available with the ability to select a color on the palette or enter a color code in RGBA and HEX formats.\nGradient.\nThe gradient is selected in the modal window.\nLinear or radial gradient types can be selected. For the radial gradient, the angle of inclination in degrees can be specified.\nAfter that, at least two gradient points should be selected by clicking the\nbutton and the position, color and transparency for each one is specified.\nThis setting is available with the \"Static\" panel style.\nBorder\nDetermining the panel border. Possible options:\nYes;\nWhen selecting the option, a color picker is available with the ability to select a color on the palette or enter a color code in RGBA and HEX formats.\nNo.\nThe setting is available with the \"Static\" panel style._\nAlgorithm\nSelecting the algorithm that will be used to set the panel background style. +The\nalgorithm should return an instance of the\n\"Basic formatting style\"\nobject type.\nThe setting is available when the panel background style is determined using an algorithm.\nBy clicking the button, a context menu will be displayed to select the way an image for the panel background is uploaded:\nFiles from disk – the file explorer opens to upload the file from the user’s device.\nWhen adding an image from the disk, a new instance of the \"File\" type [FS_FILE] is created in the System.\nFiles from system – opens the \"File\" registry type [FS_FILE] to select the image previously uploaded to the System.\nAcceptable file formats: *.png, *.jpg, *.jpeg.\nPanel contents\nAction processing\nDetermining the component that opens when clicking on the panel. Possible options:\nMenu item;\nObject;\nRegistry.\nMenu item\nDetermining the menu item that opens when clicking on the panel.\nThe menu item is selected from the drop-down list. if necessary, the\nnew menu item\nis configured through the parameter action menu.\nThe setting is available when selecting the \"Menu item\" action.\nObject type\nDetermining the object type, object profile or registry that open when clicking on the panel.\nThe object type is selected from the drop-down list. If necessary, the\nnew object type is created\nthrough the parameter actions menu.\nThe setting is available when selecting the \"Object\" or \"Registry\" action.\nObject\nThe instance whose visual will be displayed when clicking on the panel.\nThe object is selected from the drop-down list of instances of the specified object type. If necessary,\ncreate a new object\nthrough the parameter actions menu.\nThe parameter is available when selecting the \"Object\" action.\nVisual\nDetermining the object visual will be displayed when clicking on the panel.\nThe object visual is selected from the drop-down list of visuals of the specified object type. If necessary,\ncreate a new object visual\nthrough the parameter action menu.\nThe setting is available when selecting the \"Object\" action.\nRegistry\nDetermining the registry that will be displayed when clicking on the panel.\nThe registry is selected from the drop-down list of registries of the specified object type. If necessary,\ncreate a new registry\nvia the parameter actions menu.\nThe parameter is available when selecting the Registry action.\nHeader\nEntering the text of the panel header (the maximum size is 2000 characters).\nStyle\nDetermining the header style. Possible options:\nStyle;\nAlgorithm.\nBy default, all templates are set to \"Style\".\nHeader style\nDefining the header text style. The selection is made using a drop-down list of instances of the\n\"Basic formatting style\"\nobject type.\nThe setting is available when the \"Style\" options selected .\nAlgorithm\nSelecting the algorithm that will be used to set the header text style. +The\nalgorithm should return an instance of the xref :formatting-style-object-type.adoc[\"Basic formatting style\"] object type.\nThe setting is available when selecting the \"Algorithm\" option for the header style.\nDescription\nEntering the panel description text (the maximum size is 2000 characters).\nThis setting is available only for templates with a description.\nStyle\nDetermining the style for the description text. Possible options:\nStyle;\nAlgorithm.\nThis setting is only available for templates with a description.\nDescription style\nDefining the style for the description text. The selection is made using a drop-down list of instances of the\n\"Basic formatting style\"\nobject type.\nThe setting is available when selecting \"Style\"  as the description style.\nAlgorithm\nSelecting the algorithm that will be used to set the style for the description text.\nThe algorithm should return an instance of the\n\"Basic formatting style\"\nobject type.\nThe setting is available when selecting the \"Algorithm\" option as a way to set the description style.\nRounding corners\nDetermining the size of the rounded corners of the panel. Possible options:\nNo rounding;\nXS;\nS;\nM;\nL.\nThis setting is available for templates with an additional image.\nBorder\nDetermining the panel border. Possible options:\nYes;\nWhen selected, a color picker is available with the ability to select a color on the palette or enter a color code in RGBA and HEX formats.\nNo.\nThe setting is available for templates with an additional image._\nBy clicking the button, a context menu will be displayed to select the way an image for the panel background is uploaded:\nFiles from disk – the file explorer opens to upload the file from the user’s device.\nWhen adding an image from the disk, a new instance of the \"File\" type [FS_FILE] is created in the System.\nFiles from system – opens the \"File\" registry type [FS_FILE] to select the image previously uploaded to the System.\nAcceptable file formats: *.png, *.jpg, *.jpeg.\nThe setting is available for templates with an additional image.\nThe widget layout is displayed under the settings.\nIn the upper part of the modal window, there is the \"Switch to developer mode\" button, which will switch to the\nwidget development environment\nfor creating a custom widget.\nUse case\nConsider the process of placing the widget on the application home page.\nFirst, prepare the System objects to be placed on the panel for quick access.\nThe \"Marketing and Sales Materials\" registry:\nThe \"Transaction Authorization Request\" registry:\nThe \"News\"\ntile registry\n:\nNext, create a start page using one of the\navailable methods\nwithout binding it to system objects.\nEnter the page name in the window that opens, then proceed to setting up the visual by clicking the\nbutton.\nThen, in\nvisual editing mode\n, drag-and-drop the four \"Bottom Header\" templates from the \"Navigation Panel\" section of the \"Widgets\" tab to the profile workspace.\nNext, fill in the\nsettings\nfor each widget panel.\nFor example, when setting up the \"Sales Materials\" panel, select the \"Marketing and Sales Materials\" registry created\npreviously\n:\nThe \"Transaction Authorization Request\" and \"News\" panels are configured in the same way.\nThen, configure the \"Communication\" panel to access the \"Chats\" menu item by specifying the following settings:\nAs a result, the navigation bar will be displayed on the home page to quickly navigate to the necessary sections of the System:",
  "source": "https://docs.greendata.ru/platform/en/navigation-panel-widget.html"
}