{
  "title": "Рекомендации по отладке алгоритмов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРекомендации по отладке алгоритмов\nСоздание алгоритмов регулярно сопровождается ситуациями, в которых программный код и результат его исполнения вызывают сомнение, предполагают тестирование, проверку и отладку. Поэтому на платформе GreenData существуют встроенные инструменты\nотладки алгоритмов\n, а также дополнительные методы, приведенные ниже в этой статье.\nРекомендации по отладке\n1.\nИспользуйте встроенные инструменты отладки\nС помощью встроенных инструментов редактора алгоритмов выполнение алгоритма может осуществляться построчно. Исполнение алгоритма может быть остановлено (прервано) по инициативе пользователем.\n2.\nАлгоритм должен быть скомпилирован\n.\nСистемой допускается сохранение нескомпилированного кода алгоритма, однако  выполнение алгоритма происходит только после его сборки (компиляции).\nНе следует пытаться сохранить заведомо дефектный код алгоритма, содержащий явные ошибки синтаксиса. Если алгоритм содержит неверную (недописанную, некомплектную) конструкцию языка, то лучше сохранить данный алгоритм при комментировании проблемного участка кода.\n3.\nИспользуйте однострочные комментарии для таких операций, как:\nдобавление авторского пояснения над (сверху) последующим функционалом неочевидным оператором;\nдобавление авторского примечания (справа) в строке текущего оператора;\nкомментирование проблемного оператора или неотлаженного выражения.\nПримеры однострочных комментариев:\n4.\nПрименяйте многострочные комментарии в следующих случаях:\nдобавление подробного текстового пояснения;\nкомментирование нескольких строк/проблемных операторов алгоритма.\nПримеры многострочных комментариев:\nДополнительные инструменты отладки\n1. Функция\nsendPopUpMsg\n:\nсрабатывает в форме немодального всплывающего окна уведомления;\nподходит для диагностики срабатывания веток алгоритма;\nпредназначена для показа на экране\nскалярных\nзначений (строк, чисел …​).\nФункция\nsendPopUpMsg\nне умеет отображать структуры данных (массивы, ArrayList, HashSet, HashMap и пр.).\nПримеры использования функции\nsendPopUpMsg\n:\n2. Функция\nprintout\n:\nподходит для диагностики срабатывания алгоритма;\nподдерживает показ\nскалярных\nзначений и\nструктур данных\n.\nПримеры использования функции\nprintout\n:\n3. Функция\nwriteWfLog\n:\nпредназначена для сложных ситуаций логирования алгоритмов бизнес-процессов;\nне отображает данные, а сохраняет их в специальную таблицу wf_trace_log.",
  "source": "https://docs.greendata.ru/platform/ru/recommendations-for-debugging-algorithms.html"
}