{
  "title": "Displaying data for configured deadlines",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nDisplaying data for configured deadlines\nThe information about configured deadlines\n(\nDeadlines directory\n)\nis displayed in the table of the corresponding registry and is generated automatically\nwhen the route object passes through the business process (BP;\nGeneral info about business processes\n).\nThese settings are represented in the System by the object type\n\"WF. Regulatory term example\"\n.\nThe \"Overdue\" column displays a timer that counts the time of delay by the deadline. If the deadline is not expired, the timer registers zero.\nTo open the instance profile of the type\n\"WorkFlow. Deadline instance\"\ndouble-click on an entry in the table.\nThe profile contains the following attribute structure, where many fields are filled in automatically:\nSetting\nPurpose\nDeadline\nThe main name of the deadline setting.\nDeadline - Technical deadline\nThe main name of the technical deadline setting (for more information, refer to\nDeadlines directory\n, the \"Schedule date\" block of fields).\nDate and time of creation\nDate and exact time of creating a deadline instance.\nObject\nThe name of the route object instance.\nProcess instance\nName of the business process instance the deadline is specified for.\nResponsible department\nUser/ group of users of the business process that takes into account the current deadline.\nActivity marker\nA boolean attribute, possible values:\nYes – there are active tasks with the deadline considered\nNo – all tasks included in the calculation of the deadline under consideration have been completed\nStatus\nThe status of the deadline calculation. Possible values:\nIn progress\nCompleted\nSuspended\nThe \"Deadline\" block of fields\nDeadline in business days\nEnter\nthe number of business days to specify the deadline.\nActual term in business days\nThe actual deadline in business days.\nTotal suspension period\nGeneral term of deadlines suspended.\nDate and time of deadline start\nDate and time of the start of the deadline countdown in accordance with the deadline setting (for more information, refer to \"Deadlines directory\"). For example, if the deadline is calculated based on the calendar and working hours, and the deadline instance is created outside the working hours of a potential task assignee, the date of creation and the start date of the deadline may be different.\nSchedule date\nDuration of the deadline. Suspensions do not affect the schedule date (for more information, refer to\nSuspension of deadlines\n).\nSuspension of deadline\nSuspending the deadline countdown.\nDate and time of the actual deadline end\nThe completion date for all tasks that take into account the configurable deadline.\nSchedule date (months)\nThe duration of the deadline calculated in months.\nDate and time of the schedule deadline end\nThe date of the schedule deadline end, after which it will be considered that the deadline is overdue.\nActual term (months)\nTotal time spent for the current deadline.\nThe \"Task breakdown\" and \"Excluded tasks on the business process\" groups of fields\nTask on the business process\nThe name of the BP task the deadline of which is calculated.\nExcluded tasks on the business process\nThe name of the BP task that does not take into account the deadline.\nExample of\nconfiguring the deadline with recalculation on demand\n.\nIf you need to change the length of the deadline, make changes to the\n\"Deadline in business days\"\nattribute. When changes are saved, the associated attributes are recalculated automatically. Users who have a special permission can change the deadline (for more information, refer to\nWorking with permissions\n).\nIt is possible to configure the work of users (groups of users) in the System with the following permissions (for more information, refer to\nWorking with permissions\n):\nChange incomplete deadlines\nChange any deadlines\nTo work with deadlines, actions are used (\nboth schedule and actual time is taken into account\n):\n– recalculation of information about the deadline in the data warehouse. The action recalculates information in the instance of\n\"WorkFlow. Deadline instance\"\n– recalculation of deadline for the route object Recalculation of deadline is performed for a specific route object specified in the settings. Recalculation of deadlines is performed for the object types (associated with the route object specified):\n\"\nWorkFlow. Deadline instance\n\"\n\"\nWorkFlow. Deadline\n\"",
  "source": "https://docs.greendata.ru/platform/en/displaying-data-for-configured-deadlines.html"
}