{
  "title": "Checking updates",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nChecking updates\nChecking updates is an essential step before their installation, which may include the following steps:\nchecking the completeness of the update\nto exclude conflicts and compatibility issues between applications;\nchecking the update content\nfor the presence of prohibited data, such as in compliance with security requirements.\nThe permission to check updates is available if at least one of the following\npermissions\nis granted:\n\"Check updates\" - without possibility to install them afterward;\n\"Install updates\" - with possibility to install updates after checking.\nChecking the completeness of the update\nTo check the completeness of the update, sequentially select the menu items:\n\"Administration\" → \"Updates\" → \"Install updates\".\nOn the opened page, updates can be checked by selecting the corresponding tab:\nInstallation via CI/CD\n;\nInstallation of Individual/Complex GUF Files\n.\nChecking for GUF\nChecking the correctness of the prepared\n.guf\nfile or an update package (multiple update files combined into a\n.zip\narchive) is performed on the \"GUF Installation\" tab.\nThe main part of this page is occupied by the update installation wizard. On the left side of the page there are:\ninformation on the latest installed update, indicating:\ndate and time of the update;\nthe user who installed the update;\nnames of the installed file;\nThe status of the installation process.\nTo check for updates, click\n, followed by selecting the file/update package on the user’s personal computer.\nIt is not allowed to transfer the object type and objects referring to this type in the same file (*.guf). In this case, first transfer the update of the object type and then objects\nThe file/update package will be checked automatically after selecting the file, as a result of which the System will display its contents in the form of a table. If errors occur, a list of errors will be displayed at the bottom of the workspace:\nTo quickly find the missing objects, download the error list by clicking\nand\nupload\nthem to the instance from which the update was being compiled.\nPossible error correction options are given in\n\"Special features of installing updates\"\n.\nThe \"Next\" and \"Done\" buttons used to install the update are only available with\nInstall Updates permissions\n.\nChecking for the CI/CD updates\nThis method of receiving updates is used if there is a\nconfigured connection\nto the application that will deliver updates.\nIn this case, go to the \"Installation from CI/CD\" tab, which contains the following panels:\nAvailable updates – packages that deliver updates published in the applications to which the connection is configured;\nThe composition of the updates – the contents of the selected update package;\nResult of installing the update  – the status of the selected update after performing verification, installation, or publication actions.\nAs a check, the user can:\nget a list of current update packages from applications with which connection is configured by clicking\n;\nTo view the list of updates received via CI/CD, the user must have access rights to instances of the type \"Update received through CI/CD\" in addition to the \"Check the updates\" permission.\nselect the update package and view its update composition, as well as by clicking\nto check the possibility of future installation.\nAs a result of the check, the update is assigned one of the statuses:\nverification error – the result of the verification, in which the installation of the update is not allowed. This result is accompanied by a corresponding notification and the new \"Installation errors\" tab, where a list of errors is presented:\nErrors are eliminated on the instance where the update was received (for example, the development and testing instances)\n.\nchecked – the result of the check, at which the update can be installed.\nThe update install button is only available with the\ninstalling updates permissions\n.\nChecking the update content\nTo check the update file contents, follow these steps:\nSequentially select the menu items:\nAdministration → Updates → Check update\n.\nIn the opened registry \"Result of the update check against information security requirements\", create an entry by clicking the\nbutton in the control panel (for more details see\nworking with registries\n).\nOn the opened page, in the \"Update file\" field, click the \"Attach a file\" button, which will open a modal window to upload the update file from your personal computer.\nAfter adding the file, save the object by clicking the\nbutton.\nAfter saving the object, the \"Comparison result in excel\" field will display the check results in the *.xlsx format. The file can be exported by clicking the\nbutton.\nThe control panel will display the available actions:\n\"Check\" – viewing the results of checks based on regular expressions:\nThe export of the check results file in the *.xlsx format is done by clicking the\nbutton.\nThe list of checks is defined by the reference guide of the \"Regular expressions for update check\" [SYS_ISS_REGEXP_ITEM] type.\nTo add a check, navigate to the registry type and create an entry by clicking the\nbutton, then specify the required configuration parameters.\nData in the update file can be checked using one of the following methods:\nusing a\nregular expression\nspecified in the corresponding field to search for text patterns that match the specified format;\nusing an SQL query specified in the \"Query for extracting forbidden words\" field to retrieve data from the database.\nIf both parameters are specified, the priority will be given to retrieving data using the regular expression.\n\"Generate checklist\" – generating a list of objects of the specified types, as well as all permissions for the objects contained in the update file.\nThe \"Checking objects\" section displays a list of objects that belong to the types added to the reference guide \"Object types included in the information security checklist\" [SYS_ISS_CHECKLIST_TYPE].\nThe \"Checking permissions for objects\" section contains all permissions included in the update file, indicating the security principal and a privilege set.\nThe export of the check results file in the *.xlsx format is done by clicking the\nbutton.",
  "source": "https://docs.greendata.ru/platform/en/checking_updates.html"
}