{
  "title": "Configuring ETL process gateways",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nConfiguring ETL process gateways\nIn case of parallelization of ETL schemas, gateways are used.\nThe custom items control the order in which the ETL data is loaded.\nOn the ETL schema\n, the gateway is represented as follows (by default, the System will display an Exclusive gateway, which is described below):\nTo change the gateway type, use the\nicon.\nThe following types of gateways are processed on the ETL schema:\n– an exclusive gateway. A gateway of this type is activated when at least one data flow appears. When there are multiple outgoing data flows, the scheme execution continues on only one of them. To do this, the gateway checks all flows in the loop and selects the first one for which one of the conditions is met:\nThere is no sign of the conditional transition\nThere is a sign of conditional transition, but there is no algorithm for the condition\nThe conditional transition algorithm returned true\nIf no condition is met for any of the outgoing flows, the execution will continue with the default transition.\n– an inclusive (non-exclusive) gateway. The item triggers each time a data flow is received. This gateway can initiate from one to more outgoing data flows. The list of triggered outgoing data flows is defined synchronously (similar to the exclusive gateway algorithm). If there are more than one flows in the settings, all triggered flows are started according to their number. If 1 (one) is specified, all triggered data flows will start one by one synchronously.\n– a parallel gateway. This gateway is triggered only when all incoming flows are executed. Next, the processing of the item and the initiation of outgoing flows is performed the same way as with the inclusive gateway.\nThe number of incoming flows for the inclusive (non-exclusive) and parallel gateways is indicated when configured by the\nicon.",
  "source": "https://docs.greendata.ru/platform/en/etl-gateways.html"
}