{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.408.2 от 19.04.2024\nНовые возможности\nПоявилось возможность\nнастраивать фавикон\n(иконку на вкладке веб-страницы) приложения.\nТеперь при создании\nкомнаты для звонков\nдостаточно указать имя пользователя, ввод наименования комнаты теперь не требуется.\nПри настройке шаблона печатной формы появилась возможность блокировки функции создания комментариев согласно заданному условию алгоритма.\nВ опросном листе появилась возможность блокировки отдельных полей в зависимости от заданных условий.\nИзменения и улучшения\nУсовершенствован процесс редактирования объектных атрибутов через реестр.\nСтабилизирован процесс копирования экземпляра объекта.\nДоработано визуальное представление атрибута \"Гиперссылка с переходом\", теперь допускается использование  протоколов передачи данных http и https.\nОтлажен процесс предпросмотра изображений.\nСтабилизированы визуальные настройки для атрибутов типа \"DaData. Адрес\".\nСтабилизирован выбор объектов в атрибуте с визуальным представлением \"Множественные объекты в виде таблицы\" с настроенной фильтрацией.\nНалажен процесс выравнивания элемента в контейнере ряда согласно заданным настройкам.\nДля аналитической панели \"Таблица\" стабилизировано применение  алгоритма для наименования шапки и стилей форматирования для колонки.\nСтабилизирована возможность алгоритмического добавления файлов, а также загрузка файлов формата pdf.\nСтабилизирована работа алгоритма видимости на фрейме.\nДоработан процесс применения алгоритма блокировки для кнопки в панели управления без принудительного обновления страницы.\nСтабилизирована работа алгоритма, применяемого в системном шаблоне текстового сообщения.\nУсовершенствовано создание экземпляров нормативного срока для различных задач одного этапа бизнес-процесса.\nСтабилизирован перенос обновлений посредством guf-файлов, содержащих дашборд с диаграммой при наличии фильтров.\nМодальное окно \"О программе\" дополнено информацией об используемом сервере.\nВ модуле EDoc при использовании HTML-разметки в источнике закладки помимо обновления значений из источников теперь доступно и сравнение закладок.\nОптимизировано время предварительного просмотра загруженных в систему файлов.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.408.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.408.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.408.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.408.2-latest.html"
}