{
  "title": "Setting up access permissions by \"Authorization objects\"",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up access permissions by \"Authorization objects\"\nThe\n\"By authorization objects\"\npermission control allows to\nrestrict actions\n(viewing, editing, deleting, creating) performed with instances of the main type, depending on the specific values of the object attributes used in the type.\nLet’s consider an example of setting access permissions\n\"By authorization objects\"\n:\nThematic task\nAs part of the project, we’ll need to create an entity for registering borrowers' applications to the servicing bank:\nCredit application\n.\nThis entity (object type) contains 2 object attributes:\nCity\nPossible values:\nPittsburg;\nCalgary.\nStatus\nPossible values:\nEligible partner;\nProfessional client;\nPrivate client.\nEach specified attribute contains a link to an object type that acts as a directory\nUsers belonging to the following access groups will work with the specified entity:\nFinancial consultant. Pittsburg\nJameson;\nFarman.\nFinancial consultant. Calgary\nPeterson;\nWatson.\nInformation verification and processing specialist\nLewis.\nThe selected users need to perform certain actions (create, read, modify and delete) with instances of an object type, depending on the values of object attributes of this type.\nTask for the \"Financial consultant. Pittsburg\" access group\nEmployees of the specified access group should only work with registry instances containing the\nPittsburg\nvalue of the\nCity\nattribute. Also, employees should be able to create profiles with any value of the Status attribute, while editing only those profiles that have the status of\nEligible Partner\n.\nTask for the \"Financial consultant. Calgary\" access group\nUsers included in this access group should only interact with registry instances containing the\nCalgary\nvalue of the\nCity\nattribute, while any client status can be specified in the profile. However, users should only edit instances where the client statuses are\nProfessional Client\nand\nPrivate Client\n.\nTask for the \"Information verification and processing specialist\" access group\nUsers of the specified group should have access to view all instances, but should not have the permissions to create new instances, as well as edit and delete existing ones.\nConcepts and terms\nBusiness role\n- a minimally indivisible logically complete set of business functions performed by user.\nAuthorizations\n- permissions to access data (object types, instances, visuals, attributes, views, menu links, forms, etc.)\nAuthorization subject\n- a user in the system working on the platform in accordance with the authorizations set for him.\nAuthorization object\n- an object in the system defining the user’s authorizations and the level of access to data in the system. When a user attempts to access instances of a type for which authorization objects have been set, the set values for those authorization objects must be checked.\nIn case of difficulties when creating object types, read the \"Creating new object types\" article.\nInformation on creating users and access groups can be found in the \"User’s access to the system\" article.\nAnalytical settings\nTo implement the task, it is necessary:\nTo provide the necessary access to the \"Credit Application\" object type to user groups working in this object type registry;\nTo set up permissions control for the \"Credit Application\" object type;\nTo customize the authorizations matrix by defining user business roles.\nAccess to the System object\nFor the newly created \"Credit Application\" object type, restrict access to the \"Financial consultant. Pittsburg\", \"Financial consultant. Calgary\" and \"Information verification and processing specialist\" user groups.\nDefining Permissions Control for the Object Type\nNext, in the object type profile, specify the permissions control \"By authorization objects\".\nOnce the profile is saved, the \"Permission matrix settings\" button will appear on the action panel. Click on it to proceed to the differentiation of actions of users working in this object type registry.\nIn the next tab, a page will open where you can reproduce the setting of permissions to authorization objects of the “Credit Application” entity.\nCustomizing the authorization matrix\nThe principle of setting up the authorization matrix is to determine the authorizations subjects and objects, that is, to grant System users with certain permissions to work with registry objects.\nIn order to set up an authorization matrix, you need to select users or user groups and define the possible actions for them with object type instances.\nBy default, the System will create two access settings for the \"All Users\" and \"Administrative Group\".\nThe analyst will be able to change the specified permissions for both groups, while remembering that after making the changes and confirming them, it will not be possible to return the specified changes.\nTo add an authorization subject, click on the same name button and select a user or a group of users in the modal window.\nAfter that, add authorization objects in a similar way - object attributes of a custom object type, that will be used for access restriction.\nAs a result, it is possible to define allowed and prohibited actions for selected users (user groups), as well as authorization objects (reference values).\nFor default access groups configured by the System, access to all instances will be granted regardless of the object attribute value in the object type instance.\nWithin the framework of the considered example, allowed actions were defined for access groups with instances containing certain object attribute values in accordance with the thematic task.\nTo give the user access to instances containing any value, it is enough to leave out certain values of object attributes or deselect previously selected values.\nAfter making a change to any record, the System will ask to confirm the changes. Once confirmed, the changes will be saved and take effect.\nResult\nThus, the implemented settings will affect the differentiation of permissions between the three groups as follows:\nResult for the \"Financial consultant. Pittsburg\" access group\nEmployees belonging to the \"Financial consultant. Pittsburg\" user group (Jameson and Farman) have the right to create and view new registry instances with\nany client status\n, but only for the city of\nPittsburg\n. However, these employees can\nonly edit\nthe profiles of customers with\neligible partner status\n.\nResult for the \"Financial consultant. Calgary\" access group\nUsers included in the \"Financial consultant. Calgary\" (Peterson and Watson) access group have the right to create and see new registry instances with any client status, but only for the city of Calgary. However, these employees can only edit those client profiles with professional client and private client statuses.\nResult for the \"Information verification and processing specialist\" access group\nSince the employee Lewis is a member of the \"Information verification and processing specialist\" user group, he has access to all registry instances for reading. However, this user does not have sufficient permissions to edit customer profiles, as well as delete existing profiles and create new ones.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-access-permissions-by-authorization-objects.html"
}