{
  "title": "Setting up a chatbot for the technical support of an Internet service provider",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up a chatbot for the technical support of an Internet service provider\nIn the telecommunications field, customers of Internet service providers often face the problem of unstable communication (Internet) or its complete absence.\nIn situations where the client does not have the opportunity to contact the operator of the support service, a chatbot in the Telegram messenger, configured to work according to a given scenario, can help solve the problem.\nIn addition, the chatbot allows reducing the pressure on support staff by answering the most popular customer questions.\nConfiguring the connection with the Telegram bot is available when the platform is deployed on an\nOn-Premise or Private Cloud solution\n.\nTask statement\nIt is required to set up a chatbot in Telegram, with which the client can:\ncreate a message describing the problem;\nview the list of requests;\nfind out information about the request;\ncontact the support service operator to resolve more complex issues.\nObject model\nIn this example, create 5 object type:\n1. The \"Registry. Receiver channel\" [SR_CHANNEL] object type displays the receiver channel from an external user (client).\nThe following instances must be added to the type registry:\n2. The \"Stage\" object type displays the stage of a request received from the external user (client).\nThe following instances must be added to the type registry:\n3. The \"Contact\" object type [CONTACT] displays information about the external user (client)..\nType attribute composition\n\"First name\";\n\"Last name\";\n\"Middle name\";\n\"Main phone number\";\n\"Telegram username\";\n\"Telegram user ID\";\n\"Requests\" –\nchild attribute\n, which is associated with the object type of the same name by the \"Contact\" attribute.\n4. The \"Request\" object type [SERVICE_REQUEST] displays a request or issue received from the external user (client).\nAttribute composition of type\n\"Request date and time\";\n\"Chat ID\";\n\"Channel\" –\nobject attribute\n, referring to the object type \"Directory. Receiver channel\";\n\"Contact\" –\nobject attribute\nreferring to the type of objects \"Contact\";\n\"Request #\";\n\"Attachment\" –\nobject attribute\nreferring to the \"File\" object type;\n\"Request solution\" – a text attribute with \"Multiline input\" visual;\n\"Stage\" –\nobject attribute\nreferring to the \"Stage\" object type;\n\"Request text\" – a text attribute with \" Multiline input\" visual.\nFor this type of objects, you can add\nexpressions\nfor automatic generation of the name and number of the request:\nSee more\nThe xref function is used to automatically generate the request number:sequencenextval.adoc[sequenceNextVal].\n5. The \"Selected request\" object type [SELECTED_SR] displays the request selected by the client..\nAttribute composition of type\n\"Contact\" –\nrequired\nobject attribute\nreferring to the object type \"Contact\";\n\"Request\" –\nobject attribute\nreferring to the object type \"Conversion\".\nThus,\nsubject area\nwill take the following form:\nSetting up the role model\nIn this case, you will need to create 2 xrefs:creating-access-groups.adoc[access groups]:\n\"CC Operator\" [OPERATOR_CC];\n\"CC Supervisor\" [HEAD_CC].\nNext,\ncreate users\nand include them in the created groups.\n1. When creating an instance of a user, add a new\nemployee\n, specifying \"Sam Edward Smith\" in the appropriate fields.\nIn the \"Credentials\" block, select the \"Credentials. Password authentication\" type and set the credentials (login/password) for the user.\nIn the \"User groups\" block, add the \"CC Operator\" group, and then save the object.\n2. Similarly, for the second instance of the user, create an employee \"Jack Johnson\", specify the credentials for password authentication and add the user to the \"CC Supervisor\" access group.\nConfiguring external chats\nNext,\nconfigure external chats\n.\nTo do this, go to the \"Setting up external chats\" registry type  [SYS_EXT_CHAT_SETTING], create a new instance, set a name (for example, \"Setting up Telegram chats\") and enable \"Activity indication\".\nNext, configure: the\ncommunication channel\n;\nactions for working with chat\n;\npermissions\n.\nConfiguring the communication channel\nOn the\n\"Communication channel\"\ntab, create an instance of the external chat channel settings. In the modal window that opens, select the \"Telegram\" value in the \"Channel\" field and activate the channel using the switch.\nNext, on the \"Channel group\" tab, add a\npreviously created\n\"CC Operator\" access group.\nUsers included in the \"CC Operator\" will have access to external chats (chats with clients) and \"Contact\" type objects created with the chat.\nOn the \"Relationship with system objects\" tab, configure the rules for identifying the channel and the system object (contact).\nTo do this, click\nand add 2 communication settings:\nto identify the user by name;\nto identify the user by ID.\nOn the \"Security principals with \"Head\" role\" tab, the \"Security principals with the \"Head\" role\" field must be filled in with the value \"CC Supervisor\".\nUsers included in the \"CC Supervisor\" access group will be able to write to any external chat, including one assigned to a separate operator, even if this user is not part of the channel’s work groups.\nIn addition, users of the \"CC Supervisor\" group will be able to distribute chats to specific operators, including moving the chat previously assigned to one operator from one employee to another.\nSetting up actions\nOn\nActions tab\n, it is necessary to create settings for the interaction of system users with the external chat.\nTo do this, by clicking the\nbutton, create 4 actions:\n\"Close chat\";\n\"Return to queue\";\n\"Start working on\";\n\"Transfer to operator\".\nSetting up permissions\nTo access external chats, the access groups \"CC Operator\" and \"CC Supervisor\" should be given\npermissions\nto \"Read\":\na created instance of the\"Setting up external chats\" type – \"Setting up Telegram chats\";\ninstances of the \"Actions of external chats\" type,\nadded to the \"Actions\" tab\n.\nSee more details\nAdditionally, for the convenience of working with the platform, the\ncommunication panel\ncan be configured.\nSetting up the GreenData application integration service with Telegram messenger\n1.\nFirst, create a telegram bot according to the\ninstructions\n.\nFor example:\n@Internet_support_assistant_bot\n(name is Internet Support Assistant).\nUpon successful creation of the bot, a message will be received containing a token for further integration settings.\n2.\nNext, create a technical\nuser\n.\nWhen creating a user instance, add a new\nemployee\n, specifying \"Telegram Service\" in the corresponding fields.\nIn the \"User groups\" block, add the \"Administrative Group\" and \"All Users\" groups, and then save the object.\nIn the \"Advanced\" tab, create a new hook token. In the modal window that opens, specify the name:  \"TG Token\". The default token user  will be the created Telegram Service user.\nIt is required to copy the token value from the \"Value\" field\nbefore saving the\ninstance! After saving, the value will be hidden by the System.\n3.\nDeploy the service and obtain the URL according to the\ninstructions\n.\n4. Specify the obtained URL in the\nGreenData application configuration\nin the\ntgIntegrationServiceUrl\nparameter.\n5. Set the system settings described\nbelow\n.\n6. Set up external chats, see the\narticle\nfor more details.\nSetting up the Telegram bot connection with the Greendata application\nTo configure the connection between the Telegram bot and the Greendata application, navigate to\nsystem settings\n, \"Chatbot connection\" section, and fill in the parameter values in the \"Chatbot connection settings for Telegram\" block:\nIn the \"Telegram Token\" field, create a secret variable and paste the\ntoken\nobtained and copied when creating the Telegram bot;\nIn the \"TG Service Authentication Token\" field, create a secret variable and paste the previously created and copied\nhook token\n.\nFor a chatbot to communicate with clients in Telegram according to a specific scenario, set the \"Enable chatbot\" switch to the active position. In the \"Decision tree\" field that appears, select the configured decision tree (chatbot communication scenario with the client) or\ncreate a new one\n.\nAfter selecting the decision tree, click the \"Update chatbot\" button. In case of successful synchronization, a corresponding notification should be sent.\nCreating and configuring the decision tree\nTo\ncreate a decision tree\n, go to the \"Chatbot. Decision tree\" registry [BOT_DECISION_TREE] and create a new instance by specifying its name.\nNext, click the \"Open Constructor\" button in\ncontrol panel\nand proceed directly to configuring the chatbot interaction scenario with the client.\nDuring the configuration process, it is recommended to periodically save the decision tree to fix the changes.\nSetting up the first level of the decision tree\nCreate a new block by clicking the\nbutton and selecting the \"Text\" section type. In the modal window that opens, enter the following text in the \"Text\" field as a greeting:\nGood afternoon! I am your virtual assistant, ready to deal with any issues related to the Internet.\nSelect the next action.\nNext, click \"Save\".\nIn the same block, click\nand add a new section \"keyphrases\".\nIn the modal window that opens, click \"Add a phrase\" and enter \"Register a request\" in the line that appears.\nUnder the field with the phrase, click the \"Add synonym\" button and thus add the following synonyms (each synonym in a separate field): \"Leave a request\", \"Request\", \"Apply\", \"Create a request\", \"Create an application\", \"Issue an application\", \"Issue a request\", \"Register an application\", \"Send an application\", \"Application\".\nAdding the \"Register a request\" keyphrase and its synonyms\nNext, add the second keyphrase \"Get a list of requests\" with the following synonyms: \"List of requests\", \"List of applications\", \"Get a list of applications\".\nAdding the \"Get a list of requests\" keyphrase and its synonyms\nNext, add the third keyphrase \"Contact technical support\" with the following synonyms: \"Operator\", \"Person\", \"Employee\", \"Consultant\", \"Help\", \"Get help\", \"Technical support\", \"TS\", \"Tech.support\", \"Operator\", \"Operators\".\nAdding the \"Contact technical support\" keyphrase and its synonyms\nNext, click \"Save\". In the \"keyphrases\" section, set the display type to \"buttons\".\nUnder the created block, create a new block by clicking the\nbutton and selecting the \"Switching to operator\" section type. In the modal window that opens, click \"Save\".\nResult of setting up the first level of the decision tree\nThe first level of the decision tree will take the following form:\nSetting up the second level of the decision tree\nCreate a new block by clicking the\nbutton and selecting the \"Text\" section type. In the modal window that opens, enter the following text in the \"Text\" field:\nDescribe your problem in one message. To cancel, click the \"Back\" button.\nNext, click \"Save\".\nIn the same block, click\nand add a new section \"keyphrase\".\nIn the modal window that opens, click \"Add phrase\" and enter the character\n*\nin the line that appears.\nAdding the\n*\ncharacter as a keyphrase means that any text entered by the user will lead to the specified action.\nNext, add the second keyphrase \"Get a list of requests\" with the following synonyms: \"List of requests\", \"List of applications\", \"Get a list of applications\".\nAdding keyphrases and their synonyms\nNext, click \"Save\". In the \"keyphrases\" section, set the display type to \"buttons\".\nUnder the created block, create a new block by clicking the\nbutton and selecting the \"Algorithm\" section type. In the modal window that opens, create the\nalgorithm\nusing the \"Add\" option in the actions menu and fill in the following fields:\nName – \"Get a list of requests\";\nIdentifier – \"GET_LIST_OF_REQUESTS\";\nBasic object type – \"Contact\" [CONTACT].\nCreating the \"Get a list of requests\" algorithm\nThe following algorithm must be written in the input field:\nIn this algorithm:\nthe declaration of \"arr\" and \"buttons\" variables is done by the\nvar\nfunction (the arr variable is set as\ndynamic array\nof data);\nthe list of requests is created by a loop using the\nforEach\noperator;\nusing the \"add\" and \"size\" methods, an element is added to the array and the number of array elements is obtained, respectively;\nthe\nif\noperator is used to check if the client has requests.\nto return a response to the client, the\nreturn\nfunction is used.\nThe algorithms allow using the HTML markup:\nusing <button></button> tags, an interactive \"Back\" button was created in the Telegram web interface, upon clicking on which the user can return to the previous step.\nAfter writing and saving the algorithm in the modal window, click \"Save\".\nIn the same block, click\nand add a new section \"keyphrases\".\nIn the modal window that opens, click \"Add phrase\" and enter the character\n*\nin the line that appears.\nResult of setting up the second level of the decision tree\nThe second level of the decision tree will take the following form:\nSetting up the third level of the decision tree\n1. Create a new block by clicking the\nbutton and selecting the \"Algorithm\" section type. In the modal window that opens, create the\nalgorithm\nusing the \"Add\" option in the actions menu and fill in the following fields:\n\"Name\" – \"Create a request\";\n\"Identifier\" – \"CREATE_SERVICE_REQUEST\";\n\"Basic object type\" – \"Contact\" [CONTACT].\nConfiguring the \"Create a request\" algorithm\nWrite the following algorithm in the input field:\nThe algorithm contains the following parameters:\nIn this algorithm:\nthe declaration of the info, request and result variables is performed by the\nvar\nfunction;\nusing the\nnewInstance\nfunction, new instances of the \"Request\" type are created;\nusing the\nattrByVar\nfunction, the specified values are assigned to attributes, including the values parameters added using the xref function:param.adoc[param];\nthe current object is accessed using the\ncurrentObject\nfunction;\nthe object is saved by the\nsave\nfunction;\nto return a response to the client, the\nreturn\nfunction is used.\nHTML markup is allowed in the algorithms:\nby adding\n\\n\\n\ncharacters, a double line break is performed to visually separate the text.\nAfter writing and saving the algorithm in the modal window, it is necessary for\nalgorithm parameters\nto fill in the \"What to fill in\" fields with chat data in Telegram, then click on the \"Save\" button.\n2. Under the created block, create a new block by clicking the\nbutton and selecting the \"Algorithm\" section type. In the modal window that opens, create\nalgorithm\nusing the \"Add\" option in the actions menu and fill in the following fields:\n\"Name\" – \"Get information about the request\";\n\"Identifier\" – \"GET_INFORMATION_ABOUT_SR\";\n\"Base type of objects\" – \"Contact\" [CONTACT].\nSetting up the algorithm to \"Get information about a request\"\nThe following algorithm must be written in the input field:\nThe algorithm contains the following parameters:\nIn this algorithm:\nvariables are declared by the function\nvar\n;\nthe collection of objects is set by the function\nobjectsWithOptions\n, which selects the previously created algorithm as the object filtering parameter using the function\nfilterAlg\n;\nusing the function\nnewInstance\ncreates new instances of the \"Selected request\" type;\nusing the\nif\noperator, the specified conditions are checked;\nthe specified values are assigned to attributes using the\nattrByVar\nfunction, including parameter values added using the\nparam\nfunction;\nthe object is saved by the\nsave\nfunction;\nto return a response to the client, the xref function is used:return.adoc[return].\nThe algorithms allow the use of HTML markup:\nusing <button></button> tags, an interactive \"Back\" button has been created in the Telegram web interface, upon clicking on which the user can return to the previous step.\nby adding the characters\n\\n\\n\n, a double line break is performed to visually separate the text..\nAfter writing and saving the algorithm in the modal window, it is necessary for\nalgorithm parameters\nto fill in the \"To be filled in\" fields with chat data in Telegram, then click the \"Save\" button.\nThe result of setting up the third level of the decision tree\nThe third level of the decision tree will take the following form:\nSetting up transitions\nFor the configured script to work, set up transitions between blocks:\n1. To create a transition from the first block of the first level to the first block of the second level: click on the marker next to the phrase \"Register a request\", then click on the required block.\nThe transition will be created:\n2. To create a transition from the first block of the second level to the first block of the third level: click on the marker next to the phrase \"*\", then click on the desired block.\nThe transition will be created:\n3. To create a transition from the first block of the second level to the first block of the third level: click on the marker next to the phrase \"*\", then click on the desired block.\nThe transition will be created:\n4. Create transitions from the first block of the first level and from the first block of the second level to the second block of the second level: in each block, click on the marker next to the phrase \"Get a list of requests\", then click on the desired block.\nThe transitions will be created:\n5. To create a transition from the first block of the first level to the second block of the first level: click on the marker next to the phrase \"Contact technical support\", then click on the desired block.\nThe transition will be created:\nAfter completing the configuration, save the decision tree.\nAs a result, the decision tree will take the following form:",
  "source": "https://docs.greendata.ru/platform/en/setting-up-chat-bot-for-provider-support.html"
}