{
  "title": "Визуал",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВизуал\nВизуал\n– это отображение данных для конечного пользователя.\nГибкость и персонализация настройки предоставляет возможность отображать элементы визуала (отдельные атрибуты, блоки данных) для одних пользователей и скрывать для других.\nБизнес-аналитик может настроить:\nотображение\nреестра\nэкземпляров;\nвизуал\nкарточки экземпляра\n;\nкнопки на панели управления карточки экземпляра\n.\nКаждый объект Системы может иметь несколько визуалов, которые позволяют адаптировать отображение информации под разные нужды и предпочтения.\nВизуал реестра\nПо умолчанию для каждого типа отображается\nреестр базового типа\n.\nПри наличии прав доступа просмотр списка настроенных или создание нового реестра типа осуществляется по кнопке\n.\nПодробнее с созданием реестров можно ознакомиться в\nстатье\n.\nВизуал экземпляра\nОдна и та же\nкарточка объекта\nможет иметь\nнесколько визуалов\n.\nНаименование текущего визуала карточки отображается в правом верхнем углу, при наличии нескольких визуалов их список доступен в выпадающем списке.\nВидимость списка с выбором визуала регулируется\nнастройками кнопок и действий на панели управления\n.\nОтображение наименования доступно только для визуала, который открывался в режиме редактирования и был сохранен (даже без внесения изменений).\nПользователю отображается визуал по умолчанию, если у него есть\nправа\nна чтение данного визуала.\nЕсли такого визуала нет или у пользователя отсутствуют на него права, будет отображаться первый по счету визуал для текущего типа, на который у пользователя имеются права доступа.\nЕсли у пользователя нет прав на просмотр визуалов текущего типа, тогда ему будет доступен визуал по умолчанию\nнаследуемого типа объекта\n.\nЕсли такого визуала нет или у пользователя отсутствуют на него права,\nбудет показан первый доступный визуал наследуемого типа объекта, на который у пользователя есть права (и так далее до старшего родителя).\nСоздание и настройка визуала осуществляется через меню действий, доступное при нажатии на кнопку\n, после чего выбирается одна из следующих опций:\nдобавить – создание нового визуала:\nВизуалы карточек всех типов сохраняются в реестр типа \"Визуал\" [SYS_VISUAL], где при необходимости они могут быть отредактированы или удалены.\nСоздание нового визуала также доступно через\nдобавление экземпляра\nтипа \"Визуал\".\nПри выборе опции откроется модальное окно, в котором необходимо указать следующие параметры:\nПараметр\nНазначение\nНаименование\nНаименование настраиваемого визуала.\nТип объекта\nВыбор типа объекта, визуал которого настраивается. При создании визуала из карточки объекта значением параметра автоматически указывается тип объекта настраиваемой карточки.\nПолный перечень типов в выпадающем списке параметра доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nВид визуала\nОпределение вида настраиваемого визуала. Возможные значения:\nвизуал по алгоритму\n;\nвизуальная карточка объекта;\nтаблица для множественной установки значений (используется для настройки виджета\n\"Таблица для множественной установки значений\"\n).\nИзменять вид визуала могут только те пользователи, которые обладают административными правами на платформе.\nАлгоритм определения визуала\nВыбор алгоритма, определяющего используемый визуал.\nПоле доступно при настройке\nвизуала по алгоритму\n.\nСделать визуалом по умолчанию\nЛогический атрибут, определяющий использование данного визуала в качестве визуала объекта по умолчанию.\nДля объекта может быть настроен только один визуал по умолчанию.\nПри\nустановке файла обновления\n, содержащего объект с визуалом по умолчанию, ранее установленный на стенде визуал по умолчанию будет заменен визуалом, полученным из файла обновления.\nИспользовать в мобильном приложении\nЛогический атрибут, отвечающий за отображение визуала в мобильном формате.\nСкрыть кнопки панели управления\nСкрытие\nпанели управления\n.\nКнопки, расположенные на панели управления, станут недоступны из карточки объекта, включая редактирование визуала. Для деактивации параметра необходимо перейти к настройке визуала через\nреестр\nтипа \"Визуал\" [SYS_VISUAL].\nПри активном параметре станет недоступна\nнастройка кнопок панели управления\n.\nОтображать в настройках расширенного поиска в реестре\nЛогический атрибут, определяющий использование визуала в качестве фильтра расширенного поиска.\nСохранять введенные данные при закрытии нового (несохраненного) объекта\nХранение введенных данных при закрытии объекта\nс данным визуалом\nбез сохранения.\nПри\nсоздании нового экземпляра\nбудет открыта карточка объекта с заполненными ранее полями, также будут пересчитаны\nвыражения/автокалькуляции\n.\nПри нажатии на кнопку\nбудет произведена очистка полей от указанных ранее значений.\nПараметр доступен при настройке визуала вида \"Визуальная карточка объекта\".\nНастройка отображения наименования\nОпределение способа отображения наименования объекта в\nнавигационной панели\nи модальном окне. Возможные значения:\nиз атрибута Наименование [Name];\nпо алгоритму;\nскрыть.\nПо умолчанию наименование объекта формируется из атрибута \"Наименование\".\nАлгоритм наименования объекта на визуале\nВыбор алгоритма для формирования наименования объекта, которое будет отображаться в\nнавигационной панели\nи модальном окне.\nПоле доступно при способе отображения наименования \"По алгоритму\".\nПанель управления\nНа данных вкладках осуществляется настройка отображения кнопок в\nпанели управления\nи\nмодальном окне\nпри открытии объекта.\nМодальное окно\nредактировать – открытие\nнастроек текущего визуала\nв модальном окне;\nоткрыть в этом окне – переход из карточки\nк настройке текущего визуала\nв открытом окне;\nоткрыть в новой вкладке –  переход из карточки\nк настройке текущего визуала\nв новой вкладке;\nкопировать – создание нового визуала на основе существующего:\nПри выборе опции откроется модальное окно с карточкой скопированного визуала, в наименовании добавится слово \"копия\" (доступно к исправлению).\nСледует учитывать, что при копировании визуала по умолчанию необходимо отключить настройку \"Сделать визуалом по умолчанию\", так как не может быть двух визуалов по умолчанию для одного объекта.\nНастройка кнопок и действий панели управления\nОтображение кнопок системных действий и выпадающего списка с выбором визуала на\nпанели управления\nкарточки объекта может быть настроено бизнес-аналитиком.\nУправление отображением элементов панели управления осуществляется в настройках визуала на вкладке \"Панель управления\":\nНа данной вкладке размещен параметр \"Настройка кнопок панели управления\" с выбранным объектом набора настроек, представленным ниже. Данный набор настроек позволяет:\nопределить видимость кнопок системных действий \"Обновить\", \"Сохранить\", \"Копировать\" и \"Удалить\" при помощи отметок в полях checkbox;\nопределить видимость выпадающего списка с выбором визуала при помощи отметки в поле checkbox;\nВыпадающий список с выбором визуала может быть скрыт только для пользователей,\nне имеющих\nправо на \"Выполнение\"\nразрешения \"Просмотр метаданных\"\n.\nПри наличии указанного разрешения данная настройка не учитывается – выпадающий список с выбором визуала отображается всегда.\nотредактировать текст подсказки для каждой кнопки в поле \"Хинт\";\nпереопределить действие для кнопки сохранения.\nПример переопределения кнопки \"Сохранить\".\nДля оптимизации времени при создании многочисленных объектов справочника по нажатию на кнопку \"Сохранить\" можно осуществлять пакетное действие, включающее в себя действия сохранения и возврата к предыдущей странице.\nДля этого следует подготовить\nпакетное действие\n, включающее в себя действия \"Сохранить\" и \"Назад\".\nДалее в настройках визуала карточки объекта для действия \"Сохранить\" следует активировать переключатель \"Переопределить кнопку\", после чего в выпадающем списке выбрать созданное действие.\nПри необходимости для данной кнопки можно заменить иконку и хинт.\nПеречень действий для переопределения содержит все действия, включающие в себя системное действие \"Сохранить\".\nВ результате данных настроек при нажатии на переопределенную кнопку будет осуществляться сохранение и возврат к предыдущей странице.\nЕсли предыдущая страница отсутствует, тогда будет осуществляться только действие сохранения.\nВыбор ранее созданного объекта с настройками осуществляется из выпадающего списка, редактирование объекта настроек доступно через меню действий\n.\nДля создания нового объекта следует выбрать в меню действий\nсоответствующую опцию  или нажать на кнопку\n.\nНастройка кнопок и выпадающего списка с выбором визуала на панели управления может быть произведена на вкладке \"Настройка кнопок панели управления\".\nВ представленных настройках можно задать условие \"По умолчанию\" – в таком случае настройка будет применена по умолчанию ко всем объектам с данным визуалом.\nПо умолчанию ко всем новым карточкам объектов Системы применена настройка \"Системное отображение кнопок в панели управления\".\nОбъект настройки может использоваться для визуалов конкретных карточек или применяться для всех карточек объектов Системы.\nДля просмотра и редактирования списка визуалов, к которым применены данные настройки, необходимо перейти на вкладку \"Визуалы\".\nПри сохранении внесенных изменений отобразится системное уведомление, для применения настроек следует нажать на кнопку \"Ок\", для отмены изменений – на кнопку \"Отмена\":\nНастройка кнопок модального окна\nОтображение кнопок в модальном окне может быть определено в настройках визуала на вкладке \"Модальное окно\".\nНа данной вкладке размещен параметр \"Настройка модального окна\" с объектом настроек, который позволяет определить видимость кнопок \"Ок\" и \"Отмена\" при помощи переключателей:\nВыбор ранее созданного объекта с настройками осуществляется из выпадающего списка, создание нового или редактирование выбранного объекта настроек доступно через меню действий параметра\n:\nСтандартные кнопки \"Ок\" и \"Отмена\" в модальном окне могут быть\nпереопределены\nв настройках соответствующих пользовательских действий.",
  "source": "https://docs.greendata.ru/platform/ru/visual.html"
}