{
  "title": "Избранное",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИзбранное\nИзбранное – это персональный раздел пользователя, при помощи которого можно осуществить быстрый переход к часто используемым объектам Системы.\nДобавление объектов в \"Избранное\" доступно только для авторизованных пользователей (для\nанонимного пользователя\nфункционал заблокирован).\nПереход к разделу осуществляется через\nменю профиля пользователя\n.\nРаздел \"Избранное\" активен, если в него добавлен хотя бы один объект.\nДобавление  в \"Избранное\" возможно только для тех объектов, для типов которых настроено соответствующее действие.\nНастройка действия\nПроцесс настройки действия предполагает:\nОткрытие реестра типа \"Действие\". Переход можно осуществить, последовательно выбрав пункты меню: Администрирование → Управление объектами → Действия над объектами.\nНастройку экземпляра \"Избранное\" [SYS_FAVORITES_ACTION].\nДанный экземпляр представлен в базовой поставке и имеет следующие настройки:\nВ блоке \"Связанные типы объектов\" необходимо добавить типы, для объектов которых необходимо предоставить возможность добавления в \"Избранное\".\nДля того чтобы добавлять в избранное типы объектов следует настроить связь с типом \"Тип объекта\" [SYS_OBJ_TYPE].\nЕсли связать с типом \"Объект\" [SYS_OBJECT], то кнопка \"Избранное\" будет доступна для всех объектов системы.\nВ настройках действия и связанных типов объектов нельзя заменять иконку для кнопки и переопределять опцию действия.\nИзменения, внесенные в экземпляр действия, необходимо сохранить нажатием на иконку дискеты.\nДля связанных типов объектов настроенное действие отображается в виде кнопки\n, которая может быть расположена:\nв\nкарточке объекта\n;\nв\nреестре объектов\n.\nКарточка объекта\nКнопка добавления объекта в \"Избранное\" из карточки объекта может быть размешена:\nна панели управления – для этого достаточно настроить\nдействие\nдля связанного типа, выбрав в параметре \"Отображать в карточке\" значение \"Да\":\nна визуале карточки:\nДля этого необходимо при\nредактировании визуала карточки\nдобавить в рабочую область\nвиджет \"Кнопка\"\n, действие которого указать как \"Избранное\".\nКнопку для добавления объекта в избранное рекомендуется размещать обособленно от основного контента, представленного в карточке.\nПосле выбора действия \"Избранное\" в настройках виджета не допускается редактирование иных параметров, кроме как \"Активна в режиме чтения\" и \"Запуск действия по нажатию Enter\".\nРеестр объектов\nВ первую очередь для того чтобы в\nреестре типа объектов\nпоявилась возможность добавлять объекты в \"Избранное\", необходимо при настройке\nдействия\nв параметре \"Отображать в реестре\" установить значение \"Да\".\nДалее в зависимости от\nпредставления реестра\nнастроить отображение действия:\nв плоском/календарном реестре, а также в реестре с папками/иерархией кнопка может быть расположена на панели управления:\nДля этого в настройках реестра на вкладке \"Панель управления\" необходимо добавить соответствующее действие:\nв плиточном реестре при аналогичной настройке реестра кнопка будет расположена в ховере плитки (доступна при наведении мыши на плитку объекта):\nв легком реестре действие может быть добавлено:\nв виде кнопки на панели управления:\nДля этого при настройке реестра на вкладке \"Кнопки\" следует создать новую кнопку и выбрать для неё действие \"Избранное\"\nв контекстное меню объекта:\nв виде иконки действий:\nв виде кнопки в строке состояния:\nПоследние три способа реализуются при помощи добавления действия \"Избранное\" на одноименной вкладке и выбора необходимого расположения:\nДобавление объектов\nЧтобы добавить объект в избранное, достаточно нажать на кнопку\n, в результате чего кнопка изменит цвет\n.\nДля того чтобы кнопка избранного была активна в реестре, необходимо выбрать хотя бы один объект.\nЕсли в реестре активна опция мультивыбора объектов, в избранное одновременно могут быть добавлены несколько объектов. При выборе несколько объектов, часть из которых уже являются избранными, следует учесть, что:\nесли среди выбранных объектов количество отсутствующих в избранном объектов больше или равно числу ранее избранных, тогда все отмеченные объекты будут добавлены в избранное;\nесли среди выбранных объектов преобладают те, которые уже добавлены в избранное, тогда по нажатию на кнопку\nдействие будет восприниматься Системой как удаление из избранного, иными словами все выбранные объекты не станут избранными.\nДля удаления объекта из избранного следует повторно нажать на данную кнопку или, выбрав объект в реестре избранного, нажать на иконку удаления на панели управления, после чего подтвердить действие в модальном окне.",
  "source": "https://docs.greendata.ru/platform/ru/favorites.html"
}