{
  "title": "Release details, version LTS.405",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.405\nPatch LTS.405.3 of March 29, 2024\nChanges and improvements\nWorking with styles for the\nTitle by attribute\nwidget was stabilized\nPatch LTS.405.2\nChanges and improvements\nAccess permissions when working with objects were stabilized\nEdoc: document version comparison was stabilized\nPatch LTS.405.1\nChanges and improvements\nMinor changes and improvements.\nUpdate package LTS.405.0 of March 26, 2024\nNew features\nFunctionality for analyzing effective permissions by object was added.\nThe possibility to switch to editing of the business process flowchart directly from the route object flowchart was added.\nThe possibility of creating new SQL-based data sources can be managed in the configuration file.\nNew Edoc functionality: it is now possible to switch from a bookmark to a questionnaire item and to attach a document in a user-defined format. The name of the downloaded document can now be specified by the algorithm.\nChanges and improvements\nGenerating an object data source was optimized;\nVisuals of objects when working with business processes were optimized;\nWorking with objects in Text Message widget was stabilized;\nWorking with the multiselect attribute when creating a new instance was stabilized;\nWorking with reporting forms was stabilized;\nWorking with algorithm compilation was stabilized;\nDisplay of drop-down lists in the System was stabilized;\nWorking with the Theme Designer when copying themes was stabilized;\nWorking with GUF files was stabilized;\nWorking with subject area objects was stabilized;\nWorking with the registry: display of data in columns was stabilized;\nWorking with the dashboard visual was stabilized;\nEdoc: Text editing functionality in the Edoc editor was improved. Settings for creating and attaching a file, downloading a file in the working with bookmarks mode were improved. Display of buttons when working with Edoc was optimized;\nDisplay of unread chats in GreenData Desktop Messenger was stabilized;\nSystem performance was improved.",
  "source": "https://docs.greendata.ru/platform/en/LTS.405.3-details.html"
}