{
  "title": "Варианты поставки платформы GreenData",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВарианты поставки платформы GreenData\nПлатформа\nGreenData\nпредставлена на рынке вариантами поставки:\nSaaS\nрешение (\"Программное обеспечение как услуга\" от англ. Software as a Service).\nФункционирует на базе облачных технологий и согласованной работы ИТ-сервисов.\nSaaS модель позволяет потребителям\nбез значительных инвестиций\nв автоматизацию использовать и оплачивать ровно столько ИТ-ресурсов, сколько требуется для текущей комфортной работы. Именно модель SaaS позволяет \"попробовать решение\" буквально в течение одного дня, обеспечивая явные конкурентные преимущества:\nвысочайшая скорость внедрения ИТ-решений;\nмногократное сокращение затрат на инфраструктуру и ИТ-специалистов;\nмультиплатформенность, гибкость и независимость оснащения АРМ.\nПодробнее см. в статье\n\"Архитектура и безопасность SaaS решения\"\n.\nДля получения доступа к использованию облачной версии Платформы GreenData необходимо создать учетную запись в\nЛичном кабинете SaaS\n.\nДанное решение позволяет бесплатно ознакомиться с функционалом платформы, увеличение возможностей предоставляется за счет приобретения\nлицензии\n.\nOn-Premise\nрешение, разворачиваемое на площадке Заказчика.\nРаботает на ИТ-инфраструктуре Заказчика и предполагает собственный ИТ-персонал.\nУстановка Системы на ИТ-инфраструктуре предприятия в варианте поставки On-Premise позволяет Заказчику осуществлять полный контроль над своим программным обеспечением и данными, что может быть важным для соблюдения требований безопасности и конфиденциальности (например, при наличии ограничений для предприятий гособоронзаказа).\nС принципом установки и развертывания Платформы подробнее можно ознакомиться в\nстатье\n.\nДля ознакомления с условиями и оформления прав на использование платформы в On-Premise решении следует обратиться в\nотдел продаж\n.\nPrivate Cloud\nрешение, позволяющее Заказчику развернуть платформу на партнерских облачных серверах, таких как\nYandex Cloud\nили\nVK Cloud\n.\nДанный метод предоставляет Заказчику возможность работы с платформой GreenData через арендуемый облачный сервер, гибко настраивая и управляя ресурсами в соответствии с собственными требованиями по безопасности, производительности и доступности.\nРешение Private Cloud подразумевает приобретение необходимых для развертывания платформы ресурсов на стороне облачного сервиса.\nПраво на работу с платформой GreenData предоставляется после покупки\nлицензии\n.",
  "source": "https://docs.greendata.ru/platform/ru/platform_delivery_options.html"
}