{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease\nLTS.398.1\nof February 9, 2024\nNew features\nThe ability to view the duration of video playback in the Media widget before the video is loaded was implemented.\nTable Name behavior has been changed when validating entered data when creating object types.\nNew features of Unread and All folders were added to GreenData Messenger.\nA\nlegend\nwith developer information was added in the main menu bar.\nSystem settings\nwere improved and unified: system settings are now grouped in separate instances by functional modules.\nExport of Edoc documents with comments and its filtering was implemented.\nChanges and improvements\nWorking with PDF files was improved;\nWorking with custom charts was improved;\nEdoc: working with template editor was improved, working with bookmarks was stabilized, bookmark version comparison was improved;\nWorking with role_admin, all_users access groups was improved;\nAutomatic filling of the table name of the File object attribute was improved;\nWorking with the Light registry was improved: display of custom actions, button operation and drop-down lists was stabilized;\nDisplay of table heights when switching to visual editing was stabilized;\nColumn width changes in the dashboard were stabilized;\nCharts downloading in the dashboard was stabilized;\nWorking with onChange algorithm call was stabilized: read-only attributes are now removed;\nWorking with the kanban board tasks was stabilized;\nAnonymous authorization was stabilized;\nDisplay of sub-steps in the advanced status bar was stabilized;\nAlgorithm editor operation was stabilized;\nPrinted Forms file saving was stabilized;\nFile preview in the registry was stabilized;\nWorking with guf was improved: the system displays a warning message when an object is not found on the instance.",
  "source": "https://docs.greendata.ru/platform/en/LTS.398.1-latest.html"
}