{
  "title": "Uploading Android app to Google Play",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nUploading Android app to Google Play\nAn Android-based app can be added to Google Play by following the steps:\nRegistering a developer account in the Google Play Console.\nPreparing the necessary information and content for the app, including description, screenshots, graphics, etc.\nUploading the app bundle (*.aab) to the Google Play Console.\nThe file is downloaded in the\npersonal account\nin the\n\"Mobile apps\"\nsection.\nFilling in the necessary metadata and settings for the app.\nPassing Google verification for compliance with policies and requirements.\nAfter successful verification, publising the app on Google Play.\nThis article describes the\nupload of the first version of the Android application to the Google Play Console personal account\nand nuances of the\nGoogle Cloud set up to automatically update the application\n.\nAdding a new app to the Google Play Console\nAfter logging in to the\nGoogle Play Console\ngo to the \"Home Page\" tab and click the \"Create application\" button.\nAs a result, a page for creating an application will open. Fill in the appropriate fields, and then click \"Create application\" at the bottom of the screen.\nCarefully read the rules and requirements for filling in the data and publishing the application.\nThe application is configured on the \"Control Panel\" tab. Fill in all required fields in the sections:\nIn the information about the application content, specify:\nTask\nSetting\nSet privacy policy\nSpecify the URL to the application’s privacy policy.\nApp access\nSpecify access \"Access to all or some functions is restricted in my application\", then add instructions that will allow Google Play specialists to check the application.\nIn the modal window, provide the following data:\nname of the instruction is Demo access;\n{User login} – account login for demo access to the specified instance;\n{User password} is the account password of the specified login.\nTo enter the application, complete ALL STEPS!\nCheck internet is working\nEnter login in login field\nEnter password in password field\nPress Sign In button.\nIf shows error dialog then re-enter login and password and try again\nCheck the \"No other information is required to access all sections of my application\" box.\nAfter filling in the fields, click \"Add\" at the bottom of the screen.\nAds\nSelect \"No, my app does not contain ads\".\nContent reating\nFill out the questionnaire (select \"available to all\", 0 or 3, depending on the available option).\nAt the \"Category\" stage, add an email address and select the \"All other types of applications\" setting, then click \"Next\" at the bottom of the screen.\nAt the \"Questionnaire\" stage, specify the \"No\" value in each displayed item, then click \"Save\" at the bottom of the screen. After saving the questionnaire, click \"Next\".\nIn the age restrictions section that opens, specify the following:\n\"Age groups from 13 and above\";\n\"Appealing to children (can it attract children)\" – No.\nNews apps\nSpecify \"No\".\nData safety\nStep-by-step data security set up, that is done by following the instructions in the personal account\nIn the same way, fill in the settings at the \"Data collection and security\" stage.\nAt the \"Data types\" stage, in the \"Personal information\" block, select the \"email address\" and \"user IDs\" values.\nAt the \"Data usage and processing\" stage, switch to the previously selected values (\"email address\" and \"user IDs\") and select the \"Collects\" value.\nAfter that, in the displayed settings, select:\n* \"No, the collected data is not processed temporarily\";\n* \"Data collection is mandatory (users cannot disable this feature)\".\nAs purpose of data collection, specify \"Application functions\".\nAfter filling in the fields, click \"Add\" at the bottom of the screen.\nGovernment apps\nSpecify \"No\".\nCOVID-19 contact tracing and status apps\nSelect \"There are no health-related functions in my application\".\nNext, fill in the required fields for displaying the application in Google Play. For example, specifying the name, a short and full description of the application, uploading the application icon, etc.\nAfter the basic configuration of the application is completed (all the necessary sections are filled in on the \"Control Panel\" tab in the \"Configure the application\" block), proceed to uploading the application.\nTo upload the application, go to the \"Internal Testing\" section on the \"Testing\" tab, where it is necessary to:\ncreate a release, attach the\n*.aab application\nin the appropriate field, fill in the version description and publish using the button at the bottom of the screen;\nselect testers to check the availability and correctness of the application. To do this, create a mailing list, specifying its name and adding the email addresses of Google accounts under which the Google play market is accessed.\nAfter creating the list, a link to confirm participation in testing will be available on the same tab with the number of testers\nSometimes, the VPN is required to open a link.\nNext, go to the open or closed testing section to create a release by selecting an application from the list (the \"Add from library\" button), fill in the description and publish the release.\nWhen publishing, a notification will be displayed that the version is ready, but requires verification. To do this, click the appropriate button.\nAfter the verification by Google is complete, automatic publication will be available.\nSet up Google Cloud for automatic application updates\nTo be able to remotely update an application in the Google Play Console, an associated Google Cloud project with a connected API for publishing and a service account that will have access to publish the application are required.\nRemote publishing is only available if the app was previously created and published on the Google Play Console.\nUnder the same account that is the account of the developer (owner) in the Google Play Console, create a new Google Cloud project.\nAfter creating a Google Cloud project, connect the API to it. To do this, go to the \"Enabled APIs & services\" section on the \"APIs & Services\" tab and click on the button of the same name.\nOn the page that opens, using the search, find and go to the \"Google Play Android Developer API\", then click \"Enable API\".\nAfter enabling the API, add a service account. For that, go to the \"Service Accounts\" section on the \"IAM & Admin\" tab, and click \"Create service account\".\nNext, fill in the account creation settings. When granting permissions to this service account, add the Editor role and save the settings.\nAfter that, in the list of service accounts for the created account, select \"manage keys\" from the actions menu, and on the page that opens, after clicking \"Add key\", select \"Create new\". A modal window opens in which, after selecting the \"Json\" key type (selected by default), click \"Create\".\nAs a result, a key will be created, and a file in JSON format will be automatically downloaded to the device. This key must be attached to the \"Service key\" attribute in the personal account for the mobile application, which will be available after the formation of the first version of the application.\nAfter completing the steps, return to the Google Play Console and, going to the \"Users and Permissions\" tab, click \"Invite users\".\nOn the page that opens, in the \"Email address\" field, enter/copy the email specified in the Google Cloud for the service account (displayed in the list with \"Service accounts\").\nConfigure the appropriate permissions depending on whether it is required to publish different or specific applications under an account.\nFor permissions within specific app\n, on the \"App permissions\" tab, select the created mobile application by clicking \"Add Application\" button:\nAfter that, in the window that opens, check that all permissions are selected in the \"Releases\" section (if not, check them) and click \"Apply\" at the bottom of the screen.\nFor permissions within the account\n(i.e. not limited to any specific application), on the \"Account permissions\" tab, in the list that appears, check  the \"View application information\" option, as well as all permissions in the \"Releases\" section, and then save the changes.\nAfter completing the steps when creating a version of the mobile application from the\nSaaS personal account\n, it will be uploaded to the Play Console as a version for internal testing and displayed in the appropriate section.\nThis version is available on the Play Market only for users who are included in the selected lists of testers of this type of publication.\nIn order for the version to become publicly available, go to the \"Working version\" tab and click on the \"Create release\" button.\nOn the page that opens, in the \"App Bundle\" block, click \"Add from Library\" and select the required version. Next, in the \"Release Information\" section, fill in the \"Release Notes\" and click on the \"Next\" button.\nOn the page that opens, click on the \"Submit for verification\" button.\nIn case of successful verification by Google, the application becomes available in the Play Market for all users.\nIf necessary, create releases for closed/open testing with your own lists of testers in the appropriate sections of the Play Console. The creation of such releases is done in the same way as with the working version.",
  "source": "https://docs.greendata.ru/platform/en/upload-app-in-google-play.html"
}