{
  "title": "Security policy management",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSecurity policy management\nSecurity policy is a set of rules aimed at improving the data security. We pay special attention to this part of information security. In GreenData, users are given the opportunity to configure and manage their own security policy.\nCreating a security policy\nTo create a security policy for an application, go to: Administration → Access control → Security policy management:\n2. The \"Security Policy\" registry [SYS_PASSWORD_POLICY] will open. The object can be found via \"Administration\" → \"Object Management\"→ \"Object Types\". Where a new instance of the object can be created by clicking\non the control panel.\n3. In a new window, specify the name and set the security policy by using switch buttons:\nSetting\nPurpose\nGeneral settings\nName\nName of the security policy object.\nActivity flag\nApplying the conditions of the current\nsecurity policy object\nof the user in the application.\nChanging the activity attribute is only available with have\nPassword Policy Management permissions\n.\nOnly one security policy can be active in the application. By trying to save another security policy with this property, the system will notify that an already active security policy already exists and will offer to replace it.\nFor particular security principals with a\nprivilege level\n, the default security policy can be overridden.\nDate when this feature is enabled, under certain conditions, may be a reference date for other properties.\nThese settings apply to all users of the System.\nBlock users in the absence of entrances to the system\nActivation of the user account lockout property if there is no login during the specified time.\nPermissible period of absence in the system, days\nNumber of days when the user is not authorized, after which the account will be blocked.\nDay count starts from the date of the last authorization, if the user has never passed the authorization process, then the date of the last activity is considered to be the date of the user’s data change.\nBy default, the field is set to 5 days.\nThe field is displayed when the \"Block users in the absence of entrances to the system.\nPassword authentication settings\nThese settings\ndo not apply\nto users logging in via\ndomain login\nor using the OAuth 2 protocol.\nSet the frequency of the mandatory password change\nSetting up frequency of the mandatory password change option.\nPassword validity period, days\nNumber of days of password validity after which this password will be invalid and will need to be replaced.\nDay count starts from the last date of password change, in its absence from the date when the security policy activity sign is enabled.\nBy default, the field is set to 90 days.\nThe field is displayed when the \"Set the frequency of mandatory password change\" option is active.\nBlock account with unsuccessful entry attempts\nActivation of the user account lockout property in case of unsuccessful password entry attempts.\nNumber of acceptable unsuccessful attempts\nNumber of attempts to enter an incorrect password, after which the user will be blocked.\nBy default, the field takes the value 3.\nThe field is displayed when the \"Block account in case of unsuccessful input attempts\" option is active.\nPassword input mask\nDefining a set of rules governing the acceptable format of the user’s password.\nThe password input mask is defined by the \"User password input mask\" type  [SYS_PASSWORD_MASK].\nThe previously created configuration objects are selected from the drop-down list, adding a new setting is available through the parameter actions menu.\nThere are 3 password difficulty levels pre-configured in the System:\nminimum difficulty;\nat least 8 characters;\ncontains numbers;\ncontains lowercase and uppercase letters;\ndoes not contain visually ambiguous characters.\naverage difficulty;\nat least 11 characters;\ncontains numbers;\ncontains lowercase and uppercase letters;\ncontains special characters;\ndoes not contain visually ambiguous characters.\nmaximum difficulty.\nat least 14 characters;\ncontains numbers;\ncontains lowercase and uppercase letters;\ncontains special characters;\ndoes not contain 3 or more repeated or consecutive characters.\nBy default, the password input mask is set to \"Current settings\", which includes password settings previously used in the System: at least 8 characters, contains numbers, lowercase and uppercase letters, as well as special characters.\nWhen selecting a password entry mask, the corresponding\nsettings\nwill be displayed at the bottom of the screen.\nNumber of passwords banned for reuse\nDetermining the number of previously used user passwords that cannot be used.\nReset passwords for all users of the System.\nWhen clicking on the button, a corresponding warning will be displayed, in the window of which  the \"Yes\" button to reset all user passwords should be clicked.\nThe\nbutton is only available for an active password policy.\nPassword input mask\nDefining a set of rules regulating the allowed format of the user password.\nThe password input mask is defined by the \"User password input mask\" type [SYS_PASSWORD_MASK].\nPreviously created configuration objects can be selected from the drop-down list. Adding a new configuration is available via the parameter action menu.\nThe System provides 3 predefined password complexity levels:\nminimum complexity;\nat least 8 characters;\ncontains digits;\ncontains both lowercase and uppercase letters;\ndoes not contain visually ambiguous characters.\nmedium complexity;\nat least 11 characters;\ncontains digits;\ncontains both lowercase and uppercase letters;\ncontains special characters;\ndoes not contain visually ambiguous characters.\nmaximum complexity.\nat least 14 characters;\ncontains digits;\ncontains both lowercase and uppercase letters;\ncontains special characters;\ndoes not contain 3 or more repeating or sequential characters.\nBy default, the password input mask is set to \"Current settings\", which includes previously used System password configuration parameters: at least 8 characters, contains digits, lowercase and uppercase letters, as well as special characters.\nWhen a password input mask is selected, the corresponding settings will be displayed at the bottom of the screen.\nReseting passwords for all System users.\nWhen the button is clicked, a confirmation dialog will appear. Click \"Yes\" to reset all user passwords.\nThe button is available only for the active password policy.\nNumber of passwords banned for reuse\nDefining the number of previously used passwords that cannot be reused.\nBy default, this parameter is set to 1.\nLock duration\nDefining the duration of the user account lock after failed password attempts. Once the specified time elapses, the account will be automatically unlocked.\nTo configure the lock duration, the user must specify the unit of measurement in the corresponding field.\nIf a lock duration is set, the user will see a message indicating the unlock date and time when attempting to log in.\nExample\nIf no lock duration is set, the user will remain locked until an administrator manually removes the lock in the\nuser password credentials settings\n.\nExample\nBy default, the lock duration is 30 minutes.\nUnit of measurement\nDefining the unit of measurement for the lock duration. Possible options:\nSecond;\nMinute;\nHour;\nDay.\nClick\nto save the security policy instance.\nSetting up a password mask\nSetting up a password input mask involves defining the following parameters:\nSetting\nPurpose\nPassword length\nDetermining the minimum password length.\nBy default, the minimum password length should be 8 characters.\nInclude numbers\nRequired to use numbers in the password.\nIf the parameter is active, the password must contain at least one digit.\nThe parameter is active by default.\nInclude lowercase characters\nRequired to use lowercase letters in the password.\nIf the parameter is active, the password must contain at least one lowercase letter.\nThe parameter is active by default.\nInclude uppercase characters\nRequired to use uppercase letters in the password.\nIf the parameter is active, the password must contain at least one uppercase letter.\nThe parameter is active by default.\nExclude visually ambiguous characters\nThe use of visually ambiguous characters in the password is prohibited:\ni, I, 1, l, o, 0, O\n.\nIf the parameter is active, the use of the specified characters in the password is not allowed.\nThe parameter is inactive by default.\nInclude special characters\nRequired to use special characters in the password.\nWhen the parameter is active, the password must contain at least one special character.\nThe parameter is active by default.\nExclude passwords consisting of repeated or consecutive characters\nProhibiting the use of passwords consisting of repeated or consecutive characters.\nWhen the option is active, the use of 3 or more repeated or consecutive characters in the password is not allowed.\nThe parameter is inactive by default.\nApplying security policy\nThe default security policy applies to\nsystem users\nlogging into the application with a password.\nFor particular security principals with a\nprivilege level\n, the default security policy can be overridden.\nIf a user belongs to different access groups corresponding to different privilege levels, they will retain the highest available priority.\nIn the \"Password authentication\" account profile, the system records user activity data, such as:\npassword change date;\nlast login date;\nnumber of incorrect password entries.\nWhen the \"Block users in the absence of entrances to the system\" setting is active, a user who has exceeded the allowed number of days without authorization in the system will see the following notification when trying to log in:\nWhen the \"Set frequency of mandatory password change\" property is active, a notification of the following type will be displayed to the user who entered the expired password:\nWhen the \"Block account with unsuccessful entry attempts\" setting is active, the user will receive a corresponding notification containing the number of valid password attempts before the account is blocked:\nAfter the user exceeds the allowed number of password attempts, his account will be blocked and the system will issue a corresponding notification:",
  "source": "https://docs.greendata.ru/platform/en/security_policy_management.html"
}