{
  "title": "messageBox",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nmessageBox\nFunction for displaying a dialog box containing a text message and a set of buttons. Depending on the button selected by the user, further algorithm actions can be set.\nSyntax\nmessageBox\n(style, text, level, [header], buttons)\nSetting\nPurpose\nstyle\nSelect the formatting style, the settings of which will be applied to the text message area of the dialog box.\nThe selection is made using drop-down list of pre-created styles. To create a new formatting style, click on the action menu on the right side of the field and select the \"Add\" option in the context menu.\ntext\nText of the message that will be displayed in the dialog box.\nThe parameter supports text formatting with the following tags:\n<b></b> – the text enclosed within these tags will appear in bold;\n<br> – the text following this tag will start on a new line.\nlevel\nMessage level selection using drop-down list from \"Message level directory\" type objects [SYS_DIR_MSG_LEVEL].\nDepending on the selected value, the corresponding icon will be added to the left part of the text message area.\nPossible options:\nInformation –\n;\nAttentional –\n;\nError –\n.\nheader\nTitle of the dialog box. Optional parameter.\nbuttons\nSelection buttons. The selection is made by checking the checkboxes available in the drop-down list.\nPossible options - \"Button directory\" type objects [SYS_DIR_BUTTONS]:\n\"Yes\";\n\"No\";\n\"OK\";\n\"Cancel\" is the button to close the dialog box.\nNote\nThe function is called using the\nbutton located in the algorithm editor on the \"Advanced\" tab.\nAs a result, a modal window opens, in which the\nsettings\nof the dialog box are specified:\nAfter clicking on the \"Done\" button, the construction of the\nmessageBox\nfunction with the selected parameters will be added to the algorithm code.\nIf necessary, the formatting style, the message level and the set of buttons can be changed using the\ndict\nfunction, followed by the selection of the appropriate object type . The enumeration of all parameters is separated by commas.\nThe size of the dialog box is set via the formatting style using the \"Style\" parameter located in the \"System\" block.\nFor example, to set the size of the dialog box to 400x200 px, the width and height are set as follows:\nBy default, the size of the dialog box is 800x400 px.\nA dialog non-modal window displayed by the messageBox function will appear on all user browser tabs until one of its buttons is clicked.\nUse cases\nUse case 1\nSuppose a user needs to display a dialog window offering to receive the current price list at the email address provided during registration.\nIf the user agrees, a message with the price list should be sent to the email address. In case of refusal, the system will show a notification about the possibility of obtaining this information from the manager.\nTo achieve this, in the algorithm editor, the\nmessageBox\nfunction should be called, and the following parameters should be specified in the modal window:\nAs results, the algorithm code will include the construction:\nThe messageBox function returns a value selected by user (clicking the \"Yes\" / \"No\" / \"Cancel\" button). Depending on the result obtained, the necessary actions are configured.\nThe algorithm code may take the following form:\nOther functions used to write this algorithm\nThe result of the function execution is written to the res\nvariable\n;\nConditions for comparing the value obtained by the messageBox function (res variable) with the corresponding element of the \"Buttons directory\" (added through the\ndict\nfunction) are set using the\nif\nfunction;\nSelecting a directory item.\nSending a message is implemented using the\nsendMsgToEmail\nfunction;\nTo display notification, use the\nsendPopupMsg\nfunction.\nThe parameter header and text can be supplemented with user data by specifying the corresponding basic object type, after which the necessary attributes can be inserted using the\nattr\nfunction, for example, full name and email address.\nAs results of executing the algorithm and clicking \"No\", a dialog window of the following type is displayed:\nAfter clicking \"No\", the user will get the following popup notification:\nWhen clicking the button:\n\"Yes\" - the user will receive an email to the specified address;\n\"No\" - a popup notification will be displayed;\n\"Cancel\" (cross) - the dialog window will be closed with no additional actions.\nUse case 2\nIt is necessary to inform users about the upcoming price increase from July 1.\nTo do this, call the\nmessageBox\nfunction in the algorithm editor, specify the parameters and click the \"OK\" button:\nAs a result, the construction will be added to the algorithm code:\nWhen executing the algorithm, the following dialog box will be displayed:",
  "source": "https://docs.greendata.ru/platform/en/messagebox.html"
}