{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.470.7 of November 5, 2025\nNew Features\nNow for each registry, it is possible to\noverride\nthe available methods for opening objects.\nWhen building a\nuniversal graph\n, it became possible to:\nSort data by series or category names, as well as categories by series values.\nSet a style for the chart title and subtitle.\nNow with the help of the\nsendMsgToEmail\n,\nsendMsgToSubject\n, and\nsendMsgToSubjects\nfunctions, it is possible to pass email addresses to which the recipient can send a reply message.\nIt is now possible to configure\nsecurity policy\nby privilege level.\nFor attributes of “Date”, “Date and time”, “Time”, “Numeric”, “Integer”, “Money”, “String”, and “Boolean” types, it is now possible to\nencrypt values\nin the database.\nAudit\nwas implemented to record system actions, and error audit was improved.\nThe calculation of the limit of simultaneously active users under the current license was improved.\nChanges and Improvements\nThe configuration of\nobject-type expressions\nwas debugged.\nThe validation during index creation was optimized.\nA condition was added to enforce the required attribute in the “Attribute for permission inheritance” filter.\nThe display of the multiselect attribute after performing an\naction\nwith the algorithm calculation based on the selected object was stabilized.\nThe display of duplicate objects with validation errors was debugged.\nThe Del key operation was debugged when working with the domain.\nThe names of domain settings were corrected.\nThe columns of the\n\"User\"\nregistry type were corrected.\nIn registry edit mode, the “Save on focus loss” option was debugged for logical attribute value changes.\nThe search process for visible elements only was debugged.\nThe process of adding child type attributes of a related object type in the\nregistry configuration\nwas debugged.\nThe display of values in the\ntile registry\nwas debugged.\nFocus setting for the\n\"Text with advanced formatting support\"\nand\n\"Multiline input\"\nvisuals was improved.\nFocus behavior when selecting an element in the object profile navigation window was debugged.\nIn Safari browser, the display of\ntemplate covers\nduring\ninstance visual setup\nwas stabilized.\nThe insertion of the full hyperlink address into the attribute with the\n\"Text with advanced formatting support\"\nvisual was debugged.\nSaving of the visual after moving the\n\"Dashboard\"\nwidget to a new\nrow\nwas stabilized.\nThe ability to lock the\n\"Financial reporting\"\nwidget was debugged.\nIn the\n\"Object registry\"\nwidget, saving of selected filter settings when switching registries was debugged.\nThe\n\"Calendar booking\"\nwidget was improved.\nThe display of code in the algorithm editor placed on a visual via a\nframe\nwas debugged.\nThe object attribute filtering was debugged in the\n\"Explorer\" widget\n.\nOn the\nKanban board\n(extended version), the card order after page refresh was stabilized.\nThe configuration of the\nKanban board\nadded to an object visual through the\n\"Dashboard\"\nwidget was stabilized.\nThe operation of\nSQL data source\ncreated when configuring the\nmultidimensional cube (OLAP)\nwas stabilized.\nThe display of multiple object selection in the\n\"Table\" analytical dashboard\nwas debugged.\nThe xref:object-data-source.adoc[Object was adapted to work with the object type that uses the \"Inheritance of permissions with system control\" access control type.\nFiltering in the \"Access control by condition tree\" access control type was stabilized.\nThe operation of the\ndeduplicate\nfunction was debugged.\nThe visibility of the\nstart page configuration button\nwas debugged according to user permissions.\nThe functionality for binding IP addresses to\nuser accounts\nwas improved.\nThe\nprofile setup\nfor self-registration was improved.\nPermission checks when working with an object were debugged.\nThe restriction on creating instances of “Localized constants” [SYS_LOCALIZED_CONSTANT] type was removed for the “All users” access group.\nThe\nupdate creation\nprocess containing references to internal application objects was improved.\nThe transfer of updates containing the\nextended Kanban board\nwas debugged.\nThe display of the number of\nuser sessions\nwas improved.\nA vulnerability when creating an algorithm was fixed.\nThe operation of\nsecurity policy\nwas debugged.\nThe System behavior during initialization was improved.\nThe configuration of the\nLDAP domain authorization\nsettings was streamlined.\nThe update to the new platform version was stabilized.\nThe generation of a reporting form through\ndata transformation\nwas debugged.\nIn review mode, the ability to delete non-printable characters and accept edits was improved.\nDocument text locking settings were debugged.\nThe navigation to the specified document page was stabilized.\nThe ability to remove and add lists was debugged.\nThe possibility to simultaneously delete a footnote and a section was debugged.\nThe creation of new document versions was stabilized.\nThe ability to generate an invitation link to a private chat was removed.",
  "source": "https://docs.greendata.ru/platform/en/LTS.470.7-latest.html"
}