{
  "title": "Элемент потока \"Событие\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЭлемент потока \"Событие\"\nСобытие\n– это\nто, что происходит в течение бизнес-процесса\n.\nСобытие оказывает влияние на ход бизнес-процесса\nи чаще всего имеет причину (триггер) или воздействие (результат). К ним можно отнести начало и завершение процесса, отправку уведомлений, отправку/ получение сигналов и т.д.\nНа схеме бизнес-процесса события отображаются как самостоятельно, так и смежно с задачей:\nЭлементы изображаются в виде круга со свободным центром, предназначенным для дифференцировки внутренними маркерами различных триггеров или их результатов.\nДобавление события на этап бизнес-процесса осуществляется посредством перетаскивания \"события\" на элемент этапа таким образом, чтобы появился индикатор присоединения (оранжевый контур элементов). Далее задается тип события. Выделяют\nтри типа событий\nсогласно их влиянию на ход бизнес-процесса:\nНачальное событие (Start event)\n;\nПромежуточное событие (Intermediate throw event)\n;\nКонечное событие (End event)\n.\nТипы событий (начальные, промежуточные и конечные) также разделяются на типы (имеют разные триггеры).\nТриггеры\n–\nэто тип условия, при котором наступает Событие\n.\nНапример, если Событие — получение сигнала, то Тип события — сигнал, а Триггер — его получение.\nТриггеры событий схожи во всех типах, но имеют свои особенности. Поэтому каждое событие рассматривается с точки зрения трех типов.\nДля определения типа События используются различные маркеры, позволяющие отличить данный тип события от другого.\nМаркер\n– специальное обозначение, отображаемое в центре \"круга События\". Он влияет на характер работы события.\nТип события и триггера задается с помощью пиктограммы-действия\n, отображаемой при выборе элемента схемы бизнес-процесса. При нажатии кнопки открывается список для определения типа события.\nВходящие и исходящие события\nСобытие с входящим триггером (входящее событие) наступает при получении какой-либо информации (сигнала, сообщение и т.д).\nСобытие с исходящим триггером (исходящее событие) свершается при отправке информации (сообщения, письма и т.п.).\nНачальные события\nмогут быть только входящими, а\nконечные события\n— только исходящими.\nПромежуточные события\nмогут быть как входящими (получение информации), так и исходящими (отправление информации).",
  "source": "https://docs.greendata.ru/platform/ru/event-flow-item.html"
}