{
  "title": "Use case of setting up an action to copy data from object to object",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nUse case of setting up an action to copy data from object to object\nThe ability to copy data from one object to another can be implemented by setting up a\ncustom action\n.\nLet’s say we need to create an action that will copy data from the client’s profile to the client’s application.\nSetting up an action includes:\ncreating a set of attributes to copy\n;\ncreating an action with the \"Copy data\" module\n.\nCreating a set of attributes to copy\nFirst, add attributes from the  existing \"Client\" object type to the \"Client application\" object type:\nTo create a set of attributes, go to the registry of \"Copy attributes. Set option\" [SYS_COPY] type and create a new instance by clicking\n(more about\nworking with registries\n).\nIn the window that opens, fill in the following parameters:\nAfter filling in the necessary parameters, save a set of attributes for copying using\n.\nCreating an action with the \"Copy data\" module\nTo display the \"Copy\" button in the \"Client Application\" type profile:\nGo to the\n\"Actions\"\nregistry, create a new action and specify the parameters:\nin the \"Name\" field, specify \"Copy\" – the specified name will be displayed on the button;\nselect \"Copy data\" as the user interface module;\ndisplay in the profile – select the \"Yes\" value;\nin the \"Action type\" field – select the \"Action\" value;\nin the \"Additional action parameters\", click\nand create the Copy element (where th e previuosly created set of attributes to copy is selected):\nin the \"Related object types\" block, select the \"Client profile\" value.\nSave the  action settings by clicking\n.\nResult\nAs a result, the button for copying data from an object of the \"Client\" type will be displayed in the \"Client Application\" profile:",
  "source": "https://docs.greendata.ru/platform/en/example-setting-up-an-action-to-copy-data-from-object-to-object.html"
}