{
  "title": "reportDatesBetween",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nreportDatesBetween\nCalculation of the reporting period between two dates.\nNot used in algorithms like \"Algorithm. Condition for visual\"\n(even as a comment).\nSyntax\nreportDatesBetween\n(period, startDate, endDate)\nSetting\nPurpose\nperiod\nThe period type, which is selected in the \"Calculating number of reporting dates in a range\" modal window when the function is called.\nstartDate\nDeductible date (\"Date\" type attribute).\nThe current date is set by default - currentDate().\nendDate\nDecrementable date (\"Date\" type attribute).\nThe current date is set by default - currentDate().\nNote\nThe function is called using the\nbutton, located in the Algorithm Editor on the \"Date\" tab.\nThe \"Calculating number of reporting dates in a range\" modal window opens, where the period type is selected.\nNext, instead of the default values, set the dates between which to calculate the amount of the selected period.\nThe result >=0 is reached\nwith a direct calendar chronology\n(from date1 to the subsequent date2).\nThe result ⇐0 is reached\nwith a reverse chronology\n(date1 later than date2).\nExamples\nExample 1\nTo calculate the number of nights spent in the hotel, use an algorithm that calculates the difference between the \"check-in date\" and the \"check-out date\". The period is calculated in days.\nExample 2\nReturn the difference in days between the two generated dates.\nThe result of executing the algorithm: 5.\nExample 3\nGet the difference in months between the dates in the reverse chronology.\nThe result of executing the algorithm: -12.\nThe date is a complex structure and should not be queried from the user in any format.\nIf it is necessary to generate a specific date from the individual components, it must be entered in a variable of the algorithm.\nThis is implemented by calling the new constructor, which creates an instance of the LocalDate class.",
  "source": "https://docs.greendata.ru/platform/en/reportdatesbetween.html"
}