{
  "title": "Нюансы установки обновлений",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНюансы установки обновлений\nПроцесс\nустановки обновлений\nв Системе однотипен, однако при переносе файлов обновлений на промышленный стенд могут возникать ошибки, значительная часть которых может быть решена с учетом анализа выдаваемых Системой сообщений.\nНаиболее часто встречающиеся ошибки и нюансы обновлений:\nПри установке некомплектного обновления, когда Системе требуется заполнить ссылку на объект, но такого объекта на промышленном стенде не существует, Система сообщает\nUUID\nкоды недостающих объектов.\nРешение:\nдобавление в обновление недостающих объектов.\nС механизмом\nпоиска объекта по UUID\nможно ознакомиться в публикации\n\"Создание обновлений посредством Мастера\"\n.\nНекорректный порядок файлов в составе\nпакетного GUF\n(ZIP-архив, содержащий набор GUF-файлов), из-за чего нарушается порядок установки объектов.\nОсобого внимания требуют иерархические справочники,  в которых дочерние элементы содержат ссылки на родительские элементы, которые, в свою очередь, должны оказаться загруженными ранее.\nРешение:\nнастроить порядок следования файлов в составе пакетного GUF либо производить установку каждого GUF-файла отдельно в нужном порядке.\nПорядок объектов в GUF-файле значения не имеет.\nУстановка объектов, содержащихся в GUF-файле, автоматически производится в несколько этапов:\nв первую очередь устанавливаются UUID коды объектов и простейшие атрибуты;\nзатем расставляются ссылки на объекты и т.д.\nПри этом порядок установки типов объектов автоматически выстраивается от родительских типов к дочерним.\nПри формировании файла обновления для типа объектов\nвизуал\nобъекта и реестра автоматически не сохраняется.\nРешение:\nвключать в файл обновления необходимый визуал.\nПри переносе типа объекта с\nреестром по умолчанию\nна стенд, где уже присутствует данный тип объекта, ранее установленный на стенде реестр по умолчанию не будет заменен. Реестр из файла обновления будет добавлен в перечень реестров типа, но не будет использоваться в качестве реестра по умолчанию.\nЕсли файл обновления включает объект с\nвизуалом по умолчанию\n, то при установке на стенд, где уже присутствует данный объект,  будет использоваться визуал объекта по умолчанию, полученный из файла обновления.\nПри переносе\nпредметной области\nв случае отсутствия на стенде установки типов объектов, которые включены в предметную область, Система выведет ошибку, так как в данном случае типы объектов автоматически не переносятся.\nРешение:\nдобавить в обновление все типы объектов из предметной области.\nПосредством GUF-файлов нельзя осуществить перенос:\nэкземпляров\nпримитивных типов\n;\nэкземпляров типов, используемых в качестве атрибутивного состава типа\n\"Тип объекта\"\n[SYS_OBJ_TYPE] – \"Атрибут типа\", \"Выражения\", \"Индексы\", \"Ключи\", \"Ограничения\", \"Проверки\" и т.д.;\nотдельные элементы схем бизнес-процессов и ETL-процессов – этапы, переходы, события.",
  "source": "https://docs.greendata.ru/platform/ru/installing-updates-special-features.html"
}