{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.468.4 of October 3, 2025\nNew features\nThe new \"Calendar booking\" widget provides the ability to quickly and conveniently make an appointment for available time slots.\nThe new \"QR code\" widget was developed to create and place QR codes on object visuals.\nOn the\nextended Kanban board\n, it is now possible to sort task cards.\nThe height of attribute groups and tabs can now be managed using a new option.\nIn the\nstructural diagram\n, the option to sort columns was added.\nThe configuration of key phrases in the\ndecision tree\nbecame more flexible. They can now be defined simultaneously as text and as buttons, leading further to an action according to the scenario.\nAt the ETL \"Source. File\" stage, the option to parse files with the \"JSON\" extension was added.\nIt is now possible to set the\nlock duration\nof a user account in case of unsuccessful password entry attempts.\nThe option to configure websocket connection parameters was added.\nAccess to objectChatsWebHookPlugin is now controlled by the \"Access to Object Chats Webhook Plugin\" permission.\nWorking with electronic documents became more convenient due to the introduction of pagination with the ability to go to a specified page.\nUsers with the permission to edit a\ndocument\ncan now manage access permissions to the electronic document directly from its interface.\nThe transfer of text formatting when uploading a new version from a file was implemented.\nChanges and improvements\nThe loading of the main menu was optimized.\nThe object opening through a configured\nmain menu item\nwas corrected.\nThe ability to change the position of the switch using the Enter hotkey was adjusted.\nData entry in modal windows with hidden parameters was stabilized.\nWhen configuring an attribute to inherit permissions from a related object, filtering by current and parent types was added.\nThe attribute composition of the \"User privilege level\" type was corrected.\nTo stabilize performance in primitive types, the display of the \"Object type\" parent attribute was hidden.\nFor the attribute with the \"Private input\" input type, the automatic substitution of data was removed.\nThe restriction on editing attributes was stabilized according to the existing locking algorithm.\nThe validation check of data in the object instance was adjusted.\nThe creation of instances through an object attribute of the type linked in the \"Delete object duplicate\" action was adjusted.\nThe closing of the object attribute dropdown list after selecting a value was adjusted.\nThe default settings of the translation service were corrected and the handling of network exceptions was improved.\nThe opening of objects when their visual contains an attribute with the active multiline display option was stabilized.\nWorking with installed objects containing an object attribute with the\n\"Integrated object profile\"\nvisual was adjusted.\nWhen selecting values in the dropdown list, the building of the hierarchy list from the root node was adjusted.\nThe display of data in a chained attribute of the \"File\" type was corrected.\nThe ability to sign files added to an attribute with the\n\"File attachment visual for signing\"\nwas stabilized.\nIn the search filters, the option to hide the search line was added.\nThe support for the\n\"Chose instance type field\"\noption when displaying an object attribute in the registry was stabilized.\nIn registry edit mode with the active \"Hide column names\" setting, the ability to drag and drop an object into a folder was stabilized.\nThe filtering and search filter settings of the registry were modernized.\nThe ordering of attributes in the\nregistry column filter\naccording to the specified sorting was adjusted.\nThe addition of previously selected values in the registry not corresponding to the current search query was stabilized.\nThe operation of nested lock algorithms, column styles, and styling in registries was corrected.\nWhen returning to the previous page from the\nstart page\nsettings, the ability to re-enter the configuration mode was stabilized.\nThe display of the\nframe\naccording to the selected object was adjusted.\nThe content of the user password validation modal window was updated.\nThe expansion of previously collapsed hierarchy dropdown lists was adjusted.\nThe data display area when switching pages in the registry was corrected.\nThe hiding/display of the toolbar according to the defined settings was adjusted.\nThe object visuals containing\nboolean attributes\nof the “Boolean attribute as a checkbox” and “Boolean attribute as a toggle” types were adjusted.\nThe operation of the lock algorithm applied to an\nattribute group\nwas corrected.\nIn the\n\"Rating\"\nwidget, the display of ratings is now performed in descending order of points.\nIn the\n\"Object registry\"\nwidget, the ability to create a registry via the context menu was added.\nThe automatic data update in the\n\"External frame\"\nwidget when switching an object in the related\n\"Child object list\"\nwidget was adjusted.\nThe handling of errors caused by an incorrect API key when using the Yandex map in the\n\"Map with objects\"\nanalytical dashboard or in the\n\"Point on the map\"\nwidget was improved.\nFor convenience, the object type selection in the\n\"Object registry\"\nwidget settings is now presented as a hierarchy.\nThe display of the\n\"Tip\"\nwidget was improved.\nFor the\n\"Button\"\nand\n\"Text\"\nwidgets, the ability to open help documentation from the elements panel was added.\nThe application of color and lock algorithms in the\n\"Button\" widget\nwas corrected.\nThe loading of the list of employees responsible for a task was optimized.\nThe condition for displaying the hint when taking a task into work was corrected.\nOn the\n\"Kanban board\"\nanalytical dashboard, the creation of tasks through stage settings was adjusted.\nThe position of the employee avatar on the task card of the\nKanban board\nwas changed.\nOn the\nKanban board\n, the display of the task counter, the placement of the task card in the defined cell, and the hyperlink transition from the task card were adjusted.\nThe loading of the\nKanban board\nfor the object type with configured access control by the condition tree was stabilized.\nOn the task card of the\nKanban board\n, the application of the configured parameters and the attribute styling was adjusted.\nThe performance of\ndashboards\nwith control elements based on the data source was optimized.\nIn\ndashboards\n, the ability to download charts and diagrams in *.pdf format was stabilized.\nIn the\n\"Table\"\nanalytical dashboard, the number of pinned rows and the visibility of the column according to the defined settings were adjusted when displaying and exporting.\nIn the\n\"Table\"\nanalytical dashboard, the application of the defined column formatting style was stabilized and the ability to search for an object when configuring a hyperlink was restored.\nFor the correct\ndata drill-down decryption\nbetween analytical panels, the updating of dashboard data source parameter settings was improved.\nWhen changing the value of a control parameter, the reset of previously selected filter values in the\n\"Table\"\nanalytical dashboard was adjusted.\nA restriction on entering an integer parameter value when generating a report in the\nSQL-based data source\nwas added.\nThe \"Tools\" panel of the algorithm editor of the \"Algorithm. Condition for Visual based on context\" type was enhanced with the\nalg\nfunction.\nThe check for invalid algorithm code was improved.\nWhen creating an algorithm of the \"Algorithms. Object profiles\" type through the modal window, the automatic selection of the algorithm placement folder was adjusted.\nTo optimize algorithm execution when retrieving an object identifier, loading child attribute values is no longer required.\nThe work of the\nsetPlainObject\nfunction was adjusted.\nThe work of the\ncustom action\nfor calling an algorithm with saving the current object in a modal window and when creating an object in the\nregistry edit mode\nwas adjusted.\nThe action launch process for algorithm execution without selected values of the object attribute involved in the algorithm was stabilized.\nThe scenario of returning to the previous page after performing an action in the object was improved.\nThe execution of the batch action for saving and adding files was adjusted.\nIn the\ncondition tree\n, the check for access group inclusion in the \"Configured groups\" was adjusted, and the ability to compare an attribute of the \"Date\"/\"DateTime\" type with a null value was improved.\nThe configuration of data filtering when creating a date comparison condition was stabilized.\nThe attribute composition of the \"ETL. Connection to external DB\" [SYS_ETL_DB_CONNECT] type was debugged.\nThe execution of the ETL process with multiple parallel traces was adjusted.\nThe list of supported formats for date processing was extended.\nWhen working with the composite file storage, error logging for file upload and deletion was added.\nThe notification template for confirming\nregistration\nvia e-mail was changed.\nThe parameters for configuring the\ne-mail account\nwere improved.\nWhen generating object models for the AI assistant, a single technical user will now be used.\nChanging the parent of a child object is now possible only if the \"Write\" permissions exist on both the current and the new parent objects.\nThe process of granting access permissions is now accompanied by the automatic removal of the opposite permission mark (allowing and denying).\nThe display of error when trying to open an object without access permissions was improved.\nGranting access to the object profile navigation window for a user without administrative permissions was stabilized.\nThe ability to pause and resume the normative term for a user without the permission to edit instances of the \"WF. Regulatory term instance\" type was restored.\nThe time for\ninstalling\nthe update package was optimized.\nAs a result of improvements, changes on the visual received during\nupdate\nremain unchanged after the\ncache reset\nof the application.\nThe\nupdate creation\nconsidering deleted attributes in the object composition configuration was adjusted.\nThe access permissions check for editing a primitive object type instance was corrected.\nThe duplication of\nextensions\nin the child type after\nupdate installation\nwas fixed.\nThe logic of creating user session records in the audit during system processes execution was improved.\nIn the session list, the option to sort was added.\nThe restoration of the previously used page by user after re-authorization caused by session termination was improved.\nThe display of the defined login method on the login page after user session termination was adjusted.\nApplication vulnerabilities were fixed.\nThe process of\nclearing temporary files\nwas optimized.\nTo reduce the load on the DBMS, an \"obj_id\" index was added to the \"sys_delete_obj\" table.\nThe visibility of the \"Export calculation\" button for the \"Temporary calculation result (UUID)\" [CALC_CARD_RISK_RESULT] attribute can now be controlled through attribute options.\nThe configuration of actions for report recognition of the Analysis of Financial and Economic Activity Module was improved.\nWhen moving to review or copying a version, the ability of multiple users to work with the same version was adjusted.\nThe deletion of list items with automatic renumbering was adjusted.\nThe access permissions check when creating a new version and when uploading document metadata was improved.\nThe display of data in the survey sheet was adjusted.\nThe ability to check values by cells in the exported document was stabilized.\nThe editing of footnote content was adjusted.\nThe voice message duration data is now added to the file metadata.\nThe process of creating a chat was adjusted.\nFor registries with a configured\ncombined header\n, support for displaying data excluding the combined header itself was added.\nFor the Android-based app, the display of loading results when entering a search query was adjusted.\nThe support for user password security settings was added.\nThe display of dates of attached files was corrected and the process of selecting uploaded media files was improved.\nThe process of downloading the\nmeeting\nrecording was optimized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.468.4-latest.html"
}