{
  "title": "ETL. Трансформатор. Фильтрация по алгоритму",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nETL. Трансформатор. Фильтрация по алгоритму\nТрансформатор \"ETL. Трансформатор. Фильтрация по алгоритму\" используется при необходимости фильтрации входных данных.\nНастройка\nТрансформаторы ETL настраиваются в\nпреобразователе данных\n, добавленном на\nсхему\nETL-процесса.\nДля настройки используется следующий набор параметров:\nПараметр\nНазначение\nНаименование\nНазвание созданного трансформатора.\nПорядок\nВвод порядкового номера трансформатора для определения последовательности запуска при наличии нескольких трансформаторов.\nКоллекция входных данных\nВыбор элемента динамической структуры (коллекции), содержимое которого требуется отфильтровать.\nУсловие фильтрации\nВвод условия фильтрации в виде\nалгоритма\n, результатом выполнения которого должно быть логическое значение – true/false.\nДля работы с динамической структурой данных при написании алгоритма рекомендуется использовать функцию\netlValue\n.\nПродолжить работу ETL при возникновении ошибки\nПризнак, используемый для игнорирования ошибок работы трансформатора.\nПродолжить обработку данных при возникновении ошибки\nПризнак, используемый для игнорирования ошибок обработки отдельных элементов динамической структуры (коллекции).\nПримеры\nПример №1\nДопустим, при загрузке пользователей Системы необходимо отфильтровать тех, у кого не заполнен атрибут \"Дата истечения действия\".\nКоллекция входных данных содержит ноду\nexpiry_date\nдля хранения даты завершения действия учетной записи пользователя:\nДля фильтрации входных данных необходимо настроить трансформатор со следующими параметрами:\nВ результате фильтрации выходная динамическая структура данных будет содержать коллекцию пользователей Системы, атрибут \"Дата истечения действия\" которых заполнен значением.\nПример №2\nНапример, при загрузке пользователей Системы требуется произвести фильтрацию пользователей по значению атрибута \"Блокировка пользователя\".\nКоллекция входных данных содержит ноду\nis_locked\nдля хранения статуса пользователя Системы:\nДля фильтрации входных данных необходимо настроить трансформатор со следующими параметрами:\nВ результате фильтрации выходная динамическая структура данных будет содержать коллекцию пользователей Системы, атрибут \"Блокировка пользователя\" которых принимает значение\nfalse\n.",
  "source": "https://docs.greendata.ru/platform/ru/etl-transformer-filtering-by-algorithm.html"
}