{
  "title": "\"Filtering and search filters\" tab",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Filtering and search filters\" tab\nThis tab configures filtering to display only registry objects meeting specified conditions.\nAdditionally, this tab enables user access to registry data search and filtering by predefined parameters.\nSearch filters are specialized tools appearing as panels with configured filtering and search parameters for registry data display.\nFor search filter configuration examples, refer to\nthis article\n.\nSetting up\nThe list of parameters depends on the selected registry type.\nSetting\nPurpose\nRegistry filter type\nSpecifies the type of registry column filter. Possible values:\nexcel;\nIn case of working with\ntype of column filter \"Excel\"\nin the registry it is possible to add a filter fragment. That is, the end user can multiselect values. The action is performed similarly to working with filter in XLSX document.\nThere is also data filtering available to the user in working with attributes using string filters, for more information see\n\"Working with the object registry\"\n.\nby row;\nThe \"By row\" filter displays data based on the value specified in the filter row:\nunfiltered.\nWith this setting, there is no filtering tool\n.\nPreset filtering\nFilter type\nDefining the filtering method. The radiobutton type switch selects one of the three types, as a result the corresponding field for filter selection is displayed in the settings:\nFiltering algorithm;\nSQL condition;\nCondition tree.\nAlgorithm for data filtering\nEntering (selecting) an algorithm for data filtering. For more details see\n\"Configuring the filtering conditions\"\n.\nExample\nFor example, in the register of the \"Office supplies in request\" type it is required to filter the objects in which the number of goods is greater than 10. The algorithm will look as follows:\nAs a result of filtering, only objects that satisfy the specified condition will be displayed in the registry:\nThe parameter is displayed when \"Filtering algorithm\" filtering type is selected.\nCondition tree\nConfiguring filtering using the boolean condition constructor, for more information, see the\n\"Condition tree\"\narticle.\nThe parameter is displayed when \"Condition tree\" filtering type is selected.\nSQL based filter\nSelecting SQL-based filter.\nThe parameter is displayed when \"SQL condition\" filtering type is selected.\nSearch and custom filters\nDisplay search filter\nBoolean attribute that controls the display of search filters in the registry.\nWhen the parameter is enabled, advanced search filter settings become available (covered\nbelow\n).\nBy default, the switch is inactive.\nCustom filters\nSpecifying filters available to users in the dropdown list\nin the registry control panel when filters are positioned at the top.\nExisting filters are selected from a dropdown list, while new filters can be created via the parameter’s action menu.\nWhen adding custom filters, a modal window opens for creating filters based on\ncondition trees\n.\nAdditional filters can be created directly in the object type instance registry. For details, see\n\"Working with Object Registries\"\n.\nParameter is available when the \"Custom filters\" toggle is active in the registry settings on the\n\"Control Panel\"\ntab.\nRegistry\nSpecifying the custom filters registry to be displayed in the \"Custom filters\" panel when filters are positioned to the left/right of the registry.\nSelection is made from\nbasic registries\nof type \"Custom filter constructor\" [SYS_USER_FILTER_TREE].\nFor convenient storage of configured custom filters, the\n\"Folders registry\"\ntype registry is used.\nIf no parameter value is specified, the default registry is used.\nParameter is available when the \"Custom filters\" toggle is active in the registry settings on the\n\"Control Panel\"\ntab.\nUnified placement of search and custom filters\nBoolean attribute that determines the joint placement of search and custom filters based on the value of the \"Filter Location\" parameter: left, right, or top.\nThis parameter is available if the following toggles are simultaneously active:\n\"Custom Filters\" in the registry settings on the\n\"Control Panel\"\ntab;\n\"Display Search Filters\".\nPlacement of custom filters\nPlacement of custom filters in the workspace relative to the registry: left, right, or top.\nCustom filters are displayed as a registry selection - when an item is selected, the main registry displays only objects that meet the filter conditions.\nDepending on the parameter value, custom filters can be positioned:\nAs a dropdown list\nin the registry control panel;\nIn the \"Custom Filters\" panel to the left/right of the registry.\nBy default, custom filters are positioned at the top.\nThis parameter is available when the\n\"Custom Filters\"\nswitch is\nactive\nin the registry settings on the\n\"Control Panel\"\ntab and the\n\"Display Search Filters\"\nswitch is\ninactive\n.\nPlacement of search filters\nPlacement of search filters in the workspace relative to the registry: left, right, or top.\nThe placement of custom filters is fixed at the top in this case.\nDepending on the parameter value, search filters can be positioned:\nIn a modal window when clicking the\nicon in the registry control panel;\nIn the \"Search Filters\" panel to the left/right of the registry.\nUsage example\nThe \"Search Filters\" panel configured to the left of the registry may appear as follows:\nBy default, search filters are positioned to the left of the registry.\nThis field is available when the\n\"Display Search Filters\"\ntoggle is\nactive\nand the\n\"Unified placement of search and custom filters\"\ntoggle is\ninactive\n.\nFilter placement\nPlacement of the filter panel in the workspace relative to the registry: left, right, or top.\nThe placement configuration applies to both search filters and custom filters when used together.\nBy default, the filter panel is positioned to the left of the registry.\nThis parameter is available if the following switches are simultaneously active:\n\"Custom filters\" in the registry settings on the\n\"Control Panel\"\ntab;\n\"Display search filters\";\n\"Unified placement of search and custom filters\".\nFilter width\nThe percentage of screen width occupied (must be between 15 and 50).\nWidth configuration applies to both search filters and custom filters when used together.\nBy default, the filter panel occupies 30% of the workspace.\nThis parameter is available when search filters and/or custom filters are displayed and positioned to the left or right.\nDisplay the advanced search when opening the registry\nThe Boolean attribute controlling the display of either advanced search or the filtering panel.\nBy default, the switch is inactive, while the search bar is collapsed\n:\nFiltering visual\nSpecifies the visual for configuring the registry filtering panel.\nThis parameter is available when the \"Display advanced search when opening registry\" parameter is active.\nAdvanced configuration of search filters\nSearch bar\nThe search bar is configured using the following parameters:\nSetting\nPurpose\nDisplay general search\nWhen the switch is active, the normal search is replaced by \"General search\" the display of which can be configured similarly to the\n\"General Search\" widget\n, but only within the current object type.\nUsing general search implies searching by object name for the tiled registry\nand searching by attributes for other registry visuals.\nIn general search the results are displayed in a drop-down list, the objects in the registry are not filtered.\nThere is no link to the object in the results, clicking on the result is equivalent to opening a profile. For a tiled registry, clicking on a result can lead to executing an action (if action override is configured) or navigating down the hierarchy (if the tiled registry has a hierarchy).\nSearch mode\nWhen the switch is active, the search is performed in the \"Search mode\": when moving through the search results using the arrows on the keyboard, the entered query text will be replaced with the text of the search result.\nWhen the switch is inactive, navigating through the search results using the arrows on the keyboard does not affect the query text - it remains static. After clicking the\nin the search bar, the text of the search result will be copied to the search field, and the search results will be updated.\nExample of active and inactive \"Search mode\"\nPossibility to group search results by selected attribute.\nIf clicking the button, a modal window will be opened, where two tables are presented:\nthe left one presents the list of attributes by which the grouping can be configured;\nthe right table is used to directly add grouping attributes using the arrows\n.\nThe order of added attributes, which determines the sequence in which objects are grouped when search results are displayed, is managed by arrows\n.\nBy default, grouping by the \"Object type\" attribute is used.\nSingle click across the entire search result area\nWith the switch active, clicking any area of a search result will be equivalent to clicking an object link and will open the object profile (including clicks on navigation elements when chain of parent objects are displayed).\nException: Clicking the\nicon in the search bar when search mode is disabled will copy the search result text to the search field and refresh the results.\nThis parameter is available when \"Display the navigation chain of parent objects\" switch is active.\nDisplay the navigation chain of parent objects\nWhen the toggle switch is active for tile registries of a hierarchical type, the navigation panel will be displayed in the search results.\nThis parameter is only available in the tile registry type\n.\nFilters\nTo configure the filters, the following parameters must be used:\nSetting\nPurpose\nReset the navigation chain when search is applied\nWhen the switch is active for hierarchical tile registries, search will be performed across all hierarchy levels (all objects).\nThis parameter is only displayed in\ntile registry type\n.\nApplying search after changes\nThe option defines how the filtering process will be performed - immediately when entering/selecting data or after pressing the \"Find\" button.\nAdding filters to the search and filter panel is accomplished through two tables:\n1. Available attributes - the table contains all attributes of the object type for which the registry is being configured.\nTo display the attributes of the parent type, the corresponding switch must be active.\n2. Search bar settings - a table that defines the attribute composition and how attributes are displayed on the interface of the search and filtering panel.\nThe attributes can be moved between the tables using the arrows located between the tables.\nThe attributes to be filtered by are selected in the left table and moved to the right table. Attributes in the right table can only be placed in a group, when attributes are moved, the first group is automatically created.\nThe business administrator can:\nedit a group - by double-clicking/selecting the group and clicking on the\nicon, which will open a modal window, where it is possible to edit name;\nstyle -\nformatting style\n, which can be selected from the drop-down list of previously created styles or a new one can be created by clicking on the actions menu and selecting the \"Add\" option in the context menu.\ngroup status - defining the collapsed/unfolded/static status;\nhint - entering a hint for the user;\ncreate new filter groups by clicking the\nicon and selecting the option of the same name;\nBreaking attributes into logically related groups improves the perception of information.\nadd a filter by rating by clicking on the\nicon and selecting the option of the same name;\nadjust the sequence of attributes placement on the panel using\n, thus determining their belonging to one or another group of filters;\ndelete any item in the right table using the\nicon;\nWhen a filter group is deleted, all attributes added to this group will be deleted.\nchange the attribute representation on the search and filter panel by double-clicking/selecting the attribute and clicking on the\n, as a result of which the System will display a form for data input, where:\nname - filter name, by default it is used by attribute name;\nvisualization - the way of displaying the attribute on the search filters panel, the choice is made from the drop-down list. The list of visualization options depends on the attribute type.\nDepending on the selected visualization, additional customization fields may be displayed.\nMore about visualization types.\nConfiguring visualization depending on the attribute type.\nFor the attribute type \"Numeric\"/\"Integer\", user can configure visualization of the following types:\nrange:\nrange with slider:\nrange with preset options:\nThe ranges are added in the modal window after clicking on the\nicon in the \"Options\" parameter.\nAdded options can be edited or deleted using the corresponding icons on the control panel in the \"Options\" parameter.\nFor the attribute type \" Money\", the visualization types are identical to\nthe numeric type discussed earlier\n, except that the currency can be specified when configured. For example, a range with a slider can be customized as follows:\nFor the attribute type \"Date\"/\"Date and Time\" user can configure the type visualization:\ndate range:\ndate range with time:\nThe default start/end date can be set via algorithms in the \"Start Date Algorithm\" and \"End Date Algorithm\" parameters.\nTwo types of visualization can be configured for an attribute of the \"Boolean\" type, with the layout of the visualization on the search filter panel displayed in the settings window.\ncheckbox/checkbox with two states:\nA default check mark can be defined for this by defining the value of the \"Default value\" parameter.\nThe following visualization can be configured for the \"Object\" type attribute:\ndrop-down list with multiple choice:\nThe availability of search filter objects can be configured by selecting/creating a filtering\nalgorithm\n.\ndirectory content in the form of a list-box:\nAdditional parameters are available when customizing this visualization:\nSetting\nPurpose\nHide search bar\nDetermining whether to display the search field in the search filters panel.\nWhen the flag is active, the search field is hidden; when inactive, it is displayed.\nShow \"Select All\" button\nDisplaying the \"Select All\" button for the configured filter elements on the search filters panel.\nName of the \"Select All\"\nName of the button to select all items in the directory.\nThe parameter is available if the \"Show \"Select All button\"\" parameter is active.\nNumber of displayed values\nThe parameter is used to define the number of items displayed in the configured filter. When the specified number is exceeded, pagination is displayed with the ability to navigate to a specific page.\nThe filter allows displaying from 1 to 100 items.\nThe default value is 5.\nThe \"Child Object\" attribute visual associated with the object type whose registry has search filters activated also displays a search and filtering panel by object.\nSearch filters can be embedded into any type of profile using widgets\n\"Search filters\"\nand\n\"Object registry\"\n.\nAfter saving the changes using the\nbutton, the registry appearance will change according to the settings made.",
  "source": "https://docs.greendata.ru/platform/en/tab_filters_and_search_filters.html"
}