{
  "title": "Настройка прикрепления файла/документа",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка прикрепления файла/документа\nСформированный файл/документ печатной формы (далее – ПФ) может быть прикреплен в карточку\nобъекта\nСистемы\nавтоматически\nили непосредственно из панели управления документа в заданном формате.\nНастройки прикрепления выполняются в процессе настройки ПФ на вкладке\n\"Настройки шаблона\"\n.\nФормат прикрепляемого файла/документа\nСохранение сформированного документа ПФ в карточке объекта доступно из панели управления по нажатию на кнопку\nс последующим выбором одного из следующих действий:\nтекущий документ;\nфайл DOCX;\nфайл PDF.\nДействие \"Текущий документ\" доступно всегда. При помощи действия производится прикрепление к\nобъекту\nдокумента печатной формы (далее – документ ПФ).\nДокумент ПФ – объект типа \"Документ, сформированный по шаблону\" [RF_DOCUMENT].\nДействия \"Файл DOCX\" и \"Файл PDF\" позволяют прикрепить к\nобъекту\nфайл ПФ.\nФайл ПФ – объект типа \"Файл\" [FS_FILE].\nВозможность прикрепления документа ПФ в объект в формате файла регулируется значением параметра \"Формат файла при выгрузке и прикреплении к объекту\", расположенного в блоке настроек \"Настройка выгрузки файла\".\nПараметр\nНазначение\nФормат файла при выгрузке и прикреплении к объекту\nОпределяет конвертацию документа ПФ при скачивании файла на локальное устройство пользователя и при прикреплении файла в карточку объекта.\nВозможные варианты:\nAdobe PDF – скачивание/прикрепление файла в формате *.pdf;\nВыбирается пользователем – предоставление пользователю права выбора формата при скачивании/прикреплении файла в карточку объекта: в формате *.pdf или в формате\nшаблона ПФ\n;\nТекущий – скачивание/прикрепление файла в формате\nшаблона ПФ\n.\nПо умолчанию и при отсутствии значения параметра используется значение \"Текущий\".\nОбъект прикрепления\nОбъект и атрибут прикрепления документа/файла определяются в блоке настроек \"Связь с объектами системы\" при создании/редактировании объекта реестра \"Документы системы (Типы объектов)\"  при помощи параметров:\nПараметр\nНазначение\nАлгоритм определения объекта, в который будет сохранен сформированный документ\nОпределение объекта, в который будет прикреплен сформированный файл/документ ПФ.\nПараметр указывается в том случае, когда прикрепление файла/документа ПФ требуется осуществлять к объекту, отличному от того, на основании которого был сформирован документ ПФ.\nВ качестве значения параметра указывается алгоритм, возвращающий объект.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПо умолчанию значение параметра не задано и прикрепление файла/документа осуществляется к объекту, по которому был сформирован документ ПФ.\nАтрибут типа, в который будет сохранен сформированный документ.\nТип объекта\nОпределение типа объекта, в атрибут которого будет сохраняться сформированный файл/документ ПФ.\nАтрибут типа\nОпределение атрибута, в который будет сохраняться сформированный файл/документ ПФ.\nВ зависимости от действия, выбранного после нажатия на кнопку\n, сформированный документ может быть прикреплен в объект как файл ПФ или документ ПФ, каждый из которых может быть сохранен в атрибут определенного типа:\nПри выборе действия \"Текущий документ\" сохранение\nсформированного документа ПФ\nвозможно в объектный атрибут, ссылающийся на тип \"Документ, сформированный по шаблону\" [RF_DOCUMENT].\nЕсли указан иной атрибут или значение параметра отсутствует, прикрепление при выборе данного действия выполнено не будет.\nПри выборе действия \"Файл DOCX\" или \"Файл PDF\" сохранение\nфайла ПФ\nвозможно в атрибут\nтипа \"Файл\"\n.\nЕсли указан атрибут иного типа или значение параметра отсутствует, Система проверяет наличие в атрибутивном составе сохраняемого объекта атрибута \"Прикрепленные файлы\" [SYS_FILE_ID]. Если данный атрибут обнаружен, файл ПФ будет сохранен в него, в противном случае прикрепление при выборе данного действия выполнено не будет.\nАвтоматическое прикрепление\nАвтоматическое прикрепление файла/документа ПФ в карточку объекта может быть настроено:\nв момент алгоритмического создания ПФ с помощью функции\nprintEdoc\n(подробнее в статье описания функции);\nпри помощи выбора действия \"Печатная форма\" (рассмотрено далее).\nНастройки прикрепления файла/документа ПФ при выгрузке ПФ реализуются при помощи параметров:\nРанее описанные\nнастройки определения объекта и атрибута прикрепления, а также следующие параметры объекта реестра \"Документы системы (Типы объектов)\", добавленного в блоке настроек \"Связь с объектами системы\":\nПараметр\nНазначение\nПрикреплять документ eDoc к объекту автоматически\nПризнак, позволяющий при выгрузке ПФ автоматически прикреплять\nформируемый документ ПФ\nк объекту.\nПомимо установки значения \"Да\" параметру, для автоматического прикрепления сформированного\nдокумента ПФ\nв карточку объекта:\nдолжна быть\nнеактивна\nнастройка \"Выгружать без предварительного просмотра\";\nв качестве\nатрибута типа, в который будет сохранен сформированный документ\n, должен быть выбран объектный атрибут, ссылающийся на тип \"Документ, сформированный по шаблону\" [RF_DOCUMENT].\nПо умолчанию установлено значение \"Да\"\n.\nПрикреплять сформированный файл к объекту\nПризнак, позволяющий при выгрузке ПФ автоматически прикреплять\nформируемый файл ПФ\nк объекту.\nПомимо установки значения \"Да\" параметру, для автоматического прикрепления сформированного\nфайла ПФ\nв карточку объекта:\nдолжна быть\nактивна\nнастройка \"Выгружать без предварительного просмотра\";\nв качестве\nатрибута типа, в который будет сохранен сформированный документ\n, должен быть выбран атрибут\nтипа \"Файл\"\nлибо в атрибутивном составе сохраняемого объекта должен присутствовать атрибут \"Прикрепленные файлы\" [SYS_FILE_ID].\nФормат прикрепления определяется при выгрузке ПФ (в зависимости от доступных\nформатов прикрепляемого файла/документа ПФ\n).\nПо умолчанию установлено значение \"Да\"\n.\nЗначение параметра в блоке настроек \"Настройка выгрузки файла\":\nПараметр\nНазначение\nВыгружать без предварительного просмотра\nПризнак, отвечающий за возможность формирования\nдокумента ПФ\nдля предварительного просмотра или работы в документе.\nПри неактивной настройке формируется\nдокумент ПФ\nдля предварительного просмотра и работы в нем.\nПри предварительном просмотре автоматическое прикрепление\nфайла ПФ\nк объекту не производится.\nПри необходимости пользователь может прикрепить\nфайл ПФ\nпосредством выбора соответствующего действия после нажатия на кнопку\nв панели управления документа.\nПри активной настройке сразу формируется\nфайл ПФ\n(без предварительного просмотра), то есть\nдокумент ПФ в Системе не создается\n.\nПри отсутствии предварительного просмотра документ ПФ в Системе не создается, поэтому его автоматическое прикрепление к объекту невозможно.",
  "source": "https://docs.greendata.ru/platform/ru/edoc_file_document_attachment_settings.html"
}