{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease\nLTS.418.4\nof July 9, 2024\nNew features\n1. The\nCondition Tree updated: new field types were added; conditions/nodes can now be moved via drag & drop throughout all levels; Tree can be called in algorithms using the\nobjectsWithOptions\nfunction.\n2. The\nLogin page constructor\nsettings can now be applied to the mobile application.\n3.\nThe\nTable dashboard\nhas new option to choose the visual which opens after clicking the hyperlink.\nChanges and improvements\nValue validation check is now occurring during\nself-registration\nby e-mail;\nAnalytical panels settings were improved, now height is set in % of user’s screen size and width is set in % of container size;\nDisplay of OLAP tables imported in Excel was improved;\nDisplay of versioning dates in Communication panel was improved, panel’s size was adjusted for small screens;\n\"Title by attribute\" widget\nwas improved;\nAdded limitations to edit instances’ data for users with “Read” permissions in “Object registry” widget;\nFiltering of values added for related objects in “Type attribute” field;\nMultiple choice option in default attributes was stabilized;\nExecution of transitions in business processes were improved, now newly created versions work according to their original versions;\nNow non-administrator users are unable to block their own personal account;\nDisplay of images sent in email using print form template was stabilized;\nTransfer of permission settings when installing update packages was improved;\nPlacement of custom buttons in Control panel was optimized;\nDashboards opening time was improved;\nEdoc improvements: print form generation by algorithm and value filtering in object parameters were optimized;\nVisual and registry of\nExpressions/Autocalculations\nobject type instances was improved.\n\"Object chat\" widget\nwas improved;\nSending system notification when setting up deadlines in several stages at once. of an overdue task was stabilized;\nLaunching application via /hook was stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.418.4-latest.html"
}