{
  "title": "The Sprint dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThe Sprint dashboard\nThe Sprint dashboard allows displaying the progress (route) of an object on the process (sprint).\nData acquisition is performed dynamically (in real time). The use of data sources is not provided.\nTo set up the \"Sprint\" dashboard, you must first drag the panel to the workspace.\nKeep in mind that\ndata for the dashboard is borrowed from \"WorkFlow. Deadline instance\"\n. Data is acquired dynamically (in real time). ''The use of\ndata sources\nis not provided.\nDashboard settings enable debugging of object filtering. Most often, the object of a business process is an Application for decision-making. To configure the panel, use the following parameters:\nBasic settings\nSetting\nPurpose\nName\nEnter the setting name.\nBP\nEntering/selecting a previously configured business process to display.\nFiltering algorithm\nEntering/selecting a filtering algorithm for objects to display.\nObject type\nEntering/selecting a route type of the item to display.\nThe full list of types in the parameter’s drop-down list becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nValue calculation function\nSelecting a function to calculate total values, i.e. the values of all indicators of the deadline: planned period, delay, deviation. Available options:\n• Maximum\n• Minimum\n• Average\n• Median\n• Amount\nFiltering options\nSetting\nPurpose\nDepartment\nSelecting the department of users whose applications (or other objects) will be counted in the dashboard. It is specified after defining the value type used, possible options:\n• Constant\n• Reference to the parameter\nStart date\nSelecting the start date to calculate the deadline. It is specified after defining the value type used, possible options:\n• Current date\n• Constant\n• Reference to the parameter\nEnd date\nSelecting the end date to calculate the deadline. It is specified after defining the value type used, possible options:\n• Current date\n• Constant\n• Reference to the parameter\nIf you filter by the start and end dates of the deadline, the dashboard will display information on those objects (applications/requests) that generate deadlines within the period specified.\nThe number of objects (applications/requests) and their percentage are calculated automatically.\nThe dashboard view\nis configured using the following buttons:\n– editing the item name\n– setting up the business process block (sprint); parameters are duplicated with the general settings Specified\npriority item parameters\n. The number of deadlines to choose from is limited by their availability in the previously specified business process.\n– adding an item\n– delete an item\n– delete an item\nEntering/changing the item name is done manually, after which you need to\npress Enter\non your keyboard. Double-click to enter/change the name of a stage or a sub-stage.\nThe configured\nSprint\npanel is displayed in the dashboard according to the settings made.\nUse case\nThe process of applying for a decision-making within the credit workflow, taking into account the time spent by employees, is as follows:\nThe following abbreviations are provided:\nCrD – Credit Department of a Bank\nLD – Legal Department of a Bank\nCld – Client Department of a Bank\nBack office – the Bank’s office",
  "source": "https://docs.greendata.ru/platform/en/the-sprint-dashboard.html"
}