{
  "title": "Модуль eDOC",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nМодуль eDOC\nМодуль EDoc – уникальный инструмент для формирования и согласования любых документов.\nПозволяет существенно сократить время на подготовку и формирование необходимых бумаг без потери их качества.\nФормируемый проект документа представлен привычным excel-файлом или word-документом, в который можно внести правки и комментарии. При необходимости, процесс подтверждения измененного документа может быть настроен дополнительно. Эти и другие функции модуля оптимизируют процесс подготовки документов (в том числе и кредитно-обеспечительной документации финансовых организаций).\nМодуль EDoc позволяет\n:\nнастраивать в Системе формирование документов, включающих динамически изменяемые поля;\nформировать опросник, ответы которого учитываются в формируемом документе;\nсогласовывать разделы документа сотрудниками различных уполномоченных подразделений в режиме интерактивного обсуждения;\nсогласовывать документ внутри организации с ее контрагентами, фиксировать замечания;\nформировать протоколы разногласий.\nПроект документа (шаблон) может быть задан форматами *.XLSX и *.DOCX (MS Office 2010 и выше). Также поддерживаются форматы *.xls (MS Office), *.odt и *.ods (LibreOffice). Подробнее о подготовке проекта документа –\nПодготовка шаблона\n.\nРабота с проектом документа отлаживается в рамках настройки карточки шаблона печатной формы, подробнее –\nСоздание карточки шаблона печатной формы\n.\nДоступ для работы с печатными формами настраивается в Системе однотипно (подробнее –\nНастройка прав доступа к формированию документа\n). Доступ может быть настроен как на формирование печатной формы в целом, так и на редактирование отдельных блоков документа (подробнее –\nСоздание карточки шаблона печатной формы\n).\nФормирование печатной(ых) формы пользователю\nдоступно после выполнения описанных выше настроек.",
  "source": "https://docs.greendata.ru/platform/ru/the-edoc-module.html"
}