{
  "title": "\"Progress bar\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Progress bar\" widget\nThe \"Progress bar\" widget\nis a tool for displaying the progress of a process.\nExamples of a customized widget:\nConfiguring the widget\nThe widget is added in the mode of editing the\nvisual of an instance\nof an object type. When switching to the \"Widgets\" tab on the \"Elements\" panel, it is necessary to drag-and-drop the \"Progress bar\" widget from the \"Charts and Graphs\" section to the workspace of the profile.\nAfter clicking the\nbutton, a modal window for configuring the widget will open.\nSettings\nIn the modal window that opens, the widget is configured as follows:\nSetting\nPurpose\nName\nEntering the setting name.\nBy default, the \"Progress bar 1\" name is used, when adding a second and subsequent progress bar, the number increases by 1\n.\nProcess progress source\nDetermining the source for which the percentage of process execution will be transmitted.\nThe selection is made from previously created instances of the \"Process progress source\" [SYS_PROCESS_PROGRESS] type using a drop-down list.\nAdding a new process progress source is carried out in a modal window, which will be available after clicking on the kebab menu on the right side of the field and selecting the \"Add\" option in the context menu. To add a new source, specify its name and save the object (see the figure after the table).\nThere is no need to manually fill in the \"Process progress by object\" type registry embedded in the source profile\n, instances are created automatically in the process of progress change (see the figure after the table).\nView\nDetermining the type of process progress display.\nPossible options:\nclassic;\nbattery;\ncircular;\nsemicircular.\nThe default value is \"Classic\"\n.\nStyle\nDetermining the\nformatting style\n.\nThe selection is made from the\nformatting styles\nusing a drop-down list.\nAdding a new style is done by clicking on the kebab menu on the right side of the field and selecting the \"Add\" option in the context menu. In this case, the background color determines the color of the progress fill, and the font properties are applied to the displayed percentage of progress.\nIf the style does not specify a font size, it is set to 16 px when the \"Classic\" progress bar type is selected, and 20 px for all other types.\nBy default, the \"Success Style\" is used\n.\nDisplay percent\nDisplaying the completed progress of the process as a percentage. The option is available when the switch is in the active position.\nBy default, the switch is inactive.\nTo further configure the progress bar, an\nalgorithm\nof the object will be required, in the code of which the progress value is set using the SetProgress function. When calling the function, the user must specify two parameters:\nthe data source specified when configuring the Progress Bar widget in the Process Progress Source field;\nthe progress value is a numeric value from 0 to 100, determined by a number, or a variable/attribute of a numeric type.\nThe process progress is changed by means of the \"Progress bar\" widget in the object instance profile after the algorithm execution for this object is started.\nIn this case, changes in the progress of the process are recorded in the register of the \"Process progress by object\" type, embedded in the object profile of the progress bar source by automatically creating instances containing the following data:\nname of the instance;\nlink to source of the progress bar;\nan instance of the object that was used to run the algorithm for changing the progress of the process;\nthe percentage of process completion.\nUse example\nIt is necessary to monitor the progress of calculating the classification of credit claims.\nTo do this:\n1. Add the \"Progress bar\" widget to the object profile.\n2. In the widget settings:\nenter the name;\nuse the drop-down list to specify the type of \"Circle\" progress bar;\nafter clicking on the kebab menu, add the process progress source by entering the name and saving the source profile;\nswitch the \"Display percent\" switch to the active position.\n3. Add the SetProgress function to the algorithm for calculating the classification of credit claims, specify the created source process progress as the first parameter, and determine the percentage of process completion as the second parameter. The algorithm will take the following form:\n4. After the algorithm execution for the object with the \"Progress bar\" widget, the calculation progress will be displayed in the object profile.",
  "source": "https://docs.greendata.ru/platform/en/progress-bar-widget.html"
}