{
  "title": "Release details, version LTS.395.1",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.395.1\nPatch LTS.395.1 of January 23, 2024\nChanges and improvements\nStabilizations in file uploading and downloading;\nThe process of file attachment for Etl was changed;\nMaking edits was optimized in the eDoc module.\nUpdate package LTS.395.0 of January 16, 2024\nNew features\nA possibility to process \"diffDate\" and \"employeeOnSubordination\" functions was added to the filtering algorithm for the list of functions used in autocalculation.\nNew possibilities of working with visibility algorithms are now available in the Edoc editor.\nAn option allowing saving the username in external calls is added to GreenData messenger.\nChanges and improvements\nA mini-help with the description of fields was added to the schedule (CRON-format);\nAn expression was added to automatically fill in the Receive.Port attribute of the Mail Account;\nThe registry header was improved with some elements redesigned;\nGuf creation became more friendly, in particular when dealing with widget templates, ratings, filters and filtering algorithms;\nImprovements in autocalculation and dealing with the condition tree and filtering algorithms;\nThe possibility of using attrByVar and attr functions was restored for \"Algorithm. ETL\" algorithm type;\nAn attribute filter for splitting by intervals was added to Kanban board settings;\nOther minor Kanban board improvements like object opening in a new window, viewing the task expected completion date etc.;\nSystem terminology updates;\nCorrections in the \"Exchange rate data\" object type;\nImprovements in opening Edoc documents from the registry;\nPerformance improvements in object profile opening and data loading;\nCorrections in the \"Basic registry settings\" boolean attributes;\nUpdating improvements when using HTML in bookmark source;\nOptimizations in \"Checkbox with a hyperlink\", \"Status bar\" and \"Reactions and comments to the object\" widgets;\nAn option of multiline display is now available for multiselect attributes as well;\nImprovements in getComment function;\nA notification added when exiting the login page constructor without saving;\nA process of sorting data when working with registries was stabilized;\nOptimizations in ETL settings when getting connected to an external DB;\nCorrections in setting up the current date and time by user PC settings;\nSecurity improvements when loading PDF files with active contents;\nImprovements in connecting to an external call room.",
  "source": "https://docs.greendata.ru/platform/en/LTS.395.1-details.html"
}