{
  "title": "Параметрическое управление графиком",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПараметрическое управление графиком\nДо изучения материалов этой статьи предполагается, что читатель уже предварительно ознакомился с общими принципами построения графиков, изложенными в статье\n«Аналитическая панель \"Универсальный график\"»\n.\nГенерируемые алгоритмами диаграммы (графики) могут динамически перестраиваться и перерисовываться. Эти действия происходят автоматически в интерфейсе пользователя, как только диаграмма (график) замечает необходимость обновления. Платформа GreenData позволяет реализовать два вида управления графиками:\nПараметрическая зависимость\n(dependence)\nДиаграмма обновляется при изменении параметра, который был выбран в интерфейсе пользователя (UI).\nЗависимость детализации\n(\ndrill-down\n)\nЗависимость от другой диаграммы, фрагмент которой был выбран активными действиями пользователя.\nВ настоящей статье рассматривается именно параметрическая зависимость.\nМодель параметрического управления\nНастройки дашборда позволяют разместить на нем визуальные элементы (с вкладки \"Аналитические панели\") и обеспечить их согласованное обновление за счет связей с параметрами и источниками дашборда.\nЭтапы настройки\nСхема параметрического управления диаграммой предполагает выполнение следующих этапов найтройки:\nЭтап 1. \"\nНастройка типа\n\"\nИзначально следует убедится, что в приложении реализован тип, который будет выступать в качестве параметра управления диаграммой, а реестр типа заполнен актуальными значениями.\nЭтап 2. \"\nНастройка параметра дашборда\n\"\nВ существующем дашборде (в режиме \"Управление параметрами\") создается именованный параметр дашборда, в свойствах которого устанавливается признак \"Объект\" и указывается управляющий тип объекта (см. этап 1).\nЭтап 3. \"\nНастройка элемента управления\n\"\nВ существующем дашборде (в режиме \"Элементы\") размещается элемент \"Элемент управления\". При настройке элемента уточняются свойства \"Выпадающий список по типу элементов\", а также указывается связь с ранее созданным (см. этап 2) параметром дашборда. Элемент управления становится доступен в интерфейсе пользователя и позволяет выбирать запись (или записи) из реестра настроенного типа (см. этап 1).\nЭтап 4. \"\nНастройка алгоритма диаграммы\nВ системе создается и настраивается алгоритм карточки объекта. Для алгоритма создается входящий (формальный) параметр, через который код алгоритма может получать данные из дашборда. Входящий параметр является объектным и соотносится управляющему типу (см. этап 1). При необходимости алгоритм может получать данные в скалярном формате (число, строка, дата и пр.), обращаясь к атрибутам входящего объектного параметра.\nЭтап 5. \"\nНастройка источника дашборда\nВ существующем дашборде (в режиме \"Управление источниками\") создается именованный источник на основе алгоритма. При этом выбирается настроенный алгоритм (см. этап 4), а также создается параметр, заполняемый ссылкой на параметр дашборда (см. этап 2), изменения которого будут приводить к повторному срабатыванию алгоритма.\nЭтап 6. \"\nНастройка диаграммы (графика)\nВ существующем дашборде (в режиме \"Элементы\") визуально размещается аналитический элемент \"Универсальный график\". Настройка графика сопровождается выбором ранее реализованного (см. этап 5) источника на основе алгоритма.\nПосле сохранения всех изменений интерфейс дашборда позволит пользователю выбирать в списке элемента управления интересующий объект, что будет сопровождаться повторным срабатыванием алгоритма перестроения и отрисовки графика.\nПример настройки\nРазработаем простую диаграмму (график), визуализирующую выбранный пользователем календарный диапазон. График будет строиться алгоритмом, получающим выбранный пользователем диапазон времени.\nЭтапы параметрической настройки\nЭтап 1.\nВ разделе главного меню \"Типы объектов\" создадим сущность \"Календарный диапазон\" [CALENDAR_RANGE] с атрибутами: \"Наименование\" [NAME] и \"Продолжительность\" [DURATION]. Внесем туда данные для выбора (см. рисунок ниже).\nЭтап 2.\nСоздадим новый дашборд \"Дашборд календарный диапазон\" и (кнопкой \"Редактировать визуальное представление\") перейдем к общему режиму настройки. Далее нажмем кнопку \"Управление параметрами\" и создадим новый параметр дашборда \"ПД календарный диапазон\".\nЭтап 3.\nВ режиме работы с элементами \"Дашборд календарный диапазон\" перетащим \"Элемент управления\" из вкладки \"Аналитические панели\" в пространство верхней группы атрибутов и выполним настройку элемента управления, указав наименование \"Календарный диапазон\", уточнив тип элемента \"Выпадающий список по типу объектов\". Также обязательно заполним связь с параметром дашборда \"ПД Календарный диапазон\" и типом объектов \"Календарный диапазон\". Прочие настройки опциональны (см. на схеме ниже).\nПо итогу этапов 1-3 после сохранения всех изменений и нажатия кнопки \"ОК\" на дашборде появится работающий элемент управления в виде выпадающего списка, содержимое которого извлекается из сущности \"Календарный диапазон\" и предлагается на выбор пользователю.\nЭтап 4.\nСоздадим алгоритм, генерирующий график. Для этого перейдем к пункту главного меню \"Алгоритмы объектов\" и создадим новый алгоритм карточки объектов \"Алг_График_календарного_диапазона\". Для алгоритма создадим входящий параметр \"ПА Календарный диапазон\" с типом \"Объект\" и с заполненной ссылкой на системный тип объекта \"Календарный диапазон\" (см. схему ниже).\nШаблон кода алгоритма будет однократно подставлен кнопкой \"newColumnChart\" вкладки \"Графики\". Но подставленный программный код требует ручной доработки (см. рисунок ниже).\nСм.код реализации\n// получаем внешний объектный параметр\ndef ob := getObject(⁮ПА Календарный диапазон⁯, ⁩Календарный диапазон⁠, ‎Наименование​, ‎Продолжительность​)\n// генерируем диаграмму\ndef chart := newColumnChart()\nchart.title := \"Столбчатая диаграмма\"\nchart.subTitle := \"Выбранный период: \"+ob.⁬Наименование⁭\nchart.xAxis.title := \"Дни\"\nchart.yAxis.title := \"Значения\"\n// генерируем последовательность данных\ndef serie := newChartSerie()\nfor(def i:=1; i<=ob.⁬Продолжительность⁭; i++){\nserie.name := \"День \"+i\nserie.color := \"#148E5F\"\nserie.values.add(10+round(3*Math.sin(i/2),1))\n}\nchart.series.add(serie)\n// возвращаем диаграмму\nchart\nЭтап 5.\nДля создания источника дашборда кнопкой \"Редактировать визуальное представление\" перейдем к общему режиму настройки, в котором активируем кнопку \"Управление источниками\". Далее кнопкой \"Добавить на основе алгоритма\" создадим источник данных дашборда \"ИД Алг_График_календарного_диапазона\", выбрав алгоритм \"Алг_График_календарного_диапазона\" и создав параметр с типом \"Ссылка на параметр\" и ссылка на параметр дашборда \"ПД Календарный диапазон\" (см. схему ниже).\nЭтап 6.\nДля размещения графика на дашборде в режиме работы с элементами \"Дашборд календарный диапазон\" перетащим \"Универсальный график\" из вкладки \"Аналитические панели\" в пространство группы атрибутов и выполним простейшую настройку элемента, выбрав источник данных \"ИД Алг_График_календарного_диапазона\" (см. на схеме ниже).\nВ режиме настройки элементов дашборда зависимый от элемента управления появился график.\nПосле сохранения всех изменений посчитаем, что настройка завершена.\nРезультат настройки\nВ результате успешного выполнения всех шагов настройки элементов получим интерактивный график, оперативно реагирующий на выбор актуального календарного диапазона.\nВыводы\nГибкость платформы GreenData позволяет обеспечить интерактивность аналитических действий за счет настройки элементов управления, которые способны реагировать на действия пользователя и инициировать перестроение зависимых элементов (в том числе графиков) в дашбордах.\nИнтеграция с функционалом Highcharts, позволяет не только видеть интерактивные графики, но и обеспечивать выдачу снимков в графических форматах и в формате PDF документов.",
  "source": "https://docs.greendata.ru/platform/ru/parametric-graph-control.html"
}