{
  "title": "ETL. Трансформатор. Извлечение атрибута из динамической коллекции",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nETL. Трансформатор. Извлечение атрибута из динамической коллекции\nТрансформатор \"ETL. Трансформатор. Извлечение атрибута из динамической коллекции\" используется для поиска значения выбранного атрибута по значению ключевого атрибута.\nНастройка\nТрансформаторы ETL настраиваются в\nпреобразователе данных\n, добавленном на\nсхему\nETL-процесса.\nДля настройки используется следующий набор параметров:\nПараметр\nНазначение\nНаименование\nНазвание созданного трансформатора.\nПорядок\nВвод порядкового номера трансформатора для определения последовательности запуска при наличии нескольких трансформаторов.\nКоллекция входных данных\nВыбор элемента динамической структуры (коллекции), по содержимому которого будет производиться поиск.\nАдрес ключевого атрибута\nВыбор элемента динамической структуры (ноды), по которому будет производиться поиск.\nПри наличии в динамической структуре нескольких элементов с одинаковым именем должен быть указан путь до необходимого элемента в формате:\nrows.row.$.id\nАдрес значения\nВыбор элемента динамической структуры (ноды), значение которого необходимо получить.\nПри наличии в динамической структуре нескольких элементов с одинаковым именем должен быть указан путь до необходимого элемента в формате:\nrows.row.$.id\nЗначение ключевого атрибута\nЗначение ключевого атрибута, по которому будет производиться поиск.\nКоллекция выходных данных\nВыбор элемента динамической структуры (поля), в который будет передаваться полученное значение.\nПродолжить работу ETL при возникновении ошибки\nПризнак, используемый для игнорирования ошибок работы трансформатора.\nПродолжить обработку данных при возникновении ошибки\nПризнак, используемый для игнорирования ошибок обработки отдельных элементов динамической структуры (коллекции).\nПример\nДопустим, требуется получить значение атрибута \"name\" объекта с известным значением атрибута \"id\" для его дальнейшего использования.\nПредварительно добавим в выходную структуру\nпреобразователя данных\nэлемент динамической структуры (ноду) для хранения полученного значения:\nДля получения значения атрибута \"name\" объекта с \"id\":2 необходимо настроить трансформатор со следующими параметрами:\nВ результате работы трансформатора в элемент динамической структуры \"name\" будет записано значение атрибута \"name\" объекта с \"id\":2:",
  "source": "https://docs.greendata.ru/platform/ru/etl-transformer-retrieving-attribute-from-dynamic-collection.html"
}