{
  "title": "itab",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nitab\nThe function returns a value of the \"Number\" type based on the original input object value from the\ntable of coefficients\n.\nSyntax\nitab\n(tableIndex, [date], tableIndexDim)\nSetting\nPurpose\ntableIndex\nSelecting a\ntable of coefficients\ncreated earlier in the registry of instances of the \"Calculation Module. Table of coefficients (group)\" / \"Calculation Module. Table of coefficients (versions)\".\ndate\nDetermining the date on which the value is taken from the table of coefficients.\nUsed when working with historical values.\nMost often the date is specified with the \"Date\" type attribute, which should be set instead of the\ncurrentDate\ndummy variable.\nThis parameter is added when the \"Specify date\" checkbox is active.\ntableIndexDim\nThe dimensions of the table of coefficients (rows and columns) are fixed automatically from the selected table of coefficients.\nIt is necessary to specify the value of each dimension, replacing the dummy variables\nparam_1, param_2\n.\nMost often the dimension is defined by an attribute via the\nattr\nfunction.\nSpecify date - the sign that determines the possibility to specify the date within the function. Used when working with tables of historical values.\nIf the attribute and date are selected, the System will make a calculation based on the table values for the specified date.\nNote\nThe function is called using the\nbutton, located in the Algorithm Editor on the \"Sources\" tab.\nWhen calling the function, a window opens where it is necessary to select the previously created\ntable of coefficients\n. If necessary, check the \"Specify date\" checkbox.\nExamples\nExample № 1\nIt is necessary to write an algorithm for calculating the price of a hotel room, taking into account the meal type ordered.\nFirst, create and fill the table of coefficients in the registry of instances of the \"Calculation Module. Table of coefficients (group)\". Learn more about setting\ntable of coefficients\n.\nNext, the following algorithm can be written on the \"Rooms\" object type profile:\nAfter calling the\nitab\nfunction, the previously created table of coefficients \" Extra charge for meal type\".\nThe \"Hotel\" and \"Food Type\" coefficient table dimensions are fixed automatically, their values are set by the\nattr\nfunction.\nExample № 2\nIt is necessary to get the value of \"Industry risk\" to calculate the client’s rating.\nFirst, create a table of coefficients in the registry of instances of the \"Calculation Module. Table of coefficients (group)\" with the set value of the table data dependence on time.\nThe values in the table of coefficients are set for certain dates, apply to periods.\nThe required value is calculated using the\nitab\nfunction with the \"Specify date\" attribute:\nThe algorithm for getting the \"Industry risk\" value, taking into account the date of relevance of the calculation, will look as follows:\nThe dimensions of the \"Date\" and \"Activity type\" coefficients table are fixed automatically, their values are set by the\nattr\nfunction.",
  "source": "https://docs.greendata.ru/platform/en/itab.html"
}