{
  "title": "loadByExcelTemplate",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nloadByExcelTemplate\nФункция предназначена для импорта данных из xls-файла в соответствии с\nшаблоном загрузки\nи обновления/создания объектов Системы на основе полученной информации.\nСинтаксис\nloadByExcelTemplate\n(templateId, fileId, objectId, parameters)\nПараметр\nНазначение\ntemplateId\nШаблон загрузки xls-файлов, определяемый типом объектов \"Шаблон загрузки xls-файлов для типов объектов\" [SYS_XLS_TEMPLATE].\nfileId\nФайл формата *.xls, данные из которого необходимо загрузить.\nВ качестве параметра может быть передан экземпляр\nтипа \"Файл\"\n[FS_FILE] или\nколлекция экземпляров\n.\nobjectId\nОбъект (или его Код), для которого настроен\nуточненный шаблон загрузки\n.\nparameters\nОпределение значений параметров шаблона.\nПри выборе шаблона загрузки параметры будут добавлены автоматически (при их наличии).\nРабота с функцией предполагает использование\nметодов\nэкземпляра класса ResultLoadXls.\nПримечание\nВызов функции осуществляется с\nвкладки \"Дополнительные\"\nпанели инструментов редактора алгоритмов, в результате чего откроется модальное окно для выбора\nшаблона загрузки xls-файлов\n.\nФункция\nloadByExcelTemplate\nпредполагает создание экземпляра класса ResultLoadXls.\nПри работе с функцией используются следующие методы:\nМетод\nНазначение\nisSuccess\nВозвращает признак успешности завершения загрузки данных (true/false).\ngetException\nВозвращает java-исключение, если оно возникло в ходе загрузки.\nПример\nДопустим, сотруднику отдела кадров необходимо осуществить загрузку кандидатов по текущей вакансии для дальнейшей работы в Системе.\nВ рамках примера настроена объектная модель, включающая в себя типы объектов \"Вакансии компании\" и \"Импорт кандидатов\". При этом тип объектов \"Вакансии компании\" содержит атрибут \"Прикрепленные файлы\", в котором хранится файл формата *.xls со списком кандидатов.\nПодробнее об объектной модели.\nПредположим, что имеется тип объектов \"Вакансии компании\" со следующими атрибутами:\n\"Прикрепленные файлы\" – атрибут\nтипа \"Файл\"\n, в котором содержится файл формата *.xls со списком кандидатов;\n\"Кандидаты\" –\nдочерний атрибут\n, который по атрибуту \"Вакансия\" связан с типом объектов \"Импорт кандидатов\", имеющим следующий атрибутивный состав:\nТакже предположим, что имеется настроенный\nшаблон загрузки xls-файлов\n, в соответствии с которым производится сохранение данных в объекте типа \"Импорт кандидатов\".\nПодробнее о шаблоне загрузки.\nВ рамках примера загрузка данных из файла будет осуществляться согласно настроенному шаблону (подробнее, в статье\n\"Настройка шаблона загрузки xls-файлов\"\n), в котором:\nво встроенном реестре \"Параметры объекта\" добавлен параметр \"Вакансия\":\nв разделе \"Импорт кандидатов\" производится\nсопоставление ячеек с атрибутами\nтипа объектов \"Импорт кандидатов\":\nПри этом в качестве способа привязки к атрибуту \"Вакансия\" выбрано значение \"Параметр\" и указан ранее созданный параметр:\nЗагрузка списка кандидатов может быть осуществлена с помощью алгоритма следующего вида:\nДля загрузки данных из файла используется функция\nloadByExcelTemplate\n, где:\nв качестве первого аргумента указан шаблон загрузки, выбранный в модальном окне при вызове функции;\nвторым аргументом с помощью функции\nattr\nвыбран атрибут \"Прикрепленные файлы\", в котором содержится файл формата *.xls со списком кандидатов;\nтретий аргумент в рамках текущего примера не используется (указывается значение\nnull\n);\nчетвертым аргументом при выборе шаблона автоматически добавится параметр \"Вакансия\", в качестве значения которого посредством функции\nattr\nнеобходимо указать атрибут \"Код\".\nРезультат загрузки определяется с помощью метода\nisSuccess\n. Посредством конструкции\nif\n-\nelse\nпроверяется успешность выполнения загрузки и с помощью функции\nsendPopUpMsg\nпроизводится информирование пользователя:\nв результате успешной загрузки будет отображено сообщение вида:\nв случае возникновения ошибки при загрузке данных, информационное сообщение содержит текст исключения (возникшей ошибки загрузки), полученный с помощью метода\ngetException\n:",
  "source": "https://docs.greendata.ru/platform/ru/loadbyexceltemplate.html"
}