{
  "title": "setPermission",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nsetPermission\nThe function allows to assign/restrict read/write/delete permissions to an object.\nThe function is executed\nwith system control of object permissions\n. Read more about\npermissions\n.\nSyntax\nsetPermission\n(subject, obj, read, write, delete)\nSetting\nPurpose\nsubject\nSecurity subject (System user or group of System users).\nobj\nObject(s) for which permission needs to be changed.\nread\nPermissions to read the object. The value is true/false.\nwrite\nPermissions to write the object. The value is true/false.\ndelete\nPermissions to delete the object. The value is true/false.\nNote\nThe function is called using the\nbutton, located in the Algorithm Editor on the \"Users and groups\" tab.\nThis will open a modal window where the function parameter values can be set:\n1. The\nbutton will open a modal window for selecting security subjects (users/groups of users for which permissions are assigned/restricted). The selected security subjects will be displayed in the modal window for setting the setPermission function.\nIf the security subject is not selected, the\nnull\nvalue will be set when the function construct is inserted in the algorithm code.\n2.The object (objects) for which permissions should be changed is selected in the \"Objects for which permissions can be changed\" table.\nIf no object(s) is selected, the\nnull\nvalue will be set when the function construct is inserted in the algorithm code.\n3. Changing the read/write/delete permissions of the selected objects is configured using\nbuttons.\nIf permission is allowed, the value of the parameter will be set to\ntrue\n, if prohibited -\nfalse\n, to leave the existing one -\nnull\n.\nExample\nUser group\n\"Employee (Edu)\"\nwhen working with object type\n\"Division\"\nhas to\nallow writing the object, allow deleting it, and leave the permission to read the object unaltered\n. The function’s algoritm will look like the following:\nWhen calling the setPermission function, a modal window opens in which the corresponding parameter values are selected.",
  "source": "https://docs.greendata.ru/platform/en/setpermission.html"
}