{
  "title": "API updates",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nAPI updates\nCreating updates via the API\nUpdates are generated via the API using a request:\nlisting object IDs that will be included in the update:\n{url}/api/sys/update/to_zip?ids\ntext\nCopied!\nRequest example:\n/api/sys/update/to_zip?ids=845813,846153,846155\nindicating the source ID based on SQL, which returns IDs of the objects that will be included in the update:\n{url}/api/sys/update/to_zip?sqlSourceId\ntext\nCopied!\nRequest example:\n/api/sys/update/to_zip?sqlSourceId=890190\nWhere {url} is the address of the instance from which updates will be received.\nAs a result, a zip archive with update files is downloaded, where each object is represented by a separate GUF file.\nAdditionally, the following parameters can be used in the request:\nSetting\nPurpose\nonlyAccess\nOnly access permissions to the specified objects are collected in the update.\nRequest example:\n/api/sys/update/to_zip?sqlSourceId=890190&onlyAccess=true\nfileName\nThe name template of the downloaded update file.\nRequest example:\n/api/sys/update/to_zip?sqlSourceId=890190&onlyAccess=true&fileName=ACCESS\nThe file with the specified template will be received: \"ACCESS_2024_08_15_06_55_03.zip \".\nreplaceValues\nDeleting objects (attributes, expressions, indexes, LC algorithms and/or checks) on the instance where the update is installed if they are deleted in the current scheme. That is, only those objects that are available in the update will remain on the target instance.\nIt is similar to the \"replace values\" option used in\nupdate build\nvia the interface.\nRequest example:\n/api/sys/update/to_zip?sqlSourceId=890190&replaceValues=true\nexcludedAttrs\nExcluding attributes and their values from the update. The list is set by listing the attribute IDs.\nRequest example:\n/api/sys/update/to_zip?ids=845922&excludedAttrs=BASED_ON_SOURCE,RF_SOURCE_ID\nonlyRequired\nAdding only required attributes to the update.\nThere are exceptions, for example, the PARENT_ID and TYPE_ATTRS attributes are added for object types.\nRequest example:\n/api/sys/update/to_zip?ids=845922&onlyRequired=true\nexcludeLocalAttr\nExclusion of attributes from the attribute composition of the object type added to the update of the\n\"Child object\" type\n.\nRequest example:\n/api/sys/update/to_zip?ids=845922&excludeLocalAttr=true\nAlgorithm for transferring a large number of interrelated types\nTo transfer a large number of interrelated types, it is recommended to:\nCreate the update using the\nonlyRequired=true\nparameter.\nWhen creating an update, it is important to consider the hierarchy, i.e., the parent types are specified first, and the child types second. The correct order can be obtained by using a hierarchical query in the SQL-based source.\nGenerate the update excluding attributes:\nof the \"Child attribute\" type using the\nexcludeLocalAttr=true\nparameter;\nreferring to other attributes (for example, TYPE_EXPRESSIONS,INDEXES,KEYS,RESTRICTIONS,COMPILED_CODE), using the\nexcludedAttrs\n.\nCreate the update, including attributes of the \"Child attribute\" type using the\nexcludeLocalAttr=false\nparameter, while excluding other attributes that may refer to other attributes.\nCreate the update by adding expressions, keys, indexes, checks, attribute overrides, etc.\nCreate the update without exceptions.\nCreate the update with permissions using the\nonlyAccess=true\nparameter.\nDuring installation, it may be necessary to transfer the reference values used in the algorithms, or the default values (OVALUE, OVALUE_MULTI), as well as data sources that are used in source-based attributes (RF_SOURCE_ID).\nWorking with CI/CD updates via the API\nFor automation, the API can be used to interact with updates\ncreated via CI/CD\n. Using the API, it is possible to get a list of updates created via CI/CD or download and install the specific update.\nViewing the list of updates\nTo get a list of\nreleased\nupdates, a GET request of the following type is used:\ncurl -H \"X-LowCode-Private-Token: {token}\" {url}/hooks/cicd/updates > {output_json_file_with_updates_list}\ntext\nCopied!\nWhere:\n{url} – the address of the stand that delivers updates;\n{token} –\nconnection token\n;\n{output_json_file_with_updates_list} – received json file with a list of updates.\nIt is recommended to send the token for connection via the header, however, to get a list of released updates, the following GET request can be used.\n{url}/hooks/cicd/{token}/updates\ntext\nCopied!\nDownloading the update\nTo download the update, the GET request of the following type is used:\ncurl -H \"X-LowCode-Private-Token: {token}\" {url}/hooks/cicd/updates/{update_uuid} --output {output_zip_file_with_update}\ntext\nCopied!\nWhere:\n{url} – the address of the stand delivering updates;\n{token} – the\nconnection token\n;\n{update_uuid} – the uuid of the update that needs to be downloaded;\n{output_zip_file_with_update} – the downloaded ZIP file with the update.\nWhen making a request to a personal device, an archive with an update is downloaded..\nIt is recommended to send the token for connection via the header, however, to get a list of released updates, the following GET request can be used.\n{url}/hooks/cicd/{token}/updates/{update_uuid}\ntext\nCopied!\nChecking and installing the update\nTo\ncheck the update\n, a POST request of the following type is used:\ncurl -H \"X-LowCode-Private-Token: {token}\" -F \"file=@{file_to_install}\" {url}/hooks/cicd/apply?install=false> {output_json_file_with_check_results}\ntext\nCopied!\nWhere:\n{url} is the address of the instance delivering updates;\n{token} –\nconnection token\n;\n{file_to_install} – the file name from which the update is taken;\n{output_json_file_with_check_results} – the received JSON file with the verification results.\nIt is recommended to send the token for connection via the header, however, to check for updates, it is acceptable to use the following POST request.\n{url}/hooks/cicd/{token}/apply\ntext\nCopied!\nor\n{url}/hooks/cicd/{token}/apply?install=false\ntext\nCopied!\nThe \"install\" parameter is optional and is \"false\" by default.\nTo\ninstall the update\n, a POST request of the following type is used:\ncurl -H \"X-LowCode-Private-Token: {token}\" -F \"file=@{file_to_install}\" {url}/hooks/cicd/apply?install=true > {output_json_file_with_install_results}\ntext\nCopied!",
  "source": "https://docs.greendata.ru/platform/en/api-updates.html"
}