{
  "title": "User profile",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nUser profile\nUser Profile is a GreenData service that provides a single account for using the services of the\nSaaS personal account\nfunctionality and\nmarketplace\n.\nTo create a user profile, the user must pass the\nregistration process\n.\nIn the User Profile:\nuser data (surname/name) are recorded, which will:\nbe displayed when the owner/participant of the project is displayed both in their own Personal Account and in the Personal Accounts of other users when working together on the project.\ndisplayed when a user adds a rating/feedback to a purchased product on the marketplace;\nthe possibility of future product placement on the Marketplace from a representative of a legal entity is provided;\ndata on the creator of the product placing the application on the marketplace are specified;\npayment details are added and an agency agreement is signed between the product creator and GreenData for the possibility of placing a paid product on the marketplace.\nConfiguring a user profile\nUser profile settings are located on five tabs:\nAccount - a tab that contains the user’s account data used when owning a product in the Personal Account, when posting ratings, reviews and publishing products on the marketplace;\nSetting\nPurpose\nSetting up a profile photo.\nBasic information\nUser type\nSpecifying the user type used for product publishing from a private person. Possible value:\nIndividual;\nSelf-employed.\nOnly one user type is allowed to post products from a private person.\nFirst name\nEntering a user’s name.\nThe value specified during user registration is set by default.\nSecond name\nEntering a user’s second name.\nThe value specified during user registration is set by default.\nPatronymic\nEntering the user’s patronymic.\nTIN\nTIN is used to identify an individual or a self-employed person when publishing products.\nAfter signing\nagency agreement\nthe field is locked, in this case the TIN can be changed only by contacting the support service at\nhelp@greendata.ru\n.\nCountry\nUser’s registration country. The selection is made from the drop-down list.\nPaid product publishing is available only for residents of the Russian Federation.\nAfter signing\nagency contract\nthe field is locked, in this case changing the Country is possible only by contacting the support team at\nhelp@greendata.ru\n.\nThe value specified during user registration is set by default.\nContact details\nPhone\nEntering the user’s phone number.\nE-mail\nDisplaying the user’s E-mail.\nChanging E-mail is available on the “Advanced Settings” tab.\nThe value specified during user registration is set by default.\nMy payment details - a tab for adding payment details of an individual/self-employed person.\nTo publish a\npaid\nproduct from an individual, filling out the current tab data is required.\nFunds will be transferred to the specified account of the recipient for the purchase of the published product.\nTo add details, click on the button\nand in the opened modal window in the field “Bank” enter the name, BIK, SWIFT or TIN of the recipient’s Bank.\nOnce you start entering, the name can be selected from the drop-down list.\nAfter selecting a bank, BIK and correspondent account will be filled in automatically, it is required to add the current account number in the “ Recipient’s account” field and click on the “Add” button.\nSeveral current accounts can be added this way. All added accounts are displayed in the table, where they can be edited or deleted.\nTo make payouts received from the sale of products, the account specified in the “Recipient’s Primary Account” field will be used.\nThe default value of this field is the first recipient account added to the profile.\nTo delete a recipient account listed as the main account, select another account first in the “Recipient’s Main Account” field.\nOrganization - a tab for adding organization data for publishing a product from a representative of an individual.\nIn the “Name” field it is required to enter the name of the organization.\nOnce you start entering, the name can be selected from the drop-down list.\nAfter selecting the organization, most of the fields will be filled in automatically, it is possible to additionally specify the industry and the number of employees from the drop-down lists and, if necessary, replace the signatory and\nclick on the “Save” button.\nAn organization can be added only once on the Marketplace. If several users try to add the same organization, the system will display a warning notification.\nAfter adding an organization, the “Payment details” tab will be displayed. The process of adding organization details is similar to the one described\nearlier\n.\nTo publish a\npaid\nproduct from an individual, filling out the current tab data is required.\nTo delete an added organization, click on the corresponding icon:\nIt is impossible to delete an organization if there are products with the creator “Individual representative” (even for products with “Draft” status).\nIf trying to delete such an organization, the system will display a notification with the list of products bound to the organization.\nAdvanced settings - a tab for changing the password and E-mail of the user.\nOnly the confirmed current E-mail can be changed.\nAgency Agreement - a tab for concluding an agreement between the product creator and GreenData to allow publishing a paid product.\nTo place paid products on the marketplace, agent contracts must be signed on the corresponding tabs, depending on the type of product creator.\nEach type of creator corresponding to a separate tab with an agency agreement.\nIn order to sign an agency agreement on the “Individual”/“Self-employed” tabs on the\n“Account”\ntab, the TIN must be specified, the “Russia” country must be selected, and the user type corresponding to the tab must be specified.\nSigning the agreement is done by checking the checkbox “I am familiar with the terms and conditions of the Agency Agreement and agree with them”.\nThe signed agency agreement can only be canceled by contacting the support service at\nhelp@greendata.ru\n.",
  "source": "https://docs.greendata.ru/platform/en/user-profile.html"
}