{
  "title": "Настройка запуска действий по расписанию",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка запуска действий по расписанию\nДля\nавтоматического выполнения действия\nв Системе необходимо задать расписание его запуска. Время запуска задается\nв формате CRON\n.\nСуществуют следующие способы создания автоматического выполнения действия по расписанию:\nВ типе объекта \"Расписание запуска действий\"\nВвод расписания осуществляется при создании экземпляра типа объекта \"Расписание запуска действий\" [SYS_ACTION_SCHEDULE] по кнопке\n.\nгде:\nПоле\nНазначение\nНаименование\nВвод наименования настройки.\nСистемное действие\nОпределение системного действия к выполнению. Необходимо выбрать действие для запуска по расписанию.\nОбъект с параметрами для действия\nПоле будет доступно после выбора значения в поле \"Системное действие\".\nВыбор объекта (настроечного типа) с параметрами системного действия указанного ранее (поле описано выше). Тип объекта определяется как\nнаименование системного действия\n.\nРасписание работы действия\nВвод периода запуска алгоритма (подробнее, см.\n\"Планировщик в формате CRON\"\n).\nРасписание действует\nПодтверждение выполнения запуска системного действия по расписанию. Возможные значения:\nда – запуск действия по расписанию выполняется;\nнет – запуск действия по расписанию не выполняется.\nСледующие поля будут заполнены автоматически:\nПоле\nНазначение\nПоследнее выполнение прошло успешно\nРезультат выполнения запуска действия. Возможные значения:\nда – выполнено успешно;\nнет – выполнено неуспешно.\nДата последнего выполнения\nДата и время выполнения последнего запуска действия.\nВ случае изменения\nпериода запуска\nв действующем расписании, необходимо отключить и включить его запуск для обновления данных.\nДля этого необходимо сохранить карточку запуска действия со значением \"\nНет\n\" в поле \"Расписание действует\", затем – со значением \"\nДа\n\" в том же поле.\nЧтобы работа с вводом расписания была вынесена в меню навигации Системы (панель слева), необходимо создать требуемый\nпункт меню\n.\nВ типе объекта \"Расписание запуска\"\nВ реестре типа объекта \"Расписание запуска\" [\nSYS_START_SCHEDULE\n] пользователь может создать несколько автоматических действий в одном экземпляре типа. Для этого необходимо перейти в реестр типа объекта и с помощью кнопки\nсоздать новый объект.\nВ новой карточке реестра следует заполнить основные настройки (наименование, параметры расписания). Затем пользователь сможет настроить системные действия, нажав на кнопку\nв дочернем атрибуте \"Планировщик заданий\".\nПосле этого на экране пользователя отобразится окно с возможными типами системного действия.\nВыбрав необходимый тип действия, пользователь увидит окно с настройками системного действия, которые могут отличаться в зависимости от выбранного типа.\nВ завершении ввода расписания необходимо нажать кнопку\nдля сохранения данных.\nСохраненное системное действие отобразится в реестре планировщика заданий в карточке расписания. Автоматические действия будут выполняться в соответствии с расписанием работы действия.\nПодробнее настройка расписания запуска описана для:\nалгоритма\n;\nETL\n;\nрасчета\n.\nИные действия настраиваются аналогично. Количество системных действий может меняться в зависимости от наращивания функциональности Системы.",
  "source": "https://docs.greendata.ru/platform/ru/task-scheduler-launch-of-algorithm.html"
}