{
  "title": "Пользовательские виджеты",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПользовательские виджеты\nВ настоящий момент данный модуль находится на стадии разработки и имеет ограниченную функциональность.\nВ On-Premise решении доступ к модулю возможен после добавления дополнительных\nпараметров в конфигурационный файл\nприложения.\nВ зависимости от потребностей разрабатываемого продукта стандартных инструментов при\nнастройке визуала\nможет оказаться недостаточно.\nВ Системе реализован функционал, благодаря которому пользователи могут создавать собственные\nвиджеты\nс индивидуальными наборами настроек, а также задавать их конечное отображение.\nСоздание пользовательских виджетов предполагает знание основ HTML-разметки.\nСоздание пользовательских виджетов доступно пользователям, обладающим разрешениями\n\"Просмотр метаданных\"\nи\n\"Редактирование метаданных\"\n.\nДля перехода к среде разработки виджетов необходимо последовательно выбрать пункты главного меню: Администрирование → Настройки → Среда разработки виджетов.\nОсновными элементами интерфейса среды разработки виджетов являются:\nЭлемент\nНазначение\nБлок \"Виджеты\"\nСодержит пользовательские и системные виджеты, распределенные по папкам.\nБлок \"Компоненты виджета\"\nСодержит шаблоны готовых компонентов виджета.\nОбласть настроек\nИспользуется для формирования кода.\nОбласть предпросмотра\nПредназначена для предварительного просмотра итогового отображения виджета и его настроек.\nДля компактности отображения и удобства работы размер элементов среды разработки может регулироваться путем перемещения разделяющих линий между ними вправо/влево, а скрыть блок или область целиком можно посредством нажатия на кнопки\nили\nмежду ними.\nБлок \"Виджеты\"\nДанный блок содержит пользовательские и системные виджеты, расположенные в одноименных папках.\nПросмотр и скрытие содержимого папки регулируется нажатием на кнопки\nи\nрядом с ее наименованием.\nСистемные виджеты\nСоздание и редактирование виджетов в папке \"Системные\" недоступно.\nВ папке \"Системные\" размещены виджеты, которые могут быть использованы в качестве готовых шаблонов при создании пользовательских виджетов. В текущем наборе представлены виджеты\n\"Текст\"\n,\n\"Кнопка\"\nи\n\"Навигационная панель\"\n. Учитывая активное развитие Системы, перечень доступных виджетов будет регулярно пополняться, что позволит пользователям расширять функциональность и настраивать интерфейс в соответствии с их потребностями.\nПри наведении курсора мыши на наименование виджета станет доступна кнопка\n, при нажатии на которую виджет будет скопирован в папку \"Пользовательские\", где его содержимое станет доступно для редактирования.\nПользовательские виджеты\nВ папке \"Пользовательские\" расположены все созданные пользователем виджеты. При наведении курсора мыши на папку станут доступны следующие кнопки:\n– создание новой папки внутри текущей;\n– создание нового виджета внутри текущей папки.\nПри нажатии на кнопку\nбудет создан новый виджет, содержащий файлы\nSettings.html\nи\nView.html\n(процесс работы с файлами рассмотрен\nдалее\n):\nПо умолчанию виджет имеет наименование \"Пользовательский виджет\" и иконку\n. При желании виджет можно переименовать посредством двойного клика по текущему наименованию, а при нажатии на иконку ее можно изменить, выбрав новую из перечня доступных пиктограмм.\nПри наведении курсора мыши на наименование виджета станут доступны кнопки для копирования\nи удаления\nвиджета.\nЕсли виджет используется в Системе, то при его удалении будет открыто модальное окно с перечнем всех\nвизуалов экземпляров\n, на которых он был размещен, для подтверждения действия удаления.\nПеремещение виджетов между папками осуществляется посредством перетаскивания (Drag&Drop) с помощью элемента\nслева от наименования виджета.\nДля быстрого перехода к необходимому виджету можно воспользоваться строкой поиска по наименованию.\nБлок \"Компоненты виджета\"\nВ данном блоке расположены шаблоны компонентов виджета.\nДобавление шаблона осуществляется перетаскиванием (Drag&Drop) компонента из блока \"Компоненты виджета\" в файл, открытый в области\nнастроек\n.\nВ результате чего в файл будет добавлен шаблон кода выбранного компонента, а его итоговое отображение будет доступно в области предпросмотра:\nС примерами использования шаблонов компонентов виджета можно ознакомиться в\nстатье\n.\nНастройка\nСоздание пользовательского виджета производится посредством использования двух файлов:\nшаблон настроек\nSettings.html\n:\nВ данном файле производится формирование настроек виджета, которые будут отображены в модальном окне при нажатии на кнопку\nпри размещении виджета на визуале;\nшаблон вывода\nView.html\n:\nС помощью условий, заданных в данном файле, осуществляется настройка итогового отображения виджета в зависимости от выбранных пользователем настроек.\nПри внесении изменений в файл слева от его наименования появится соответствующий индикатор, а на\nпанели управления\nстанет доступна кнопка\n, при нажатии на которую индикация пропадет и все изменения будут сохранены.\nС синтаксисом, используемым для создания пользовательского виджета, можно ознакомиться в\nстатье\n.",
  "source": "https://docs.greendata.ru/platform/ru/custom-widgets.html"
}