{
  "title": "Системное действие. Скрипт СУБД",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСистемное действие. Скрипт СУБД\nСистемное действие с расширением \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\" используется для выполнения действий в базе данных в ходе выполнения ETL-процесса.\nВ\nSaaS окружении\nфункциональность системного действия с расширением \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\" недоступна.\nПросмотр карточки системного действия доступен пользователям, обладающим правом на выполнение\nразрешения\n\"Просмотр метаданных\" и имеющим право на выполнение следующих действий:\n\"Чтение экземпляров типа\" для типа объектов \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\" [ACT_EXEC_SQL_PARAMS];\n\"Чтение\" соответствующего экземпляра системного действия.\nПри\nнастройке схемы ETL\nс панели действий и компонентов необходимо перетащить (Drag&Drop) в рабочую область элемент задачи. После чего нажатием на кнопку\nв меню действий выбрать тип \"Этап. Системное действие\":\nПараметры настройки\nДля перехода к параметрам настройки системного действия необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего откроется новая вкладка, на которой в модальном окне необходимо выбрать расширение \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\":\nДля настройки данного системного действия используется следующий набор параметров:\nПараметр\nНазначение\nСоединение с внешней БД\nОпределение объекта с настройками\nсоединения с внешней БД\n.\nВыбор ранее созданного объекта с настройками\nсоединения с внешней БД\nосуществляется из выпадающего списка, добавление нового объекта доступно через меню действий параметра.\nПри пустом значении атрибута база данных определяется как текущая, с которой работает Система.\nSQL скрипт\nВвод кода используемого скрипта.\nПараметры объекта\nРеестр для добавления параметров объекта, используемого в коде SQL скрипта.\nСоздание нового параметра осуществляется по кнопке\n.\nПример\nРассмотрим применение системного действия с расширением \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\" для очистки имеющихся\nисключений\nперед выполнением интеграции по загрузке данных о праздничных и рабочих днях в календарь.\nГотовая интеграция на основе ETL по загрузке данных о праздничных и рабочих днях в календарь доступна для установки на\nмаркетплейсе\n.\nНа\nсхему ETL\n\"Синхронизация календаря праздничных дней из внешнего сервиса\" добавляется этап типа \"Этап. Системное действие\".\nПосле сохранения схемы ETL можно перейти к настройкам системного действия по кнопке\nв меню действий этапа. На открывшейся странице выбирается расширение \"Скрипт СУБД (SQL, PL/SQL, T-SQL и др)\", после чего параметры настроек определяются следующим образом:\nпараметр \"Соединение с внешней БД\" не заполняется, так как происходит обращение к текущей БД;\nпри помощи SQL скрипта для объекта, соответствующего условию, устанавливается статус 0, в результате чего данный объект будет помещен в\nкорзину\n.\nУсловие осуществляет проверку вхождения ID объекта в список исключений из календаря, при этом ID календаря передается через параметр \"cal_id\".\nЭкземпляр объекта \"Календарь. Исключение\" хранится в двух таблицах базы данных ([CALENDAR_EXCEPTION] и [SYS_CALENDAR_EXCEPTION]), поэтому при написании SQL скрипта осуществляется запрос к каждой из таблиц.\nпараметр объекта \"cal_id\", используемый в SQL-запросе, задается алгоритмически:\nв качестве базового типа объекта устанавливается текущий экземпляр ETL (\nтип стартового объекта\nETL-процесса) \"ETL. Синхронизация календаря праздничных дней\";\nдля передачи в запрос SQL скрипта ID календаря, выбранного при\nзапуске ETL-процесса\n, в код алгоритма посредством функции\nattr\nвставляется код атрибута \"Календарь\".\nВ результате данных настроек при выполнении ETL-процесса \"Синхронизация календаря праздничных дней из внешнего сервиса\" будет очищен список\nисключений\nкалендаря, указанного при\nзапуске ETL-процесса\n.",
  "source": "https://docs.greendata.ru/platform/ru/system-action-dbsm-script.html"
}