{
  "title": "Создание новых типов объектов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСоздание новых типов объектов\nТипы объектов состоят из набора атрибутов и объявляют (декларируют) структуру, в которой хранятся данные объектов Системы.\nНа базе типов объектов в Системе создаются экземпляры и реестры объектов. Гибкость Системы позволяет бизнес-аналитику разрабатывать не только структуры для хранения, но и любые функциональные объекты (например, алгоритмы и отчетные формы). Каждый объект системы соотнесен конкретному объектному типу. Перечень типов объектов может расширяться в любое время в процессе настройки Системы.\nРабота с типами объектов доступна пользователям, имеющим право на выполнение разрешений\n\"Просмотр метаданных\"\nи/или\n\"Редактирование метаданных\"\n, состоящим в\nгруппе доступа\n\"Административная группа\" [ROLE_ADMIN] и обладающим правами на выполнение соответствующих действий для типа \"Тип объекта\" [SYS_OBJ_TYPE]:\nЧтение экземпляров типа;\nСоздание экземпляров типа;\nРедактирование экземпляров типа,\nа также правом на \"Чтение\" и \"Запись\" соответствующего типа объектов.\nВ Системе возможно использование значений следующих атрибутов карточек типов объектов:\nID,\nNAME,\nSTATUS,\nTYPE_ID,\nPARENT_ID.\nДля доступа ко всем атрибутам карточки типа пользователь должен обладать правом на выполнение разрешения\n\"Просмотр метаданных\"\n, а также правом на \"Чтение\" соответствующего типа объекта.\nОсновные этапы действий\nСоздание нового типа объекта предполагает исполнение упорядоченных действий.\nБизнес-аналитику потребуется продекларировать новый тип и укомплектовать его атрибутами.\nПрежде чем создавать новый тип объекта нужно убедиться, что в Системе такой тип еще не реализован.\nОзнакомиться с уже существующими типами объектов можно в реестре типов.\nВ Системе все типы объектов упорядочены в единую иерархическую структуру (репозиторий), верхними (родительскими) элементами которой являются типы:\n\"Объект\"\n;\n\"Примитивный объект\"\n– тип, предназначенный для решения специальных задач хранения больших наборов данных и интеграции (подробнее о видах и возможностях примитивных объектов смотрите в публикации\n\"Примитивный объект\"\n).\nВсе прочие типы являются дочерними и визуально отображаются вложенными. За счет механизма наследования типы объектов заимствуют от своих родительских типов их атрибуты.\nРеестр типов объектов в интерфейсе Системе\nДля перехода в реестр \"Тип объекта\" необходимо последовательно выбрать в главном меню пункты:\nАдминистрирование → Управление объектами → Типы объектов\n.\nНа открывшейся странице по умолчанию представлены\nпользовательские типы объектов\n.\nДля пользователей, входящих в группу доступа \"Административная группа\", также дополнительно отображаются некоторые релевантные типы объектов, входящие в базовую поставку.\nПри наличии разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\nв панели управления отобразится кнопка \"Показать все типы\"\n, при нажатии на которую в реестре будет представлен:\nполный перечень типов, включая пользовательские и системные — для пользователей, входящих в группу доступа \"Административная группа\";\nперечень доступных типов с учетом выданных прав — для остальных пользователей.\nДля перехода к сокращенному переченю типов необходимо повторно нажать на кнопку.\nКлючевые команды для работы с типами объектов размещаются в левой части панели управления соответствующего раздела.\nС перечнем и назначением элементов панели управления реестра можно ознакомиться в статье\n\"Работа с реестром объектов\"\n.\nДля прикладной наглядности материала рассмотрим действия на примере учебной тематической задачи, требования которой далее по тексту именуем ТЗ.\nТематическая задача\nВ интересах проекта автоматизации отеля требуется создать тип объекта для регистрации заявок на бронирование номеров.\nНа первом этапе подлежат регистрации следующие данные:\nдата и время поступления;\nдата заезда;\nдата выезда;\nколичество гостей;\nФИО контактного лица;\nпаспортные данные контактного лица (серия, номер, дата выдачи), которые могут быть не заполнены;\nконтактный телефон;\nсотрудник, зарегистрировавший заявку;\nномер отеля (например, \"107\", \"205а\", \"304 VIP\" …).\nПосле предварительного анализа установлено, что в структуре типа объекта потребуется атрибут, который будет в дальнейшем уточнять сотрудник отеля:\nподтверждение брони (по умолчанию не подтверждено).\nТакже для последующих расчетов будет очень удобен числовой атрибут:\nдлительность (дней периода проживания).\nПо мере автоматизации состав атрибутов будет расширяться, но в рамках демонстрационного примера посчитаем его достаточным.\nПорядок создания типа объекта\nПредварительные действия\nЕсли планируется разработать новый тип объекта Системы, то бизнес-аналитик должен предварительно проанализировать задуманный состав атрибутов. Часто в создаваемом типе объекта подразумевается необходимость выбора справочных значений (например, из выпадающего списка справочника).\nЕсли в перечне атрибутов типа А должна быть реализована возможность выбора значения из другого объекта сущности B, то перед созданием объектного типа А, необходимо убедиться в существовании типа В. При отсутствии типа В в Системе требуется первоначально разработать именно его, а затем разрабатывать/модернизировать атрибутивный состав типа А.\nПоэтому в рамках решения задачи (ТЗ) следует создать два связанных типа объектов. Причем сначала должен быть спроектирован тип \"Номера отеля\", а лишь затем \"Бронь номера\".\nБизнес-аналитику следует учитывать, что механизм наследования атрибутов от родительского объекта (по умолчанию от \"Объект\") позволяет значительно уменьшить количество настраиваемых вручную атрибутов типа объекта. Поэтому в структуре типа объекта должны создаваться лишь оригинальные, отсутствующие в родительском типе атрибуты.\nВ рамках решаемой задачи потребуется выполнить следующий порядок действий:\nСоздать тип объекта \"Номера отеля\" без собственных атрибутов, так как атрибут наименования уже будет унаследован от родительского типа \"Объект\".\nСоздать тип объекта \"Бронь номера\" с заявленными (см.ТЗ) перечнем атрибутов.\nПри создании атрибутов необходимо учесть следующее:\nСоздавать новый атрибут для фиксации сотрудника, зарегистрировавшего заявку не требуется, так как в составе типа \"Бронь номера\" уже имеется унаследованный атрибут \"Сотрудник, создавший объект\".\nПодлежат созданию \"с нуля\" не все атрибуты, так как некоторые из них (например: номер, серия паспорта, дата выдачи паспорта) могут быть созданы на основе уже существующих в Системе атрибутов.\nВ перечне атрибутов типа объекта \"Бронь номера\" потребуется настроить объектную ссылку на выбор одного из элементов справочника \"Номера отеля\".\nЭтап 1. Декларация типа\nБизнес-аналитику следует первоначально продекларировать тип объекта, заполнив смысловые атрибуты идентификации типа. Далее следует выбрать родительский тип объекта, из состава которого произойдет наследование атрибутов.\nСпецифика реальных задач может потребовать применения расширенных настроек, но для создания учебного типа объекта, предназначенного для хранения данных, достаточно выполнить цепочку ключевых действий, временно не обращая внимания на расширенные настройки и специальные опции.\nЗаполнение атрибутов идентификации типа\nСоздание нового типа объекта возможно по кнопке\n, создание копии существующего типа – по кнопке\n.\nВ открывшейся карточке типа необходимо указать:\nНаименование – смысловое выражение сущности;\nНаименование таблицы – англоязычное техническое наименование таблицы для хранения данных, которое может быть:\nсгенерировано автоматически после ввода/изменения наименования типа с последующим снятием фокуса с поля (с возможностью ручной корректировки);\nВ\nSaaS и Private Cloud решениях\nзначение генерируется на английском языке при помощи Яндекс сервиса. Если сервис перевода недоступен, то поле остается пустым.\nВ\nOn-Premise решении\nданный функционал выполняется в соответствии с\nсистемными настройками переводчика\n.\nПравила формирования наименования таблицы.\nсервис перевода применяется только для буквенных символов;\nпри генерации наименования таблицы слова в словосочетании разделяются нижним подчеркиванием;\nспецсимволы, артикли, предлоги (\nOF\n,\nFOR\n,\nIN\n,\nFROM\n,\nTO\n,\nBY\n) в наименование таблицы не добавляются;\nцифры, расположенные перед буквенными символами, отбрасываются, так как наименование таблицы должно начинаться с буквы;\nцифры, размещенные после буквенных символов через пробел, добавляются через нижнее подчеркивание, при отсутствии пробела – слитно;\nесли в результате перевода длина наименования таблицы превышает 23 символа, то осуществляется обрезка слова/словосочетания;\nесли ранее не было ручной корректировки наименования таблицы, то при изменении наименования типа оно будет перегенерировано автоматически;\nесли сервис перевода недоступен, тогда поле остается пустым.\nдобавлено ручным вводом: длиной не более 23 знаков, без пробелов и спецсимволов, состоящее из букв латинского алфавита, цифр и знаков подчеркивания, начинающееся с буквы.\nНаименование таблицы не может содержать префикс SYS, WF, RF, RISK, ETL или FS, поскольку они зарезервированы исключительно для системных типов.\nПри выборе наименований таблиц рекомендуется использовать смысловые термины английского языка в единственном числе. Например, сущности товара желательно сопоставить имя таблицы PRODUCT, а договору - CONTRACT.\nСложные составные наименования могут состоять из слов, сокращений и аббревиатур, разделенных знаком подчеркивания. Например, условие договора можно обозначить как CONTRACT_CONDITION.\nНаименование таблицы не может быть изменено после сохранения типа объекта.\nРодитель – родительский тип объекта, из состава которого произойдет наследование атрибутов (подробнее рассмотрено на следующем\nшаге\n).\nРабота по созданию и настройке типа объекта всегда должна завершаться нажатием на кнопку сохранения выполненных изменений на панели управления –\n.\nВыбор родительского типа\nНеобходим для соблюдения общей иерархии типов:\nРодитель - конкретный родительский тип объекта.\nБизнес-аналитиком обязательно указывается (выбирается) родительский тип объекта, атрибуты которого будут заимствованы и войдут в состав атрибутов разрабатываемого типа.\nВ случае создания нового объектного типа, не имеющего принципиального сходства с существующими типами, следует выбирать в качестве родительского тип верхнего уровня \"Объект\".\nЕсли создаваемый тип является результатом развития существующей структуры, то именно ее следует выбрать в качестве родителя.\nСледует внимательно указывать родительский тип, так как его замена возможна только в случае отсутствия связей настраиваемого типа объекта с другими объектами.\nПравила замены родительского типа\nВ качестве родительского типа не может быть указан настраиваемый тип объекта или его дочерний тип.\nПри изменении родительского типа объектный тип может быть заменен только на объектный, а примитивный тип – на\nпримитивный\n.\nЗамена родительского типа не должна сопровождаться изменением иных свойств типа объекта. Например, нельзя заменить родительский тип, и не сохранив внесенные правки, создавать алгоритмы, индексы, события и т.д.\nУ настраиваемого типа должны отсутствовать\nэкземпляры\n, в том числе в\nкорзине\n.\nВ качестве родительского типа не может быть указан тип объекта, который приведет к появлению дублей атрибутов в текущем/дочерних/расширяемых типах.\nВ качестве родительского типа не может быть указан тип объекта, который содержит\nрасширения\n/\nключи/индексы/ограничения\nс таким же набором атрибутов, что и настраиваемый тип или его дочерние типы.\nЕсли заменяемый родительский тип приведет к уменьшению состава атрибутов/\nключей/индексов/ограничений\n, то такая замена возможна при соблюдении следующих условий:\nу настраиваемого типа должны отсутствовать, в том числе в\nкорзине\n:\nдочерние (унаследованные) типы объектов;\nвыражения\nи переопределённые выражения;\nпроверки\n;\nсобытия\n;\nключи/индексы/ограничения\n, в которых задействованы атрибуты прежнего родительского типа;\nпереопределённые атрибуты прежнего родительского типа;\nнастроенные\nреестры\n;\nнастроенные\nвизуалы экземпляра\n;\nатрибут прежнего родительского типа не выбран в настраиваемом типе в качестве значения параметра:\n\"Атрибут для иерархии\" (применимо для\nиерархического\nтипа объекта);\n\"Атрибут для наименования\" (применимо для\nпримитивного объекта\n);\n\"Атрибут для наследования прав\" (применимо в случае выбора вида контроля прав\n\"Наследование прав от связанного объекта\"\n);\nнастраиваемый тип объекта не используется:\nв\nисточниках данных\n;\nв\nалгоритмах\n, в которых задействованы атрибуты/ключи/индексы/ограничения прежнего родительского типа;\nв\nконструкторах фильтров\n, в которых задействованы атрибуты/ключи/индексы/ограничения прежнего родительского типа;\nв\nматрице полномочий объектов\nнастраиваемого типа объекта отсутствуют атрибуты прежнего родительского типа.\nВ рамках решаемой задачи (ТЗ) создадим новый тип объекта с характеристиками:\nНаименование =\nНомера отеля\nНаименование таблицы =\nROOM\nРодитель =\nОбъект\nДля этого типа не требуется создания индивидуальных атрибутов, так как унаследованный (от типа \"Объект\") строковый атрибут наименования полностью подходит для хранения наименований номеров отеля. Если атрибутивный состав типа кажется пустым и унаследованные атрибуты не отображаются, то переключите чек-бокс \"Показать атрибуты родительского типа\" в активное положение. Завершим создание справочника \"Номера отеля\" нажатием кнопки сохранения и вернемся из карточки типа кнопкой возврата на панели инструментов. После того как справочник номеров отеля создан, можно приступать к созданию второго типа объекта:\nНаименование =\nБронь номера\nНаименование таблицы =\nBOOKING\nРодитель =\nОбъект\nПрименение дополнительных настроек\nДля решения некоторых задач может потребоваться применение расширенных настроек типа объектов, в том числе:\nНастройка иерархии;\nНастройка версионности;\nНастройка контроля прав доступа и пр.\nПредназначение расширенных настроек\nИспользуются для тонкой настройки объектов и решения специальных задач. В режиме ознакомления с Системой расширенные опции настройки знать и применять необязательно.\nДанные настройки представлены в блоке \"Дополнительные настройки\" и распределены по вкладкам.\nВкладка\n\"Общие\"\nНа данной вкладке расположены параметры для настройки общих характеристик и свойств объекта, такие как:\nПараметр\nНазначение\nСохранять объект без пересчета выражений/ЖЦ\nПозволяет отключить выполнение алгоритмов жизненного цикла/пересчета выражений после первого сохранения.\nНастройка работает в совокупности с активным признаком \"Изменять значение без пересчета выражений/ЖЦ\" в атрибутах типа и применяется\nтолько для сохраненных объектов\n.\nПодробнее с вариантами запуска алгоритмов жизненного цикла и пересчета выражений в зависимости от выбранных значений параметров можно ознакомиться по\nссылке\n.\nПо умолчанию настройка неактивна.\nЗапретить наследование типа\nОграничение возможности создания наследуемых типов.\nПри активной опции текущий тип объектов нельзя будет использовать в качестве\nродительского\n.\nВкладка\n\"Описание/Назначение\"\nНа данной вкладке в поле \"Описание\" пользователи могут добавлять подробное описание назначения и использования данного типа объекта.\nВкладка\n\"Иерархия\"\nНа данной вкладке осуществляется настройка иерархического типа, предназначенного для систематизации объектов в виде древовидной структуры. В качестве примеров иерархических типов могут служить: справочник подразделений компании, перечень узлов чертежа, муниципальные территории и пр.\nПереключатель \"Иерархический тип\" подразумевает разрешение использования иерархической вложенности данных, позволяющей настроить\nреестр с иерархией\nдля объектов типа.\nПри активном переключателе \"Иерархический тип\" станет доступно поле \"Атрибут иерархии\". В качестве атрибута иерархии должен быть указан\nобъектный атрибут\n, ссылающийся на текущий тип объекта, который будет использоваться для формирования структуры.\nВкладка\n\"Версионность\"\nНа данной вкладке представлены два параметра с выбором значения \"Нет\" / \"Да\":\n\"Принудительное создание версий исторических атрибутов\" – выполняет предписание принудительного создания первой версии исторического атрибута.\n\"Атрибуты могут зависеть от времени\" со значениями – разрешает фиксировать хронологию изменения значений атрибутов для выдачи не только актуального значения, но и значений на разный момент времени.\nВкладка\n\"Аудит\"\nНа данной вкладке представлен параметр \"Включить запись в аудит изменений\", при активации которого изменения значений атрибутов экземпляров типа будут фиксироваться в\nаудит изменений\n.\nДанная настройка работает в совокупности с активным признаком\n\"Включить запись в аудит изменений\"\nв атрибутах типа.\nПо умолчанию параметр \"Включить запись в аудит изменений\" активен.\nВкладка\n\"Контроль доступа\"\nНа данной вкладке расположены параметры для настройки прав доступа к реестру и экземплярам типа:\nПараметр\nНазначение\nВид контроля прав\nПараметр определяет общий принцип проверки прав доступа к экземплярам данного типа.\nПри\nсоздании нового типа объекта\nс родителем \"Объект\" [SYS_OBJECT] по умолчанию устанавливается \"Системный контроль прав\", в остальных случаях вид контроля прав наследуется от родительского типа.\nПри копировании типа объекта сохраняется контроль прав исходного типа.\nПодробнее можно ознакомиться в статье\n\"Общий порядок настройки прав доступа\"\n.\nАтрибут для наследования прав\nПараметр позволяет указать связь с другим объектом, от которого будут наследоваться права доступа.\nПараметр доступен в случае выбора вида контроля прав\n\"Наследование прав от связанного объекта\"\nили\n\"Наследование прав с системным контролем\"\n.\nОткрывать объекты в режиме только чтение\nОграничение возможности редактирования экземпляров данного типа.\nПри активном переключателе открытие экземпляров осуществляется в режиме просмотра.\nМетадата\nПризнак, при котором экземпляры данного типа считаются метаданными.\nПри активном переключателе будет ограничен доступ к реестру типа, не блокируя при этом работу с отдельными экземплярами.\nДля доступа к реестру метаданных необходимо обладать правом на \"Выполнение\" разрешения\n\"Просмотр метаданных\"\n.\nВкладка\n\"Внешнее соединение\"\nПараметр \"Соединение с внешней БД\" отвечает за возможность выбора внешнего хранилища данных (стандарта взаимодействия JDBC).\nГибкость Системы позволяет обеспечить работу с таблицами, хранящимися в сторонних базах данных. Возможность предусмотрена для задач интеграции.\nПодробнее можно узнать в статье\n\"Соединение с внешней БД\"\n.\nЭтап 2. Настройка атрибутов:\nПроисходит после декларации типа объекта и сохранения соответствующих изменений. Для всех атрибутов типа объекта (циклически) выполняется индивидуальная настройка.\nОпределение способа создания атрибута\nВнедрить атрибут (характеристику) в состав типа объекта можно двумя способами:\nсоздать новый атрибут (\"с нуля\" с индивидуальными настройками);\nдобавить атрибут по образцу (по существующему атрибуту в одном из типов объектов).\nПри создании нового атрибута потребуется вручную задать наименование, наименование поля для таблицы, идентификатор, уточнив подходящий тип и обязательность заполнения.\nПри создании атрибута в режиме добавления из существующего необходимо выбрать эталонный атрибут (из конкретного типа объектов либо из полного списка всех атрибутов), который будет служить образцом для последующего заимствования всех характеристик. В результате не требуется ручное заполнение идентификатора, типа, размерности и прочих характеристик.\nАктуальный перечень индивидуальных атрибутов отображается в табличном виде в разделе \"Атрибуты\" типа объекта, но для показа полного перечня атрибутов (с учетом заимствованных от родительского типа) нужно переключить чек-бокс \"Показывать атрибуты родительского типа\" в активное положение.\nСоздание атрибута предполагает определение параметров:\nНаименование – смысловое обозначение атрибута;\nНаименование поля для таблицы – англоязычное техническое наименование поля для хранения данных атрибута, которое может быть:\nсгенерировано автоматически после ввода/изменения наименования атрибута с последующим снятием фокуса с поля (с возможностью ручной корректировки);\nВ\nSaaS и Private Cloud решениях\nзначение генерируется на английском языке при помощи Яндекс сервиса. Если сервис перевода недоступен, то поле остается пустым.\nВ\nOn-Premise решении\nданный функционал выполняется в соответствии с\nсистемными настройками переводчика\n.\nПравила формирования наименования поля для таблицы.\nсервис перевода применяется только для буквенных символов;\nпри генерации наименования поля для таблицы слова в словосочетании разделяются нижним подчеркиванием;\nспецсимволы, артикли, предлоги (\nOF\n,\nFOR\n,\nIN\n,\nFROM\n,\nTO\n,\nBY\n) в наименование поля для таблицы не добавляются;\nцифры, расположенные перед буквенными символами, отбрасываются, так как наименование поля для таблицы должно начинаться с буквы;\nцифры, размещенные после буквенных символов через пробел, добавляются через нижнее подчеркивание, при отсутствии пробела – слитно;\nесли в результате перевода длина наименования поля для таблицы превышает 23 символа, то осуществляется обрезка слова/словосочетания;\nесли ранее не было ручной корректировки наименования поля для таблицы, то при изменении наименования атрибута оно будет перегенерировано автоматически;\nв зависимости от типа атрибута в наименование поля для таблицы добавляется:\nпостфикс \"_ID\" – для атрибута типа \"Объект\"/\"Файл\";\nпостфикс \"_DATE\" – для атрибута типа \"Дата\"/\"Дата и время\";\nЕсли в наименовании атрибута типа \"Дата\" присутствует термин \"Дата\", то \"DATE\" используется только в качестве постфикса.\nНапример, для наименования атрибута \"Дата обращения\" будет сгенерировано наименование поля для таблицы \"REQUEST_DATE\".\nпостфикс \"_LIST\" – для атрибута типа \"Дочерний объект\";\nпрефикс \"IS_\" – для атрибута типа \"Логический\";\nесли сервис перевода недоступен, тогда поле остается пустым.\nдобавлено ручным вводом: длиной не более 23 знаков, без пробелов и спецсимволов, состоящее из букв латинского алфавита, цифр и знаков подчеркивания, начинающееся с буквы.\nНаименование поля для таблицы не может содержать префикс SYS, WF, RF, RISK, ETL или FS, поскольку они зарезервированы исключительно для системных типов.\nС требованиями по идентификации атрибутов можно ознакомиться в\nстатье\n.\nНаименование поля для таблицы не может быть изменено после сохранения типа объекта.\nТип – назначенный тип атрибута (\"Целое число\", \"Строка\", \"Дата\" или др.);\nЗначение по умолчанию – значение, подставляемое в атрибут в случае не заполнения его пользователем или алгоритмом.\nПрочие характеристики и опции атрибутов настраиваются при необходимости. Более подробное описание приведено в статье\n\"Атрибуты\"\n.\nСоздание нового атрибута\nСпецифика реальных задач требует создания новых атрибутов. Но прежде чем создавать новый атрибут нужно убедиться, что в Системе такой атрибут еще не реализован. В случае наличия в Системе существующего атрибута осуществляется его\nдобавление\n.\nДля создания обычного атрибута активируем кнопку добавления на панели управления и заполняем формуляр основного раздела.\nСохранение изменений фиксируется кнопкой \"ОК\".\nБизнес-аналитик при проектировании типа объекта может реализовать связь со вспомогательным (справочным) типом. Создание такой связи возможно за счет использования атрибута с типом \"Объект\" при условии уточнения конкретного типа объекта (реестр которого будет выбран в качестве справочника).\nНастройка связанного со справочником атрибута\nПо стандартам проектирования наименование атрибута, который предполагает обращение к справочному значению, должно начинаться с префикса \"DICT_\".\nВ рамках решаемой задачи (ТЗ) настроим состав атрибутов для типа объектов \"Бронь номера\". Для этого последовательно создадим новые атрибуты со следующими характеристиками:\nАтрибут\nНаименование поля\n(идентификатор)\nТип\nЗначение\nпо умолчанию\nОбязательность\nДата и время поступления\nBOOKING_DATE_REG\nДата и время\nТекущая дата\nДа\nДата заезда\nBOOKING_DATE_ENTRY\nДата\nДа\nДата выезда\nBOOKING_DATE_EXIT\nДата\nДа\nКоличество гостей\nGUEST_COUNTER\nЦелое число\n1\nДа\nФИО контактного лица\nFULL_NAME_PERSON\nСтрока\nДа\nКонтактный телефон\nPHONE_NUMBER\nСтрока\nДа\nПодтверждение брони\nIS_BOOKING_CONFIRM\nЛогический\nНет\nДа\nДлительность\nBOOKING_DURATION\nЦелое число\nНет\nНет\nНомер отеля\nDICT_ROOM_ID\nОбъект\nТип объекта:\nНомера отеля\nДа\nОбратите внимание, что типом \"Объект\" с соседствующим уточнением типа объекта \"Номера отеля\" характеризуется атрибут \"Номер отеля\", указывающий выбор из списка справочника номеров отеля.\nАтрибут \"Сотрудник, зарегистрировавший заявку\" разрабатывать и настраивать не требуется, так как в составе атрибутов типа уже присутствует равнозначный атрибут \"Сотрудник, создавший объект\" (унаследованный от родительского типа \"Объект\").\nНекоторые характеристики атрибута (например, \"Тип\") в дальнейшем будут ограниченно доступны для коррекции.\nДобавление существующего атрибута\nТакой способ настройки атрибутов рекомендуется в ситуациях, когда в существующих типах объектов Системы уже имеются аналогичные атрибуты (характеристики). Метод добавления приводит в полное соответствие типы и разрядность атрибутов, что обеспечивает максимальную совместимость архитектуры данных в развитии и настройке Системы.\nДля добавления в тип объекта существующего атрибута следует нажать кнопку \"Добавить существующий\" и выбрать атрибут, который будет служить образцом, из полного списка атрибутов.\nДействие успешно завершается нажатием кнопки \"Добавить\". В результате в состав типа объекта внедряется атрибут полностью эквивалентный образцу.\nВ рамках решаемой задачи предполагается, что заявки на бронирование носят предварительный характер и не требуют точной сверки и обязательного заполнения паспортных данных. Поэтому создадим эти атрибуты необязательными.\nТак как в объектах Системы уже реализована возможность хранения паспортных данных физических лиц, то выполним добавление в состав типа \"Бронь номера\" двух существующих атрибутов.\nАтрибут\nИдентификатор в Системе\nПаспорт - серия, номер\nSC_TR_PASSPORT_ATT\nДата выдачи паспорта\nSC_TR_PASSPORTDATE_ATT\nДля этого последовательно воспользуемся выбором атрибута из полного списка атрибутов, в режиме поиска найдем требуемые атрибуты образцы и добавим их кнопкой \"Добавить\". Идентификаторы и прочие характеристики атрибутов автоматически заполнятся.\nАтрибут подготовлен\nАтрибут следует считать подготовленным при успешном завершении настройки текущего атрибута и обязательном сохранении выполненных изменений.\nРасширенные возможности типа объекта\nПри необходимости расширенные функциональные возможности типа объекта позволяют реализовать оригинальную логику обработки, контроля и заполнения данных.\nВ качестве расширенного функционала типу объекта могут быть сопоставлены:\nвыражения;\nПредставляют собой перечень алгоритмов, которые срабатывают автоматически при сохранении данных карточки объекта. Обычно выражения по некой логике выполняют автоматическое заполнение атрибутов, которые не заполнены пользователем или должны быть алгоритмически рассчитаны в зависимости от значений других атрибутов.\nВыражения могут использоваться для подстановки вычисленного алгоритмом значения в конкретный атрибут типа или программно воздействовать на атрибуты текущего объекта.\nВыражения могут наследоваться от родительских объектов вместе с заимствованными атрибутами.\nВладельцами таких выражений являются родительские типы объектов, но исполняются выражения в контексте текущего типа объекта.\nИз решаемой задачи (ТЗ) следует, что атрибут длительности в перспективе последующей автоматизации должен вычисляться автоматически, опираясь на расчет количества дней между датой заезда и датой выезда.\nРеализовать расчетное действие можно с помощью нового выражения, которое вызывает специализированный алгоритм \"Расчет длительности брони\", вычисляющий разность между датами и программно заполняющий длительность текущего объекта.\nВ рамках учебной задачи по созданию новых типов объектов новое выражение можно не создавать, так как для его написания предполагается знакомство с алгоритмами.\nПоэтому в разделе \"Выражения\" типа \"Бронь номера\" должно остаться единственное выражение, влияющее на заполнение атрибута наименование. Подробнее о выражениях можно прочитать в статье\n\"Выражения/Автокалькуляции\"\n.\nиндексы;\nИндекс предназначен для проверок и блокировки дублирования данных, а также уведомления об этом пользователей.\nНа вкладке \"Индексы\" определяются ключевые атрибуты типа объекта, за дубликатами которых требуется следить.\nВ рамках учебной задачи (ТЗ) будет полезно создание индекса уникальности номеров, исключающего случайную вставку дубликатов в справочник номеров отеля. Подробнее с индексами можно познакомиться в статье\n\"Ключи, индексы и ограничения\"\n.\nпроверки;\nПредставляют собой разновидность алгоритмических выражений, предназначенных для принятия решений. В основе проверки лежит алгоритм, возвращающий значение \"Истина\" или \"Ложь\" в зависимости от ситуации с заполнением атрибутов на карточке объекта.\nЕсли список проверок типа объекта не пуст, то при сохранении данных карточки объекта автоматически выполняются все проверки. Если какая-либо проверка не пройдена, то Система блокирует сохранение данных и извещает пользователя об ошибке валидации входных данных.\nВ рамках учебной задачи (ТЗ) в перспективе последующей автоматизации может быть создана проверка ситуации ошибочной хронологии (например, \"Дата заезда\" оказалась позже \"Даты выезда\").\nПроверка может быть названа \"Проверка даты выезда (бронь)\" и возвращать \"Истина\", если хронология атрибутов не нарушена, или \"Ложь\" - в противном случае.\nПроверка может быть создана в следующей алгоритмической логике:\nВ рамках учебной задачи по созданию новых типов объектов проверку можно не создавать, так как для ее реализации предполагается знакомство с алгоритмами. Поэтому в разделе \"Проверки\" типа \"Бронь номера\" может не быть никаких проверок. Подробнее о проверках можно узнать в статье\n\"Проверки для объектов\"\n.\nрасширения;\nПредставляет собой набор функциональных инструментов для синхронизации атрибутов между различными типами объектов.\nРазделяются на основные (увеличивает атрибутивный состав расширяемого типа) и потенциальные (происходят по запросу пользователя).\nПрименяется в случае включения в состав карточки объекта атрибутов, относящихся к объектам других типов. Подробнее о расширениях можно узнать в статье\n\"Расширения\"\n.\nсобытия.\nВ разделе \"События\" типу объекта могут быть назначены алгоритмы, срабатывающие до и после сохранения карточки объекта типа.\nАлгоритм, сопоставленный событию \"До сохранения\" получит доступ и сможет обработать исходные данные карточки (до их правки).\nАлгоритм, сопоставленный событию \"После сохранения\" получит доступ именно к уже исправленным и сохраненным данным карточки.\nСобытия могут использоваться для логирования принципиальных изменений существенных атрибутов.\nПодробнее о событиях можно узнать в статье\n\"События\"\n.\nТип объекта создан\nПосле настройки всех атрибутов и успешного сохранения изменений становится возможной последующая работа с реестром данных и настройка режима доступа.\nОдноименные командные элементы основных и расширенных действий становятся доступны на панели верхнего меню.\nПервичное заполнение данных в реестре спроектированного типа объекта можно посмотреть в статье\n\"Работа с реестром объектов\"\n.\nПро настройку прав доступа к типу объекта изложено в статье\n\"Общий порядок настройки прав доступа\"\n.\nВыводы\nПоявление в Системе новых типов объектов позволяет не только создавать экземпляры объектов и вносить их в реестр, но и развивать бизнес-логику Системы, приспосабливая ее под актуальные потребности бизнеса.\nРасширенные настройки объектов не заменяют необходимость последующей разработки бизнес-процессов, но могут выполнять множество проверок, функций контроля и прочих рутинных действий.\nВизуал любого объекта Системы (в том числе карточки заполнения нового типа объекта) может быть настроен под потребности заказчика.\nПодробнее о визуальной настройке смотрите в статье\n\"Настройка визуала экземпляра\"\n.",
  "source": "https://docs.greendata.ru/platform/ru/creating-new-object-types.html"
}