{
  "title": "Создание обновлений из объекта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСоздание обновлений из объекта\nФайл обновления (*.guf) может быть создан непосредственно из  объекта Системы. Для этого необходимо выполнить ряд шагов, рассмотренных далее.\nВозможность формирования файлов обновления предоставляется только пользователям, которые обладают\nразрешением \"Сбор обновлений\"\n.\n1. Открыть объект Системы, файл обновления которого необходимо создать.\n2. Нажать на кнопку\nв панели управления.\nДалее осуществляется выбор одного из действий:\nПеречень доступных действий зависит от объекта системы.\nдобавить в обновление\n– добавление изменений текущего типа объекта или объекта в состав обновлений (полный состав обновлений типа объекта отображается только при создании\nобновления посредством мастера\n);\nдобавить права в обновление\n– добавление прав доступа для текущего объекта Системы в состав обновления;\nистория обновлений\n– просмотр истории обновлений текущего объекта;\nпересчет выражений по экземплярам типа\n– добавление в состав обновления действия по пересчету выражений по экземплярам типа объекта;\nВ контекстном меню действие отображается при создании обновления из карточки типа объекта.\nвыполнить алгоритм\n– добавление в состав обновления действия по запуску алгоритма по заданным параметрам;\nВ контекстном меню действие отображается при создании обновления из карточки алгоритма.\nдобавить удаление объекта\n– добавление в состав обновления операции удаления объекта.\nВ контекстном меню действие отображается при создании обновления из\nкорзины\n.\n3. Сформированный файл можно\nскачать\nдвумя способами:\nнажать на кнопку\nв уведомлении о формировании файла обновления;\nперейти в\nмастер создания обновлений\n, где сформированные файлы доступны для скачивания.\nНаименование сформированного файла обновлений формируется следующим образом:\n\"Дата\" + \"Время_UTC\" + \"Определение обновляемого объекта\" + \"Наименование объекта\".\nНапример, \"2019-03-26_12-14-51-Тип объекта-Заявка на принятие решения.guf\".\nДобавить в обновление\nПри выборе действия \"Добавить в обновление\" откроется модальное окно для настройки формируемого файла обновления, в котором могут быть определены следующие параметры:\nПараметр\nНазначение\nВключить объекты\nОбновление всех экземпляров текущего типа объекта.\nПризнак доступен только\nв случае работы с типами объектов\n, при формировании обновления из карточки экземпляра данный параметр отсутствует.\nЗаменить значения\nЗамена или удаление объектов (атрибутов, выражений, индексов, алгоритмов ЖЦ и/ или проверки) на стенде, куда устанавливается обновление, если они видоизменены или удалены на текущей схеме.\nВместе с тегами\nВключение в обновление\nтегов\nобъекта.\nВместе с правами\nДобавление в состав обновления прав доступа на объект.\nПри\nустановке обновления\nна целевой стенд данные права будут добавлены в дополнение к уже имеющимся.\nЗаменить права\nЗамена прав доступа на обновляемый объект.\nЕсли на целевом стенде правами на объект обладают субъекты безопасности (группы/пользователи), отсутствующие в обновлении, в результате\nустановки обновления\nданные субъекты будут лишены прав.\nНастройка доступна в случае выбора признака \"Вместе с правами\".\nЗаменить права по умолчанию\nЗамена ранее настроенных на типе объекта\nправ по умолчанию\n.\nДанный параметр не распространяется на уже существующие объекты типа.\nНастройка применима  при работе с типами объектов со следующим\nвидом контроля прав\n:\nВсе пользователи имеют право на чтение\n;\nСистемный контроль прав\n;\nСистемный контроль прав по группам.\nНастройка доступна в случае выбора признака \"Вместе с правами\".\nВключить изменение прав доступа на экземпляры\nПересчет прав доступа на все существующие объекты типа в соответствии с настройкой\nизменения прав на экземпляры\n.\nНастройка применима  при работе с типами объектов со следующим\nвидом контроля прав\n:\nВсе пользователи имеют право на чтение\n;\nСистемный контроль прав\n;\nСистемный контроль прав по группам.\nНастройка доступна в случае выбора признака \"Вместе с правами\".\nПрименить права по умолчанию к существующим объектам\nПрименение\nправ по умолчанию\nк существующим объектам типа.\nДанный параметр не изменяет\nправа по умолчанию\nна типе объекта.\nНастройка применима  при работе с типами объектов со следующим\nвидом контроля прав\n:\nВсе пользователи имеют право на чтение\n;\nСистемный контроль прав\n;\nСистемный контроль прав по группам.\nВключить только измененные зависимые объекты\nОбновление измененных объектов в определенный день и/ или определенным сотрудником. После выбора признака доступны поля для ввода значений:\nдата, когда были внесены изменения;\nпользователь, которым были внесены изменения.\nПо умолчанию указывается текущий пользователь\n.\nОбратите внимание, что при формировании guf-файла для\nвизуала карточки объекта или реестра\nданный параметр не применим.\nТо есть в файле обновления будут учитываться изменения всех пользователей.\nПосле настройки параметров следует нажать на кнопку \"Ок\", в результате чего Система сгенерирует файл обновления и уведомит об этом в правом нижнем углу экрана.\nДобавить права в обновление\nПри выборе данного действия откроется модальное окно, где могут быть дополнительно указаны параметры, назначение которых описано в таблице\nвыше\n.\nПеречень доступных действий зависит от объекта системы.\nПосле настройки параметров необходимо нажать на кнопку \"Добавить в обновление\", в результате чего Система сформирует guf-файл,\nуведомив пользователя\n.\nИстория обновлений\nПри просмотре истории обновлений объекта Система отобразит данные об объекте в таблице.\nПересчет выражений по экземплярам типа\nВыбор действия \"Пересчет выражений по экземплярам типа\" из\nпанели управления\nдоступен при формировании обновления из карточки\nтипа объекта\n.\nФункционал обновлений по пересчету выражений по экземплярам системного типа недоступен.\nПо нажатию на действие отобразится модальное окно, в котором необходимо задать следующие настройки:\nПараметр\nНазначение\nТип объекта\nТип объекта, по которому необходимо пересчитать выражение.\nПри установке обновления выполнение пересчета значений по экземплярам указанного типа происходит автоматически.\nЗначение параметра определяется автоматически текущим типом объекта, из которого собирается обновление.\nВыражения / Автокалькуляции\nВыбор\nвыражений/автокалькуляций\n, при помощи которых будет произведен пересчет по экземплярам указанного типа объекта.\nЗначение параметра выбирается через выпадающий список из экземпляров типа \"Выражение/Автокалькуляция\" [SYS_OBJ_TYPE_EXP], соответствующих указанному типу объекта.\nВключая дочерние типы\nРегулирует необходимость пересчета выражений по экземплярам наследуемых типов объектов.\nПри активном признаке пересчет выражения будет выполнен по экземплярам типа, выбранного  в поле \"Тип объекта\", и по всем экземплярам наследуемых от него типов объектов.\nЕсли у наследуемого типа выражение переопределено, то пересчет по экземплярам такого типа не осуществляется.\nПри неактивном признаке пересчет выражения будет выполнен только по экземплярам типа, выбранного  в поле \"Тип объекта\".\nПо умолчанию признак активен.\nВыполнить алгоритм\nВыбор действия \"Выполнить алгоритм\" из\nпанели управления\nдоступен при формировании обновления из карточки\nалгоритма\n.\nФункционал обновлений по выполнению системного алгоритма недоступен.\nПо нажатию на действие отобразится модальное окно, в котором необходимо задать следующие настройки:\nПараметр\nНазначение\nАлгоритм для выполнения\nАлгоритм, который будет выполнен автоматически при установке обновления.\nЗначение параметра определяется автоматически текущим алгоритмом, из которого собирается обновление.\nУказанный алгоритм будет добавлен в обновление.\nВыбрать объект для выполнения\nРегулирует необходимость выбора объекта, по которому будет выполняться алгоритм.\nПо умолчанию параметр неактивен.\nТип объекта\nВыбор типа объекта, по экземпляру которого будет выполнен алгоритм.\nТип объекта выбирается через выпадающий список из экземпляров типа \"Тип объекта\" [SYS_OBJ_TYPE].\nЕсли у алгоритма указан базовый тип объекта, то параметр будет автоматически заполнено данным значением.\nПараметр отображается при активном признаке \"Выбрать объект для выполнения\".\nОбъект\nВыбор экземпляра типа объекта, по которому будет выполнен алгоритм.\nОбъект выбирается через выпадающий список из экземпляров типа, указанного в параметре \"Тип объекта\".\nПараметр отображается при активном признаке \"Выбрать объект для выполнения\".\nПропускать ошибки при выполнении\nОпределяет возможность установки обновления при наличии ошибки при выполнении алгоритма.\nЕсли параметр активен, то при установке обновления в случае наличия ошибок при выполнении алгоритма настройка \"Выполнение алгоритма\" будет пропущена.\nЕсли параметр неактивен, то при установке обновления в случае наличия ошибок при выполнении алгоритма  обновление не будет установлено, пользователю отобразится соответствующая ошибка.\nПо умолчанию параметр неактивен.\nОтчетная дата\nПризнак, определяющий выполнение алгоритма на заданную дату. Активирует поле для ввода даты, на которую будет сохранен расчет.\nПо умолчанию параметр неактивен.\nДата актуальности\nПризнак, определяющий выполнение алгоритма с теми значениями\nисторических атрибутов\n, которые были сохранены на указанную дату. Активирует поле для ввода даты актуальности.\nПо умолчанию параметр неактивен.\nПараметры\nОпределение значений параметров алгоритма.\nПоле активно при наличии параметров в собираемом в обновление алгоритме.",
  "source": "https://docs.greendata.ru/platform/ru/creating-updates-from-the-object-profile.html"
}