{
  "title": "filterSource",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nfilterSource\nФункция используется для ограничения перечня объектов при помощи ранее созданного фильтра на основе\nисточника данных\n.\nФункция используется совместно с функцией\nobjectsWithOptions\n.\nСинтаксис\nfilterSource\n(filterIdObj, [param: paramValue])\nПараметр\nНазначение\nfilterIdObj\nФильтр\nна основе источника данных, определяемый типом \"Фильтр\" [SYS_FILTER].\nparam\nПараметры фильтра, перечисленные через запятую (при их наличии).\nПараметр необязательный. Используется при наличии параметров фильтра.\nparamValue\nЗначения параметров фильтра.\nЗначения параметров могут быть переданы, например, при помощи функций\nattr\n,\ndict\n,\nvar\n.\nПараметр необязательный. По умолчанию используется значение null.\nПримечание\nВызов функции осуществляется с вкладки\n\"Источники\"\nпанели инструментов редактора алгоритмов, в результате чего откроется модальное окно, в котором необходимо выбрать фильтр и нажать на кнопку \"Готово\".\nПри вызове функции в код алгоритма будет добавлена функция с параметрами фильтра (при их наличии), для которых необходимо определить значения вместо фиктивных переменных\n\"null\"\n.\nИсточник данных для фильтра должен содержать только\nодно поле\n.\nПример\nНеобходимо сформировать список именинников будущего месяца среди сотрудников компании.\nАлгоритм может принять следующий вид:\nС помощью функции\nfilterSource\nв код алгоритма добавляется фильтр на основе источника данных с параметром \"next_month\" для определения номера следующего месяца.\nПодробнее о создании фильтра.\nВ первую очередь необходимо создать\nисточник данных на основе SQL\nследующего вида:\nнеобходимо указать наименование и идентификатор источника данных в соответствующих полях;\nв поле \"Текст SQL-запроса\" следует сформировать запрос для получения всех активных сотрудников, у которых день рождения в следующем месяце;\nво встроенном реестре \"Параметры объекта\" создать параметр \"next_month\", с помощью которого будет передаваться номер будущего месяца.\nДалее необходимо создать фильтр на основе источника данных, в настройках которого указать:\nнаименование фильтра;\nбазовый тип объекта, объекты которого фильтруются – \"Сотрудник\";\nисточник – настроенный ранее источник данных \"Именинники месяца\";\nпараметр фильтра \"next_month\", с помощью которого в алгоритме будет передаваться номер будущего месяца.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nОбъявление новых переменных выполняется с помощью функции\nvar\n.\nДля получения номера следующего месяца используются функции\ngetMonth\n,\nplusMonths\nи\ncurrentDate\n.\nПоиск именинников реализуется циклом посредством функции\nforEach\n, где коллекция объектов задается функцией\nobjectsWithOptions\n, в качестве параметра фильтрации которой выбирается ранее созданный фильтр посредством функции\nfilterSource\n.\nАтрибуты \"Фамилия\" и \"Имя\" добавляются при помощи\nattrByVar\n.\nДля отображения результата выполнения алгоритма в логе применяется функция\nprintout\nс использованием функции\ntext\n.\nВ результате выполнения алгоритма в логе будет отображен сформированный список:",
  "source": "https://docs.greendata.ru/platform/ru/filtersource.html"
}