{
  "title": "treeObjects",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ntreeObjects\nThe function returns a collection of\nhierarchical object types\ndown the hierarchy from the specified node.\nSyntax\ntreeObjects\n(typeObj, [rootNode], rootNodeInCollection, [useDepthPath])\nSetting\nPurpose\ntypeObj\nObject type represented by the hierarchy.\nrootNode\nRoot node - a tree node in the form of an instance of this object type (used optionally).\nParameter is used optionally. If the root node is not selected (null is specified), then all objects of the specified type will be added to the collection.\nrootNodeInCollection\nBoolean parameter (true/false) that determines the calculation on the specified root node.\nuseDepthPath\nBoolean parameter (\ntrue/false\n) that determines the sorting of the resulting collection of objects, specifically:\nif the parameter value is\ntrue\n, the objects will be sorted\nby hierarchy branches\n(child objects will be grouped under their respective parent), and then by ascending Object IDs;\nif the parameter value is\nfalse\n, the objects will be sorted\nby hierarchy levels\n(from top to bottom), and then by ascending Object IDs.\nThis parameter is optional. If not specified, the default value is true.\nNote\nThe function is called from the\n\"Objects\" tab\nof the algorithm editor’s toolbar.\nA modal window is displayed, requiring the following actions:\nin the \"Object type\" field, select a\nhierarchical object type\n;\nin the \"Root node\" field, specify the object (node) from which the collection will include objects located lower in the hierarchy;\nuse the \"Include root node in collection\" parameter to define whether to add the specified node to the collection.\nUse example\nTo obtain a list of departments in France that belong to the Île-de-France region, the system object type\n\"Region\"\nis used, which is intended for storing country region lists.\nThe following algorithm structure is proposed:\nWhen writing the algorithm, the treeObjects function is called. During its configuration, the object type \"Region\" is selected, and the root node \"Île-de-France\" is specified, which will be added to the collection.\nThe output of the resulting object collection to the algorithm log is performed using the\nprintout\nfunction through a loop over the object collection with the\nforEach\nfunction. The \"Name\" attribute is specified using the\nattrByVar\nfunction.\nAs a result of algorithm execution, the following data will be written to the algorithm operation log:",
  "source": "https://docs.greendata.ru/platform/en/treeobjects.html"
}