{
  "title": "Промежуточное/граничное событие (Intermediate/boundary throw event)",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПромежуточное/граничное событие (Intermediate/boundary throw event)\nПромежуточное событие\nпроисходит на отрезке, ограниченном Начальным и Конечным\nсобытиями\n.\nПримером промежуточного события является автоматическое уведомление пользователя (например, для исполнителя задачи при её назначении).\nПромежуточное событие оказывает влияние на ход процесса\n, но не может являться началом или завершением бизнес-процесса.\nДля выбора типа промежуточного события необходимо на панели действия события нажать\n:\nНапример:\nИнициатор промежуточного события-сообщения (Message intermediate throw event)\nОбработчик промежуточного события-таймера (Timer intermediate catch event)\nОбработчик промежуточного события-сигнала (Signal intermediate catch event)\nИнициатор промежуточного события-сигнала (Signal intermediate throw event)\nПараметры Промежуточного события:\nНаименование поля\nЗначение\nНаименование\nОтображение наименования элемента.\nИдентификатор\nОтображение идентификатора элемента.\nПроцесс\nОтображение наименования бизнес-процесса, в котором используется элемент.\nТип события\nОтображение наименования типа события элемента.\nСостояние объекта\nВыбор состояния объекта из справочника Системы.\nПризнак прерывания задачи\nОтображение признака прерывания задачи.\nПо умолчанию используется значение \"Нет\".\nЭтап процесса\nОтображение наименования этапа бизнес-процесса.\nЭлемент\nПромежуточное событие\n(сигнал-ожидание) ожидает и обрабатывает сигналы и в том случае, если сигнал-передатчик (\nSignal intermediate throw event\n) находится в подпроцессе (не в основном процессе). Например, при настройке бизнес-процесса \"Принятие решения по заявке\", промежуточное событие \"Передача заявки для подготовки заключения\" ожидает сигнала от источника.\nПри этом источник сигнала \"Передача заявки для подготовки заключения\" расположен в подпроцессе \"Принятие решения Rm\" (\"Принятие решения риск-менеджером\").",
  "source": "https://docs.greendata.ru/platform/ru/intermediate-throw-event.html"
}