{
  "title": "Источники данных",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИсточники данных\nИсточник данных\n– это выборка данных, систематизированных по определенным критериям. Критерии выборки задаются с помощью запроса к базе данных (на языке SQL).\nТермин \"Источник данных\" можно интерпретировать как\nзапрос к базе данных Системы\n, представляющий собой набор атрибутов из одной или нескольких таблиц (типов объектов) Системы.\nПросмотр карточки источника данных доступен пользователям, имеющим право на выполнение следующих действий:\n\"Чтение экземпляров типа\" для соответствующего типа объектов – \"Источник данных на основе SQL\" [RF_SQL_DATA_SOURCE] и/или \"Объектный источник данных\" [RF_DATA_SOURCE];\n\"Чтение\" соответствующего экземпляра источника.\nДля просмотра настроек (параметров) источника также необходимо обладать правом на выполнение\nразрешения\n\"Просмотр метаданных\".\nФункционал Системы позволяет реализовать настройку следующих видов источников данных:\nИсточник данных на основе SQL\n– ввод непосредственно SQL-запроса. Тип объекта \"Источник данных на основе SQL\" [RF_SQL_DATA_SOURCE];\nОбъектный источник данных\n– задание правил выбора и отображения данных пользователем через интерфейс. На основании действий пользователя Система будет осуществлять автоматическое формирование SQL-запроса. Тип объекта \"Объектный источник данных\" [RF_DATA_SOURCE];\nИсточник данных на основе алгоритма. Тип объекта \"Алгоритм. Карточки объектов\" [SYS_ALG_CARD].\nСформированная информация используется в последующей работе пользователей и отображается (при соответствующей настройке):\nв отчетных формах (\nподробнее\n);\nв печатных формах (\nподробнее\n);\nв дашбордах (\nподробнее\n).\nВ случае изменения источника данных используемый инструмент для его отображения необходимо перенастроить вручную. В том числе требуется актуализация используемых фильтров источника.\nИсточник данных может использоваться для\nфильтрации\nданных.",
  "source": "https://docs.greendata.ru/platform/ru/data-sources.html"
}