{
  "title": "attrByVar",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nattrByVar\nReturns the value of an instance attribute of a given type via a variable declared earlier using\nvar\n.\nSyntax\nThe syntax of the function depends on the choice of function signs.\nvariable.attr\nvariable.setAttr (attr, value)\nvariable.setAttr (attr, value, date)\nSign\nPurpose\nSet  value\nDefines the assignment of a value to the selected attribute. That is, by means of this function the transformation of the used attribute values is performed. The\nsave\nfunction must be used to save the transformations.\nSpecify attribute type\nDetermines how to handle attributes of the\nchild object type\n. The sign is active after selecting a parent object attribute, similar to the\nattr\nfunction.\nSetting\nPurpose\nvariable\nThe variable with attribute-collection value, previously declared in the current algorithm via the\nvar\nfunction.\nattr\nThe attribute of the selected variable.\nvalue\nThe value assigned to the attribute.\nWhen the function is called, a dummy variable\n\"null\"\nis set, which should be replaced with the required value.\ndate\nThe date for which the value is assigned. The parameter applies to\nhistorical-attribute\n.\nWhen the function is called, a dummy variable\n\"currentDate()\"\nis set, which should be replaced with the required value.\nThe value is assigned within the given period of dynamics (\nfield \"Discreteness of time dependence\"\n).\nIf the\nhistorical-attribute\ndynamics period is not set, the data is fixed until the next value is entered.\nNote\nThe function is called using the\nbutton, located in the Algorithm Editor on the \"Algorithms\" tab.\nAfter that a modal window opens where it is necessary to select the variable and then the attribute whose value should be returned.\nIf it is necessary to select a function sign, check the corresponding checkbox.\nThe attribute selection is limited to the object type of the declared variable (that is, attributes of the object type previously declared via the\nvar\nfunction in the current algorithm are available).\nExamples\nExample 1\nCreate a \"Guarantee\" object with the following attribute values:\nnumber of days for property insurance - 100;\ncurrency of the sum insured - USD.\nThe\nattrByVar\nfunction is used to set attribute values. It is selected for each attribute with the \"Set Value\" sign:\nThe number of days for insurance is specified manually;\nThe currency of the amount to be covered is determined by the\ndict\nfunction (selecting the System’s directory value).\nOther functions were also used to write this algorithm.\nMore details\nThe new variable is defined using the\nvar\nfunction.\nThe\nnewInstance\nfunction is used to create a new profile of the \"Guarantee\" object type.\nThe\nsave\nfunction must be used to save the changes in the created instance.\nExample 2\nIt is necessary to set an order limit: the order sum must be no more than $500.\nThe calculation algorithm can be represented as follows:\nThe attrByVar function is used to access the attributes of the i variable.\nOther functions were also used to write this algorithm.\nMore details\nThe variable is declared using the\nvar\nfunction.\nThe\nattr\nfunction is used to access the attributes of the current object.\nThe\nforEach\nfunction is used to make a collection loop.\nThe\nreturn\nfunction is used to return the value.",
  "source": "https://docs.greendata.ru/platform/en/attrbyvar.html"
}