{
  "title": "ETL. Трансформатор. Разбор XML",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nETL. Трансформатор. Разбор XML\nТрансформатор \"ETL. Трансформатор. Разбор XML\" используется для преобразования данных в формате XML в динамическую структуру.\nДля выполнения обратной операции (преобразования динамической структуры в строку формата XML) используется\n\"ETL. Трансформатор. Сериализация динамической структуры\"\n.\nНастройка\nТрансформаторы ETL настраиваются в\nпреобразователе данных\n, добавленном на\nсхему\nETL-процесса.\nДля настройки используется следующий набор параметров:\nПараметр\nНазначение\nНаименование\nНазвание созданного трансформатора.\nПорядок\nВвод порядкового номера трансформатора для определения последовательности запуска при наличии нескольких трансформаторов.\nКоллекция входных данных\nВыбор элемента динамической структуры (поля типа STRING), значение которого необходимо преобразовать.\nКоллекция выходных данных\nВыбор элемента динамической структуры, в который будет передаваться полученное значение.\nЕсли входной объект XML содержит одно поле, то в качестве коллекции выходных данных указывается нода, предполагающая разбор этого поля.\nЕсли во входном объекте XML более одного поля, то в качестве коллекции выходных данных указывается элемент (объект), в который предполагается разбор структуры объекта XML.\nПродолжить работу ETL при возникновении ошибки\nПризнак, используемый для игнорирования ошибок работы трансформатора.\nПродолжить обработку данных при возникновении ошибки\nПризнак, используемый для игнорирования ошибок обработки отдельных элементов динамической структуры (коллекции).\nПример\nДопустим, источник содержит строку формата XML, которую необходимо представить в виде динамической структуры:\n{\n\"rows\"\n: {\n\"XML\"\n:\n\"<?xml version=\\\"1.0\\\" encoding=\\\"UTF-8\\\" standalone=\\\"no\\\"?>\\n<ETL_SCHEMA_ROOT>\\n  <row>\\n    <name>Объект</name>\\n    <id>2</id>\\n  </row>\\n  <row>\\n    <name>Тип объекта</name>\\n    <id>15</id>\\n  </row>\\n</ETL_SCHEMA_ROOT>\\n\"\n}\n}\njson\nCopied!\nПредварительно добавим в выходную структуру\nпреобразователя данных\nсоответствующие элементы динамической структуры для хранения полученного значения:\nДля преобразования строки формата XML в динамическую структуру необходимо настроить трансформатор со следующими параметрами:\nВ результате чего выходная структура данных примет следующий вид:\n{\n\"rows\"\n: {\n\"XML_parsing\"\n: {\n\"row\"\n: [\n{\n\"name\"\n:\n\"Объект\"\n,\n\"id\"\n:\n2\n},\n{\n\"name\"\n:\n\"Тип объекта\"\n,\n\"id\"\n:\n15\n}\n]\n}\n}\n}\njson\nCopied!",
  "source": "https://docs.greendata.ru/platform/ru/etl-transformer-xml-parsing.html"
}