{
  "title": "Встраивание собственной объектной модели в диаграмму Ганта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВстраивание собственной объектной модели в диаграмму Ганта\nВ данной статье рассматривается частный случай использования инструмента \"Диаграмма Ганта\", а именно встраивание объектной модели пользователя.\nПорядок создания Диаграммы\nПроцесс создания диаграммы Ганта аналогичен описанному в статье\nНастройка диаграммы Ганта\n. Но в случае, когда требуется встраивание пользовательской объектной модели, в окне настроек диаграммы выбирается \"Использовать собственные типы Проекта и Задачи\".\nПосле чего в окне настроек отобразятся дополнительные параметры.\nВ поле \"Тип объекта системы для привязки проекта\" по умолчанию используется тип объекта \"Диаграмма Ганта. Базовый проект\", который при необходимости можно заменить на собственный тип объекта, выполняющий роль проекта, а в поле \"Проект\" указать экземпляр выбранного типа объекта.\nПри выборе типа \"Диаграмма Ганта. Базовый проект\", заполнение поля \"Проект\" не обязательно, при сохранении настроек новый проект сгенерируется автоматически. В качестве наименования проекта будет использовано название диаграммы.\nЕсли пользователь выбирает собственный тип объекта системы для привязки проекта, то заполнение поля \"Проект\" является обязательным!\nСобственный тип - это дочерний тип объекта \"Диаграмма Ганта. Базовый проект\", в качестве Проекта которого выбирается созданный экземпляр данного типа объекта, подробнее об\nархитектуре объектов системы\n.\nДля сохранения настроек диаграммы требуется нажать на кнопку сохранения\nна панели управления, после чего в шапке страницы отобразится кнопка \"Открыть Диаграмму Ганта\", которую следует нажать непосредственно для перехода к представлению диаграммы.\nПредставление Диаграммы\nОбщее представление инструмента \"Диаграмма Ганта\" подробно описано\nв статье\n.\nДля отображения актуальных данных задач встроенной объектной модели будет необходимо обновить представление диаграммы посредством иконки\nв правом верхнем углу (данное действие следует повторять после внесения изменений в экземпляры задач/подзадач, используемых для построения текущей диаграммы).\nРабота с диаграммой Ганта\nДобавление и изменение Задач\nПомимо методов создания задач, описанных в\nстатье\n, при использовании собственных типов Проекта и Задач могут быть добавлены внешние задачи.\nДля добавления внешних задач в окне настройки диаграммы на панели реестра задач \"Добавьте уровни Задач и Подзадач для диаграммы Ганта\" следует нажать на кнопку\n.\nОткроется модальное окно, в котором необходимо задать наименование уровня, выбрать тип объекта в поле \"Тип объекта системы для привязки задачи/подзадачи*\" и указать его объектный атрибут в поле \"Проект\".\nВыбираемый тип объекта системы должен содержать объектный атрибут со ссылкой на тип объекта \"Диаграмма Ганта. Базовый проект\".\nВ блоке \"Привяжите поля указанных типов Задач к полям диаграммы Ганта\" необходимо указать атрибуты выбранного типа, сопоставив их с атрибутами-источника связанного Типа объекта.\nК атрибутам, обязательным для заполнения, относится название задачи,а также даты начала и окончания задачи. Поля данных атрибутов подсвечены красной окантовкой.\nПри выборе атрибутов своего типа в выпадающем списке будут отображены только атрибуты сопоставимые по типу данных с атрибутом базового типа.\nДля последующего добавления ресурсов следует заполнить поле \"Пользовательский справочник ресурсов для выполнения задачи\" в нижней части окна настроек, указав необходимый тип объекта. В качестве ресурсов могут выступать сотрудники, инструменты, техника или оборудование, необходимые для выполнения проекта.\nНапример, в рамках проекта требуется указать человеческий ресурс, в таком случае можно выбрать тип объекта \"Должность\".\nЭкземплярами данного типа могут быть представлены должности сотрудников компании:\nДля сохранения внесённых данных следует нажать на иконку сохранения в верхней части окна, а для закрытия окна с внесёнными изменениями на кнопку \"Ок\" в правом нижнем углу окна настроек.\nПри первом сохранении сгенерируются задачи типа \"Диаграмма Ганта. Задачи\", количество экземпляров будет равняться количеству экземпляров типа объекта пользователя.\nДобавление подзадач\nДля добавления второго и последующего уровней подзадач также следует нажать на кнопку\nна панели реестра задач \"Добавьте уровни Задач и Подзадач для диаграммы Ганта\".\nВ открывшемся модальном окне заполнение данных производится аналогично первому уровню задач, за исключением того, что после заполнения поля \"Тип объекта системы для привязки задачи/подзадачи*\" необходимо указать родительскую задачу в соответствующем поле.\nВ поле \"Родительская задача\" указывается объектный атрибут типа объекта, выбранного для привязки задачи/подзадачи, со ссылкой на родительский тип объекта:\nВ родительском типе объекта при этом необходимо добавить дочерний атрибут со ссылкой на тип объекта, используемого для привязки задачи/подзадачи, и выбором созданного ранее объектного атрибута в качестве связи:\nПосле сохранения введенные данные отобразятся в реестре задач.\nДля перехода к представлению диаграммы, построенной на основе собственной объектной модели, следует нажать на кнопку \"Открыть диаграмму Ганта\", расположенную на панели управления.\nОтредактировать данные задачи, настроить связь между задачами можно в таблице в левой части экрана представления диаграммы либо в правой части окна в области диаграммы. А также при помощи карточки задачи, перейти к которой можно при помощи нажатия на иконку редактирования рядом со строкой задачи либо посредством двойного клика по строке задачи.\nИзменения, внесенные во внешнюю задачу, также будут сохранены в экземпляре типа.\nСоздание карточки внешней задачи\nДля формирования списка задач и подзадач собственной объектной модели необходимо перейти в реестр типа объекта, добавленного в качестве уровня задач и подзадач диаграммы Ганта, и создать экземпляры типа.\nЗаполнение значений атрибутов, сопоставимых в настройках диаграммы Ганта с атрибутами-источника \"Название задачи\", \"Дата начала задачи\", \"Дата окончания задачи\" связанного Типа объекта является обязательным.\nВ качестве объектного атрибута со ссылкой на тип объекта \"Диаграмма Ганта. Базовый проект\" указывается необходимая диаграмма Ганта.\nКарточка задачи Диаграммы\nВ карточке задачи для редактирования доступны следующие параметры:\nнаименование задачи;\nдата начала задачи;\nнесмещаемость дат начала и окончания задачи;\nпродолжительность выполнения задачи, в рабочих днях (изменение данного параметра влияет на значение поля \"Дата окончания задачи\", указывается как целочисленное значение);\nпрогресс выполнения задачи (в %);\nописание задачи;\nпоследовательность задач и смещения сроков относительно друг друга, при помощи которой задается связь между задачами. Указывается в формате целочисленного значения (порядковый номер задачи), в случае необходимости создания связей текущей задачи с несколькими другими значения следует указывать через запятую.\nСоздавать связь между задачами рекомендуется не в карточке задачи, а непосредственно в области диаграммы:\nродительская задача - это параметр, при помощи которого посредством выпадающего списка в поле \"Родительская задача\" из доступных задач проекта выбирается родительская задача по отношению к текущей задаче;\nресурсы (сотрудники, инструменты, техника или оборудование, необходимые для выполнения проекта). Для определения ресурсов задачи следует в нижней части карточки задачи в блоке \"Ресурсы\" нажать на кнопку\nи в открывшемся окне выбрать Ресурс, указать % использования ресурса и его порядок.\nВыбор ресурсов задач, добавленных методами, описанными в\nстатье\nосуществляется из экземпляров типа объекта \"Диаграмма Ганта. Ресурсы\" [SYS_GANTT_RESOURCE].\nВыбор ресурсов для задач, связанных с внешними задачами, осуществляется из экземпляров типа объекта, выбранного в окне настроек диаграммы в поле \"Пользовательский справочник ресурсов для выполнения задачи\".\nТакже в карточке задачи имеются не редактируемые поля, такие как:\nдата окончания задачи. Значение данного поля устанавливается автоматически. При создании новой задачи определяется значением даты начала задачи, данное значение пересчитывается при вводе количества рабочих дней продолжительности задачи;\nссылка на пользовательскую задачу. Если задача связана с внешней задачей, поле заполняется автоматически, при этом имеется возможность перехода по ссылке на связанную задачу;\nстатус задачи - параметр, демонстрирующий статус выполнения текущей задачи, изменение которого доступно только в таблице задач представления Диаграммы Ганта;\nскрыть из диаграммы. Данный параметр показывает отображена ли текущая задача на Диаграмме Ганта, при активном положении переключателя задача является скрытой.\nДля сохранения внесенных изменений в карточку задачи необходимо нажать на кнопку \"Сохранить задачу\".",
  "source": "https://docs.greendata.ru/platform/ru/embedding-object-model-in-gantt-chart.html"
}