{
  "title": "Audit",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nAudit\nAuditing improves the data integrity level in the database.\nData changes are recorded automatically in the System and do not require user actions. The audit log permanently stores all data changes, including:\nsystem updates\nuser actions in the System\ndata changes made by a particular user at a specific time\nThe audit log organizes a single storage for all changes in the database. Choose the\nAudit\nmenu item to view the log.\nThe log of most types of audit is viewed after the following menu items are selected: Administration → Audit.\nA complete list of all types of auditing is available in\nthe object type registry\n.\nThe System supports the following types of audit:\nActions audit\n(recording user actions in the System);\nChanges audit\n(recording data changes made to the System by the user);\nUpdate audit (recording the\nInstall updates\noperation with extended data);\nPermissions audit (recording actions related to access permissions);\nAccess groups audit (recording the changes of access groups and whether users belong to them);\nSession audit\n.\nActions audit\nThis type of audit records all user actions performed in the System.\nThe audit is recorded in the parameters:\nUser – the user who performed the action;\nOffice – the office of the user who performed the action;\nObject – the object within which the action was performed (in the audit registry, the parameter contains a link to open the object profile in a modal window);\nAction type – the modified object attribute;\nComment;\nDate – the action date and time;\nEvent success – the parameter that demonstrates whether the action was completed successfully;\nThe user with permissions to perform the action – the user under whose permissions the action was performed.\nFor example, with installing updates under a user with no permissions to change the object, but with permissions to execute \"Installing updates\"\npermissions\n, this parameter is filled with the \"admin\" value, in some cases, the user performing the action is recorded to the parameter.\nIn the case of multiple xrefs:execas.adoc[user substitutions], the end user under whose permissions the action is performed will be fixed as the parameter \"The user with permissions to perform the action\".\nChanges audit\nThis audit type that records each saved change for all attributes of the System.\nTo go to the audit registry, select the menu items: Administration → Audit → Changes audit.\nIn addition, the changes audit of each System object can be viewed by clicking the audit view button\n, which is located on the control panel in\nregistry\nand in\nthe object profile\n.\nThe visibility of the\nbutton is controlled by the presence of  “View audit”\npermissions\n.\nThe object type, the object for which the change audit should be displayed, as well as the start and end dates of the period of data display in the change register can be defined in the corresponding fields.\nThe data presented in the registry can be exported by clicking the\nbutton, to update the registry data click the\nbutton.\nIn the audit registry, the data is presented in the form of columns:\nUser – the user who made the change;\nOfiice – the department of the user who made the change;\nObject – the object in which changes have been made (in the audit registry, the parameter contains a link to open the object card in a modal window);\nAttribute type – the attribute whose value has been changed;\nChange – the name of the object being changed (to view the changed attribute value, open the profle of the audit object);\nDate – the change date and time.\nSession audit\nThe session audit is created only when the user is successfully authorized in the application.\nViewing the audit of user sessions is available in the registry of the \"Audit.Session\"  object type. [SYS_AU_SESSION].\nThe data in the audit log can be\nsorted/filtered\nby the following parameters:\nby\nto the user\n;\nby\nuser ID\n;\nby information from the provider;\nThe value of the \"Information from the provider\" parameter is formed depending on\nidentification provider\n:\ndomain authentication retrieves the domain name;\npassword and oauth authentication uses the corresponding account ID.\nby\nemployee\n;\nby IP address;\nby the date of creation of the audit session.\nReports on audit data and access permissions\nTo facilitate working with a large amount of information on data changes in the System, audit data reports were configured.\nAccess to reports is available through the following menu items: \"Administration\" → \"Reports on audit data and access permissions\".\nNext, select a report and specify filtering parameters:\nAudit of actions by user\n- a report containing information about user activities in the System.\nFiltering is available by user, action type, start and end dates.\nThe specified period must not exceed 31 days.\nAudit of actions by object\n- records actions performed on an object.\nFiltering is available by object type, object, start and end dates.\nThe specified period must not exceed 31 days.\nAudit of changes by object\n- records object data changes.\nFiltering is available by object type, object, start and end dates.\nAudit of updates for the period\n- a report listing all \"Update installation\" operations performed in the System.\nFiltering is available by start and end dates.\nAudit of access masks\n- records changes in access masks for users in the System.\nFiltering is available by start and end dates.\nAudit of access group assignment\n- a report containing information on access group assignments for users in the System.\nFiltering is available by start and end dates.\nAudit of other actions with permissions\n- records actions related to access permissions.\nFiltering is available by start and end dates.\nAudit of system login\n- a report containing information on user sessions in the System.\nFiltering is available by user, start and end dates.\nAudit of integrations with external systems\nThis type of audit records the results of the following events:\nInteraction with external databases (each query is logged).\nOperation of the\nmessage queue listener\n.\nOperation of the e-mail message listener.\nWebhook requests.\nHTTP interactions:\nConnections to external GreenData environments;\nrequests to\ndata sources\n/\ndata receivers\nin ETL (excluding dummy sources);\nwith the\nDaData\nservice;\nwith the MangoOffice service;\nwith the Ahunter service.\nThis type of audit can be viewed by opening the\nregistry\nof the \"Audit. Integration with external systems\" object type [SYS_AU_INTEGRATION].\nThe recording of\nbody\n/\nsql\n/\nemailText\ndata in the audit may be limited by the number of characters specified in the\nconfiguration file\n.",
  "source": "https://docs.greendata.ru/platform/en/audit.html"
}