{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.432.3 of October 4, 2024\nNew features\nThe\nisCurrentLang\nfunction is now available to check the current locale in the algorithm editor, it is not recommended to use the previously available getCurrentLang function when creating new algorithms.\nIt is now possible to move a document between folders directly from the eDoc document interface.\nChanges and improvements\nThe ability to adjust the proportions when setting\nvisual for “Image” attribute\nwas debugged;\nFor an attribute displayed as a toggle or checkbox, the “Display attribute name on the left” option is no longer available.\nThe default value set when creating an object via a child attribute was stabilized.\nNow, when editing a visual, clicking the “Open dashboard” button in the “Dashboard” widget opens an instance of the dashboard template in a new tab.\nThe order of execution of\nonChanged event\nin the frame was adjusted to match the previously accepted logic.\nThe ability to add multiple virtual columns in the registry was stabilized.\nLocking the ability to change the value of the checkbox field in edit mode for a user with no write access permissions was stabilized.\nDashboard control panel display is now set by the user’s access permissions.\nThe application of display settings for the “Image” analytical panel was stabilized.\nThe ability to run an action from the context menu of a graph node in the “Graph” analytical panel was improved.\nWorking of the exportEDocToFile function for documents created by optimized templates was stabilized.\nModal windows displayed when calling from, var and getComment functions were improved.\nViewing the algorithm log is now more user-friendly.\n\"Logging\"\nsystem setting\nwas stabilized, and the \"Substitution\" system setting was added.\nIn the\nupdate system\nthe object search by change date was debugged.\nWhen working with a business process task, the information of the error output became clearer.\nSending files from the System to e-mail was stabilized.\nTime of displaying the actual list of files in the registry after loading a new file into the System was optimized.\nChange of interface localization when changing the language in another application tab was stabilized.\nIn the EDoc module for a number of settings of print form templates the default value of switches is set to false.\nThe names of the “User” [SYS_USER] type attributes were modified , “Data source. Object data source. Source link” [RF_DS_TYPES_LINK], “WF. Business Process” type and related objects.",
  "source": "https://docs.greendata.ru/platform/en/LTS.432.3-latest.html"
}