{
  "title": "Дерево условий",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДерево условий\nДерево условий – это визуальный конструктор, позволяющий создавать различные логические условия для фильтрации данных с помощью операторов\nOR (ИЛИ)\nи\nAND (И)\n.\nДанный вид фильтрации обеспечивает наглядный контроль над вложенностью и приоритетом условий, простота и удобство построения дерева реализуется за счет использования метода Drag&Drop и горячих клавиш.\nУсловие фильтрации при помощи конструктора фильтров можно задавать при выборе контроля прав\n\"Контроль прав по дереву условий\"\nили, например, при настройке\nфильтрации реестра\nили\nправ на атрибуты типа\n.\nРезультатом проверки условий конструктора фильтров является логическое значение (true/false).\nГотовое дерево условий можно использовать в алгоритме при помощи функции\nfilterTree\nили\nobjectsWithOptions\n.\nПостроение дерева условий\nДля создания дерева условий в первую очередь необходимо определить параметры:\nПараметр\nНазначение\nНаименование\nНаименование объекта настройки дерева условий.\nТип объекта, элементы которого нужно отфильтровать\nТип объекта, для которого настраивается фильтрация.\nПолный перечень типов в выпадающем списке параметра доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nКарточка объекта, параметры которой нужно использовать для фильтра\nКонтекстный тип объекта для настройки фильтрации.\nПолный перечень типов в выпадающем списке параметра доступен после нажатия на кнопку \"Показать все типы\"\n, которая отображается при наличии права на \"Выполнение\" разрешения\n\"Просмотр системных типов в реестре \"Тип объекта\"\n.\nСтруктура дерева условий состоит из «узлов» (операторов) и «листьев» (условий), при выделении которых в правой части рабочей области выводится боковое меню (видимость бокового меню регулируется кнопкой\n).\nВ боковом меню отображается:\nсписок условий и операторов, находящихся на первом уровне вложенности выбранного узла;\nнастройки фильтра выбранного листа, подробнее рассмотрено в последующем\nподразделе\n.\nПо умолчанию структура дерева содержит корневой узел AND\n.\nСоздание\nновых узлов или листьев осуществляется при помощи нажатия на кнопку\nс последующим выбором в контекстном меню добавляемого элемента — оператора OR/AND или условия.\nКнопка\nдоступна в конструкторе фильтров под оператором или в боковом меню после его выделения, созданный элемент будет размещен внутри блока выбранного оператора.\nПо нажатию на условие или оператор в конструкторе отобразится контекстное меню с доступными опциями, управление которыми также доступно в боковом меню:\nусловие или оператор со всей исходящей от него иерархией могут быть\nскопированы\nпри помощи:\nопции\n, в результате нажатия на которую копия будет вставлена под копируемый элемент;\nкомбинации клавиш: Ctrl+C для копирования и Ctrl+V для вставки копии в указанную часть структуры дерева;\nпереключатель\nпозволяет изменить структуру дерева без удаления или правки самих условий,\nисключив\nих из фильтрации;\nДеактивация узла в дереве условий означает, что данный узел и все его дочерние элементы не будут учитываться при фильтрации.\nудалить элемент дерева можно при помощи опции\nили  клавиши Delete;\nДля корневого узла функция удаления отсутствует.\nПри попытке удаления узла с наличием дочерних элементов отобразится модальное окно для подтверждения действия.\n.\nв случае выделения узла доступна опция\nзамены оператора\n.\nПорядок элементов структуры дерева может быть изменен в конструкторе фильтров при помощи перемещения узла/листа методом Drag&Drop, в боковом меню изменение порядка допускается только в пределах выбранного узла при помощи иконки\n.\nДля отмены последнего выполненного действия можно воспользоваться комбинацией клавиш Ctrl+Z.\nДля компактности узлы и условия могут быть свернуты, данное действие не влияет на фильтрацию, так как используется исключительно для удобства восприятия и лучшей визуализации.\nНастройка условий\nУсловие задается в области фильтра и представляет собой сравнение двух значений полей:\nдля формирования левой части условия необходимо указать \"Тип поля 1\", после чего — \"Значение поля 1\";\nПо умолчанию значением \"Тип поля 1\" устанавливается \"Атрибут объекта\".\nдля формирования правой части условия необходимо указать \"Тип поля 2\", после чего — \"Значение поля 2\".\nЗаполнение всех полей настройки условия является обязательным.\nДля выбора типа поля доступны следующие значения:\nпростые значения;\nТип поля\nЗначение поля\nСтрока\nВвод строкового значения.\nЦелое число\nВвод целого числа.\nЧисловой\nВвод целого числа или числа с дробной частью.\nДенежный\nВвод денежного значения.\nДата\nВвод даты в специализированном поле с возможностью использования календаря.\nДата и время\nВвод даты и времени в специализированном поле с возможностью использования календаря.\nNull\nВозможность выбора значения отсутствует, в заблокированном поле выбрано пустое значение.\nЛогическое\nВ качестве значения через выпадающий список выбирается \"Да\"/\"Нет\".\nПри выборе типа \"Дата\"/\"Дата и время\" отобразится логический параметр \"Текущая дата\", который позволяет установить в качестве значения текущую дату/дату и время.\nПри выборе типа \"Дата\"/\"Дата и время\" имеется возможность указания смещения даты через одноименный параметр. Смещение даты осуществляется  в днях, количество которых определяется в поле \"Количество дней для смещения\".\nобъектные значения;\nТип поля\nЗначение поля\nАтрибут объекта\nВыбор атрибута типа, указанного в качестве\nбазового\n. Выбор осуществляется из выпадающего списка, возможна вставка цепочечного атрибута.\nПоле недоступно, если для дерева условий не выбран базовый тип объекта.\nЕсли в противоположной части условия выбрано справочное значение, то в качестве настраиваемого\nзначения поля\nавтоматически будет установлен объектный атрибут базового типа, который ссылается на данный справочник.\nСправочное значение\nВыбор объекта в качестве справочного значения.\nПри нажатии на поле откроется модальное окно для выбора объекта, логика выбора аналогична использованию функции\ndict\n.\nЕсли в противоположной части условия выбран объектный атрибут, то  настраиваемое\nзначение поля\nавтоматически будет заполнено первым по порядку объектом справочника.\nПараметр\nВыбор параметра дерева условий.\nПри нажатии на поле значения откроется модальное окно для выбора параметра.\nУправление параметрами осуществляется при нажатии на одноименную кнопку, расположенную в панели управления дерева условий.\nкастомные значения.\nТип поля\nЗначение поля\nТекущий пользователь\nВыбор атрибута текущего пользователя. Вставка выбранного значения осуществляется как цепочечный атрибут.\nУсловие сравнения значений полей выбирается в параметре \"Оператор\". Для настройки проверки условий доступны операторы: =, !=, >, >=, <, <=, ⊂, ⊄.\nПри использовании оператора ⊂ (включает) для\nmultiselect-атрибута\nнеобходимо выбрать одну из следующих опций:\nПодробнее про операторы ⊂ (включает) и ⊄ (не включает).\nДанные операторы могут быть актуальны для типов полей:\n\"Multiselect-атрибут\"\n;\n\"Дочерний атрибут\"\n;\n\"Строка\".\nОператоры проверяют наличие или отсутствие объекта/символа в массиве.\nПримеры применения:\nЖивотные\n(multiselect-атрибут)\n⊂ Кошки (объектный атрибут). Результатом будет true.\nРастения\n(дочерний атрибут)\n⊄ Одуванчик (объектный атрибут). Результатом будет false.\nПример\nПример № 1\nДопустим, при помощи дерева условий необходимо настроить фильтрацию  объектов, для которых:\nстатус инцидента = \"На распределении\" или \"В работе\";\nпроблемность = \"Высокая\";\nколичество дней просрочки по SLA не менее заданного числа.\nДля выполнения задачи рекомендуется выполнять ряд шагов.\nШаг 1. Определить параметры дерева условий\nУказать наименование дерева условий \"Фильтрация по статусу инцидента\".\nВ качестве фильтруемого типа объекта выбирается тип \"Инцидент\".\nШаг 2. Построение структуры дерева\nДобавление\nузлов и листьев согласно условию задачи. Структура примет следующий вид:\nШаг 3. Определение параметров условий\nУсловие проверки количество дней просрочки по SLA необходимо сравнивать с задаваемым числом.\nДанное значение может быть передано через параметр, который добавляется по кнопке \"Параметры\", расположенной в панели управления.\nШаг 4. Настройка условий\nУсловия проверки соответствие статуса инцидента значениям \"На распределении\" или \"В работе\" задаются в узле OR.\nСтатус инцидента – это объектный атрибут типа объекта, элементы которого нужно отфильтровать.\nПоэтому в качестве\nтипа поля 1\nуказывается \"Атрибут объекта\", а в качестве\nзначения поля 1\n\"Статус инцидента\".\nДопустимые значения указанного объектного атрибута являются объектами одноименного справочника.\nПоэтому для проверки условия в качестве\nтипа поля 2\nиспользуется \"Справочное значение\", а в качестве\nзначения поля 2\nв модальном окне для первых двух условий выбираются объекты \"На распределении\"/\"В работе\" типа \"Статус инцидента\".\nВ качестве оператора указывается \"= равно\".\nПроверки уровня проблемности в узле AND задается аналогичным способом:\nЧетвертое условие – проверка дней просрочки:\nНастройки\nполя 1\nаналогичны первым трем условиям, а для\nполя 2\nследует указать:\nтип поля – \"Объектное значение\" → \"Параметр\";\nзначение поля – параметр, созданный на Шаге 3.\nВ качестве оператора сравнения устанавливается \">= Больше или равно\".\nШаг 5. Сохранение\nСохранить настройки нажатием на иконку дискеты в панели управления.\nСформированное дерево условий может быть:\nиспользовано в алгоритме при помощи функции\nfilterTree\n;\nвыбрано при настройке фильтрации вида \"Дерево условий\" в\nреестре\n.\nПример № 2\nНеобходимо выдать права на редактирование отдельных атрибутов типа \"Обращения\" только тем пользователям, которые входят в группу доступа \"Тех.поддержка\".\nДля этого при\nнастройке прав доступа к необходимым атрибутам\nследует определить право на редактирование, задав условие вида:\nПри формировании левой части условия необходимо выбрать кастомное значение \"Текущий пользователь\" и указать его значение как \"Настроенные группы\".\nДалее в данном примере условием проверяется, включает (⊂) ли перечень настроенных групп доступа текущего пользователя определенную группу.\nВ правой части условия выбирается соответствующее справочное значение – объект \"Тех.поддержка\" типа \"Группа доступа\".\nСравнение настроенных групп поддерживает данные формата:\nсправочное значение;\nатрибут, хранящий группу доступа, в т.ч. и цепочный (например, \"Группа доступа.Код\");\nцелочисленное значение.\nПри необходимости настроенное условие также может быть реализовано при помощи функций\ncurrentUserHasGroup\nи\nuserHasGroup\n.\nПример № 3\nДопустим, требуется настроить автоматический подбор фильмов на основе жанровых предпочтений клиента.\nДля этого необходимо настроить фильтрацию по дереву условий в\nреестре\nфильмов, указав в качестве основного типа объекта \"Фильм\", а в качестве контекстного типа — \"Клиент сервиса\":\nДалее необходимо задать условие вида:\nдля подбора фильмов, которые хотя бы частично соответствуют предпочтениям клиента, необходимо активировать опцию \"Включает 1 и более элементов\":\nдля строгого соответствия всем предпочтениям клиента должна быть включена опция \"Включает все элементы\":\nПри формировании левой части условия необходимо выбрать объектное значение \"Атрибут объекта\" и указать в качестве значения атрибут \"Жанр\" типа объекта \"Фильм\".\nДалее условием проверяется, включает (⊂) ли перечень жанров каждого фильма список предпочитаемых клиентом жанров в соответствии с выбранным режимом.\nВ правой части условия выбирается соответствующее объектное значение \"Атрибут родительского объекта\" – атрибут \"Предпочтения по жанрам\" типа объекта \"Клиент сервиса\".",
  "source": "https://docs.greendata.ru/platform/ru/condition-tree.html"
}