{
  "title": "executeTask",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nexecuteTask\nA function for completing a\nbusiness process\ntask.\nThe function is available to users with the\n\"Routes administration\"\npermission.\nSyntax\nexecuteTask\n(taskId, [routeId, isAuto, initiator, comment])\nSetting\nPurpose\ntaskId\nTask to be completed. The parameter must be an instance of the \"WF. Process task\" [WF_PROCESS_TASK] type (or its ID).\nThe parameter can be passed as a numeric value or using the\nattr\n,\nparam\n,\ndict\n, or\nvar\nfunctions as an attribute (of \"Object\" or \"Integer\" type), parameter, reference value, or variable.\nrouteId\nTransition\noption (decision on the task). The parameter must be an instance of the \"WorkFlow. Business process transition\" [WF_PROCESS_ROUTE] type (or its ID).\nThe parameter can be passed as a numeric value or using the\nattr\n,\nparam\n,\ndict\n, or\nvar\nfunctions as an attribute (of \"Object\" or \"Integer\" type), parameter, reference value, or variable.\nThis parameter is required if the task has more than one outgoing transition. If a decision is not required (i.e. the task has only one outgoing transition), the value should be set to null.\nisAuto\nBoolean parameter that determines whether the task can be technically completed without being executed.\nThe parameter can be passed as a boolean value (\ntrue\n/\nfalse\n) or using the\nattr\nor\nvar\nfunctions as an attribute (of \"Boolean\" type) or variable.\nIf the value is\ntrue\nor the parameter is not provided, the task will be completed automatically. If the value is\nnull\nor\nfalse\n, the task will be completed on behalf of the user who initiated the algorithm, or on behalf of the assignee explicitly specified in the task.\nThe user/employee on behalf of which the task is executed must have appropriate permissions to complete the task (i.e. be a potential assignee).\nThis parameter is optional.\ninitiator\nUser\nor\nEmployee\non behalf of which the task is run.\nThe parameter can be passed as a numeric value or using the\nattr\n,\nparam\n,\ndict\n, or\nvar\nfunctions as an attribute (of \"Object\" or \"Integer\" type), parameter, reference value, or variable.\nThis parameter is optional. If not provided or set to _null\n, the task will be run on behalf of the user who initiated the algorithm._\nThe specified user/employee must have permission to complete the task (i.e. be a potential assignee).\ncomment\nComment text for the task.\nThe parameter can be passed as a\ntext value\nor using the\nattr\n,\nparam\n, or\nvar\nfunctions as an attribute (of \"String\" or \"Text\" type), parameter, or variable.\nThis parameter is optional.\nNote\nThe function is added manually via input.\nExample\nFor example, in the\ntask settings\nfor \"Order approval\", the \"Sales department\" access group is specified as the assignee.\nThe task must be completed with the decision \"Approved\" on behalf of S. Smith, a member of the \"Sales department\" group.\nThe algorithm may look like this:\nThe task is completed using the\nexecuteTask\nfunction, where:\nthe first parameter uses the\nattr\nfunction to set the \"ID\" attribute of the task being completed;\nthe second parameter specifies the transition option \"Approved\" using the\ndict\nfunction;\nthe third parameter is set to \"false\", meaning the task will be completed on behalf of the assignee;\nthe fourth parameter uses the\ndict\nfunction to select the user S. Smith, on behalf of which the task will be executed;\nthe fifth parameter specifies the\ntext\nof the task comment.\nAs a result, the task will be completed, and the specified data will be displayed on the\nbusiness process route map\n:",
  "source": "https://docs.greendata.ru/platform/en/executetask.html"
}