{
  "title": "Настройка прав доступа на создание и редактирование типов объектов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка прав доступа на создание и редактирование типов объектов\nВ данной статье будет рассмотрен пример настраивания ограничений для работы с типом объекта \"Заявка на принятие решения\".\nТематическая задача\nВ рамках проекта требуется создать одну сущность для управления заявками:\nЗаявка на принятие решения\n.\nС указанной сущностью работают следующие пользователи:\nИванов\n;\nПетров\n, входящий в группу доступа \"Все пользователи\".\nДля группы пользователей \"Все пользователи\" необходимо\nразрешить создание и просмотр\nэкземпляров типа объекта \"Заявка на принятие решения\" и\nзапретить удаление\nэтого документа.\nПодробнее о настройке прав доступа типа объекта можно посмотреть в статье\nНастройка системных прав доступа\n.\nАналитическая настройка\nДля реализации поставленной задачи необходимо перейти в пункт меню \"Доступ к объектам системы. Далее следует в поле \"Тип объекта\" указать значение \"Тип объекта\", после этого на экране отобразится список существующих в системе типов объекта.\nНеобходимо выбрать из списка сущность \"Заявка на принятие решения\".\nДалее необходимо выбрать субъекта безопасности \"Все пользователи\" и указать признаки разрешенных действий с экземплярами типа объекта:\nчтение;\nсоздание;\nредактирования.\nИ запрещенное действие - удаления экземпляра типа объекта.\nПосле завершения настройки прав доступа к типу объекта необходимо сохранить внесенные изменения с помощью кнопки\n.\nВ зависимости от того, какой вид контроля прав был выбран для типа объекта, отличается настройка прав доступа. Узнать больше об этом можно в статье\nНастройка прав доступа к экземплярам типа объекта\nРезультат\nПосле сохранения введенных настроек для любого пользователя (сотрудника, включенного в группу \"Все пользователи\")\nдоступен ввод, просмотр и редактирование\nЗаявок на принятие решения, и\nотсутствует возможность удаления\nэтого типа объекта.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-permissions-to-create-edit-object-types.html"
}