{
  "title": "API",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nAPI\nAPI is an Application Programming Interface. GreenData API provides a set of ready-made procedures, methods, and data structures that developers can use to access it.\nGreenData API allows working with the platform using\nHTTP requests\n. Using the API, you can access any type of the System object, the ETL process. Request processing can only be limited by the hardware and software available.\nThe work with the API is organized on an external server (NOT on the platform server), which sends requests of a certain type to the platform server.\nFor convenience, this article will cover sending requests\nusing the Postman application\n. Alternatively, you can use other applications.\nAuthentication\nTo create API requests, you need a\nuser account\n, and/or an access key (custom token).\nCreating a custom token\nThe access key for the user is configured in the System. The custom token is the\nHook custom token [HOOK_USER_TOKEN]\nobject type. To create a token, go to the object types registry. For more information, refer to\nworking with the registry\n.\nAttention! It is necessary to record (independently save in another document) the token value\nbefore saving the profile created\n. After saving the profile, the token value will not be available for viewing.\nThe profile contains the following fields:\nSetting\nPurpose\nToken user\nSelect/create a user from the drop-down list.\nValue\nView the token value. You need to\nsave this value for the user\n. After saving the profile, the token value will not available for viewing. The token value is stored only in the database.\nValidity period start\nSelect the start date of the token validity period. By default, the current time is fixed.\nValidity period end\nSelect the end date of the token validity period. By default, the date 01.12.4000 is fixed.\nMaximum number of authentications by token\nLimit the number of requests by token. By default, the number of authentications is not limited.\nName\nEnter the setting name.\nThe value of the custom token is then used for authentication via http requests.\nHTTP Authentication\nAuthentication by requests is ensured by one of the following options:\nSpecify the login and password of the user in the settings of the request generation software:\nAuthentication type:\nBasic Auth\nSpecify the token value after the plugin name in the URL bar:\nSpecify the token value as the parameter\ntoken\nof the get-request:\nRequest parameters are separated by &.\nSpecify the header\nX-TLT-Private-Token\nin the request settings:\nGeneral principles\nThe TLT API accepts POST and GET requests depending on the action being performed.\nThe URL to execute the request is generated as follows:\n, where:\nHooks\nis the API name, the value is constant for any type of request. Working with the plugin is described below.\nidOrUuidOrIdent\nis a request parameter that allows assigning a value of both the ID and the object ID. Request parameters are separated by ''&''.\nThe text of the request itself must match the XML or JSON format. By default,\nJSON\nis used. Depending on the format, the request address and the value of the HTTP header\nContent-Type\nchange:\nXML requires the following Content-Type:\napplication/xml\nJSON requires the following Content-Type:\napplication/json\nConfiguring plugins\nPlugins are represented in the System by the\nHook plugin [SYS_HOOK_PLUGIN]\ntype. To view the plugins available, go to their registry. For more information, refer to\nworking with the registry\n.\nTo create a request, the generated URL must contain the plugin ID (specified in the\nResource\nfield).\nWhen building a request, the following values are used (\nthe plugin name entry is case sensitive\n):\netl\n– start the ETL process\ndatasource\n– request to the database\nExamples of generating requests\nJSON\nrequests are distinguished by the\nContent-Type\nheader.\nTo execute a GET request, it is enough to generate a browser URL string.\nFor more information, refer to '''\nWorking with ETL via API\n'\n.\nThe PUT request should contain a body. The body (params'') can be empty.\nIn this example, you are accessing\ndata source\nwith the ID\nSOURCE_FOR_API\n. The data source returns the object name by the ID specified. ID is a data source parameter.\nBy default, the response is generated in the\njson\nformat. In this example, the PUT request refers to a parameter with the identifier (\nid\n)\n844583\nand the value (\nvalue\n)\n15\n. In response, the database generates a description of columns and rows.\nTo generate the response in\nxml\n, specify\napplication/xml\nin the\nAccept\nheader.\nIn the case of configuring the\nETL process\n, if you need to generate an application response in the xml format, the required code should be specified by the algorithm.\nRead more about this\n.\nPossible server response codes\nPossible server response codes:\n200 – a standard response to the operation; it means that no errors occurred\n201 – in some cases, when creating objects, this code may return; it does not differ in meaning from code 200\n302 – redirection performed\n400 – invalid HTTP request, the server could not process it\n401 – failed to log in (you need to check your login and password or token)\n404 – the requested object was not found (it may have already been deleted or an invalid object ID was specified)\n500 – internal server error (the request may have been made incorrectly or the server is not responding)",
  "source": "https://docs.greendata.ru/platform/en/api.html"
}