{
  "title": "Theme Designer",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nTheme Designer\nThe theme designer allows the user to independently customize the color scheme of the System interface in the mobile and web versions of the application.\nLayout settings\nTo switch to the theme settings, select \"Theme designer\" in the\nuser profile menu\n.\nThe page that opens contains three blocks:\nLayout design is a set of system design themes.\nThe default system theme is \"Material\".\nCustom layouts are design themes created by the application users.\nMobile app theme is the design themes used in the\nGreenData mobile app\n.\nThe default system theme is \"Mobile Material\".\nWhen hovering over the theme, the theme can be copied\n, edited\n, and deleted\n.\nThe System design themes can be only copied.\nThe copied theme for the web version of the application will be placed in the \"Custom layouts\" block, after which it can be edited.\nChanging the settings for the design theme is available to the user if they have the \"Write\"\npermissions\nfor the corresponding instance of the design theme. Otherwise, editing the theme will not be available.\nViewing and editing the settings for the design theme is done via the theme designer, available by clicking\nin the theme hover.\nThe application has the option to use a theme from another application. To do this,\ninstall file\nin the\n*.guf\nformat.\nSetting up a theme for the web version of the application\nThe theme designer provides an extensive set of parameters through which the color design of the System interface elements is configured:\napplication\n;\nbuttons\n;\ncheckboxes\n;\nnavigation bar\n;\nmain menu\n;\nmenu search box\n;\nforms\n;\nregistries\n;\nprofile\n.\nFirst, it is recommended to specify the layout title (it can be edited later).\nThe display of all text elements of the System interface is configured in the theme designer using a set of the following settings:\nSetting\nPurpose\nFont of the application text\nText font selection from the drop-down list.\nThe default font is \"Clear Sans\".\nSize\nSelecting a value of the font size from the drop-down list.\nThe default value is 14 size.\nFont formatting\nSelecting the font formatting. The formatting options:\n— bold;\n— italics.\nThe color of the System interface elements is changed by clicking on the color field\n, located next to the configurable setting. As a result, a color picker opens with the ability to select the color on the palette or enter a color code in RGBA, HEX and HSVA formats.\nApp\nSetting\nPurpose\nText color\nSelecting the text color of the following elements:\nthe main text of object profiles;\nflat registries;\nattributes as links.\nWhen using the parameter, the color is set using the Color picker that opens with the option to select a color on the palette or enter the color code in RGBA, HEX and HSVA formats.\nLogo of the download page\nSelecting an image for the download page logo.\nImage is uploaded by clicking the \"Upload an image or gif\" button. After uploading, the selected image will be displayed in place of the button.\nHovering the mouse cursor over the uploaded image will display a hover with\nicons to delete and replace the image.\nA JPG, PNG, or GIF file can be used as the page logo. When uploading the image in an unsupported format, the System will display the image element instead of the image.\nThe image size should not exceed 1 MB. Otherwise, the System will show the notification:\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, changing the logo of the download page is not available.\nFavicon\nSelecting an image for the icon that is located in front of the page name in the browser tab.\nImage download is available by clicking on the \"Upload an image or gif\" button. After uploading, the selected image is displayed instead of the button.\nHovering the mouse cursor over the uploaded image will display a hover with icons\nto delete and replace the image.\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, changing the favicon is not available.\nButtons\nThe shape of the button corners is set in the \"Button corners rounding\" field. Available values:\nXS\nS\nM\nL\nXL\nCheckboxes\nNavigation bar\nMain Menu\nSetting\nPurpose\nLogo\nSelecting an image to display in the main menu.\nImage is uploaded by clicking \"Upload Image\". After uploading, the selected image is displayed instead of the button.\nHovering the mouse cursor over the uploaded image will display a hover with icons\nto delete and replace the image.\nUploading the logo is allowed in JPG and PNG format.\nWhen uploading the image in an unsupported format, the System will display the image element instead of the uploaded image.\nThe image size should not exceed 1 MB.\nOtherwise, the System will show the notification:\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, changing the logo is not available.\nScalability, %\nThe \"Scalability, %\" field allows you to change the scale of the logo (the percentage is calculated from the original image size in pixels) and can take values from\n5\nto\n300\n.\nThe scale value is set to 100% by default.\nA block of\n316\nby\n43\npixels is provided for the logo, so the edges of the larger image are cropped.\nAlignment\nUsing the buttons\nthe uploaded image can be aligned to:\nthe left edge;\nthe center;\nthe right edge.\nBy default, the alignment is set to the left.\nSearch on the sidebar\nForms\nRegistries\nProfile\nThe \"Dropdowns/calendar/toolbar search\" parameter affects the display of the following System elements:\nSystem element\nDisplay\nDrop-down list\nObject types drop-down list\nVersioning attributes calendar\nSearch box\nTo save the generated color scheme (theme), click the\nbutton.\nConfiguring the mobile app\nWhen configuring the\nmobile app\ntheme, the color palette of the app elements is set for light and dark themes.\nThe theme designer specifies the name of the custom theme and defines the colors (the color palette for the light and dark themes are set in the appropriate sections):\nThe color is selected using the Color picker on the palette or by entering the color code in RGBA or HEX formats.\nmain – the main contrasting color of the application, which is used for buttons, the side menu and the header of the home page;\nsecondary – the color of the application, which is used for icon buttons, attributes, outlines, and lines;\ntertiary – the color of the application, which is used for links inside the application;\nwarning – the color that is used for \"warning\" type notifications and as a warning marker;\nerrors – the color that is used for error alerts;\nbackground – the color that is used for the background of cards and registers;\ntext – the color that is used for the main text, registries, headings in the card and in the registry header.\nTo save the edits made in the theme designer, click the \"Save\" button.\nIf necessary, use the \"Reset\" button to undo the edits you made and return to the last saved version.\nTheme selection\nTo select the default theme of the application, check the appropriate box.\nFor the web version of the application, the user has the option to select a theme other than the default one by clicking on the desired theme.\nThe default theme of the mobile application will be displayed for all users of the application. In case there is no\naccess permissions\nto \"Read\" the default user theme, the user will be shown the system theme \"Mobile Material\".",
  "source": "https://docs.greendata.ru/platform/en/theme-designer.html"
}