{
  "title": "Виджеты, блокировка которых доступна",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджеты, блокировка которых доступна\nВ Системе возможно заблокировать работу виджета при определенном условии. Это условие задается\nалгоритмом\nпри\nразмещении виджета\n. Для блокировки доступны\nтакие виджеты, где предполагается выполнение действия пользователями.\nЗадать алгоритм блокировки можно для следующих виджетов:\n\"Реестр объектов\"\n– в случае блокировки виджета, реестр станет доступным только для просмотра;\n\"Реестр задач\"\n– в случае блокировки виджета, реестр задач станет доступным только для просмотра. Кнопки панели управления реестра не отобразятся;\n\"Дашборд\"\n– при блокировке виджета дашборд становится недоступным, как простая таблица для чтения или изображение.\n\"Кнопка\"\n– при блокировке виджета нажать кнопку невозможно;\n\"Кнопки для голосования\"\n– при блокировке виджета его кнопки неактивны;\n\"Чекбокс с гиперссылкой\"\n– при блокировке виджета его выбор (checkbox) невозможен;\n\"Таблица атрибутов\"\n– при блокировке виджета таблица становится заблокированной. Данные таблицы представлены только для просмотра;\n\"Финансовая отчетность\"\n– при использовании алгоритма, блокируются поля с данными;\n\"Согласование файлов\"\n– при блокировке виджета, его кнопки блокируются;\n\"Иерархия файлов\"\n– при блокировке виджета действия пользователя становятся недоступными, включая возможности прикрепления и удаления файлов;\n\"Проводник\"\n– при блокировке виджета действия пользователя становятся недоступными, включая возможности подписания, прикрепления и удаления файлов;\n\"Список файлов по статусам\"\n– при блокировке виджета действия пользователя становятся недоступными, включая возможности подписания, прикрепления и удаления файлов.",
  "source": "https://docs.greendata.ru/platform/ru/widgets-available-for-locking.html"
}