{
  "title": "Creating a calculation profile",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCreating a calculation profile\nThe calculation profile allows you to calculate the methodology using the system parameters specified (reporting date, dynamics type, etc.). The required data is specified once when creating the profile and can be edited if necessary.\nThis profile is implemented by the type \"\nCalculation Module. Calculation profile\n\" (and its child types). The profile can be created, edited and deleted from the registry of the corresponding types. The calculation profile can also be copied and edited.\nTo create a calculation profile, you need to:\n1. Create a calculation profile. Click the\nbutton on the control panel for the profile registry. The System will display a form to enter the profile parameters.\nNote: the administrator can independently configure the visualization of the profile of any type of the System object (for more information, refer to\nConfiguring the visual\n).\n2. Enter parameters for methodology calculation where mandatory fields (attributes) are:\nSetting\nPurpose\nReporting date\nEntering the calculation date. That is, the calculation result will be saved on this date.\nRelevance date\nSelecting a date to take into account the value of time-dependent attributes (\nsee more\nabout them).\nMethodology\nChoosing/entering the methodology according to which the calculation is performed.\nA characteristic feature of the calculation profile is that there are system attributes, that allow you to calculate and save the values obtained.\nSetting\nPurpose\nTemporary calculation result [UUID]\nThe attribute allows you to see the result of the methodology calculation without saving it to the database.\nSaved calculation result\nA system attribute that allows you to save the result of the performed calculation to the database.\n3. Click\nin the object window to save the parameters entered.\nNote: The calculation profile is used to run the methodology and can be specified as a base object type in the corresponding algorithms. In case of starting methodologies from other object profiles, you need to make sure that the mandatory nature of the required attributes is taken into account for the correct calculation.",
  "source": "https://docs.greendata.ru/platform/en/creating-a-calculation-profile.html"
}