{
  "title": "Настройка оповещений",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка оповещений\nОповещения для пользователей настраиваются при создании\nсхем бизнес-процессов\n.\nДля настройки оповещений реализованы следующие типы объектов:\n\"ДО. Оповещение стандартные\" – оповещения, формируемые при назначении задачи в ходе бизнес-процесса;\n\"ДО. Оповещение по завершению задачи\" – оповещения, формируемые после завершения задачи бизнес-процесса.\nДля создания оповещения необходимо нажать на кнопку\nво встроенном реестре \"Оповещения\" настраиваемого элемента бизнес-процесса и в открывшемся модальном окне выбрать тип оповещения:\nВ результате чего откроется страница для формирования шаблона по следующим параметрам:\nПараметр\nНазначение\nНаименование\nВвод наименования шаблона оповещения.\nВид оповещения\nВыбор вида оповещения. Возможные значения:\nсообщение в чат;\nсообщение на электронную почту.\nПараметр доступен при создании оповещения типа \"ДО. Оповещение по завершению задачи\".\nРедактор шаблона заголовка\nФормирование шаблона заголовка оповещения при помощи инструментов\nредактора\n.\nВ шаблон заголовка можно добавить динамические данные, полученные из атрибута любого типа объектов или результата выполнения алгоритма,\nсм. подробнее\n.\nИспользуется при выборе вида оповещения \"Сообщение на электронную почту\".\nРедактор шаблона сообщения\nФормирование шаблона сообщения с применением инструментов\nредактора\n.\nВ шаблон сообщения можно добавить динамические данные, полученные из атрибута типа объектов или результата выполнения алгоритма,\nсм. подробнее\n.\nИспользуется при выборе вида оповещения \"Сообщение на электронную почту\".\nНастройка получателей оповещения\nКому рассылать оповещения\nВыбор групп получателей из выпадающего списка:\nвсем ответственным по маршрутному объекту – отправление оповещения всем ответственным, указанным в маршрутном объекте на момент отправки сообщения.\nДанные атрибута \"Список ответственных для отправки оповещения\" в данном варианте не учитываются\n;\nвсем пользователям, входящим в указанные группы доступа – отправление оповещения всем пользователям Системы, которые имеют группы доступа, указанные в поле \"Список ответственных для отправки оповещения\";\nтолько ответственным в рамках экземпляра процесса – отправление оповещения ответственным в рамках данного экземпляра бизнес-процесса, которые указаны в поле \"Список ответственных для отправки оповещения\";\nтолько ответственным из родительского БП – отправление оповещения ответственным по родительскому бизнес-процессу (вариант используется, если текущий бизнес-процесс является дочерним), которые указаны в поле \"Список ответственных для отправки оповещения\";\nтолько указанным ответственным по маршрутному объекту – отправление оповещения всем ответственным по маршрутному объекту, которые указаны в поле \"Список ответственных для отправки оповещения\".\nОтправлять только ответственным, у которых есть активные задачи\nПараметр, определяющий получателей в зависимости от наличия активных задач. Возможные значения:\nда – отправление оповещения потенциальным получателям, у кого по маршрутному объекту есть незавершенные задачи;\nнет – отправление оповещения всем потенциальным получателям.\nСписок потенциальных получателей определяется настройкой полей \"Кому рассылать оповещения\" и \"Список ответственных для отправки оповещения\".\nСписок ответственных для отправки оповещения\nФормирование списка групп доступа для фильтрации получателей оповещения.\nВыбор существующих групп доступа осуществляется при нажатии на кнопку\n. Для создания новой группы доступа необходимо нажать на кнопку\n.\nПрикрепление файлов в оповещение\nПрикреплять к письму файлы с маршрутного объекта со следующей классификацией\nВыбор классификации прикрепляемых файлов из выпадающего списка.\nПрикреплять к письму файлы, добавленные на процессе со следующими тегами\nВыбор тегаов из выпадающего списка. Возможные значения:\nнеобработанные файлы;\nобработанные файлы;\nсогласованные файлы;\nфайлы, добавленные на маршруте;\nфайлы, переданные на маршрут.\nПосле заполнения параметров необходимо сохранить шаблон оповещения нажатием на кнопку\nв панели управления.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-alerts.html"
}