{
  "title": "breakException",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nbreakException\nФункция останавливает расчет выражения или сохранение объекта в\nсобытии до сохранения\n, при этом отображая пользователю системное уведомление с заданным текстовым сообщением.\nЕсли функция сработала во вложенном алгоритме, тогда будет остановлен и основной алгоритм.\nСинтаксис\nbreakException\n([text])\nПараметр\nНазначение\ntext\nТекстовое сообщение, которое будет отображаться пользователю при остановке выполнения транзакции в случае использования функции в\nсобытии до сохранения\n.\nЕсли параметр не заполнен, тогда будет использоваться уведомление \"Произошла ошибка, обратитесь к администратору\".\nПримечание\nВызов функции осуществляется с\nвкладки \"Алгоритмы\"\nпанели инструментов редактора алгоритмов.\nПри вызове функции устанавливается фиктивная переменная \"text\", которую следует заменить на необходимое значение.\nПри возникновении ошибок на каких-либо этапах жизненного цикла функция прерывает сохранение объекта или останавливает расчет\nвыражения\n/\nсобытия\nи отменяет внесенные изменения по объекту.\nОднако, для асинхронно запущенных процессов, например, для запуска бизнес-процесса или процедур интеграции через ETL, возвращение к прежнему состоянию не производится.\nТекстовое уведомление отображается при использовании функции в событии до сохранения, в иных случаях функция останавливает выполнение алгоритма с записью ошибки в лог.\nПример\nНапример, сохранение объекта осуществляется в событии до сохранения. Необходимо прерывать алгоритм жизненного цикла, когда дата создания заявки устанавливается больше текущей даты.\nДопустим, что условие проверки вынесено отдельным алгоритмом в следующем виде:\nВо вложенном алгоритме посредством оператора\nif\nосуществляется проверка условия, в результате выполнения которого вызов функции\nbreakException\nприведет к остановке сохранения объекта в событии, при этом пользователю будет выведено уведомление \"Данные некорректны\".\nБудет остановлен как вложенный, так и основной алгоритмы.\nДля вызова вложенного алгоритма используется функция\nalg\n, подробнее с остальными функциями, задействованными в основном алгоритме, можно ознакомиться в статье\n\"newInstance\"\n.",
  "source": "https://docs.greendata.ru/platform/ru/breakexception.html"
}