{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.435.5 of October 28, 2024\nNew features\nA new deduplication mechanism was added. It is implemented through a\ncustom action\n.\nUsers can now set a profile photo in the\ncall room\n.\nIn the \"File\" attribute control panel with the \"File attachment visual for signing\", it is now possible to place\ncustom actions\n.\nThe button for viewing the business process route is now implemented using\nactions\n.\nChanging the values of control attributes in the \"Dashboard\" widget now refreshes the analytical panel visuals upon saving without needing a page reload.\nA new function, insertText, was introduced, allowing the creation of a .pdf file based on an uploaded .docx file.\nIt is no possible to check the correctness of update packages with a new feature controlled by a new permission.\nWhen setting up authentication via the \"External service\" source, it is now possible to set a username and password not only for the service but also for the proxy.\nWhen working with\neDoc documents\n, it’s now possible to insert images from the clipboard. Additionally, support for using hotkeys is now available on both Windows and Mac.\nChanges and improvements\nLocking object type settings for read-only users was improved;\nCreating instances in a new tab was stabilized;\nThe object deletion process was improved;\nAutomatic registry updates after adding or editing objects were improved;\nThe focus setting on a row in the registry displayed on the frame was debugged;\nThe process of saving the visual for an inherited type instance was stabilized;\nThe possibility to set file extension filters for the \"Files widget\" attribute was improved;\nThe functionality of the\n\"Financial Statements\" widget\nwas enhanced;\nWhen using\ndrill down\nin dashboards with the option to display in place of the parent, users can now return to the previous table with the \"Back\" button;\nIn the\n\"Table\" analytics panel\n, data filtering by boolean attributes was stabilized;\nThe creation of a\ncolor palette\nis now available when setting up a chart;\nThe algorithm for locking the\naction\nbutton was stabilized;\nThe\nattrOldValue\nfunction was debugged;\nIn applications with a Redis caching system, the operation of algorithms for building\ncharts\nwas stabilized.\nThe replacement of the \"?\" symbol no longer occurs when compiling an algorithm;\nIn the\nlogin page constructor\n, the window height setting was stabilized;\nAccess group audit functionality was optimized;\nIn the \"External service\" source, support for NULL was added for boolean values;\nThe process of displaying errors during\nupdates installation\nvia a GUF file was improved;\nThe\ninstallation of updates\ncontaining search filters, filtering algorithms, or control panel button settings in the registry via a GUF file was stabilized;\nThe structure of XML files used for sending notifications to the Notary was updated;\nThe renaming process for the \"Database Script (SQL, PL/SQL, T-SQL, etc.)\" object instances was improved;\nIn the Edoc module, large images in paragraphs with hanging line prevention are now properly displayed, table elements update correctly after re-rendering, and the cursor position in documents was stabilized;\nIn the GreenData mobile app, message exchange times was optimized;\nThe visual for the modal window managing dashboard parameters was adjusted;\nIn the Edoc module, visuals for several profiles related to print form template settings were adjusted.",
  "source": "https://docs.greendata.ru/platform/en/LTS.435.5-latest.html"
}