{
  "title": "Requirements for system deployment",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRequirements for system deployment\nTechnical requirements\nFor the installation and correct operation of the Low-Code platform, when evaluating the compatibility of the company’s equipment, it is advised to adhere to the recommended requirements.\nDatabase\n-\nMinimum\nRecommended\nCPU or vCPU\n4 Cores\n8 Cores\nRAM\n16 GB\n32 GB\nDisk, SSD\n250 GB\n500 GB\nApplication Server\n-\nMinimum\nRecommended\nCPU or vCPU\n4 Cores\n8 Cores\nRAM\n16 GB\n32 GB\nDisk, SSD\n100 GB\n200 GB\nThe backup system must be located on an independent server, and the amount of available memory must correspond to the frequency of backup.\nThe performance and stability of the application in the cluster depends on the disk speed. A slow disk will increase the latency of requests in the cluster and potentially damage the stability of the cluster.\nSystem software\nThe platform can be deployed on the\nPostgre SQL 13\nDBMS through the following operating system:\nLinux Debian (ver. >= 11)\n;\nIn addition, the Low-Code platform is available on other Linux distributions (Ubuntu, CentOS, etc.), but it is recommended to use the Debian Linux platform.\nNetwork requirements\nType of network\nSpecifications\nNetwork between the application server\nThe minimum undivided bandwidth of the connection channel to the System is 512 Kbit/s\nCommunication channels between servers\nThe minimum undivided bandwidth of connection channels between servers is 1 GB/s\nClient software\nThe platform supports the 3 latest released versions of browsers:\nGoogle Chrome\n;\nSafari\n;\nFirefox\n;\nEdge\n.\nIt is recommended to use the Google Chrome browser\nTechnical support applies to the 3 latest released versions of the browser. For example, if the latest version of the Google Chrome browser is 109, then the platform supports 107, 108, 109 browser versions.\nThe chrome://accessibility flags should be turned off.\nInterface requirements\nTo work with the System, a full-featured browser with the following settings is required (usually active by default):\nJavaScript execution is allowed;\nthe use of cookies is allowed;\nSSL encryption of traffic is supported (HTTPS is allowed).\nWorkstation requirements\nSupport type\nSpecifications\nProcessor\nIntel Core i5\n6 MB SmartCache memory\n4 cores\n2.80 GHz\nand higher\nRAM\nAt least 8Gb\nHDD\n10 GB SSD (free space)\nOS\nWindows 7+, MacOS 12+\nOffice\nMS Office  2010, 2013, 2016+\nDocker\nDOcker is required to work with the System:\nDocker (the installation file is available via the\nlink\n);\ninstallation file for Linux Debian\n;\nDocker Composer (the installation file is available via the\nlink\n).\nArchitecture model\nVisual of the architecture taking condisdering the recommended technological solutions (IT stack), as well as their possible analogues (alternatives):\nLearn more about\ninstallation and launch of the Platform\n.",
  "source": "https://docs.greendata.ru/platform/en/system-requirements-for-system-deployment.html"
}