{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.434.2 of October 18, 2024\nNew features\n1. The hotkeys support when working with registries and instance profiles was added.\n2. Now the number of instances can be optionally displayed in the\nregistry grouping\n.\nIn the\n\"Table\" dashboard\n, it is now possible to create a combined header for table columns similarly to\nobject registries\n.\n1. In the eDoc module, when working in version comparison mode, displaying the user who made the change to the document was added.\n2. Files can now be uploaded via the Edoc document registry interface.\nThe\ntraceId\nlabel was added to the log to ease searching for records related to a single operation.\nChanges and improvements\nChecking the uniqueness of attribute values included in a restriction or key, while simultaneously saving several objects with the same values was stabilized.\nThe display of the registry with fixed columns when scrolling was optimized.\nThe filtering operation in the registry when changing the filter type was stabilized.\nThe process of transferring the registry visual using GUF files was improved.\nThe display of the\n\"Status Bar\" widget\nwas stabilized.\nIt is now possible to display an instance profile in the\ncommunication panel\nwhen selecting it in the\n\"Object registry\" widget\n.\nThe operation of\nbatch action\nwhen using the\n\"Object registry\" widget\nwas stabilized.\nThe option to add the \"Loading local objects from Excel\" user interface module to\nbatch action\nwas added.\nThe\nattrOldValue\nfunction was improved.\nThe display of additional task attributes for the mobile application and web-version according to the application field was added.\nIn the business process task profile, the display of the attribute highlighting style for selecting the responsible was improved.\nThe operation of data sources based on requests with comments was optimized.\nNow the user who installed the update is recorded in the action audit and the display of records depending on the selected language was optimized.\neDoc improvements: the display of the document history when another user creates a new version and entering text in the table cells was improved; a notification about the creation of a new version of the document was added.\nIn the GreenData Meet, the sound quality for several users simultaneously turning on microphones was improved.\nThe operation of child attributes with\n\"OnChanged\" event\nwas improved.\nThe registry search filters for \"String\" and \"Text\" attributes was stabilized.\nWidget transferring using GUFs with\n\"Title by attribute\" widget\nand\n\"Status bar\" widget\nwidgets was stabilized.\nAttaching files in the System was stabilized.\nThe backward compatibility for \"Setting buttons on the control panel in the registry\" object type instances was improved.\nIn the\nGreenData Messenger\n, receiving messages from a chat with a telegram bot was optimized.\nThe unification of modal windows in the System was implemented.\nRegistry settings for the \"File Storage\" object type [FS_STORAGE] and instance visuals were improved.\nThe display of analytical source fields when setting up the previosuly created tables in\nThe \"Dynamics chart\" dashboard\ndashboard was improved.",
  "source": "https://docs.greendata.ru/platform/en/LTS.434.2-latest.html"
}