{
  "title": "Геопозиция пользователя",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nГеопозиция пользователя\nВ приложении имеется возможность определения местоположения пользователя по IP-адресу, которое при необходимости может быть изменено пользователем.\nДанная возможность контролируется настройками, производимыми в экземпляре типа \"Настройка определения геопозиции\" [SYS_GEO_SETTINGS].\nДля того чтобы включить определение геопозиции пользователя, необходимо активировать одноименный выключатель, после чего станут доступны следующие параметры настройки:\nПараметр\nНазначение\nВключить определение геопозиции пользователя\nПри активации переключателя Система автоматически определяет местоположение пользователя по IP-адресу или настройкам браузера и отображает распознанный город в навигационной панели.\nЕсли Системе не удалось определить геопозицию, в навигационной панели отображается \"Город не определился\".\nПоказывать окно подтверждения геопозиции\nАктивация параметра предоставляет пользователю\nвозможность изменения\nавтоматически определенного местоположения.\nПосле авторизации в приложении откроется диалоговое окно для подтверждения установленного города, в котором пользователь может подтвердить или изменить местоположение, или в случае когда город не определился, осуществить выбор города из прикладного списка городов.\nСправочник городов\nДобавление пользовательского справочника со списком городов, которые будут доступны для выбора конечному пользователю.\nАлгоритм фильтрации экземпляров справочника городов\nДобавление алгоритма типа \"Условие фильтрации\", который отвечает за статичную/динамическую фильтрацию конечного списка городов, отображаемых пользователю.\nАлгоритм возвращает массив объектов справочника.\nСопоставлять по атрибуту\nОпределение атрибута указанного справочника, по которому осуществляется сопоставление значений пользовательского справочника и значения текущей геопозиции пользователя.\nЕсли определенный Системой город отсутствует в справочнике, будет отображено уведомление: \"Вашего города нет в справочнике городов системы\", при этом пользователю будет предложено оставить текущий город или выбрать другой город из прикладного справочника.\nЕсли пользователь оставил текущий город, который отсутствует в справочнике городов, при этом на геопозицию была завязана фильтрация в реестре, тогда перед пользователем будет отображен пустой реестр объектов.\nЗадержка отображения, сек.\nПериод времени (в секундах) относительно полной загрузки страницы, через который пользователю будет отображено окно для подтверждения автоматически установленной геопозиции.\nОтсутствие значения воспринимается как 0 секунд.\nПо умолчанию значение параметра равняется 30 секунд.\nТаким образом при активном переключателе \"Включить определение геопозиции пользователя\" Система автоматически определит геопозицию пользователя.\nПри активном переключателе \"Показывать окно подтверждения геопозиции\" пользователь по нажатию на установленный город в навигационной панели сможет заменить его.\nДля выбора доступны города справочника, выбранного в параметре \"Справочник городов\", при необходимости отфильтрованного алгоритмом фильтрации экземпляров справочника городов.\nКнопка \"Определять автоматически\" позволяет вернуться к исходному местоположению, определенному Системой.\nПри помощи функции\ncurrentUserGeoLocation\nтекущее местоположение пользователя может использоваться для настройки отображения конкретных объектов Системы.\nНапример, в каталоге товаров для жителей г.Москва будут показаны только товары, доступные для приобретения в Москве.",
  "source": "https://docs.greendata.ru/platform/ru/user-location.html"
}