{
  "title": "Visuals for \"Integer\", \"Number\", \"Money\" type attributes",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nVisuals for \"Integer\", \"Number\", \"Money\" type attributes\nAttributes of \"Integer\", \"Number\" and \"Money\" types are used to display numbers. Visuals for these attribute types are made for a clear representation of data as shown here below.\nThe display format of attribute values of \"Integer\", \"Number\" and \"Money\" types in the System is determined according to the selected\ncountry\nand\nlocale\n.\nFor example, when the country is set to the USA and the locale is EN, the default number format will be as follows in accordance with international standards for the USA:\n1,234,567.89\nIf the country \"Austria\" is selected, with the locale set to EN, the number will be displayed in the following format:\n1.234.567,89\nVisuals for integer attributes\nSetting up the \"Attribute by type (for numbers)\" visual\nThe \"Attribute by type (for numbers)\" visual allows\nselecting an attribute type in a configurable profile\n.\nThis visual does not require additional settings.\nAfter selecting a visual and saving the type, the System will display two fields in the profile for selecting:\nobject type;\nattribute of the selected object type.\nSetting up the \"Loading indicator\" visual\nThe \"Loading Indicator\" visual allows displaying the\ninteger attribute value as an indicator\n. That is, the value of the configured attribute must be a countable value. The attribute setting looks like this:\nWhere\nin the \"Signature algorithm\" field\n, the indicator signature is formed using an algorithm (optional).\nSetting up the \"Input field with range slider\" visual\nThis visual allows displaying the attribute as a slider in the profile. The visual is used ''\nfor working with the \"Integer\" attribute type\n''. The attribute retains the value specified by user via the slider.\nThe visual settings contain the following parameters:\nSetting\nPurpose\nVisual for attribute of the type \"Integer\"\nDisplaying the name of the selected attribute visual.\nMaximum value\nSelecting/inputting an algorithm that determines the maximum slider value. It can be defined by an integer value or an attribute, for example:\nMinimum value\nSelecting/inputting an algorithm that determines the minimum slider value. It can be defined by an integer value or an attribute, for example:\nMaximum value (Virt.)\nSelecting/inputting an algorithm that determines the virtual maximum slider value. This value limits the maximum slider value in the profile (optional).\nMinimum value (Virt.)\nSelecting/inputting an algorithm that determines the virtual minimum slider value. This value limits the minimum slider value in the profile (optional).\nStep\nSelecting/inputting an algorithm that determines the slider step. It can be defined by an integer value or an attribute.\nAdditional line\nEntering text to display inside the slider (optional).\nCentered\nA flag that allows to center-align the text of the additional line (optional).\nAllow a negative values\nA flag that determines the use of negative values (optional).\nUpdate the value when dragging\nA flag that determines the immediate update of the attribute value and recalculation of related expressions during slider manipulation (optional). If the flag is not selected, the attribute value and recalculation of related expressions are updated after the slider value is set (after the user releases the slider).\nSetting up the \"Weekday\" visual\nThe \"Weekday\" visual for the integer attribute\nallows displaying a dropdown list for selecting a weekday.\nThis visual does not require additional settings.\nSetting up the \"ETL structure selection\" visual\nThis visual allows to visually display the data structure used in the\nETL process\n. The visual is usually used to display attributes of technical types, such as\nETL converters\n.\nThe \"Collection of input/output data\" attributes\nare displayed using the current visual.\nTo configure the visual:\nselect the visual;\nspecify the attribute containing the ETL structure.\nIn the object profile, the attribute will be displayed as a dropdown list with a tree structure of the presented data:\nVisuals for \"Number\" and \"Money\" attributes\nSetting up the \"Entering monetary values\" visual\nThe \"Entering monetary values\" visual is used to display numeric values with separators.\nThe values are displayed as follows:\nSetting up the \"Entering percentage values\" visual\nTo work with numeric values, the corresponding attribute type is used, and the data display is configured with the corresponding visual. In our case it is \"Entering percentage values\":\nPlease note that the number of decimals is also specified on the \"Basic\" tab, which is a priority attribute property.\nWhen displaying the value of the configured attribute, the System will indicate the percentage sign \"%\".\nSetting up the \"Scale-sensitive display\" visual\nThe \"Scale-sensitive display\" visual allows displaying the \"Arbitrary Precision Number (money)\" attribute type in the required scale. The scale is set by the \"Value scale\"\n[SPR_SCALE]\nsystem type.\nInstances of this type define the data display scale.\nThis object needs to be included in the configurable type with the object attribute. To display monetary attributes of this type, the \"Number Display Considering Scale from Attribute Type\" visual is used, selecting the required system attribute \"Value scale\"\n[SPR_SCALE]\n.\nAfter selecting this visual, the attribute value will be displayed as follows:",
  "source": "https://docs.greendata.ru/platform/en/integer_number_money_attribute_visuals.html"
}