{
  "title": "Настройка расписания запуска действий",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка расписания запуска действий\nДля\nавтоматического выполнения действия\nв Системе необходимо задать\nрасписание его запуска\n. Время запуска задается\nв формате CRON\n.\nНастройка расписания запуска действий выполняется в одноименном разделе главного меню, который доступен после последовательного выбора пунктов:\nАдминистрирование→ Настройки→ Расписание запуска действий\n.\nВ открывшемся реестре \"Планировщик заданий\" следует создать новый экземпляр нажатием на кнопку\nна панели управления (подробнее о\nработе с реестрами\n).\nПараметры настройки\nНастройка расписания запуска действий осуществляется при помощи следующих параметров:\nПараметр\nНазначение\nНаименование\nВвод наименования настройки.\nСистемное действие\nОпределение системного действия к выполнению. Необходимо выбрать действие для запуска по расписанию.\nРасписание работы действия\nВвод периода запуска алгоритма (подробнее, см.\n\"Планировщик в формате CRON\"\n).\nЛокаль\nОпределение локали, в которой будет выполнено расписание.\nРасписание действует\nПодтверждение выполнения запуска системного действия по расписанию. Возможные значения:\nда – запуск действия по расписанию выполняется;\nнет – запуск действия по расписанию не выполняется.\nПоследнее выполнение прошло успешно\nРезультат выполнения запуска действия. Возможные значения:\nда – выполнено успешно;\nнет – выполнено неуспешно.\nПараметр будет заполнен автоматически.\nДата последнего выполнения\nДата и время выполнения последнего запуска действия.\nПараметр будет заполнен автоматически.\nОбъект с параметрами для действия\nПоле будет доступно после выбора значения в поле \"Системное действие\".\nВыбор объекта (настроечного типа) с параметрами системного действия, указанного ранее. Параметры для действия могут отличаться в зависимости от выбранного системного действия.\nВ случае изменения\nпериода запуска\nв действующем расписании, необходимо отключить и включить его запуск для обновления данных.\nДля этого необходимо сохранить карточку запуска действия со значением \"\nНет\n\" в поле \"Расписание действует\", затем – со значением \"\nДа\n\" в том же поле.\nПримеры\nПример №1. Запуск алгоритма\nВ рамках данного примера следует в настройках расписания указать название расписания, тип системного действия\n\"Запуск алгоритма\"\n, время запуска алгоритма. В поле \"Расписание действует\" необходимо выбрать значение \"Да\". Поля \"Последнее выполнение прошло успешно\" и \"Дата последнего выполнения\" будут заполнены автоматически.\nПосле выбора системного действия в карточке экземпляра отобразится поле \"Объект с параметрами для действия\". Необходимо нажать на кнопку \"Создать новый\", чтобы настроить параметры для автоматического запуска алгоритма.\nНажав на кнопку, пользователю нужно выбрать тип настраиваемого объекта\n\"Параметры для автоматического запуска алгоритма\"\n.\nАвтоматически пользователем будет создан новый экземпляр выбранного типа. В данном случае был настроен алгоритм, при запуске которого происходит информирование в чате сотрудников о днях рождения.\nДля настройки автоматического действия необходимо заполнить следующие поля:\nПараметр\nНазначение\nАлгоритм для выполнения\nОпределение алгоритма, который будет запускаться.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nВыполнять в одной транзакции\nПризнак, определяющий выполнение алгоритма в рамках одной транзакции.\nПри активном параметре выполнение алгоритма выполняется в одной транзакции. Если параметр неактивен, то выполняется одна транзакция для каждой функции\nsave\nв алгоритме.\nПо умолчанию параметр активен.\nВид объектов для запуска\nОпределение вида объектов для запуска алгоритма, выбранного в параметре \"Алгоритм для выполнения\".\nВозможные варианты:\nвыбор списка объектов –  алгоритм будет выполнен по объектам, выбранным в параметре \"Список объектов\";\nвыбор типа объекта и алгоритма фильтрации – инициирует запуск алгоритма по каждому объекту типа, указанному в параметре \"Тип объекта для определения объектов для запуска\", который соответствует условию фильтрации, заданному в параметре  \"Алгоритм фильтрации объектов\".\nСписок объектов\nОпределение объектов системы, по которым будет осуществлен запуск алгоритма.\nВыбор ранее созданных объектов осуществляется из выпадающего списка, добавление нового объекта доступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор списка объектов\".\nТип объекта для определения объектов для запуска\nОпределение типа объектов, по объектам которого будет осуществляться запуск алгоритма.\nВыбор ранее созданного типа объектов осуществляется из выпадающего списка, добавление нового\nтипа объектов\nдоступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор типа объекта и алгоритма фильтрации\".\nАлгоритм фильтрации объектов\nОпределение алгоритма для фильтрации объектов, по которым будет осуществляться  запуск алгоритма выполнения.\nВыбор ранее созданного алгоритма фильтрации осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор типа объекта и алгоритма фильтрации\".\nПо завершении настройки параметров запуска алгоритма следует сохранить данные. Алгоритм для выполнения действия будет отображен в карточке расписания.\nВидеообзор настройки запуска алгоритма по заданному объекту\n.\nПример №2. Запуск ETL\nВ данном случае следует в настройках расписания указать название расписания, тип системного действия\n\"Запуск ETL\"\n, время запуска действия. В поле \"Расписание действует\" нужно выбрать значение \"Да\". Поля \"Последнее выполнение прошло успешно\" и \"Дата последнего выполнения\" будут заполнены автоматически.\nПосле выбора системного действия в карточке экземпляра отобразится поле\n\"Объект с параметрами для действия\"\n. Необходимо нажать на кнопку \"Создать новый\", чтобы настроить параметры для автоматического запуска ETL.\nПользователю нужно выбрать тип настраиваемого объекта нажатием на \"Параметры для автоматического запуска ETL\".\nАвтоматически пользователем будет сформирован новый экземпляр выбранного типа. В данном случае были созданы:\nобъект ETL, который отображает информацию о прожиточном минимуме;\nалгоритм для формирования параметров запуска ETL.\nДля настройки автоматического действия необходимо заполнить следующие поля:\nПараметр\nНазначение\nОбъект ETL\nВыбор объекта ETL, который будет запущен.\nАлгоритм для формирования параметров запуска ETL\nОпределение алгоритма для формирования параметров стартового экземпляра запускаемого объекта ETL.\nПо завершении настройки параметров запуска ETL следует сохранить данные. Объект ETL будет отображен в карточке расписания.\nПример №3. Запуск расчета\nДля создания расписания запуска расчета необходимо в настройках расписания указать название, тип системного действия\n\"Запуск расчета\"\n, время запуска расчета. В поле \"Расписание действует\" необходимо выбрать значение \"Да\". Поля \"Последнее выполнение прошло успешно\" и \"Дата последнего выполнения\" будут заполнены автоматически.\nПосле выбора системного действия в карточке экземпляра отобразится поле \"Объект с параметрами для действия\". Необходимо нажать на кнопку \"Создать новый\", чтобы настроить параметры для автоматического запуска расчета.\nПользователю нужно выбрать тип настраиваемого объекта нажатием на \"Параметры для автоматического запуска расчета\".\nАвтоматически пользователем будет создан новый экземпляр выбранного типа. В данном случае была выбрана методика, по которой будут ежеквартально рассчитываться значения показателей оценки риска нефинансовых компаний.\nДля настройки автоматического действия необходимо заполнить следующие поля:\nПараметр\nНазначение\nМетодика\nОпределение\nметодики расчета\n, которая будет запущена.\nАлгоритм выбора отчетной даты (опционально)\nВыбор\nалгоритма\nдля определения отчетной даты.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nОтчетная дата задается при использовании в методике\nформ отчетности\n.\nРежим выбора объектов\nОпределение способа выбора объектов системы, по которым будет осуществлен расчет. Возможные значения:\nвыбор по типу объекта;\nвыбор по типу (с алгоритмом фильтрации);\nручной выбор из списка.\nДля расчета используется тип объектов\n\"РМ. Карточка расчета\" [CALC_CARD]\nи его дочерние типы.\nТип объектов для расчета\nОпределение типа объектов, по объектам которого будет осуществляться запуск расчета.\nВыбор ранее созданного типа объектов осуществляется из выпадающего списка, добавление нового\nтипа объектов\nдоступно через меню действий параметра.\nПараметр доступен при установке режима выбора объектов \"Выбор по типу объекта\".\nАлгоритм фильтрации объектов для расчета\nОпределение алгоритма для фильтрации объектов, по которым будет осуществляться запуск расчета.\nВыбор ранее созданного алгоритма фильтрации осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПараметр доступен при установке режима выбора объектов \"Выбор по типу (с алгоритмом фильтрации)\".\nОбъекты расчета\nОпределение объектов системы, по которым будет осуществлен запуск расчета.\nВыбор ранее созданных объектов осуществляется после нажатия на кнопку\n, добавление нового объекта доступно при нажатии на кнопку\nв панели управления реестра.\nПараметр доступен при установке режима выбора объектов \"Ручной выбор из списка\".\nТип динамики\nОпределение динамики (временного периода) предоставляемых данных в методике расчета. Возможные значения:\nдень;\nмесяц;\nквартал;\nгод;\n…​\nПо завершении настройки параметра запуска расчета следует сохранить данные. Указанная методика будет отображена в карточке расписания.",
  "source": "https://docs.greendata.ru/platform/ru/configuring-the-scheduled-actions-to-run.html"
}