{
  "title": "Subject area",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSubject area\nIn order to effectively work with System data, understanding the principles of creating, implementing business processes and user preferences is not enough. It is important to understand what kind of information the System should manage, and therefore, it is necessary to know what logical connections can exist between different objects of the System.\nSubject areas are used to form such an understanding. They display the structural elements of the task (entity), their own attribute composition and the relations between the elements (including inheritance relationships that allow us to judge the inherited attributes).\nA subject area is a directory of subject areas that contains object types related to a single task.\nThe purpose of constructing subject areas is to obtain a graphical representation of the logical structure of the subject area under study, i.e. to display the relationships between the objects of the System.\nCreating a subject area\nTo create a subject area, the user needs to go to the\nregistry\nof the \"Subject area\" [SUBJECT_AREA] type. To do this, sequentially select the following menu items: Administration → Object management → Subject areas.\nNext, in the registry, click the\nbutton to create a new instance.\nFor users of\nSaaS\nand\nPrivate Cloud\nsolutions, a modal window will open to select a creation method:\nIn\nOn-Premise\nsolutions, the ability to use a template when creating a subject area is controlled by a parameter in the application\nconfiguration file\n.\n– a blank subject area will be created;\nselecting a product template from the \"Ready-made solutions\" section – creating a subject area based on a ready-made template.\nTo install the selected product, click the corresponding button, confirm the action in the modal window, and wait for the installation process to complete. After that, the \"Installed\" label will appear next to the product. Clicking on the product will open the corresponding subject area, available for editing.\nThe user can read the detailed product description by clicking the \"Learn more\" button, which will open the product page on the Marketplace.\nOn the page that opens, specify the name of the subject area in the field located on the control panel.\nThe default name is New Subject Area.\nAfter that, creating and customizing the subject area is done using the buttons located on the control panel and in the subject area creation area.\nThe following buttons are located on the control panel of the subject area:\nButton\nPurpose\nCreating subject area.\nClicking the button opens a new tab for creating a new subject area.\nSaving subject area\nIf the subject area is not saved, the configured data model will be cleared when the page is refreshed or when navigating back to the previous page.\nAction back.\nAction repeat.\nVisual settings.\nExporting subject area.\nFiting the subject area to the screen. Automatic scaling of the subject area display to fit the user’s screen size.\nSetting up screen form for the object.\nEntering values for the multi-language attribute.\nDisplaying the\nobject tags\npanel.\nOpening a window to search for attributes and object types in the subject area by entering a text query.\nMore info\nThe search field can be opened by using the keyboard shortcut Ctrl+F.\nThe object type is searched by object type name and table name, even if these values were hidden in the subject area via object display settings.\nThe attribute is searched by attribute name, by field name for the table and by attribute type, even if these values were hidden in the subject area via attribute display settings.\nAll items matching the search query will be bolded in the subject area, and the table of the found item on which the focus is located will be highlighted in yellow.\nMoving between the found items is done using the\nbuttons.\nTo clear the search field click on the\nicon, to close the search window click on the\n.\nDeleting the subject area.\nThe button is active only for a previously saved subject area.\nIn the subject area creation area:\nButton\nPurpose\nAdding object type to domain\nCreating new object type\nSubject area generation\nusing AI\nMoving option is carried out by:\nmouse wheel scroll – up and down movement;\npressing the mouse wheel and moving the mouse – moving across the entire workspace in all directions.\nSaving changes when configuring the subject area is required and is done by clicking the\nbutton.\nAdding object types to the subject area\nAdding existing object types\nTo add entities to a subject area:\nClick\nbutton.\nIn the opened modal window, select the required entities in the \"Object types\" table.\nThe full list of types in the \"Object types\" column becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for the\n\"View system types in the \"Object type\" registry\"\n.\nUsing\nbuttons, move the entities to the \"Subject area\" table.\nClick the \"Add\" button.\nAs a result, the list of entities with their relations elements, generated in the \"Subject area\" table, will be added to the subject area.\nCreating new object types\nThe user can add previously created object types as well as create new objects and add them to the workspace by clicking\n. After clicking the button, a new type of object creation window will appear on the screen.\nWhen all necessary data is filled in, click \"OK\". The created object will be automatically displayed in the subject area. The object type can be also added to the subject area by right-clicking on the workspace, the action \"Add an object Type to the Domain\" will appear.\nSubject area generation\nAt the moment the object model generation\nonly supports Russian language\n, other languages will be available later.\nTo learn more about the available option for generating a subject area, please refer to the\narticle\n.\nUsing artificial intelligence to create subject area is available only for\nSaaS solution\n.\nThe subject area can be generated using AI based on the text description. To do this, click on the button\n, which will open a modal window where the name and description of the object model should be specified, then click on the\nbutton.\nOnce the object model generation process is complete, a list of objects will be generated that can be displayed on the subject area.\nWorking with objects\nThe actions applied to the added object are available by right-clicking on the subject area object.\nButton\nPurpose\nDisplaying parent attributes of an object type on a subject area. To hide the parent attributes, click\nthe\n.\nEditing object type.\nClicking on the button in the modal window opens an object type profile.\nDeleting an object type. When clicking the button, the user must choose a deletion method:\nRemove object type from the domain - excludes the object type from the domain without deleting it from the System;\nDelete object type - permanently deletes the object type from the System with no possibility of recovery.\nPermanent deletion of an object is only allowed if the user has the \"Run\"\npermission\nfor \"Delete objects without possibility of recovery\". Otherwise, the object type will only be removed from the subject area.\nThe user can also remove a selected object type from the domain by clicking the\nDelete\nkey on the keyboard, followed by choosing the deletion method in the modal window.\nCreating an associative link.\nCreating an\n\"Extension\"\ntype relation.\nAdding local objects.\nWhen clicking the button, a modal window opens, which includes 2 columns.\nIn the first one, entities are selected from the presented registry of local objects of the selected object types. The selected element changes color and can be moved to the second column using\nbuttons, which defines the list of objects that need to be reflected on the subject area.\nIf an object type has only one descendant, it will be automatically added to the subject area.\nConfiguring the screen form for an object.\nIf the object already has a configured visual, a\nmodal window\nwill open, allowing to select a visual for editing or create a new one. If no visual exists, the\nvisual editing mode\nwill open in a new tab.\nOpening the object registry.\nWhen clicking the button, the\nobject registry\nwill open in a new tab.\nThe location of objects and their relations can be changed by the user using drag-and-drop.\nThe selected object can be deleted from the subject area by pressing the \"Delete\" key on the keyboard.\nIn order to undo or repeat the action, use\nand\nbuttons on the control panel.\nSaving changes when configuring the domain subject area is mandatory and is done by clicking\n.\nConfiguring visual settings\nIn order to correctly configure the subject area, it is necessary to determine what information and in what form it will be displayed on the area. To do this, go to the settings of the subject area by clicking\n.\nThe default settings are as follows:\nObject display\nIn this section, the type of visualization in the subject area can be selected. The user can display the name of the object, its identifier, or both options at the same time.\nOne of the \"Show type name\" or \"Show table ident\" modes must be enabled.\nAttribute visual\nThis setting allows the user to determine what information about the properties (attributes) of an object will be presented in its card. To do this, the configuration of the display of the following elements is required:\nName;\nIdentifier;\nRequired;\nAttribute type color;\nAttribute type.\nRelation visual\nFor a detailed visualization of the relations between objects, the System automatically displays the type of arrow that corresponds to a particular type of relation.\nThere are 3 types of arrows (of relations between objects) in total:\nDesignation\nName\nPurpose\nInheritance\nLink to the parent object\nAggregation relation\nLink to the Local object of the main object type\nRelation link\nLink to the object that is more commonly used as a directory\nWhen right-clicking on an associative relation, the following options are available:\n- convert the association relation into an aggregation relation. When clicking the button, a modal window will open for creating a child attribute.\n- delete the association relation. When clicking the button, a modal window will open to confirm the relation deletion from the subject area and the removal of the object attribute in the object type.\nIf the target object type is a system type, these options are unavailable.\nIn the data visual editing mode, the user can customize the visualization of relations between objects. It is done by:\nAllowing (restricting) demonstration of a relation type;\nSelecting the type of line.\nExport subject area\nThe customized subject area can be exported for further use in 3 possible formats:\nPNG;\nJPEG;\nPDF.\nClick\n, specify the name in the field and select the desired format. After selecting the file format, the download will start.\nConfiguring the screen form for an object\nTo edit the object\nvisual\n, select the desired object in the subject area, then click on\n, which allows\nconfiguring the screen form for the object\n. Next, a modal window will open where a new visual can be created or an existing visual can be edited. To edit a visual select it in the list and click on the “Edit” button.\nCreating a new visual is done by clicking the corresponding button.\nDelete subject area\nDeleting a subject area is done by:\ndeleting an instance in the “Subject Area” type registry;\nclicking on\n, located on the control panel of the subject area profile, which becomes active after saving the diagram.\nAfter that, the System will display a window in which the user is required to confirm the decision.",
  "source": "https://docs.greendata.ru/platform/en/subject-area.html"
}