{
  "title": "sendMsgToSubjects",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nsendMsgToSubjects\nОтправка сообщения по электронной почте произвольному списку получателей с возможностью указания получателей копии и скрытой копии письма.\nСинтаксис\nsendMsgToSubjects\n(pattern, to_list, cc_list, bcc_list, [reply_to], [object], [files], [email_account])\nПараметр\nНазначение\npattern\nШаблон уведомления (экземпляр типа\n\"Шаблон уведомления\"\n[SYS_EMAIL_NOTIFICATION] или\n\"Уведомление в календарь\"\n[SYS_CALENDAR_NOTIFY]).\nto_list\nСписок получателей письма.\nВ качестве значения параметра необходимо передать\nдинамический массив\n(коллекцию объектов arrayList), элементами которого могут быть группы доступа, пользователи или E-mail адреса.\nВ качестве элементов массива можно указать строковое значение при помощи функции\ntext\n, справочник при помощи функции\ndict\nили атрибут посредством функции\nattr\n.\nЭлектронные адреса, переданные через данный параметр, будут видны всем получателям сообщения.\nПри вызове функции устанавливается фиктивная переменная\n\"to_list\"\n, которую следует заменить на необходимое значение.\ncc_list\nСписок получателей копии письма.\nВ качестве значения параметра необходимо передать\nдинамический массив\n(коллекцию объектов arrayList), элементами которого могут быть группы доступа, пользователи или E-mail адреса.\nВ качестве элементов массива можно указать строковое значение при помощи функции\ntext\n, справочник при помощи функции\ndict\nили атрибут посредством функции\nattr\n.\nЭлектронные адреса, переданные через данный параметр, будут видны всем получателям сообщения.\nПри вызове функции устанавливается фиктивная переменная\n\"cc_list\"\n, которую следует заменить на необходимое значение.\nЕсли отправка сообщения в копии письма не требуется, необходимо передать пустой массив – [ ].\nbcc_list\nСписок получателей скрытой копии письма.\nВ качестве значения параметра необходимо передать\nдинамический массив\n(коллекцию объектов arrayList), элементами которого могут быть группы доступа, пользователи или E-mail адреса.\nВ качестве элементов массива можно указать строковое значение при помощи функции\ntext\n, справочник при помощи функции\ndict\nили атрибут посредством функции\nattr\n.\nЭлектронные адреса, переданные через данный параметр, не будут видны другим получателям, получившим сообщение.\nПри вызове функции устанавливается фиктивная переменная\n\"bcc_list\"\n, которую следует заменить на необходимое значение.\nЕсли отправка сообщения в скрытой копии письма не требуется, необходимо передать пустой массив – [ ].\nreply_to\nСписок адресов электронной почты, на которые получатель сможет отправить ответное письмо.\nE-mail адреса передаются в виде строковых значений\nдинамического массива\n(коллекции объектов arrayList).\nПри отсутствии значения параметра ответное письмо поступит на адрес электронной почты, с которого осуществляется отправка текущего сообщения.\nПараметр необязательный.\nЕсли изменение адреса почты для получения ответного письма не требуется, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nobject\nОбъект Системы, к которому привязывается алгоритм. Если шаблон уведомления содержит алгоритмы, их выполнение произойдет в рамках указанного объекта.\nПараметр необязательный.\nЕсли объект не назначается, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nfiles\nСписок файлов, используемых в качестве вложений письма.\nК прикреплению можно указать отдельный файл или массив файлов.\nПараметр необязательный.\nЕсли прикрепление файлов к сообщению не требуется, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nemail_account\nАдрес электронной почты, с которого выполняется рассылка уведомлений.\nПараметр необязательный.\nПри отсутствии значения параметра для отправки сообщений используется электронный адрес учетной записи пользователя,\nвыбранной по умолчанию\n.\nПримечание\nВызов функции осуществляется с\nвкладки \"Сообщения\"\nпанели инструментов редактора алгоритмов.\nФункция используется в\nалгоритмах\nследующих\nтипов\n:\nАлгоритм. Карточки объектов;\nАлгоритм. ETL;\nАлгоритм для рассылки уведомлений;\nАлгоритм. Расчет методик;\nАлгоритм. Балансовая проверка;\nАлгоритм. Шаблоны документов.\nВ результате вызова функции откроется модальное окно для выбора\nшаблона сообщения\n.\nВ результате чего в код алгоритма вставится функция с выбранным шаблоном сообщения и фиктивными переменными, которые следует заменить на необходимые значения.\nВыполняется обязательная проверка:\nРазрешенных серверов отправки, указанных в одноименной\nсистемной настройке\n.\nЕсли настройка не содержит данных, отправка сообщений из Системы не реализуется.\nЗначения атрибута \"\nЗапретить отправку уведомлений на почту\n\" карточки\nсотрудника\n.\nПри активном положении переключателя Система блокирует рассылку.\nРазрешения на получение соответствующего уведомления на вкладке \"Дополнительная информация\" карточки\nсотрудника\n.\nПри неактивном положении переключателя напротив соответствующего шаблона уведомления Система блокирует рассылку.\nБазовым типом алгоритмов, используемых в шаблоне уведомлений, должен выступать тип, по объекту которого осуществляется отправка e-mail сообщения.\nАлгоритмы с базовым типом, не соответствующим типу, по объекту которого осуществляется отправка e-mail сообщения, не будут учитываться Системой.\nПример\nРассмотрим пример отправки шаблона сообщения \"Новости\" на электронные адреса пользователей, в том числе в копии и скрытой копии письма.\nАлгоритм может принять следующий вид:\nПосредством функции\nvar\nобъявляются переменные со структурой\nмассива\n:\nto\n– массив для определения основных получателей письма, в качестве элементов массива передается строковое значение \"\nivanov@greendatasoft.ru\n,\npetrov@greendatasoft.ru\n\".\ncc\n– массив для определения второстепенных получателей письма (которые указываются в копии письма), в качестве элементов массива посредством функции\ndict\nпередаются объекты справочника.\nbcc\n– массив для определения получателей в скрытой копии письма. Электронные адреса указанных получателей не будут отображаться другим адресатам. В качестве элементов массива посредством функции\nattr\nпередается значение атрибута.\nДалее на примере переменной \"to\" показано применение метода\nadd\nдля добавления в массив электронного адреса \"\nsergeev@greendatasoft.ru\n\".\nПосле вызова функции\nsendMsgToSubjects\nв открывшемся окне выбирается ранее подготовленный шаблон сообщения \"Новости\".\nФункция добавится в код алгоритма с фиктивными переменными. Первые три следует заменить на объявленные ранее переменные массивов\n\"to\"\n,\n\"cc\"\nи\n\"bcc\"\n.\nПредположим, что сообщение не содержит вложений и отправляется с электронной почты, указанной в\nучетной записи отправителя по умолчанию\n, поэтому соответствующие фиктивные переменные заменяются на\n\"null\"\n.\nНа примере параметра для списка получателей копии письма рассмотрена запись добавления в массив электронного адреса \"\nkazantsev@greendatasoft.ru\n\" непосредственно через аргумент функции.\nВ результате выполнения данного алгоритма с электронной почты, указанной в\nучетной записи отправителя по умолчанию\n, шаблон уведомления \"Новости\" будет отправлен на электронные адреса, указанные и переданные через справочник \"E-mail адреса\" и атрибут \"E-mail\".",
  "source": "https://docs.greendata.ru/platform/ru/sendmsgtosubjects.html"
}