{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.447.2 от 10.02.2025\nНовые возможности\nРеализована возможность управления лицензиями непосредственно из интерфейса приложения через одноименный пункт\nменю профиля пользователя\n.\nДоработана функция\nnewPdfFile\n: появилась возможность объединения нескольких файлов в один, а также опция подсчета страниц в файле.\nИзменения и улучшения\nСтабилизирована работа горячей клавиши Esc при закрытии модальных окон.\nОтлажена возможность выбора пользовательского\nспособа открытия объектов\n.\nПоявилась возможность исключения из Системы неактуальных типов объектов.\nДля всех системных типов выровнена работа алгоритмов заполнения наименования по умолчанию.\nСтабилизировано отображение значения атрибута при настройке цвета поля через алгоритм.\nОптимизирована работа\nавтокалькуляций\nпри удалении объекта, указанного в качестве значения в multiselect-атрибуте.\nСтабилизирована работа с\nисторическими атрибутами\n.\nПри работе с реестром отлажен процесс открытия карточки экземпляра посредством двойного клика.\nВ\nнастройках\nплоского реестра и реестра с иерархией опции \"Использовать в режиме редактирования\" и \"Сохранять сразу после снятия фокуса\" перенесены на вкладку \"Общие настройки\".\nОтлажено переключение страниц реестра с группировкой при работе с\nвиджетом \"Реестр объектов\"\n.\nПри работе с\nвиджетом \"Финансовая отчетность\"\nстабилизирован экспорт данных в Excel, а также отлажено отображение экземпляров\nформы отчетности\n.\nПри работе с\nаналитической панелью дашборда \"Таблица\"\nотлажена возможность настройки стиля форматирования для шапки столбца, а также оптимизирован процесс экспорта данных в Excel.\nСтабилизирован процесс переноса\nдашбордов\nс помощью\nобновлений\n.\nВ\nалгоритмах блокировки\nотлажена возможность вызова вложенного алгоритма.\nПри создании\nпункта меню\nстабилизирована работа алгоритмов выражений и событий.\nОтлажена работа функций\ncurrentUserHasGroup\nи\ndelete\n.\nСтабилизирована работа редактора алгоритмов.\nОтлажена работа\nпользовательского действия\n, размещенного во\nфрейме\n.\nОтлажен процесс\nзапуска бизнес-процесса\n.\nВ\nтаблице коэффициентов\nотлажено отображение данных.\nСтабилизировано применение прав на атрибуты типа при создании нового объекта.\nИзменен контроль доступа к карточкам типов объектов: теперь карточки типов доступны при наличии права на выполнение\nразрешения\n\"Просмотр метаданных\" и права на \"Чтение\" соответствующего типа объектов.\nВ\nаудите действий\nотлажено отображение экземпляров типа \"Формирование печатной формы по объекту\".\nОтлажена возможность предварительного просмотра документа в редакторе EDoc.\nТеперь в реестре документов EDoc создание и загрузка документов производится в текущей папке.\nВ модуле EDoc отлажено сохранение нумерации в списках при загрузке документа из файла. Помимо этого, стабилизирована работа при вставке текста из буфера.\nВ модуле EDoc отлажено использование источника данных типа \"Строка\" на основе объектного атрибута и стабилизировано применение форматирования к тексту при формировании печатной формы.\nТеперь при закрытии вкладки с активной встречей в\nGreenData Meet\nбудет отображено уведомление о возможной потере данных. Также оптимизирован процесс запроса разрешения на использование камеры и микрофона.\nВ\nGreenData Messenger\nстабилизирована возможность поиска по фрагменту ссылки, частям слов, числовым значениям, наименованиям прикрепленных файлов.\nСкорректировано отображение кнопок на панели управления реестра типа \"Привилегия контроля прав по дереву условий\" [SYS_TREE_ACC_TYPE].\nСкорректирован визуал объектов типа \"Настройка пользовательского реестра\" [SYS_REGISTRY_CUSTOM].\nИзменен внешний вид модального окна с предупреждением о несохраненных изменениях.\nУведомление при попытке входа в Систему пользователем, для которого настроено\nзамещение\nпо причине увольнения, стало более информативным.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.447.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.447.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.447.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.447.2-latest.html"
}