{
  "title": "\"Process Stage\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Process Stage\" widget\nThe \"Process Stage\" widget displays the full name and contact details of the performer of the business process stage\n(most often the examination stage) of the current route object.\nExample of a configured widget:\nBefore starting the widget configuration, create a new\nobject type\nand then its instances.\nThe \"Process Stage\" widget can be configured in the editing mode of the\nvisual\n. To do this, find the widget in the corresponding list in the \"Elements\" window and drag-and-drop it to the workspace.\nWidget settings\nConfiguring the widget involves filling in the following settings:\nSetting\nPurpose\nStage name\nEntering the name of the business process stage.\nResponsible employee identification algorithm (returns employee ID)\nSelecting an algorithm that determines the ID of the employee responsible for the route object\nChat employee list algorithm\nSelecting an algorithm that determines the list of employees of the general chat via the\ndict\nfunction.\nCollapse/expand widget algorithm (returns true/false)\nSelecting an algorithm that determines the state of the widget when opening the instance profile. Possible options:\ntrue - widget is expanded;\nfalse - widget is collapsed.\nExamination attribute\nSelecting an object attribute with the examination result.\nColor detection algorithm (returns color as a string)\nSelecting an algorithm that determines the color of the element to the right of the stage name. The color specified in the algorithm should be in HTML format.\nEmployee role algorithm\nSelecting an algorithm that determines the role (position) of the assigned employee.\nHide due diligence time\nA feature that allows users display information about the start and end dates of a business process stage and about the actual and regulatory time of completion of the stage.\nStart date algorithm (returns the Date)\nSelecting an algorithm that determines the date of acceptance of the task (stage of the business process). The parameter is available when the \"Hide due diligence time\" option.\nEnd date algorithm (returns the Date)\nSelecting an algorithm that determines the completion date of the task (stage of the business process). The parameter is available when the \"Hide due diligence time\" option is active.\nActual date algorithm (returns seconds)\nSelecting an algorithm that determines an actual period of the task completion (stage of the business process). The parameter is available when the \"Hide due diligence time\" option is active.\nNormative date algorithm (returns seconds)\nSelecting an algorithm that determines a normative period of the task completion (stage of the business process). The parameter is available when the \"Hide due diligence time\" option is active.\nEmployee name attribute\nSelecting an attribute of the \"Employee Directory\" type with information about the name of the responsible employee. The parameter is available after adding the algorithm for determining the responsible employee.\nEmployee subdivision attribute\nSelecting an attribute of the \"Employee Directory\" type with information about the name of the responsible employee. The parameter is available after adding the algorithm for determining the responsible employee.\nEmployee phone attribute\nSelecting an attribute of the \"Employee Directory\" type with information about the phone number of the responsible employee. The parameter is available after adding the algorithm for determining the responsible employee.\nEmployee email attribute\nSelecting an attribute of the \"Employee Directory\" type with information about the email of the responsible employee. The parameter is available after adding the algorithm for determining the responsible employee.\n== Configuration example\nThe widget can be configured as follows:\nThe\ngetWorkDatesBetween\nfunction – which calculates the number of seconds in the period – is used to configure the actual and normative periods. Specify an instance of the\n\"Calendar\" object type\nin the function parameters, that defines working days and holidays.\nAfter saving the settings, the System will display the widget in the instance profile.\nClicking\nopens a chat with employees specified in the widget.\nClicking\nopens a modal window with employees defined by the algorithm along with System administrators. After selecting the necessary employees, click the \"Open\" button which opens the chat with the selected employees.",
  "source": "https://docs.greendata.ru/platform/en/process-stage-widget.html"
}