{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.460.5 of June 18, 2025\nNew features\nNow, when creating an\nobject type\nor an\nattribute\n, the table/field name is generated automatically by the System.\nIt is now possible to display a file thumbnail in the registry column\nsettings\n.\nFiltering can now be configured in the extended version of the Kanban board.\nIt is now possible to create object chat using an algorithm.\nIn addition, functions for chat administration were added: adding/excluding users, setting up roles, assigning/removing the administrator role.\nForced stopping of ETL processes is now performed only with an appropriate\npermission\n.\nIt is now possible to select a text fragment in the document by holding\nShift\nand clicking with the mouse.\nChanges and improvements\nTo ensure unified terminology, the \"Messages\" menu item and \"Dialogs\" panel were renamed to \"Chats\".\nWhen working with an object type configured with permissions by condition tree, it is now possible to view users editing the object profile.\nThe modal window behavior for closing unsaved objects using the keyboard was improved.\nThe link functionality in pop-up notifications was restored.\nThe operation of\nobject lifecycle events\nwas debugged.\nThe process of adding\nobject tags\nwas stabilized.\nObject saving when editing the value of a chained attribute was improved.\nThe ability to copy the value of a \"Text\" type attribute using an algorithm was stabilized.\nChanging the value of a boolean attribute using a custom action algorithm was improved.\nData retention\nwhen closing an object profile without saving was optimized.\nIn the modal window for configuring \"String\" and \"Text\" attributes, the parameter for maximum length was renamed to \"Size, characters\".\nThe attachment of files to the file attribute was debugged.\nThe logic for transferring the registry along with control panel button settings with \"Default for all registries\" enabled using\nupdates\nwas improved.\nData filtering in the registry was improved.\nButton settings in the control panel now prioritize the\nobject attribute visual\nover the\nregistry panel button settings\n.\nThe display of object attribute values when grouping in a registry with a virtual column was stabilized.\nThe\nauto-refresh\nof registry data when editing objects via business processes was improved.\nPrimitive object filtering in the registry was improved.\nWhen working with the object registry located in a frame, the process of adding objects in edit mode was debugged.\nWhen creating a new object instance, the first\ntab\nnow displays correctly on the visual.\nDefault values were added for\n\"Image\"\nand\n\"Progress bar\"\nwidgets.\nThe work of the\n\"Financial statements\"\nwidget was debugged.\nThe widget size for\n\"Title by attribute\"\nis now saved according to the container on the\nvisual\n.\nTime-dependent attributes can now be locked using the\n\"Attribute table\"\nwidget.\nThe generation of a\nsubject area\nusing AI was optimized.\nColored display and critical path viewing when working with the\nGantt chart\nwas improved.\nThe preservation of data formats when exporting\nOLAP views\nwas improved.\nThe algorithm to automatically fill in the value when setting up the\n\"Control element\"\nanalytical dashboard panel was restored.\nThe process of creating Kanban boards was debugged.\nWhen setting up Kanban boards, the ability to select an attribute for dividing lanes into groups was debugged.\nThe signature placement algorithm in the\n\"Sign the file using a simple e-signature\"\naction was optimized.\nObject opening via a custom action algorithm was enabled.\nThe execution of the\n\"Sign the file (CryptoPro)\"\naction was stabilized.\nThe operation of the\ncurrentUser\nfunction with chain attributes was stabilized.\nThe display of the modal window when calling the\nobjectsWithOptions\nfunction was improved.\nThe\nobjects\nand\nobjectsWithOptions\nfunctions now accept the object type and tree/source/algorithm as a parameter (\nparam\n), dictionary value (\ndict\n), or variable (\nvar\n).\nThe creation of variables with names matching function names was restricted.\nThe tooltip display in the algorithm editor with\nCtrl\n+\nSpace\nwas stabilized.\nThe\ncopyAndSave\nfunction was optimized.\nThe\nisNumber\nfunction was improved.\nHighlighting of incorrect links in the\ndata converter\ndynamic structure was added.\nThe \"Search for object in directory\" transformer was improved.\nThe execution button for \"Run ETL on files\" is now locked if no ETL process is selected.\nThe\nbatch update\ninstallation process was improved.\nThe algorithm transfer via GUF was stabilized.\nThe ability to migrate object types containing attributes with a configured\ntwo-way relation\nusing updates was improved.\nWhen logging in via LDAP, the ability to create users with the administrator role was debugged.\nUser permissions verification for registry viewing and creation was improved.\nDefault permissions for structural groups for the \"Comment Marker\" type [SYS_RF_COMMENT_MARKER] were removed.\nVarious security enhancements were implemented in the System.\nThe date display based on\nconsolidation wizard\nsettings was improved.\nThe ability to delete reporting form lines was restored.\nBalance checks\nwere added when importing reports.\nThe automatic\ncalculation of methods\nwhen making manual adjustments was debugged.\nThe ability to edit templates in the\nreporting form import wizard\nwas restored.\nTahoma\nfont was added to the list of supported fonts in the document editor.\nText fragment insertion when copying from a *.docx file was improved.\nThe full-text comparison of versions with footnotes was stabilized.\nThe generation of printed tabular forms was improved.\nThe text fragment highlighting in printed forms was improved.\nThe filling of bookmarks in printed form tables was improved.\nThe display of the printed form file content was debugged.\nThe display of warning when opening an executable file was improved.\nThe message window display during speech recognition was stabilized.\nThe unread messages counter was adjusted.\nThe ability to use\nmeeting organizer tools\nwas stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.460.5-latest.html"
}