{
  "title": "Виджет \"Список файлов по статусам\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Список файлов по статусам\"\nВиджет \"Список файлов по статусам\" позволяет отобразить список прикрепленных файлов (документов) особым образом. Виджет используется для отображения экземпляров\nтипа\n\"Файл\" FS_FILE\nи его дочерних объектов.\nФайлы в виджете отображаются и могут быть отсортированы согласно\nего статусу\n. Статус файла определяется с помощью объектного\nсистемного атрибута \"Статус документов\" [RC_DEV_APP_DOC_STATE]\n. Его значение учитывается Системой по умолчанию, То есть в настройке виджета этот\nатрибут не указывается\n.\nВыглядит настроенный виджет следующим образом.\nВ зависимости от выбранных настроек, для пользователя будет доступен ряд действий. Действия в отношении файла доступны после наведения на него курсора.\nНастройка виджета\nВиджет работает с объектами типа \"Файл\", а также с несистемными дочерними объектами от типов:\n\"Чек-лист. Позиция в экземпляре\" [\nCHK_INSTANCE_POSITION\n]\n\"Чек-лист. Позиция в шаблоне\" [\nCHK_TEMPLATE_POSITION\n]\nВиджет отобразит ограничение по прикрепляемым форматам, если их зафиксировать в атрибуте\n\"Классификации файлов для добавления в чек-лист\" [CHK_FILEKINDS_TO_ADD]\nтипа \"Чек-лист. Позиция в экземпляре файлового листа\" [CHK_FILELIST_INST_POS]\n.\nЧтобы настроить виджет, необходимо:\n1. Выбрать виджет на панели.\n2. Перейти к настройке виджета по кнопке\nНастройка иерархии файлов\n- выбор настройки иерархии из выпадающего списка. Данная иерархия задается типом объекта\n\"Настройка иерархического отображения файлов\" [FS_HIER]\n. Подробная\nнастройка иерархического отображения файлов\n.\nКоличество элементов на странице\n- ввод количества выводимых на странице элементов (файлов/ объектов).\nУправляющие атрибуты\n- определение атрибута типа из выпадающего списка. В случае изменения указанного атрибута типа, Система автоматически обновит настраиваемое представление данных. Если управляющие атрибуты не указываются, обновление данных происходит в случае загрузки/ удаления объектов.\nПредставление реестра (Файлы)\n- выбор/ определение представления реестра (используется тип объекта \"\nПредставление реестра\n\"\n[SYS_REGISTRY]\n)\nПрикреплять файлы к нескольким позициям\n- признак, определяющий возможность прикрепления файла по нескольким классификациям одновременно.\nПредпросмотр файла\n- признак, определяющий\nвозможность просмотра файла из виджета\n. После выбора признака необходимо указать, как будет отображаться документ при предпросмотре:\nв модальном окне;\nв новой вкладке;\nв этой вкладке.\nВ случае выбора признака, в меню действия пользователя отобразиться кнопка для предпросмотра файла:\nФорматы файлов доступные к предпросмотру: \"tiff\", \"tif\", \"img\", \"pdf\", \"jpeg\", \"jpg\", \"gif\", \"png\", \"bmp\", \"xls\", \"xlsx\", \"pptx\", \"docx\".\nВид подписи\n- выбор вида подписи, для её прикрепления к файлу. Возможные значения:\nподпись клиента;\nподпись сотрудника банка.\nВыбранное значение используется при определении загружаемой подписи. Фактически это значение будет присвоено объектному\nатрибуту \"Вид подписи файла\" [FS_FILE_SIGN_KIND]\nэкземпляра\nтипа \"Электронная подпись файла\" [FS_FILE_SIGNATURE]\n.\nНастройки отображения фильтрации и сортировки\n- выбор кнопок для задания фильтрации и сортировки в виджете. Возможные значения:\n– отображать фильтрацию по экспертизе; Система позволит фильтровать документы согласно пройденной экспертизе. В шапке виджета отобразится кнопка \"Экспертиза\". Здесь учитывается объектный атрибут\n\"Экспертиза\" [EXPERTISE_ID]\n, используемый в\nдочерних объектах типа [CHK_FILELIST_INST_POS]\n– отображать фильтрацию по наличию подписи; Система позволит фильтровать документы относительно наличия подписи, в шапке виджета отобразится кнопка \"Наличие подписи\". Здесь учитывается логический\nатрибут \"Наличие подписи\" [FS_FILE_SIGNATURES]\n, используемый в\nтипе \"Файл\" [FS_FILE]\n– отображать фильтрацию по дате документа; Система позволит фильтровать документы по дате, в шапке виджета отобразится кнопка \"Дата документа\". Здесь учитывается\nатрибут \"Дата документа\" [DOC_DATE]\n, используемый в дочерних объектах\nтипа [CHK_FILELIST_INST_POS]\n– отображать фильтрацию по статусу; Система отобразит кнопки в шапке виджета согласно имеющимся статусам. Для определения статусов используется реестр типа объекта\n\"Статус документов\" [RC_DEV_APP_DOC_STATE]\n. Значения к отображению фильтруются следующей настройкой.\n– отображать сортировку по дате документа; Система отобразит кнопку \"Упорядочить\" с возможностью сортировки значений по дате. Системой учитывается ''атрибут \"Дата документа\" [DOC_DATE]\nтипа \"Файл\" [FS_FILE]\n.\n– отображать сортировку по наименованию; Система отобразит кнопку \"Упорядочить\" с возможностью сортировки значений в алфавитном порядке. Системой учитывается ''атрибут \"Наименование\" [NAME] дочерних объектов\nтипа [CHK_FILELIST_INST_POS]\n– отображать сортировку по размеру; Система отобразит кнопку \"Упорядочить\" с возможностью сортировки значений по размеру файла. Системой учитывается атрибут \"размер\" [FS_FILE_BODY_SIZE]\nтипа \"Файл\" [FS_FILE]\n.\nАлгоритм фильтрации статусов\n- выбор алгоритма для фильтрации статусов. Подробнее о работе с\nалгоритмами фильтрации\n. Например можно отфильтровать определенные статусы к отображению следующим образом:\nОтображать комментарий\n- логический атрибут, определяющий возможность отображения комментария. В случае выбора значения \"Да\", в строке файла отобразится кнопка\n.\nПечатная форма для действия \"Скачать отчет по подписям файла\"\n- определение\nпечатной формы\nдля выгрузки данных в случае нажатия на кнопку\n.\nПечатная форма для действия \"Скачать отчет по всем подписям файла\"\n- определение\nпечатной формы\nдля выгрузки данных в случае нажатия на кнопку \"Скачать отчет по всем подписям\"\n.\nАлгоритм наименования комментария отправителя\n- выбор алгоритма, формирующего наименование комментария отправителя. Алгоритм должен вернуть наименование, например, при помощи функции\ntext\n.\nАлгоритм наименования комментария получателя\n- выбор алгоритма, формирующего наименование комментария получателя. Алгоритм должен вернуть наименование, например, при помощи функции\ntext\n.\nРазрешить удаление файлов\n- логический атрибут, определяющий возможность удаления файла. В случае выбора значения \"Да\", в строке файла отобразиться кнопка\n. В случае выбора значения \"Нет\", пользователь не сможет удалить файл, но сохранятся иные возможности работы с документами в виджете.\nСкачивать файл с подписями\n- логический атрибут, определяющий возможность скачивания файла с подписями (при условии их наличия). В случае выбора значения \"Да\", в строке файла отобразится кнопка\n. При скачивании файла с подписью Система выгрузит архив, содержащий выбранный документ и *.sig.\nОтображать отдельное действие по скачиванию файла с подписями\n- признак, определяющий возможность скачивать файл с подписью или без. Для пользователя будет отображено два соответствующих действия:\n– скачать файл;\n– скачать файл с подписью.\nОтображать поиск\n- Признак, определяющий отображение поля поиска файлов. В случае выбора значения \"Да\", поле для поиска будет отображено в ряду с наименованиями статусов.\n3. Сохранить внесенные настройки по кнопке\n.\nРабота с виджетом\nОтображение виджета меняется, согласно выполненным настройкам. Виджет \"Список файлов по статусам\" отображает семь позиций. В случае прикрепления большего количества файлов, отображение файлов доступно посредством прокрутки (сролл файлов).\nНастройками регулируются действия пользователя в работе с файлом. Меню действий активируется при наведении курсора на файл.\n- предпросмотр файла.\n- подписать файл. Кнопка доступна, в случае выполнения следующих настроек\nдействий \"Подписать\"\n:\nфиксация связи действия\nс\nтипом объекта \"Файл\"\n;\n\"Отображать в LocalObject\"\n=\nДа\n(true).\nПосле нажатия на кнопку Система отобразит модальное окно для выбора используемой подписи.\n- отображение данных об используемых подписях в модальном окне. Кнопка доступна только для документа с подписью. После нажатия на кнопку, Система отобразит имеющуюся информацию:\nВ зависимости от подписи, фон представления данных имеет заливку:\nкрасную, если подпись не валидна;\nзеленую, если подпись валидна;\nсерую, если данных не достаточно для определения корректности подписи.\nИнформации о подписи можно выгрузить по кнопке\n. Печатная форма отчета определяется\nпараметром \"Печатная форма для действия \"Скачать отчет по подписям файла\"\nнастройки виджета.\n- скачать файл. Система выгрузит выбранный файл стандартным для браузера способом. Кнопка доступна в случае настройки\nдействий для скачивания файлов\n.\n- скачать файл с подписью. Система выгрузит архив, содержащий выбранный файл и подпись. Кнопка доступна в случае настройки\nдействий для скачивания файлов\n.\n- удалить файл. Выбранный файл будет удален из системы.\n- отображение комментариев к выбранному файлу. После нажатия на кнопку, для пользователя доступен ввод комментария. Следующее нажатие на кнопку\nскроет поле ввода комментария. Сохраненный комментарий зафиксируется в поле.\n- прикрепление файла. Для пользователя возможны:\nвыбор файла после нажатия на одну из кнопок;\nперетаскивание файла в Систему (drug’n’drop).\nРазмер файлов, загружаемых в Систему, имеет ограничение. Подробности представлены в\nстатье\n.\nВ Системе возможно одновременное\nприкрепление нескольких файлов\n. Прикрепляемый файл для нескольких позиций фиксируется как новый. Если прикрепляемые файлы\nфильтруются\n, эти настройки учитываются автоматически. Используемые расширения файлов ограничиваются объектным атрибутом\n\"Тип файла\" [FS_FILE_TYPE]\n.\nТакже Система позволяет загружать\nподписанные файлы\n, выбрав целевой файл и подпись к нему в формате *.sig. В этом случае файлы отобразятся с пиктограммой\n. В случае прикрепления только подписи, Система проверит отображаемые в виджете файлы. Если файл *.sig соответствует имеющемуся файлу, подпись зафиксируется. Если соответствующий файл отсутствует, подпись не фиксируется. В случае прикрепления невалидной подписи, она не сохранится и Система уведомит об этом.\nСуществуют следующие ограничения для отображения кнопок прикрепления файлов:\nприкрепление недоступно, если работа с виджетом заблокирована;\nпри работе с чек-листами кнопки для прикрепления файла не отображаются, если в атрибуте ''\"Открыт для добавления файлов\" [CHK_ENABLE_ADD_FILES]\nтипа \"Чек-лист. Экземпляр файлового листа\" [CHK_FILELIST_INST]\n'' указано значение \"Нет\". Если указано значение \"Да\", кнопки в виджете отображаются.\nВ случае прикрепления файла, Система отобразит экранную форму:\nВ зависимости от выбранных настроек при работе с виджетом доступны следующие действия для работы со всеми файлами одновременно.\nКнопка\nДействие\nПодписать все файлы одновременно. После нажатия на кнопку, Система отобразит установленные подписи. После выбора подписи и подтверждения действия, будут подписаны все файлы в настроенной иерархии.\nСкачать отчет по всем подписям. Система отобразит отчет по подписям, которыми отмечены имеющиеся в виджете файлы. Вид отчета определяется печатной формой, указанной в\nпараметре \"Печатная форма для действия \"Скачать отчет по всем подписям файла\"\nнастройки виджета.",
  "source": "https://docs.greendata.ru/platform/ru/file-list-by-status-widget.html"
}