{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.461.3 of June 30, 2025\nNew features\nIt is now possible to spell-check using browser tools when entering text in the\nstring\n/\ntext\nattribute field.\nThe\n\"Key Indicators\" dashboard analytics\nnow supports\nDrill Down decryption\n.\nWhen creating\ncustom action\n, it is now possible to use the \"Add files to attribute\" UI module.\nIt is now possible to customize the result of e-signature verification.\nIt is now possible to check the contents of the update file for prohibited data.\nIn\naudit\n, the ability to track principal actions by\nuser privilege\nlevel is now available.\nA setting for adjusting the page margins of a document was implemented.\nChanges and improvements\nThe process of selecting values in radiobutton using hotkeys was debugged.\nThe display of existing relations with dashboards when\ndeleting\nthe data source was debugged.\nThe logic of automatic generation of the table name/field for the table when\ncreating\nan object type or attribute was improved\nSwitching between tabs in\ntab group\nand in the\n\"Tab Management\"\nwidget was stabilized.\nThe copying process using\nset for copying attributes\nwas debugged.\nThe display of object attributes by the selected attribute of the object in the\n\"Choose instance type field\"\nsetting was stabilized.\nThe column selection process in the copied\nobject registry\nwas stabilized.\nDisplay of scroll bar in advanced registry search was improved.\nThe process of deleting registry pinned in\nobject attribute options\nwas debugged.\nThe mapping of virtual columns in the child attribute registry was stabilized.\nThe ability to filter data using a data source with parameters was debugged.\nThe loading of an object with a built-in registry with configured filtering based on SQL with parameters was stabilized.\nNow the\ndefault visual\ngot from\nupdate file\nis applied to the object being updated via GUF.\nThe display of a child attribute with the \"MultiLinkLocalObject\" visual is stabilized according to the specified visibility algorithm.\nThe display of buttons in the\n\"Search filters\"\ncompact widget type was debugged.\nThe default values were added to the settings of\n\"Button\" widget\n.\nThe locking algorithm applied to the\n“Date range”\nwidget was debugged.\nCreating an object profile through the\nkanban-board\nstage was simplified.\nThe ability to create a\nsubject area\nbased on a template from\nGreenData marketplace\nwas stabilized.\nIn the\nobjectsWithOptions\nfunction, passing necessary parameters to the “filterSource” method was improved.\nModal window naming when calling the\nvar\nfunction was adjusted.\nVulnerabilities when working with algorithms in the browser part of the application were fixed.\nThe newExcelWorkbook function was debugged.\nAlgorithm execution using the\ngetselected\nfunction via the\nactions\nbutton located on the\ndashboard\nwas stabilized.\nThe ability to save\nstart page\nwith no linking to an object after changing the principals composition of the “Who can see” section was debugged.\nThe possibility of excluding a user from an administrative group was debugged.\nThe ability to save\nstart page\nwithout relation with object was debugged after changing the composition of the subjects of the \"Who can see\" section.\nChecking of\npermissions for type attributes\nwas stabilized.\nThe display of condition names in the\npermissions for type attributes\nregistry was debugged.\nRoute update on task completion was debugged.\nThe processing of subprocess termination signals when there are several versions of signals with the same name was debugged.\nThe process of performing the “Reporting consolidation wizard” action was stabilized.\nDisplay of values of indicators involved in balance check algorithms was debugged.\nHiding the value of a custom token after saving an object was stabilized.\nThe ability to get\nlist of updates in the platform\nby clicking on\nwas debugged.\nThe update installation process with the parameters for connecting to the\nApache Kafka\nmessage\nqueue was stabilized.\nIntegration with Mango Office for recording call was improved.\nFile upload via the ETL process with active flags of asynchrony was debugged.\nChecking for available\nCI/CD\nupdates was stabilized.\nTab names when selecting objects to build updates and the default visual when searching by object type was adjusted and the object type registry was set.\nXml file processing vulnerabilities were fixed.\nThe file signing key length was increased to 2048 bytes.\nThe service administrator authentication process is now audited only during application startup for all server processes.\nThe logic of creating user session records in the audit when executing system processes was improved.\nThe system actions log now records the object id for which tasks are started.\nScrolling when working with a document was improved.\nThe  generation of a printed form file when copying content from another source was stabilized.\nThe visibility algorithms execution after updating values from sources was debugged.\nThe display of color fill in a row without symbols in the printed form file was stabilized.\nIn\nmobile app system settings\n, the icon for the “Tasks” menu item was changed.\nFile scrolling in\nGreenData Meet\nwas improved.",
  "source": "https://docs.greendata.ru/platform/en/LTS.461.3-latest.html"
}