{
  "title": "Вкладка \"Разметка документа\". Настройка закладок",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВкладка \"Разметка документа\". Настройка закладок\nЗакладка – настраиваемый и переиспользуемый объект текста для транслирования данных из заявки.\nНастройка закладок предполагает следующее:\nНастройка закладки\nСоздание закладки\nДля создания закладки в шаблоне ПФ необходимо выделить нужный текст (область, где будет размещена закладка) и нажать на кнопку\nна панели закладок.\nПосле откроется окно создания закладки. Необходимо заполнить поля \"Наименование\" и \"Идентификатор\" (обычно их названия дублируются) и нажать на кнопку \"Ок\".\nПосле сохранения созданная закладка будет отображена на панели закладок и на шаблоне ПФ, на месте ранее выделенного элемента.\nРедактирование закладки\nОтредактировать закладку можно двумя способами:\nдважды нажать левой кнопкой мыши на закладку в тексте шаблона ПФ.\nдважды нажать левой кнопкой мыши на наименование закладки в панели \"Закладки\" шаблона ПФ.\nВ открывшемся окне можно внести необходимые изменения, затем необходимо обязательно сохранить изменения с помощью кнопки\nи, чтобы закрыть окно, нажать на кнопку \"Ок\".\nУдаление закладки\nУдалить закладку можно двумя способами:\nнеобходимо найти закладку в тексте шаблона ПФ, нажать на нее (она подсветится), затем нажать на кнопку\nна панели закладок;\nвыбрать ее на панели закладок, а затем нажав на кнопку\n.\nНеобходимо убедиться, что выбранная закладка не является группой закладок. Для этого следует нажать на закладку – в тексте должны подсветиться одноименные закладки.\nНастройка закладки в закладке\nДля создания закладки в закладке необходимо в шаблоне ПФ выделить элемент текста и создать новую закладку с помощью кнопки\n. Чтобы созданная закладка находилась внутри другой закладки, необходимо выделить область, включающую созданную ранее закладку и создать новую.\nДанный вид настройки закладок уместен, если определенная фраза в документе может изменяться в зависимости от пользовательского выбора, при этом конкретный элемент в фразе должен оставаться статичным.\nНастройка группы закладок\nДобавление закладки к группе закладок\nДля добавления закладки к группе закладок необходимо выделить нужный элемент текста в шаблоне ПФ, нажать на закладку с нужным наименованием на панели закладок (закладки подсветятся в тексте) и нажать кнопку\n.\nПосле будет создана новая закладка, входящая в группу закладок.\nЕсли при создании одной из закладок / группы закладок к ней был привязан источник данных, то данный источник будет использоваться по умолчанию ко всем закладкам в группе. Прописывать источник данных для каждой закладки в группе закладок не требуется.\nУдаление группы закладок\nДля удаления группы закладок необходимо на панели закладок выбрать закладку, которую требуется удалить (при этом все закладки, привязанные к данной закладке, автоматически подсветятся), после нажать кнопку\nи подтвердить удаление во всплывающем окне.\nПри удалении группы закладок и подтверждении удаления во всплывающем окне, автоматически удаляется группа закладок и привязанный источник данных. Если подтверждении удаления во всплывающем окне не произошло, то автоматически удаляется группа закладок, а источник данных останется. Если удаляется закладка из группы закладок по тексту единично, то удаляется только одна закладка.",
  "source": "https://docs.greendata.ru/platform/ru/edoc-setting-up-bookmarks.html"
}