{
  "title": "Виджет \"Расширенный слайдер\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Расширенный слайдер\"\nВиджет \"Расширенный слайдер\"\n- это инструмент интерфейса, который позволяет выводить на слайде различные визуальные элементы (элементы группировки, виджеты, атрибуты). Расширенный слайдер объединяет в возможности следующих виджетов:\nСлайдер\n- элемент, предназначенный для отображения текстового и графического контента и переключения между слайдами. Виджет предполагает ручное управление и не содержит настроек таймера автоматического чередования слайдов;\nФигура\n- виджет, необходимый для настройки карточки с различной информацией (показатели, графики, иконки и т.д.). Однако в виджете нельзя настроить представление нескольких карточек и переключение между ними.\nПример настроенного виджета:\nАналитическая настройка\nНастройка виджета \"Расширенный слайдер\" осуществляется в карточке типа объекта. Для этого необходимо перейти в режим редактирования визуала и найти необходимый виджет на одноименной вкладке в окне \"Элементы\".\nВыбранный виджет следует перенести на рабочую область.\nПереход к общим настройкам виджета осуществляется по кнопке\n.\nВиджет можно настроить с помощью следующих параметров:\nНастройка\nНазначение\nАвтоподбор ширины\nЛогический атрибут. В активном состоянии скрывает поле \"Ширина, пикс\" и позволяет автоматически подобрать ширину слайдера так, чтобы он заполнял все пространство ряда визуала. При этом пользователь может самостоятельно выбрать высоту виджета. В неактивном состоянии позволяет пользователю вручную настроить размер слайдера.\nШирина, пикс\nОпределение ширины слайдера в пикселях.\nВысота, пикс\nОпределение высоты слайдера в пикселях.\nСкруглять углы по отдельности\nЛогический атрибут. В активном состоянии позволяет определить скругление для каждого угла слайдера по отдельности. В неактивном состоянии отображает поле \"Скругление углов, пикс.\"\nСкругление углов, пикс.\nОпределение значения скругления для всех углов слайдера.\nОбводка\nВыбор формата обводки слайдера.\nТолщина, пикс\nОпределение толщины обводки слайдера в пикселях.\nЦвет\nВыбор цвета обводки\nТочки снизу\nНастройка отображения точек переключения между слайдами виджета.\nБоковые стрелки\nНастройка отображения боковых стрелок для переключения между соседними слайдами виджета.\nАвтоматическое перелистывание слайдов\nНастройка, подключающая возможность автоперелистывания между слайдами с заданной задержкой по времени. В активном состоянии позволяет настроить время переключения в поле \"Задержка слайда, сек\". Если настройка выключена, то переход между слайдами будет осуществляться вручную.\nЗадержка слайда, сек\nЧисловое поле, определяющее время, через которое будет происходить переключение на следующий слайд. Настройка отображается при активном переключателе \"Автоматическое перелистывание слайдов\".\nУдалить слайд можно по кнопке\n, которая располагается под наименованием слайда. Чтобы создать новый слайд, следует нажать на кнопку\n.\nНажав на кнопку\n, пользователь может открыть модальное окно с настройками слайда, где определяется его фон.\nВ качестве заливки фона можно выбрать цвет или градиент (линейный, радикальный, конический, квадратный).\nТакже пользователь может загрузить изображение, которое отобразится на слайде. При выборе изображения будут доступны следующие параметры:\nопределение размера изображения;\nустановление прозрачности изображения в процентах;\nвыбор положения изображения в рамках фигуры.\nРазмещение объектов (виджетов и атрибутов типа объекта) на слайде возможно при использовании элементов визуала (ряды, колонки и т.д.).\nПример расширенного слайдера с использованием виджетов\n\"Картинка\"\n,\n\"Текст\"\n, и\n\"Кнопка\"\nможно представить следующим образом.\nДля виджета было настроено автоматическое перелистывание слайдов с задержкой слайда 2 секунды.",
  "source": "https://docs.greendata.ru/platform/ru/advanced-slider-widget.html"
}