{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease\nLTS.400.4\nof February 28, 2024\nNew features\nNew “Object chat” widget added: now chats can be assigned to system objects and access to chat depend on object permissions.\nAutosave option added when moving objects between folders in registry.\ndeletePlainObjects functionality improved: now all objects in primitive type can be deleted.\nnginx supported mTLS authentication option when receiving messages via ETL was added.\nProcessing of functions with EvaluateContextFunction is now performed when working with doAfterCommit function.\nAdded new Edoc feature: version comparison of two documents based on single template.\nChanges and improvements\nCI/CD operation was improved;\nFiltering algorithms functionality was optimized;\nBlocking algorithm functionality when working with integer attributes was improved;\nObject visual display was improved;\nDashboard row display was stabilized;\nWorking with limit parameters was stabilized;\nSelecting values of object attributes was stabilized;\nDisplay of attribute percent values in registry was improved;\nConverting contents of uploaded signature was stabilized;\nSelection of created task’s object type when working with business process was improved;\nEdoc functionality when downloading documents with comments and saving edited documents was improved;\nFavorites filter was stabilized;\nDisplay of Excel files downloaded from dashboards was stabilized;\nAdding large amount of data from clipboard to Edoc was stabilized;\nThe parseSignature function for getting signature from external storage was updated.",
  "source": "https://docs.greendata.ru/platform/en/LTS.400.4-latest.html"
}