{
  "title": "Обновления в платформе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбновления в платформе\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.393.1 от 18.12.2023\nНовые возможности\nТеперь перенос обновлений между приложениями может осуществляться при помощи  функционала CI\\CD через сетевое хранилище с возможностью просмотра и редактирования состава сформированной поставки обновления.\nПри подключении к очереди сообщений Kafka теперь поддерживается настройка учетной записи для аутентификации в брокере.\nВ хранилище сертификатов появилась возможность загрузки файла хранилища в формате jks.\nТеперь при изменении способа выбора значений атрибута с multiselect на singleselect, ранее выбранные при множественном выборе значения сохраняются в Системе и при обратном переключении будут автоматически восстановлены.\nВ GreenData Messenger появилась возможность просмотра видеоконтента.\nТеперь при отключении уведомлений чата в Мобильном приложении GreenData или GreenData Messenger упоминание о входящем звонке не будет отображаться пользователю.\nИзменения и улучшения\nФункционал по отображению и обработке тэгов в электронных документах теперь доступен и в новом редакторе Edoc.\nУсовершенствована работа с дашбордами, а также оптимизированы настройки аналитических панелей  \"Карточка объекта, \"Слайдер с диаграммами\" и \"Таблица\".\nВ плоском реестре восстановлена возможность закрепления строк и столбцов.\nСтабилизировано отображение реестров и кнопок в карточках объектов в соответствии с выданными правами и при работе с виджетом \"Фрейм\".\nВ виджете \"Исходящие документы\" налажена настройка признака для прикрепления файлов из системы.\nОптимизирована настройка параметров функции getObjectByIndex.\nПовышена стабильность настройки визуала задачи бизнес-процесса.\nОтлажен процесс удаления экземпляров типа \"Подразделение\".\nСтабилизировано отображение расшифровки формулы вычислимого показателя на карточке расчета в боковой панели.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.393.1\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.393.1.war\nhttps://downloads.greendatasoft.ru/LTS/lts.393.1.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.393.1.html"
}