{
  "title": "Configuring the scheduled actions to run",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nConfiguring the scheduled actions to run\nTo\nautomatically perform an action\nin the System, you need to configure a schedule for its launch. The start time is set\nin CRON format\n.\nAn automatic scheduled action can be created in the number of ways:\nIn the \"Action run schedule\" object type\nThe schedule is set when creating an instance of the \"Action run schedule\" object type [SYS_ACTION_SCHEDULE] by clicking\n.\nWhere:\nSetting\nPurpose\nName\nEntering the title name.\nSystem action\nSelecting a system action to be performed. You need select an action to run on a schedule.\nObjects with actions parameters\nThe field will be available after selecting a value in the \"System Action\" field.\nSelecting an object (of a custom type) with the parameters of the system action specified earlier (described above). The object type is defined as the\nname of the system action\n.\nAction Operation Scheduler\nEntering the start period of the algorithm (for more information, see\nCRON Scheduler\n).\nSchedule is valid\nConfirming the launch of the system action according to the schedule. Possible values:\nyes – the scheduled action is active;\nno – the scheduled action is inactive.\nThe following fields will be filled in automatically by the System:\nSetting\nPurpose\nThe last run was successful\nResult of running the action. Possible values:\nyes – executed successfully;\nno – executed unsuccessfully.\nLast run date\nThe date and time of the last run of the action.\nIf the\nrun period\nis changed in the current schedule, it is necessary to disable and then enable its launch to update the data. You can do that by saving the action run profile with the value \"\nNo\n\" in the \"Schedule is valid\" field, then change the value to \"\nYes\n\" in the same field and save it again.\nIn order to work with the schedule input in the navigation menu of the System (the panel on the left), you need to create a\nmenu item\n.\nIn the \"Launch schedule\" object type\nIn the registry of the \"Launch Schedule\" object type [SYS_START_SCHEDULE], the user can create several automatic actions in one instance of the type. To do this, go to the object type registry and click\nto create a new object.\nIn the new registry profile you need to fill in the basic settings (name, schedule parameters). The user can configure system actions by clicking\nin the \"Task Scheduler\" child attribute.\nAfter that, a window with possible types of system actions will be displayed on the user’s screen.\nAfter selecting the required action type, the user will see a window with the settings of the system action, which may differ depending on the selected type.\nAt the end of the schedule configuration, click\nto save the data.\nThe saved system action will be displayed in the task scheduler registry of the schedule profile. Automatic actions will be performed according to the action’s work schedule.\nFor more information, the process of setting up the launch schedule is described for:\nalgorithm\n;\nETL\n;\ncalculation\n.\nOther actions are configured in similar way. The number of system actions may vary depending on the increase in the functionality of the System.",
  "source": "https://docs.greendata.ru/platform/en/configuring-the-scheduled-actions-to-run.html"
}