{
  "title": "The \"Dynamics chart\" dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThe \"Dynamics chart\" dashboard\nThe \"Dynamics chart\"\ndashboard\nis designed for creating a chart that considers the change of data over time. All values for displaying data are borrowed from the\ndata source\n.\nExample of a custom dashboard:\nThe user can download the customized in PNG/JPEG/PDF/SVG format or print it.\nBy configured data decryption, it is possible to display additional data by clicking on the sector of the dynamics diagram.\nAdding the Kanban board analytical panel to the\ndashboard\nprofile is done in the visual editing mode. Drag-and-drop the \"Dynamics diagram\" dashboard from the \"Elements\" window to the\nmain workspace\n.\nThe settings are accessed using the\nbutton that opens the \"Chart settings\" modal window, containing five tabs.\nSettings\nMain settings\nThe first tab defines the main parameters of the analytical panel, such as:\nSetting\nPurpose\nData source\nSpecifying the data source needed to create the chart.+\n\"Table\" dashboard\n, added as part of a configured dashboard.\nName\nEntering/displaying the name of the chart. The name will be displayed in the dashboard profile and apply for the entire dashboard.+\nBy default, the name \"New Dynamics chart\" is used.\nChart view\nDefining the type of diagram. Possible values:\nColumn;\nLinear.\nThe \"Columnar\" chart view is set by default.\nDynamics type\nSelecting the type of calculation dynamics from the drop-down list. Possible periods:\nYear;\nDay;\nQuarter;\nMonth;\nMinute;\nWeek;\nHalf a year;\nSecond;\nHour.\nBy default, the chart type is set to \"Day\".\nColumn with a date\nSelecting a \"date\" attribute type of the source. It is used to build a diagram (the abscissa axis).+\nIf there is a single column of the \"Date\"/\"Date and Time\" type, this column will be selected by default.\nNumber of data series\nSelecting the number of data series to display. The selection is made by a switch. Possible values:\nOne\nMOre than one.\nThe default value is \"One\"\n.\nColumn for value aggregation\nSelecting the data source field whose value will be used to aggregate the value.\nIf there is a single column of numeric type, this column will be selected by default.\nAggregation method\nSelecting the aggregation method. Possible values:\nQuantity;\nMaximum;\nMinimum;\nWeighted average;\nAverage;\nAmount.\nThe \"Amount\" value is used by default.\nColumn for naming a row\nSelecting the data source field whose value will be used as the name of the grouped data.\nThis tab also contains the drop-down \"Decryption of the diagram sector\" block.\nWhich contains the following parameters:\nSetting\nPurpose\nThe column with the sector ID of the chart\nThe parameter is necessary for creating a decoding of the row value (Drill-down).\nDisplay the decryption table\nOpening an explanatory table with data when clicking on a sector of the chart.\nThe dashboard table for decryption\nSelecting the dashboard table that will be displayed when clicking on a sector of the dynamics chart. The field is displayed when the \"Display table with decryption\" switch is active.\nWhen decrypting, set the values of the Dashboard parameters\nDefining values for dashboard parameters during decryption. Setting parameter values is available when the switch is active.\nThe button is available when the switch of the \"When decrypting, set the values of the Dashboard parameters\" parameter is active. Clicking on the button will be display a pair of \"Dashboard parameters\" and \"Dashboard parameter values\" fields.\nDashboard parameter\nSelecting the dashboard parameter to set the value.\nValues of dashboard parameters\nSelecting the value of the dashboard parameter. Possible values:\nIdentifier of the chart sector;\nConstant.\nThe default value is \"Chart sector identifier\".\nStyle customization\nOn the \"Style of design\" tab, the user can set the chart size and color scheme.\nThe following design parameters can be configured on this tab:\nSetting\nPurpose\nChart height, %\nSetting the chart height and width. If needed, the \"Maintain aspect ratio\" option can be used by clicking the\nbutton.\nBy default, the following parameters are set: chart height - 100%, chart width - 40%.\nChart width, %\nPalette\nSelecting a\npalette\nfor the chart color style.\nThe selection is made from a dropdown list of standard or previously created palettes. The user can create a new palette or edit the selected one via the parameter action menu.\nBy default, the GreenData corporate color palette is set.\nPalette color cyclicity\nEnabling the cyclic repetition of palette colors for the chart.\nPalette color cyclicity is enabled by default.\nAccumulation chart\nSelecting the column presentation style for visual data comparison.\nSetting the group and column intervals using sliders or input values.\nGrouping chart\nAdditional settings\nThe setting on the \"Additional\" tab allows adding JSON code containing additional options that will be displayed on the diagram after saving.\nAt the moment, JSON expressions are not used to customize dashboard elements.\nSetting up filtering condition\nThe Filter tab provides setting for setting up additional data filtering.\nTo implement the setting, click\non the \"Filter\" tab, the system will display fields for entering filtering parameters.\nSelect the column whose data will be filtered, and then add a filtering condition using the drop-down list and specify the value of the selected condition in the next field. Possible values of the filtering conditions:\nEqual to;\nNot equal to;\nLess than;\nGreater than;\nLess than or equal to;\nGreater than or equal to.\nClick\nto add the next filtering condition.\nDecryption\nOn this tab, the connection between two or more analytical panels is configured, i.e. the setting allows changing the data display of one analytical panel in real time depending on the selected value of another analytical panel.\nFor more information about configuring decryptions, see the  \"\nDrill Down Decryption\n\" article.\nUse case\nLet’s assume the setup of the analytical panel \"Dynamics diagram\" using the example of the sale of dairy products with various parameters.\nUse case 1\nUsing a dynamics diagram with a single row of data without setting up the decryption of the chart sector.\nIt is assumed that the System has the following objects which data is presented as a dynamics diagram:\nThese objects are instances of the \"UPV. Sale of dairy products \" object type.\nThe registry of the type \"Dairy product\" has the following form:\nIn this case, the values of the \"Product\" object attribute are derived from the \"Dairy product\" object types.\nSince values are borrowed from a configured data source to display data on a dynamics diagram, it means that in addition to the object model, a data source should also be prepared.\nIn this case, the \"Sale of dairy products\"\nobject data source\nis used, where objects are added for the source of the \"Sale of dairy products\" and \"Dairy product\" object types.\nIf necessary, rename the values in the right column of the \"Fields added to the source\" block. These values will be displayed when configuring the parameters of the dynamics diagram.\nThe relations between the object types are configured as follows:\nThe dynamics diagram can be configured after setting up the data source. To set up the diagram, perform the following:\n1.\nCreate and open the dashboard\n\"Sale of dairy products\".\n2. In the visual editing mode, add the prepared data source using\n.\n3. In the visual setup mode, drag-and-drop the \"Row\" element from the \"Groupings\" tab and the \"Kanban Board\" dashboard from the \"Analytical Panels\" tab to the workspace.\n.\n4. Open the dynamics diagram settings using\n5. In the opened settings window, select the \"Sale of dairy products\" data source and specify a similar name for the panel.\nReplace the default value in the \"Dynamics type\" field with \"Month\" and in the \"Column for value aggregation\" field specify \"The total cost of the product with US Dollar\".\nThe remaining fields will be filled in by default.\n6. Save the chart settings using \"Ok\" and the visual using the \"Save\"  on the \"Elements\" panel.\nAs a result, the dynamics diagram will look as follows:\nWhen hovering the mouse cursor over a column of the chart, a value is displayed with the calculation of the total cost of the product for the selected month.\nUse case 2\nUsing a dynamics diagram with a single row of data without setting up the decryption of the chart sector.\nThe settings in this case are identical to the settings in\nUse case 1\n, except for Step 5:\nHere, in the modal settings window that opens, do the following:\nselect the \"Sale of dairy products\" data source;\nspecify the name for the \"Sale of dairy products\" panel;\nreplace the default value in the \"Dynamics type\" field with \"Month\";\nreplace the \"Number of data series\" set by default with the \"More than one\";\nin the \"Column for value aggregation\" field, specify \"Quantity\";\nin the \"Column for the name of the series\" field, if necessary, replace the value with \"Product\".\nThe remaining fields will be filled in by default.\nAfter saving the settings, the dynamics diagram will look as follows:\nWhen hovering the mouse cursor over a column of the diagram, a value is displayed with the calculation of the total cost of the product for the selected month.\nUse case 3\nUsing a dynamics diagram with a single row of data without setting up the decryption of the diagram sector.\nThis case is considered based on a result of the configuration of\nUse case 1\n.\nTo set up decryption, prepare a data source for the component used as decryption.\nThis case uses, the \"Sale of dairy products. Decryption\" object data source, containing data of \"UPV. Sale of dairy products\" and \"UPV. Dairy product\" and \"Private customer\".\nIn this case, the connections are configured as follows:\nOn the \"Filtering conditions\" tab in the \"Source parameters\" block, create the \"Purchase Date\" parameter, as shown below:\nAdd a \"By date of sale only\" filtering algorithm for \"Sale of dairy products\" object type by creating a \"Sale date\" parameter in the algorithm profile:\nThe algorithm is written using\nattr\n,\nparam\nand\ntruncdate\nfunctions.\nAfter substituting the \"Sale date\" filter parameter, the filtering conditions will look as follows:\nAdding a prepared data source for decryption is done in the same way as the previously added data source:\nThe\n\"Table\" dashboard\nwill be used for decryption by clicking on the sector of the diagram..\nTo add it, drag-and-drop the \"Table\" dashboard element from the \"Analytical Panels\" tab to the workspace.\nAfter switching to the settings of the \"Table\" dashboard using\n, in the opened modal window on the \"Main\" tab, add the \"Sale of dairy products. Decryption\" data source and specify the same name for the table.\nNext, go to the \"Decryption\" tab, open the collapsed block \"Use the current component as decryption\" and add the decryption using the button of the same name. In the modal window, select the \"Sale of dairy products\" value as the Parent component and click\n.\nThen, the \"Sale date\" value is selected in the \"Date parameter\" field and the table settings are saved after clicking \"OK\".\nNext, configure the table view (for more information, see the \"\n\"Table\" dashboard\n\") article) and save the visual using \"OK\" button on the Elements panel.\nAs a result, by clicking on a sector of the dynamics diagram, the data corresponding to this sector will be displayed in the table.\nUse case 4\nUsing a dynamics diagram with a single row of data without setting up the decryption of the diagram sector.\nThe setup of the dynamics diagram for this example is presented in\nUse case 2\n.\nTo set up decryption, prepare a data source for the component used as decryption.\nThe preparation of the object data source for this case is done in the same way as the data source presented in Use case 3, except for the settings that are made on the \"Filter condition\" tab.\nThe difference is that two parameters are required for this case, so in the \"Source Parameters\" block, in addition to the \"Purchase Date\" parameter, the \"Product\" parameter is added:\nFor \"Sale of dairy products\" object type, add a filtering algorithm \"By selected products and date of sale\" in which profile \"Product\" and \"Date of sale\" parameters are created:\nThe algorithm code is written using the\nattr\n,\nparam\n,\nor\n,\nand\n,\nisNull\n,\ntruncdate\nand parentheses:\nAfter substituting the \"Sale date\" filter parameter, the filtering conditions will look as follows:\nThis data source is not suitable for the case considered in Example No. 3, due to the fact that it requires two input parameters, and in Use case 3 only the \"Sale date\" parameter is passed.\nThe \"Table\" dashboard  will be used for decryption by clicking on the sector of the diagram.\nTo add it, drag-and-drop the \"Table\" dashboard element from the \"Analytical Panels\" tab to the workspace.\nAfter switching to the settings of the \"Table\" dashboard using\n, in the opened modal window on the \"Main\" tab, add the \"Sale of dairy products. Decryption\" prepared data source and specify the name of the table \"Sale of dairy products Decryption\".\nNext, go to the \"Decryption\" tab, open the collapsed block \"Use the current component as decryption\" and add the decryption using the button of the same name. In the modal window, select the \"Sale of dairy products\" value as the Parent component and click\n.\nAfter that, the value \"Date of purchase\" is selected in the \"Date parameter\" field, and the value \"Product\" is specified as the row parameter, for which a connection with the \"Product Code\" is established using the \"Column for row identifier\" field. The table settings must be saved by clicking \"Ok\".\nIf necessary, the table view can be customized (for more information, see the\n\"Table\" dashboard\narticle).\nAfter saving the visual using \"Ok\" the \"Elements\" panel, the functionality of decrypting data in the table by clicking on the sector of the dynamics diagram will become available to the end user.",
  "source": "https://docs.greendata.ru/platform/en/the-dynamics-chart-dashboard.html"
}