{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.404.3\nот 02.04.2024\nНовые возможности\nУсовершенствован \"ETL трансформатор. Поиск объекта в справочнике\", теперь появилась возможность принимать в качестве входных данных простой или составной ключ типа.\nУсовершенствованы настройки виджета \"Иерархия файлов\", теперь доступно отображение в режиме снапшота.\nТеперь необходимость шифрования значений секретных переменных может регулироваться в зависимости от уровня строгости контроля доступа.\nТеперь настройки страницы входа передаются и в мобильное приложение GreenData.\nИзменения и улучшения\nСтабилизирована возможность запуска бизнес-процесса из дочернего объекта.\nДля атрибута оптимизирована работа маски ввода.\nСтабилизирована синхронизация изменений атрибута, унаследованного от родительского типа.\nУсовершенствована возможность подсветки значений атрибутов, добавлена прозрачность.\nСтабилизирован процесс добавления существующего атрибута в атрибутивный состав типа при настройке визуала.\nОтображение атрибутов с визуалом \"Изображение\" на визуале объекта скорректировано\nсогласно заданным настройкам.\nВ виджетах \"Статус бар\" и \"Заголовок по атрибуту\" доработаны настройки стилей.\nВ виджете \"Вычислимый показатель\" налажен процесс отображения данных по объектному значению.\nСтабилизировано отображение виджета \"Поисковые фильтры\" в компактном виде.\nУсовершенствованы настройки виджета \"Иерархия файлов\", теперь доступно отображение в режиме снапшота.\nСтабилизировано отображение стрелок при настройке дерева решений чат-бота.\nВ аналитической панели \"Таблица\" отлажен процесс отображения строки поиска и наименований колонок, указанных пользователем.\nСтабилизирована возможность выбора отображения реестра типа.\nВ реестрах стабилизированы процессы поиска и фильтрации.\nВ мастере обновлений стабилизировано отображение состава обновлений.\nСтабилизировано формирование пакетного действия.\nОптимизированы функции sendMailToSubject и setAttrComment.\nСтабилизировано отображение наименований атрибутов в редакторе алгоритмов, добавленных при помощи функции attrByVar.\nОтлажен процесс обновления данных в формах отчетности.\nПовышена производительность при работе с плиточным реестром и виджетом \"Медиа\".\nДля повышения производительности оптимизирован процесс интеграции при получении файлов из внешнего хранилища.\nСтабилизирована функциональность системы при работе с секретными переменными.\nВ модуле EDoc стабилизирован экспорт документа с комментариями, добавленными к таблицам.\nТеперь в мобильном приложении GreenData можно осуществить поиск по каждому из сгруппированных разделов чатов.\nВ мобильном приложении GreenData стабилизировано отображение плиточного реестра согласно заданной сортировке.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.404.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.404.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.404.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.404.3-latest.html"
}