{
  "title": "Визуалы атрибута типа \"Текст\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВизуалы атрибута типа \"Текст\"\nАтрибут типа \"Текст\" позволяет сохранить многострочные значения, количество символов в которых не ограничивается.\nДля подсветки орфографических ошибок в значении атрибута необходимо в настройках браузера включить проверку правописания и выбрать язык проверки.\nДля наглядного представления атрибута в Системе реализованы следующие визуалы, выбор которых осуществляется при настройке атрибута на вкладке \"Визуал\":\nТекст с поддержкой сложного форматирования\n;\nМногострочный ввод\n.\nОтображение содержимого атрибутов типа «Текст» с визуалами «Текст с поддержкой сложного форматирования» и «Многострочный ввод» в интерфейсе ограничено 4000 символами.\nЕсли текст превышает указанный объём, на атрибуте появляется иконка\n, по нажатию на которую можно скачать полный текст в виде файла в формате *.txt с названием, соответствующим наименованию атрибута.\nХранение данных в БД включает форматирование, поэтому в обусловленных 4000 символах учитываются тэги разметки.\nТекст с поддержкой сложного форматирования\nДанный визуал предоставляет возможности для сложного форматирования текста. Дополнительных настроек визуал не требует.\nИспользуемый редактор поддерживает сложное форматирование текстов, вставку таблиц и изображений. Действия для работы с текстом доступны в панели управления атрибута, некоторые из которых выведены в панель быстрого доступа.\nАтрибуты типа \"Текст\" с указанным визуалом имеют следующий вид:\nДля просмотра значения атрибута\nв полноэкранном режиме\nнеобходимо нажать на\nв панели управления атрибута или использовать комбинацию клавиш\nCtrl+Shift+F\nна клавиатуре. Для возвращения к карточке объекта – нажать повторно.\nВставка таблицы\nЧтобы добавить таблицу в редактируемое поле, необходимо нажать на кнопку \"Таблица\" в панели управления атрибута, выбрать желаемое количество строк и столбцов, передвигая мышку по изображению с превью таблицы, затем обозначить желаемый диапазон (он будет выделен голубым цветом) и кликнуть по нему для подтверждения.\nТакже пользователь может изменить свойства таблицы, нажав на кнопку\n, расположенную в панели управления атрибута.\nВставка изображения\nПользователь может добавить в текстовое поле картинку, перейдя в настройки вставки и редактирования изображения.\nПрикрепить изображение можно следующими способами:\nуказать источник (URL изображения) в общих настройках;\nво вкладке \"Передать\" загрузить фото с диска компьютера. Таким образом источник изображения сформируется автоматически.\nВыбранное изображение отобразится в поле ввода. Можно изменить его размер, потянув за уголки.\nВставка видео\nЧтобы отобразить в поле видео, следует перейти в настройки вставки и редактирования видео.\nВ общих настройках нужно указать источник (URL видео). Размер видео сформируется автоматически, но, при необходимости, его можно изменить вручную.\nВо вкладке \"Встроенный-код\" можно вставить готовый или изменить генерируемый HTML-код (генерируется автоматически при вставке ссылки видео).\nВ расширенных настройках пользователь может указать URL постера видео.\nПостер отобразится в атрибуте в том случае, если в общих настройках была указана ссылка на файл видео. Она должна содержать информацию о формате файла (.mp4). При вставке ссылки с Youtube и других плееров со своими настройками данная настройка работать не будет.\nПосле сохранения настроек необходимое видео отобразится в поле ввода. Размер видео можно изменить, потянув за его уголки.\nМногострочный ввод\nВизуал \"Многострочный ввод\" используется для отображения данных \"широким\" полем в несколько строк. Дополнительной настройки визуал не требует.\nПосле выбора визуала и сохранения настроек данные отобразятся в карточке объекта следующим образом:",
  "source": "https://docs.greendata.ru/platform/ru/text_attribute_visuals.html"
}