{
  "title": "Интеграция с сервисом DaData",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИнтеграция с сервисом DaData\nИнтеграция с сервисом DaData позволяет проверить корректность и ускорить заполнение данных организаций и адресов, вводимых пользователем посредством отображения подсказки.\nИнтеграция с сервисом DaData поставляется отдельным модулем, который может быть встроен в приложение GreenData для повышения производительности и эффективности работы с карточками объектов.\nДля использования модуля необходимо получить продукт, представленный на\nмаркетплейс GreenData\n.\nС процессом установки продукта в приложение GreenData можно ознакомиться в статье \"\nУстановка продуктов из каталога Маркетплейса\n\".\nНастройка\nНастройка интеграции с сервисом DaData включает в себя следующие шаги:\nЗаполнить параметры подключения к сервису DaData через экземпляр типа объекта \"Dadata. Настройки интеграции\" [DADATA_INT_SETTINGS].\nДанный тип может содержать единственный экземпляр.\nПараметр\nНазначение\nНаименование\nВвод наименования экземпляра.\nПо умолчанию в типе объекта \"Dadata. Настройки интеграции\" создан экземпляр с наименованием \"Dadata. Integration settings\".\nDaData. URL\nВвод  URL сервиса DaData.\nНастройки подключения\nDaData. Настройка SSL\nНастройка\nssl шифрования\n. Вставка осуществляется через\nсекретную переменную\n.\nDaData. TOKEN\nИспользование значения API-ключа (токена), полученного после регистрации на сайте сервиса\nDaData\n. Вставка осуществляется через\nсекретную переменную\n.\nНастройки повторного подключения\nDaData. Количество повторений при неудачном запросе (раз)\nВвод числового значения – количества повторений при неудачном запросе сервиса.\nDaData. Время между повторами при неудачном запросе (миллисекунд)\nОпределение времени в миллисекундах для отправки повторного запроса в случае неудачно завершенной предыдущей попытке.\nДополнительно\nDaData. Использовать определение местоположения по ip-адресу\nОпределение местоположения по ip-адресу сотрудника, выполняющего поиск. Локация учитывается при получении ответа от сервера Dadata.\nОбязательными для заполнения являются параметры:\n\"DaData.TOKEN\";\n\"DaData.URL\".\nВ типе объекта, в карточке которого потребуется применение подсказок сервиса DaData, добавляются\nобъектные атрибуты\nтипов:\nDaData.Адрес\n[DADATA_ADDRESS]\n– для подсказки и проверки адреса;\nDaData.Организация\n[DADATA_ORG]\n– для подсказки и проверки организации.\nДля объектных атрибутов необходимо выбрать соответствующие\nвизуалы\n:\n\"Организация из DaData (с подсказкой)\"\n\"Адрес из DaData (с подсказкой)\"\nНастроенный объектный атрибут хранит в себе соответствующий объект типа. К данному объекту можно обратиться в выражении, в алгоритме жизненного цикла и т.д.\nПри настройке\nвизуала\nсозданные объектные атрибуты необходимо разместить (Drag&Drop) в карточке объекта и сохранить изменения.\nРезультат\nПосле выполненных настроек ввод данных осуществляется следующим образом:\nПоиск организации осуществляется по наименованию, адресу или ИНН организации.\nОпределение приоритета города\nПри поиске необходимого адреса в Системе\nреализовано определение приоритета города\n. Это осуществлено посредством:\nрасширения системного типа\n[SYS_CITY]\nкодами КЛАДР и ФИАС;\nдобавления атрибута\n[SYS_CITY_ID]\nв тип\n[SYS_EMPLOYE]\n;\nпередаче кода КЛАДР (непустого значения) в приоритет при поиске.\nЕсли указывается город с пустым значением КЛАДР или только улица, то перед выполнением запроса серверу Dadata, Система\nпроверяет ip-адрес пользователя\n. Согласно этим данным выполняется верхнеуровневое определение адреса (город).\nРезультат кэшируется\n.\nПроверка ip-адреса пользователя регулируется\nсистемной настройкой\n\"\nDaData. Использовать определение местоположения по ip-адресу\n\".",
  "source": "https://docs.greendata.ru/platform/ru/dadata-integration.html"
}