{
  "title": "Setting up a matrix for a business process",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up a matrix for a business process\nSetting up a matrix for the business process allows you to identify potential assignees and responsible employees for the business process (BP). Learn more about\nBP\n. You can configure it in the \"Apply to appoint assignees\" field. The fields of the Curation Matrix object are described\nhere\n.\nWhen setting up a role model, two concepts are used:\nAssignee – the role provided to the employee when assigning and/or performing a task. An employee with this role is displayed on the \"Responsible for document\" tab\nPotential assignee – a technical entity/role assigned to multiple employees This role is not displayed in the user interface\nWhen starting the BP (or any subsequent generation of tasks if the assignee is not defined), the \"Initiator\" is specified (as the current user, or the initiator of the BP start (depending on the value set in the \"Search for assignees from the initiator of the process\" field of the BP stage; for more information, refer to\nTask\n, the \"Main stage settings\" tab).\nThe Curation Matrix is used to search for potential assignees:\nIf when setting up the Curation Matrix, the value is set to \"Yes\" in the \"Branch office\" field (for more information, refer to\nCreating a Curation Matrix\n), the employees/groups of employees are searched for according to the following scenario:\n1. A branch office is to be specified:\nIf the Curation Matrix contains the \"Unit type\", then the search for a branch office starts from the current unit (i.e., from the unit of the current user or the initiator of the BP start) up the hierarchy of units (the search is carried out until the unit matches the one in the matrix)\nIf the \"Unit type\" is not specified in the Curation Matrix, then the current unit is used as a branch office (i.e., the unit of the current user or the initiator of the BP start)\n2. Search for potential employees with the required role (specified in the Curation Matrix) starting from the Branch office found down the hierarchy of units.\nIf when setting up the Curation Matrix, the value is set to \"No\" in the \"Branch office\" field (for more information, refer to\nCreating a Curation Matrix\n), the users (groups of users) are searched for according to the following scenario:\n1. Specify the departments in the Curation Matrix (choose the \"Supervising department\", if the \"Assignee is being supervised\" field of the BP stage is set to \"Yes\", otherwise – the \"Supervised department\"; for more information, refer to\nCreating a Curation Matrix\n).\n2. Search for employees with the required role (specified in the Curation Matrix) throughout the departments found. Found employees are assigned the \"Potential assignees\" role. Potential assignees are granted permissions to view the route object and view/save/complete the corresponding task. The employee who completed the task will be identified as the assignee for the role specified in the \"Assignee role\" field of the BP stage.\nWhen the task is completed, the employees are removed from potential assignees for this task automatically.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-a-matrix-for-a-business-process.html"
}