{
  "title": "unescapeJsonMbcs",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nunescapeJsonMbcs\nФункция предназначена для декодирования строк, которые были экранированы для использования в JSON, то есть восстановления оригинального представления строк из многобайтной JSON-строки (формата MBCS).\nПервичное преобразование выполняется функцией\nescapeJsonMbcs\n.\nСинтаксис\nunescapeJsonMbcs\n(string)\nПараметр\nНазначение\nstring\nСимвольное выражение, из которого необходимо получить многобайтный текст (MBCS).\nВ параметр необходимо передавать строковое значение.\nПримечание\nДобавление функции осуществляется посредством\nручного ввода\n.\nФункция работает в многобайтном формате\nMBCS\n, который позволяет обеспечить поддержку диакритических знаков, специальных символов и национальных символов любых языковых раскладок (в том числе японской и китайской).\nФормат MBCS может использоваться для современного экранирования данных JSON в алгоритмах и поддерживает режим кодирования специальных символов с переменной длиной.\nФункция может игнорировать одиночные пробелы во входящих данных (нужны парные).\nСимвол двойной кавычки во входящем аргументе обязательно экранируется слешем, который должен предварительно экранироваться еще одним слешем (\\\\\").\nТак как в большинстве систем автоматизации формат обмен данными происходит в многобайтной кодировке (UTF-8, UTF-16 или пр.), экранирование данных также должно выполняться именно в многобайтном формате.\nПоэтому следует избегать устаревших функций:\nвместо функции\nescapeJson\nиспользовать\nescapeJsonMbcs\n;\nвместо функции\nunescapeJson\nиспользовать\nunescapeJsonMbcs\n.\nПример\nДопустим, необходимо извлечь текст из строки, заполненной JSON данными (в формате MBCS).\nАлгоритм может принять следующий вид:\nВ результате выполнения алгоритма будет получена следующая строка:",
  "source": "https://docs.greendata.ru/platform/ru/unescapejsonmbcs.html"
}