{
  "title": "Signal intermediate catch event",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSignal intermediate catch event\nThe \"Signal intermediate catch event\" element is a\nsignal receiver\nand processes events received from the\nsource\n. Its execution is blocked until the corresponding signal is received, ensuring thread synchronization.\nThe signal handler in the system is implemented by the\n\"WorkFlow. Event handler. Signal\"\ntype.\nIn the business process diagram, the signal handler is represented by\n.\nSignal processing can be configured both within elements of the same business process as well as across different business processes (subprocesses).\nTo configure the signal parameters, save the business process diagram, then click the\nbutton in the stage menu: a modal window with the set of parameters for configuration will open.\nSetting\nPurpose\n\"Signal settings\" tab\nObject state\nSelecting the object state from the System directory.\nActs within a process instance\nBoolean parameter that restricts signal distribution outside the process instance:\nwhen the switch is active, signal handling occurs within the diagram (the source and receiver must be in the same business process diagram);\nwhen the switch is inactive, signal handling occurs in multiple diagrams (source and receiver can be in different business processes).\nSignal\nDefining the relation with the\nsource\nfor signal transmission configuration.\nThe source and signal handler are matched according to the value specified in the \"Signal\" field. If no values are provided in this field,\nthe element names in the diagram must be identical\n.\nIt applies to parallel running BPs on other route objects\nBoolean parameter that determines the distribution of the signal to parallel running business processes on other route objects.\nAlgorithm to define an object\nSelecting\nalgorithm\nto define the object that will receive the signal.\nIf no algorithm is specified, the signal handler will search for all objects with active processes.\nExpect processing of all signals\nBoolean parameter that controls waiting for signal processing:\nwhen the switch is active, the receiver waits for all signals from the source before continuing the process;\nwhen the switch is inactive, the receiver waits for the first signal from the related source to continue the process.\nRollback route by timeout\nBoolean parameter that triggers the automatic rollback of the process route if the expected source signal is not received within the specified time:\nwhen the switch is active, the handler waits for the signal for the duration specified in the \"Timeout before rollback (sec)\" parameter;\nIf the signal is not received within the specified time, the business process will roll back to the stage specified in the \"Rollback to scheme element\" parameter.\nwhen the switch is inactive, the handler waits for the signal without a time limit.\nRoute rollback timeout in seconds\nTime to wait for the signal (in seconds).\nBy default, the value 300 is used.\nThis parameter is available when the \"Rollback route by timeout\" switch is active.\nRollback process item\nSelecting the business process stage where the route will be rolled back after the specified time.\nThis parameter is available when the \"Rollback route by timeout\" switch is active.\n\"Service information\" tab\nIdentifier\nDisplaying the element identifier.\nThis parameter is defined by the System.\nEvent type\nDisplaying the event type name of the element.\nThis parameter is defined by the System.\nLast modified by (employee)\nSystem employee who made the last changes to the element configuration.\nThis parameter is defined by the System.\nProcess\nDisplaying the business process name in which the element is used.\nThis parameter is defined by the System.\nProcess stage\nDisplaying the business process stage name.\nThis parameter is defined by the System.\nLast modified date\nDate when the last changes were made to the element configuration.\nThis parameter is defined by the System.",
  "source": "https://docs.greendata.ru/platform/en/signal-intermediate-catch-event.html"
}