{
  "title": "File signature verification",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nFile signature verification\nWhen signing a file with an electronic signature, the system can verify the signature according to the set settings.\nDocument signing is implemented by clicking on a button via a customized action, for example\n\"Sign the file using a simple e-signature\"\n.\nSignature verification is configured via the parameters of the object type \"File signing type\" [FS_FILE_SIGN_KIND]:\nSetting\nPurpose\nName\nName of the signature type.\nIdentifier\nEntering the unique identifier of the configuration object.\nFile re-signing settings\nLock a single signatory from signing a file multiple times\nFeature that determines whether a file can be signed multiple times with one valid signature.\nIf the value is set to \"No\", the user will be able to sign the file with one valid signature several times.\nIf the \"Yes\" value is selected, the user will be able to sign the file with one signature only once.\nAlgorithm for calc time blocking the signature of a file with one certificate several times\nFeature for blocking the ability of signing a file for a certain time.\nThe algorithm should determine the number of minutes during which re-signing of the file is prohibited. If working with multiple signatures, the user can sign the file for each of them.\nThe previously created algorithm is selected from the drop-down list, adding a new\nalgorithm\nis available through the parameter actions menu.\nThe parameter is available when the \"Lock a single signatory from signing a file multiple times\" option is inactive.\nFile signature settings\nFile signature verification settings\nConfiguring verification of file signatures for revocation and qualification.\nThe values of the boolean parameters \"Check the certificate for revocation\", \"Check the certificate for qualification\" – \"Yes\"/\"No\" are set in the settings data object, and the files of trusted root certificates are displayed/attached.\nThe previously created configuration object is selected from the drop-down list, adding a new object is available via the parameter actions menu.\nSignature verification algorithm\nAlgorithm to set the signature verification condition.\nThe previously created algorithm is selected from the drop-down list, adding a new\nalgorithm\nis available through the parameter actions menu.\nThe algorithm should return an object of the \"Directory of e-signature verification results\" type   [FS_FILE_SIGN_CHECK].\nIn objects of the \"Directory of e-signature verification results\" type, the text and background color of the signature verification are set, which are used when displaying information about signatures.\nWhen signing the document, the verification result:\ndisplayed when viewing information about signatures:\nThe display of buttons for working with the \"File\" type attribute depends on\nattribute visual\n.\nrecorded in the registry of the  \"E-signature verification result\" type [FS_SIGN_VERIFY_RESULT]:\nThe display of information about signatures may be affected by changes in the values of the following parameters:\n\"E-signature verification result\" is an object type of the\"Directory of e-signature verification results\" [FS_FILE_SIGN_CHECK], which defines the text and background color of the signature verification result.;\n\"Certificate qualified \" is a boolean parameter that defines the caption in the signature header of the file.\nWhen the value \"Yes\" is selected, \"Certificate qualified\" is displayed, when the value \"No\" or no value is set, \"Certificate not qualified\" is displayed.",
  "source": "https://docs.greendata.ru/platform/en/file_signature_verification.html"
}