{
  "title": "Интеграция с сервисом Контур.Фокус",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИнтеграция с сервисом Контур.Фокус\nИнтеграция с сервисом\nКонтур.Фокус\nпозволяет проверить корректность и ускорить заполнение данных контрагентов: сведения из ЕГРЮЛ/ЕГРИП, арбитражные дела, юридические признаки, госконтракты и др.\nИнтеграция с сервисом Контур.Фокус поставляется отдельным модулем, который может быть встроен в приложение GreenData для повышения производительности и эффективности работы с карточками объектов.\nДля использования модуля необходимо получить продукт, представленный на\nмаркетплейс GreenData\n.\nС процессом установки продукта в приложение GreenData можно ознакомиться в статье \"\nУстановка продуктов из каталога Маркетплейса\n\".\nНастройка\nПеред настройкой интеграции необходимо\nполучить\nтокен для подключения к сервису и установить его значение в экземпляр\nсекретной переменной\n\"Контур. Ключ доступа\".\nНастройка интеграции с сервисом Контур.Фокус заключается в создании ETL-процесса и включает в себя следующие шаги:\nСоздание объекта ETL\n, в настройках которого необходимо указать тип стартового объекта, содержащий необходимые для запуска атрибуты: \"ИНН\", \"ОГРН\" и др.\nДобавление на\nсхему ETL\nэтапа\n\"Источник. Внешний сервис\"\nи заполнение параметров настройки:\nна вкладке\n\"Основные параметры\"\nустановить:\nHTTP метод – GET;\nФормат ответа – JSON;\nURL – ссылка на внешний сервис в соответствии с\nдокументацией\n, например:\n{url}buh?key={key}&inn={inn}&ogrn={ogrn}\nПараметры запроса указываются после вопросительного знака \"?\".\nПри перечислении нескольких параметров запроса их необходимо разделять амперсандом \"&\".\nв блоке \"Описание структуры ответа\" необходимо указать структуру ответа от сервиса Контур.Фокус в зависимости от используемого метода согласно\nдокументации\n.\nПример\nна вкладке\n\"Параметры запроса\"\nсоздать необходимые параметры согласно URL, указанному\nранее\n:\nВыполнение ETL\nс указанием параметров запуска в карточке экземпляра объекта ETL, выбранного в поле \"Тип стартового объекта\".\nВ результате работы ETL-процесса в логе выполнения отобразятся данные, полученные с помощью сервиса Контур.Фокус.\nПример\nРассмотрим пример интеграции с сервисом Контур.Фокус для поиска контрагента по ИНН.\nВ Системе данные контрагентов сохраняются в типе объекта \"Юридическое лицо\", который содержит\nключ\nдля проверки уникальности по атрибуту \"ИНН\".\nВ реестре типа \"Юридическое лицо\" необходимо предоставить возможность поиска и получения данных контрагента по введенному ИНН.\nПредварительно следует создать экземпляр\nсекретной переменной\n, содержащий токен для подключения к сервису.\nДля загрузки данных из сервиса Контур.Фокус необходимо настроить ETL-процесс следующим образом:\nСоздать тип стартового объекта \"Контур. Загрузка контрагента\", содержащий строковый атрибут \"ИНН\" и объектный атрибут \"Загруженный контрагент\", ссылающийся на тип объекта \"Юридическое лицо\".\nАтрибутивный состав типа объекта \"Контур. Загрузка контрагента\".\nСоздать объект ETL\n, в настройках которого указать созданный на предыдущем шаге тип стартового объекта.\nСоздать\nсхему ETL-процесса\nи добавить на нее следующие этапы:\nИсточник. Внешний сервис\n– для получения данных из сервиса Контур.Фокус.\nПодробнее о настройке источника данных.\nПерейти к настройкам источника данных нажатием на кнопку\n.\nНа вкладке\n\"Основные параметры\"\nустановить:\nHTTP метод – GET;\nФормат ответа – JSON;\nURL – ссылка на внешний сервис в соответствии с\nдокументацией\nдля получения базовых реквизитов контрагента:\nhttps://focus-api.kontur.ru/api3/req?key={key}&inn={inn}\nв поле \"WSDL/JSON\" необходимо указать структуру ответа от сервиса Контур.Фокус для используемого метода \"req\" согласно\nдокументации\n.\nНа вкладке\n\"Параметры запроса\"\nсоздать параметры URL, указанного ранее:\nв качестве значения параметра {inn} с помощью функции\nattr\nосуществляется вставка значения атрибута \"ИНН\" типа объекта \"Контур. Загрузка контрагента\";\nв параметр {key} с помощью функции\nsecretVariable\nподставляется значение ранее созданной\nсекретной переменной\n, содержащей токен для подключения к сервису.\nПреобразователь данных\n– для дополнительного преобразования динамической структуры.\nПодробнее о настройке преобразователя данных.\nПерейти к настройкам преобразователя данных нажатием на кнопку\n.\nНа вкладке\n\"Основное\"\nнеобходимо добавить в выходную структуру числовое поле (тип \"NUMBER\") для хранения идентификатора (id) контрагента.\nПриемник. Внутренний\n– для обновления существующих объектов Системы и создания новых.\nПодробнее о настройке приемника данных.\nПерейти к настройкам приемника данных нажатием на кнопку\n.\nВ качестве базового типа объекта следует выбрать тип \"Юридическое лицо\" для сохранения получаемых из сервиса данных.\nДалее необходимо настроить пары связей между элементами входной динамической структуры и соответствующими атрибутами типа, в том числе требуется связать поле \"id\" с атрибутом \"Код\".\nВо встроенном реестре \"Настройка связей типов\" создать объект настройки со связью по ранее созданному альтернативному ключу \"ИНН\".\nПреобразователь данных\n– для фиксации загруженного контрагента в атрибуте экземпляра типа стартового объекта ETL.\nПодробнее о настройке преобразователя данных.\nПерейти к настройкам преобразователя данных нажатием на кнопку\n.\nНа вкладке\n\"Дополнительно\"\nнеобходимо добавить\n\"Трансформатор. Изменение экземпляра объекта\"\nи указать параметры настройки:\nв поле \"Коллекция входных данных\" выбрать поле \"ID\", значение которого будет записано в атрибут экземпляра объекта ETL;\nв качестве атрибута\nстартового типа\nнеобходимо из перечня атрибутов типа \"Контур. Загрузка контрагента\" выбрать атрибут \"Загруженный контрагент\", в который будет записано значение.\nДалее необходимо настроить\nпользовательское действие\n, посредством которого будет осуществляться запуск ETL:\nв поле \"Наименование\" ввести \"Поиск по ИНН\" – указанное наименование будет отображаться на кнопке;\nв качестве модуля пользовательского интерфейса выбрать \"Вызвать алгоритм\";\nпри необходимости можно указать идентификатор действия в одноименном поле;\nв поле \"Тип действия\" выбрать значение \"Действие\";\nв поле \"Отображать в реестре\" выбрать значение \"Да\";\nв блоке \"Связанные типы объектов\" добавить связь с типом \"Юридическое лицо\":\nв блоке \"Дополнительные параметры действия\" нажать на кнопку \"Создать\", в открывшемся модальном окне активировать параметр \"Открывать карточку объекта\" и выбрать способ открытия карточки объекта, а также указать алгоритм для запуска ETL:\nПодробнее об алгоритме.\nПеременная \"etlInstance\" объявлена с помощью функции\nvar\n.\nПри помощи функции\nnewInstance\nсоздается новый экземпляр типа \"Контур. Загрузка контрагента\".\nДалее посредством функции\nattrByVar\nс признаком \"Установить значение\" для созданного экземпляра определяются значения атрибутов:\nETL, которую необходимо выполнить – \"Контур. Загрузка контрагента\" (задается с помощью функции\ndict\n);\nатрибуту \"ИНН\" устанавливается значение, переданное при помощи\nпараметра\n.\nЗапуск ETL-процесса осуществляется при помощи функции\nstartEtl\n.\nДля корректной работы опции\n\"Открывать карточку объекта\"\nалгоритм возвращает значение атрибута \"Загруженный контрагент\", который выбирается с помощью функции\nattrByVar\n.\nВ результате настройки в панели управления реестра \"Юридическое лицо\" отобразится кнопка, при нажатии на которую будет открыто модальное окно для ввода ИНН.\nПосле нажатия на кнопку \"Ок\" откроется карточка контрагента с данными, полученными из сервиса Контур.Фокус.\nНовые контрагенты будут добавлены в реестр типа \"Юридическое лицо\", а имеющиеся в Системе объекты с указанным ИНН будут обновлены информацией, полученной из внешнего сервиса.",
  "source": "https://docs.greendata.ru/platform/ru/kontur-focus-integration.html"
}