{
  "title": "renameLdapEntry",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nrenameLdapEntry\nThe function for renaming an existing entry in the Microsoft Active Directory Service (hereinafter the AD) when connected via the LDAP protocol.\nTo change the values of entry attributes, use\nupdateLdapEntry\n.\nSyntax\nrenameLdapEntry\n(obj, entryDn, dnWithNewName)\nSetting\nPurpose\nobj\nObject with settings for connecting  to the directory service via the LDAP protocol. Find more details\nhere\n.\nAs a value, using\ndict\n, select an object of the \"LDAP connection settings\" [SYS_LDAP_SETTINGS] type.\nentryDn\nDirectory of the entry whose name needs to be changed.\nThe parameter is provided as\ntext\n.\nSpecify the full path\nincluding\nthe root directory defined in the\nLDAP connection settings\n.\ndnWithNewName\nSpecifying the directory of the entry taking into account the new name.\nThe parameter is provided as\ntext\n.\nSpecify the full path\nincluding\nthe root directory defined in the\nLDAP connection settings\n.\nNote\nAdding the function is carried out by manual entry.\nUse example\nFor example,\nintegration of the application with AD\nis configured and the AD directory service contains user entries. Within the example, the names of user entries in the directory service include users’ first and last names.\nIt is required to rename a user’s entry due to a surname change.\nThe algorithm may be as follows:\nUsing the\nrenameLdapEntry\nfunction, the name of the entry in the AD directory service is changed. Where:\nthe first parameter of the function specifies the object with settings for connecting to the AD service using\ndict\n;\nthe second parameter is the entry directory;\nthe third parameter is the entry directory taking into account the new name.\nThe following functions were also used to write the algorithm.\nDue to the user’s surname change, it is also necessary to change the value of the \"Second name\" attribute. To do this:\nusing\nreplaceLdapAttribute\n, specify the new value for the \"Second name\" attribute. The changes represent an array set via the\nnew variable\n\"modifications\";\nusing\nupdateLdapEntry\n, the specified value is passed to the AD directory service.",
  "source": "https://docs.greendata.ru/platform/en/renameldapentry.html"
}