{
  "title": "inclineNumber",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ninclineNumber\nФункция используется для склонения единицы измерения с возможностью записи числового значения прописью в указанном падеже.\nПрименяется для\nотображения\nзначения атрибута (например, в печатных формах).\nСинтаксис\ninclineNumber\n(case, number, units, unitsOnly)\nПараметр\nНазначение\ncase\nПадеж – словоизменительная грамматическая категория, с помощью которой производится склонение числа и его единицы измерения.\nВ качестве значения параметра указывается объект типа \"Падеж\" [SYS_CASE].\nnumber\nЧисловое значение, которое необходимо представить в текстовой форме (прописью) с учетом заданного падежа.\nunits\nЕдиница измерения числового значения.\nНапример, рубли, штуки, единицы.\nunitsOnly\nЛогический признак, определяющий результат, который вернет функция.\nПри значении\ntrue\nвыводится только единица измерения в заданном падеже (число не выводится).\nПри значении\nfalse\nв заданном падеже выводится число и его единица измерения.\nПримечание\nВызов функции осуществляется с вкладки\n\"Текст\"\nпанели инструментов редактора алгоритмов, в результате чего откроется модальное окно, в котором необходимо выбрать падеж для склонения числа и его единицы измерения, после чего нажать на кнопку \"Готово\".\nПри вызове функции в код алгоритма добавляется функция с фиктивной переменной\n\"string\"\n, вместо которой указывается единица измерения числового значения.\nОстальные параметры функции заменяются при необходимости (по умолчанию в качестве числового значения установлен \"О\", а логический признак, определяющий выводимый функцией результат, -\ntrue\n).\nПример\nДопустим, в текстовом поле объекта необходимо формировать комментарий, включающий минимальную стоимость залога. Стоимость должна отображаться как цифрами, так и прописью.\nАлгоритм может принять следующий вид:\nПредположим, что настройка алгоритма осуществляется через\nвыражение\nтипа, атрибутивный состав которого включает атрибуты с минимальной стоимостью предмета залога, валютой и номером договора. Расчет выражения будет установлен в атрибут \"Комментарий\".\nЕсли при записи минимальной стоимости залога цифрами необходимо добавить валюту числа, тогда следует вызывать функцию\ninclineNumber\n, при настройке которой выбрать винительный падеж, фиктивную переменную\n\"string\"\nзаменить на атрибут типа \"Валюта. Наименование\", а четвертому параметру установить значение\ntrue\n.\nДля вывода данного числа прописью с добавлением валюты в заданном падеже необходимо вызвать функцию\ninclineNumber\nи настроить аналогичным образом, за исключением последнего параметра — в данном случае используется значение\nfalse\n.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nПри помощи функции\nvar\nобъявляются переменные val и val2, в которые фиксируется результат работы функции\ninclineNumber\n, а также переменная result, используемая для формирования итогового комментария.\nДобавление атрибутов осуществляется при помощи функции\nattr\n.\nДля добавления текста в комментарии применяется функция\ntext\n.\nДля возвращения значения используется функция\nreturn\n.\nВ результате выполнения алгоритма при заданных значениях атрибутов  в объекте сформируется следующий текст комментария:",
  "source": "https://docs.greendata.ru/platform/ru/inclinenumber.html"
}