{
  "title": "ДО. Сервис. Установить ответственное подразделение",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДО. Сервис. Установить ответственное подразделение\nВыбор ответственного подразделения для обработки маршрутного объекта (выполнения задачи бизнес-процесса) может выполняться автоматически посредством сервисного действия (\nService Task (Сервисная задача)\n) \"ДО. Сервис. Установить ответственное подразделение\".\nДля этого необходимо\n:\n1. Вынести элемент Task в рабочую область (подробнее,\nНастройка схем бизнес-процессов\n).\n2. Указать тип элемента: Service Task (подробнее,\nService Task (Сервисная задача)\n).\n3. Выбрать расширение \"Установить ответственное подразделение\".\n4. Заполнить атрибуты для настройки выбранного расширения.\nгде:\nНаименование поля\nЗначение\nРоль для назначения ответственного\nВыбор роли для назначения ответственного.\nНазначать глобального ответственного\nЛогический атрибут, определяющий назначение ответственного сотрудника за выполнение задачи. Возможные значения:\nда – исполнитель назначается ответственным по всем экземплярам бизнес-процесса (используется в случае разрешенного параллельного запуска бизнес-процесса,\nСоздание карточки бизнес-процесса\n);\nнет – исполнитель назначается ответственным в рамках запущенного экземпляра бизнес-процесса.\nНазначаемые ответственные - курируемые\nЛогический атрибут, определяющий ответственного за выполнение задачи по матрице курируемости (Подробнее,\nНазначение матрицы курируемости\n).\nНастройка курируемости\nВыбор настройки курируемости из списка, в рамках которой происходит назначение (подробнее,\nНастройка курируемости\n).\nПодразделение\nВыбор подразделения для назначения задач бизнес-процесса.\nАлгоритм для определения подразделения\nВыбор/ ввод алгоритма для определения подразделения.\nУчитывать иерархию подразделения\nЛогический атрибут, определяющий учет иерархии подразделений организации Заказчика. По умолчанию – \"Нет\". Возможные варианты:\n* нет – определяются ответственные конкретного подразделения (например, \"Пермского филиала\").\n* да – определяются ответственные выбранного подразделения; и при генерации новой задачи потенциальными ответственными буду определяться сотрудники не только конкретного подразделения, но и иных подразделений вниз по иерархии (с указанной ролью).\nВизуал карточки любого типа объекта Системы может настраиваться администратором самостоятельно (подробнее,\nНастройка визуала экземпляра\n).\n5. Сохранить внесенные настройки, нажав\nили\nв карточке объекта.\nТаким образом настраивается автоматическое определение ответственного подразделения за выполнение задачи бизнес процесса.",
  "source": "https://docs.greendata.ru/platform/ru/wf-service-select-responsible-department.html"
}