{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.465.13 от 29.10.2025\nНовые возможности\nХранение\nнесохраненных пользователем  данных\nтеперь осуществляется с учетом пересчета выражений/автокалькуляции и может быть настроено в разрезе отдельного визуала экземпляра.\nРеализована поддержка кнопок браузера для перехода к ранее выполненному перемещению по уровням вложенности иерархии\nплиточного реестра\n, а также в панель управления такого реестра добавлена кнопка перехода к списку объектов верхнего уровня.\nВ результате модернизации усовершенствованы настройки\nвиджета \"Кнопка\"\n, а также появилась возможность его использования в качестве шаблона при создании\nпользовательского виджета\n.\nДля типа \"Объект ETL\" вид контроля прав заменен на\n\"Системный контроль прав\"\n, а  для\nзапуска ETL-процесса\nпри помощи системных кнопок добавлена привилегия \"Выполнение\".\nСоздание и управление\nпунктами главного меню\nстало боле простым и удобным.\nТеперь хранение\nсекретных переменных\nпо умолчанию осуществляется в основной базе данных.\nПри настройке подключения к базе данных реализованы\nдополнительные параметры\nсессии PostgreSQL.\nПоявился удобный способ сохранять важные сообщения, файлы и заметки в чате с самим собой через специальный\nчат \"Избранное\"\n.\nИзменения и улучшения\nУсовершенствована автоматическая генерация наименования таблицы типа объекта и наименования поля для таблицы атрибута.\nДоработан механизм удаления объектов при наличии зависимых объектов, на которые у пользователя отсутствуют права доступа.\nПри создании объекта типа \"Параметры объекта. Фильтр\" добавлена возможность создания фильтра через меню действий параметра.\nВ\nнастройках главного меню\nатрибуту \"Развернут по умолчанию\" установлено значение по умолчанию \"Нет\".\nВ новом объекте после сохранения отлажен процесс переключения между\nвкладками\n.\nПри работе с объектом в\nрежиме редактирования\nреестра доработана подсветка обязательных атрибутов и отображение значений объектного атрибута, ссылающегося на тип объекта с реестром по умолчанию\n\"Реестр с иерархией\"\n.\nСтабилизирована фильтрация данных со сдвигом типа динамики, заданная через\nпользовательский фильтр реестра\nи при\nсмене вида фильтра.\nОтлажена возможность изменения размера изображения, добавленного в виде миниатюры в\nвиртуальной колонке реестра\n.\nСтабилизировано отображение реестра в соответствии с заданной шириной колонок.\nОтлажено открытие настроек реестра с типом\n\"Реестр задач\"\nи возможность отображения в панели управления такого реестра элемента для выбора исполнителя.\nОтлажено отображение числовых значений и агрегации для цепочечных атрибутов в реестрах и дочерних атрибутах.\nНа визуале объекта доработано скрытие области, содержащей невидимые для пользователя параметры.\nОтлажена возможность фильтрации по дате в\nвиджете \"Проводник\"\n.\nСтабилизировано отображение значений в таблице, представленной с помощью виджета\n\"Дашборд\"\n.\nОтлажена работа\nалгоритма блокировки\nдля виджета\n\"Кнопка\"\n.\nВ дашбордах отлажена возможность фильтрации данных в\nаналитической панели  \"Таблица\"\n, используемой в качестве\nрасшифровки\n.\nСтабилизирована возможность\nпереопределения\nстандартного действия\nпакетным действием\n.\nОтлажено выполнение алгоритма\nпользовательского действия по кнопке\n, размещенной в дочернем атрибуте, добавленном на визуал связанного типа через фрейм.\nОтлажено\nсоздание объектного чата\nчерез бизнес-процесс посредством алгоритма.\nОптимизирована работа\nалгоритмов видимости\nс использованием функции\nalg\n.\nОтлажена работа функции\ncontextObjAttr\nс цепочечными атрибутами контекстного типа.\nУсовершенствованы настройки\nдерева условий\nи отлажена проверка на включение пользователя в группу доступа.\nДоработана проверка прав на выполнение\nисточника данных\n.\nСкорректированы права доступа на создание и удаления\nпунктов меню\nпри помощи кнопок панели управления реестра.\nПроведен ряд улучшений в части безопасности Системы.\nДоработана проверка цикличности при создании бизнес-процесса.\nОтлажен процесс\nвыполнения ETL\nпо файлу.\nПеред запуском ETL стабилизирована возможность открытия модального диалогового окна для ввода параметров.\nОтлажена работа трансформатора типа\n\"Поиск объекта в справочнике\"\n.\nОптимизирована установка обновлений, содержащих\nшаблоны бизнес-процессов\n.\nОтлажена возможность удаления группы доступа при заданном уровне\nпривилегии\n.\nСкорректирован перечень пользовательских ошибок, отправляемых системному администратору на E-mail.\nСтабилизирована возможность включения пользователей в\nгруппы доступа\nСистемы.\nДоработана очистка кэша при сохранении\nпривилегий\nсубъекта.\nОптимизирована работа\nбалансовых проверок\n.\nОтлажен процесс блокировки/разблокировки пользователей на основе данных, полученных из Microsoft Active Directory.\nДоработана\nвозможность синхронизации данных\nс Microsoft Active Directory только при первом входе в приложение под доменной учетной записью.\nДля\nSaaS решения\nисправлено отображение размера базы данных приложения.\nСтабилизировано отображение\nсекретных переменных\nи их сохранение в заданной\nдиректории\n.\nМодернизирован процесс сохранения изменений в документе при коллаборативном редактировании.\nОтлажено отображение курсора и горизонтальной линейки после загрузки версии из файла и принятии всех правок в документе в режиме рецензирования.\nСтабилизировано отображение отредактированных данных при переходе между вкладками просмотра и рецензирования документа.\nОтлажена настройка нумерации страниц в документе.\nСтабилизировано формирование печатной формы.\nЗа счет усовершенствования обработки заголовков, колонтитулов и комментариев стабилизировано создание новой версии документа из файла.\nДоработана возможность совместной работы с документом с разных нод.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.465.13\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.465.13.war\nhttps://downloads.greendatasoft.ru/LTS/lts.465.13.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.465.13-latest.html"
}