{
  "title": "newExcelWorkbook",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nnewExcelWorkbook\nThe function is intended to create an Excel workbook and assumes working with the\n\"File\"\n[FS_FILE] type objects by using additional methods.\nSyntax\nnewExcelWorkbook\n([fsFile])\nSetting\nPurpose\nfsFile\n.xls or *.xlsx\nfile.\nAs the parameter the user may pass the ID of an existing file (an object of the\n\"File\" [FS_FILE] type\n) in the form of a\nreference value\n, a\nvariable\n, an\nattribute\n, a\nparameter\n, or a numeric value.\nIf the file ID is not specified, a new file is created according to the settings defined in the algorithm.\nWorking with the function assumes using ExcelWorkbook class instance\nmethods\n.\nNote\nThe function is called from the\n\"Documents and Files\"\ntab on the algorithm editor toolbar.\nAs a result, the following construct is inserted into the algorithm code:\ndef book := newExcelWorkbook()\ndef book_file := newInstance(File)\nbook_file.setAttr(Name, \"My book\")\nbook_file.setAttr(Classification, All files)\nbook_file.setAttr(Data, book)\nsave(book_file)\nThe\nnewExcelWorkbook\nfunction creates an instance of the ExcelWorkbook class (\nworkbook\n). By default, the created instance is assigned to the \"book\" variable.\nThe construct also assumes using other functions.\nthe \"book\" and \"book_file\" variables are declared with the\nvar\nfunction;\na new instance of the \"File\" type is created with the\nnewInstance\nfunction and is written to the \"book_file\" variable;\nthen, using the\nattrByVar\nfunction with the active \"Set value\" flag, the declared variable attributes are assigned the specified values:\nthe \"Name\" attribute is set to \"My book\", added with the\ntext\nfunction;\nIn this case the file will be created without an extension. To create a file with a specific extension, include it in the name, for example:\n\"My book.xlsx\"\n.\nthe \"Classification\" attribute is assigned the \"All files\" instance of the \"File Classification\" [FS_FILE_KIND] type, added with the\ndict\nfunction;\nthe \"Data\" attribute is assigned the previously created entity stored in the \"book\" variable;\nsaving the generated file is performed with the\nsave\nfunction.\nTo access a previously created file the following construct can be used:\ndef file := getObject(id, File)\ndef book := newExcelWorkbook(file)\nMore about the algorithm\nthe \"file\" and \"book\" variables are declared with the\nvar\nfunction;\naccessing an object of the \"File\" type is performed via the\ngetObject\nfunction, where the \"id\" parameter must be the identifier of the target object;\nthen, using the\nnewExcelWorkbook\nfunction, a\nworkbook\nis created from the obtained file.\nThe following methods are used with the function:\nsheets\n- to get all sheets of the workbook;\nsheets(index)\n- to access a sheet by index passed as a numeric value;\nsheets(\"name\")\n- to access a sheet by name passed as\ntext\n.\nFurther work with the workbook sheets can be performed via additional methods:\nMethod\nPurpose\nname\nGetting the sheet name.\nindex\nGetting the sheet number.\nendRow\nGetting the number of the last filled row on the sheet.\nendColumn\nGetting the number of the last filled column on the sheet.\ncells(x,y)\nGetting the value of a cell by its coordinates.\nThe method uses the parameters:\nx\n– row;\ny\n– column.\ncopy([index], srcSheet)\nCopying sheets from one workbook to another.\nThe method uses the parameters:\nindex\n- an optional numeric parameter that defines the index of the sheet position where the copied sheet will be inserted.\nIf such a sheet already exists in the workbook, the sheet will be inserted before it, shifting the others.\nIf the number is not specified, the sheet will be added to the end of the workbook.\nsrcSheet\n- the workbook where the copied sheet is inserted.\nTo save changes use the\nsave\nfunction and pass an object of the \"File\" [FS_FILE] type.\nUse example\nFor example, the System contains two XLSX documents with information about candidates for an open job offer:\nthe \"Candidates\" file consisting of one sheet \"Data\" with candidates’ personal data;\nthe \"Processing\" file consisting of two sheets: \"Interview History\" and \"Salary Expectations\" with the following view:\nThe user needs to create a new document \"Report\" based on the two documents with the following sheet order:\nData;\nSalary Expectations;\nInterview History.\nAlso, for analytics purposes it is necessary to calculate the average salary expectations for the current job offer based on the data of the \"Salary Expectations\" sheet.\nThe algorithm may look as follows:\nFirst, a new workbook is created. To do this, call the\nnewExcelWorkbook\nfunction from the algorithm editor toolbar and specify the file name \"Report\" in the construct.\nThen, using\ngetObject\n, access the previously created \"Candidates\" and \"Processing\" files in the System. Based on them, the\nnewExcelWorkbook\nfunction creates workbooks for further work.\nWith the\nsheets\nand\ncopy\nmethods the sheets from the \"Candidates\" and \"Processing\" workbooks are added to the \"Report\" workbook in the required order. Then, using the\nattrByVar\nfunction with the active \"Set value\" flag, the generated workbook is written into the file’s \"Data\" attribute, after which the file is saved with the\nsave\nfunction.\nCalculation of the average salary expectations for the job offer is done using the methods:\nsheets\nand\nendRow\n- to get the last filled row number on the sheet;\nsheets\nand\ncells\n- to get table cell values.\nOther functions used to write the algorithm.\nvariables are declared with the\nvar\nfunction;\nto iterate over the cells of the fourth column on the second sheet, the\nfor\nfunction is used. The loop runs from the second to the last filled row. Inside the loop the following operations are performed:\nusing the\nif\noperator and the\nlength\nmethod, the presence of data in the cell is checked\nif the condition is met, the cell value is added to the \"sum\" variable and the \"rows_count\" counter is increased by one;\nthe text value of the cell is converted to a numeric format using the\ntoBigDecimal\nmethod for a correct mathematical calculation;\nthe\nreturn\nfunction returns the result of the average value calculation.",
  "source": "https://docs.greendata.ru/platform/en/newexcelworkbook.html"
}