{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.416.2 of June 24, 2024\nNew features\n1. The requirement to fill in the reason for pausing the normative term can now be regulated by settings.\n2. When configuring the connection of an\naction\nwith an object type, a read-only mode lock indicator appeared.\n3. After updating the platform and when first signing in, the application will show a modal window with a list of updates.\n4. A collaborative work of users with comments was added. Answers to comments are displayed immediately for all users working with the document.\nChanges and improvements\nIn dashboards, improvements in the possibility to algorithmically configure an attribute group style and name by the label,\nStabilizations in the Drill Down decryption;\nStabilizations in viewing attribute values of a business process run in the task profile;\nImprovements in the System action and session audit;\nBlocking the selection of system objects in a multiselect attribute can now be done without updating the page;\nFiltering the registry settings when selecting algorithms can now be done by the object base type;\nStabilizations in selecting multiple registry objects;\nImprovements in viewing data filtering window in the \"Flat registry\";\nStabilizations in underlying text when setting up the formatting style;\nImprovements in selecting file classification when adding files;\nStabilizations in saving child objects in the \"Receiver. Internal\" ETL stage;\nOptimizations in generating print forms with the printEDoc function;\nImprovements in running the visibility algorithm for groups of tabs;\nIt’s now once again possible to name the\ncall room\nwithout further editing;\nCorrections in chat type names in the GreenData Messenger;\nImprovements in pop-up notifications in the Messenger call service;\nImprovements in the System audit and session end date display;\nCorrections in the \"Setting up external chats\" type visual;\nOptimizations in profile opening speed;\nOptimizations in eDoc print form generation;\nOptimizations in granting permissions;\nA permission control by condition tree was added;\nAn HTML-injection vulnerability in monitoring tasks was fixed;\nUpdates in Swagger documentation;\nAn icon button was added to labels;\nIn\nKanban boards\n, a possibility to create columns based on new values was added;\nImprovements in the \"Audit. Session\" registry aimed at transferring data to event registration system with displaying the session end date;\nIn the\nExclusive mode\n, the \"Disable exclusive mode\" button was hidden for all users except for those from the Administrative group;\nOptimizations in \"Setting external chats\" visual type;\nViewing the \"Color selection\" attribute visual was enables;\nOptimizations in insertions to the sys_type_attr_ref table;\nOptimizations in task profiles opening;\nOptimizations in viewing eDoc documents;\nUpdates in system buttons relative to normative terms;\nOptimizations in opening eDoc documents and generating print forms;\nImprovements in control elements and dashboard autofill algorithms;\nImprovements in the parallel distribution of permissions.",
  "source": "https://docs.greendata.ru/platform/en/LTS.416.2-latest.html"
}