{
  "title": "Kanban board. Extended version",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nKanban board. Extended version\nThe\nKanban board\nis used for visualization, optimization and workflow efficiency improvement.\nPlanning using the\nextended version Kanban board\nprovides multi-level task flow representation, allowing visual tracking of task statuses at different stages, in different categories and groups.\nExample of configured extended version Kanban board:\nThree organization levels are used for visualization:\nstages\n- vertical columns displaying different work stages;\nswimlanes\n- horizontal rows used to split tasks into different categories, teams or work types;\ngroups\n- combination of stages/swimlanes by certain attributes, for example by priority, client or project.\nA simplified workflow visualization and management option, focused on main process stages without additional organization levels, may be configured using\n\"Kanban board\" analytics dashboard\n.\nSetting up\nCreating, configuring and working with the Kanban board is performed through\nregistry\n, which can be opened by sequentially selecting\nmain menu items\n: \"Reports\" → \"Kanban board. Extended version\".\nFor\ncreating and configuring\na Kanban board, the user must be granted appropriate access permissions.\n\"View metadata\" permission:\nRun\n\"Kanban board\" object type:\nRead\nCreate instances\nRead instances\nEdit instances\n\"Object type\" object type:\nRead instances\n\"Kanban. Stage\" object type:\nCreate instances\nDelete instances\nEdit instances\n\"Kanban. Swimlane\" object type:\nCreate instances\nDelete instances\nEdit instances\n\"Kanban. Group of swimlanes\" object type:\nCreate instances\nDelete instances\nEdit instances\n\"Kanban. Group of stages\" object type:\nCreate instances\nDelete instances\nEdit instances\n\"Object profile opening method\" object type:\nRead instances\n\"Formatting style and tooltips\" object type:\nCreate instances\nRead instances\nEdit instances\n\"Kanban. Profile attributes list\" custom widget:\nRead\n\"WorkFlow. Deadline categories\" object type:\nRead instances\nObject types whose data will be displayed as tasks on the Kanban board:\nRead\n\"Reports\" and \"Kanban board. Extended version\" menu items:\nRead\nBy default, permissions to create and edit Kanban boards are granted to users added to the\nsystem access group\n\"Administrative group\" [ROLE_ADMIN].\nIn the \"Kanban board\" object registry, creation of a new object is performed via the\nbutton in the control panel. When clicked, a new tab opens with the object ready for configuration.\nThe object name is specified in the control panel field. Access to the Kanban board settings is achieved by clicking the\nbutton in the control panel or in the\nworkspace\n.\nWhen opening an existing Kanban board object, settings become available after switching to edit mode by clicking the\nbutton in the control panel or in the\nworkspace\nprofile.\nConfiguring a Kanban board requires completing two stages:\nDefining\nconfiguration parameters\nfollowed by saving the object.\nCreating, configuring and arranging stages, swimlanes and their grouping (details in\n\"Building the Kanban Board\"\nsection).\nConfiguration Parameters\nWhen navigating to settings via the\nbutton, a modal window will open containing the following parameter groups organized in tabs:\nBasic Settings\nDisplay Settings\nWIP Limits\n[\n1\n]\nFiltering\nSortings\nBasic settings\nSetting\nPurpose\nGeneral Settings of Kanban Board\nKanban board Object Type\nThe object type whose data will be displayed as task profiles on the Kanban board.\nThe object type is selected from a dropdown list of pre-created types or can be created using the \"Add\" option available in the context menu after clicking the actions menu in the right part of the parameter field.\nThe full list of types in the parameter’s drop-down list becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nThis field is required.\nAttribute for stage separation\nThe attribute used to distribute tasks across stages (columns).\nSelection is made from a dropdown list of\nobject attributes\n(including inherited ones) of the object type specified in the \"Kanban Board Object Type\" parameter.\nThis field is required.\nCell height\nThe height of the area containing task cards.\nIf tasks don’t fit within the container’s visible area, vertical scrolling becomes available.\nAccepts integer values from 50 to 10000 (inclusive).\nDefault value is 200.\nCard opening method\nMethod for opening Kanban board object (task) cards.\nAvailable options:\nIn modal window;\nIn new window;\nIn current window.\nDefault value is \"In modal window\".\nAttribute for swimlane separation\nThe attribute used to distribute tasks across swimlanes (rows).\nSelection is made from a dropdown list of\nobject attributes\n(including inherited ones) of the object type specified in the \"Kanban Board Object Type\" parameter.\nThis field is required.\nAttribute for group of stages separation\nThe attribute for grouping stages.\nSelection is made from a dropdown list of\nobject attributes\nof the object type referenced by the attribute specified in the \"Attribute for stage separation\" parameter.\nThe directory values of the selected object attribute will be available for selection when configuring stage grouping, enabling synchronization of task profile placement changes between the Kanban board and objects of the attribute type selected for stage grouping.\nIf the parameter value is not specified, stage grouping can be configured on the Kanban board, but these changes won’t be synchronized with corresponding system objects.\nThis field is available when the \"Attribute for stage separation\" parameter is filled in.\nAttribute for group of swimlanes separation\nThe attribute for grouping swimlanes.\nSelection is made from a dropdown list of\nobject attributes\nof the object type referenced by the attribute specified in the \"Attribute for swimlane separation\" parameter.\nThe directory values of the selected object attribute will be available for selection when configuring swimlane grouping, enabling synchronization of task card placement changes between the Kanban board and objects of the attribute type selected for swimlane grouping.\nIf the parameter value is not specified, swimlane grouping can be configured on the Kanban board, but these changes won’t be synchronized with corresponding system objects.\nThis field is available when the \"Attribute for swimlane separation\" parameter is filed in.\nNumber of cards to be loaded\nThe quantity of task cards displayed in cells during initial interface loading.\nWhen the number of tasks in a cell exceeds the specified value, vertical scrolling becomes available. Scrolling triggers incremental loading of tasks according to the parameter value.\nAccepts integer values from 50 to 100 (inclusive).\nDefault value is 5.\nDisplay the number of cards in each cell\nIndicator showing the number of cards in a cell.\nWhen enabled, each cell’s header displays the count of contained task cards.\nCustomizing card attributes\nAdding attributes whose values will be displayed on task cards.\nClicking the button adds a selection area for choosing an attribute to be placed on the task card.\nExample of task card display:\nThe task name appears as a hyperlink that opens the task card when clicked.\nThe card opening method is controlled by the corresponding parameter in the \"Kanban Board General Settings\" section.\nAttribute display settings can be edited by clicking the\nicon.\nThe modal window that opens contains the following attribute configuration parameters:\nSetting\nPurpose\nGeneral attribute settings\nAttribute\nSelecting an attribute to display in the task card.\nSelection is made from a dropdown list of all attributes (including inherited ones) of the object type specified in the \"Kanban Board Object Type\" parameter.\nAttribute display style\nTitle\nEntering the attribute title to display in the task card.\nBy default, the field is filled in by attribute name.\nDisplay title\nParameter determining whether to display the attribute title in the card.\nDisplay chat button\nParameter controlling display of a chat icon which, when clicked, opens the\nweb messenger\nin the bottom right corner of the screen for discussing the configured attribute with users.\nAvailable for\nobject attributes\nof type \"Personal data\" [SYS_EMPLOYEE] or inherited from it.\nDisplay photo\nParameter controlling display of the user profile icon for the configured attribute.\nAvailable for\nobject attributes\nof type \"Personal data\" [SYS_EMPLOYEE] or inherited from it.\nDisplay as hyperlink\nParameter controlling whether to display the attribute value as a hyperlink that navigates to the attribute object type instance when clicked.\nAvailable for\nobject attributes\nexcept those of type \"Personal data\" [SYS_EMPLOYEE].\nStyle\nSelecting the attribute display style.\nSelection is made from a dropdown list of predefined\nformatting styles\n. New styles can be added via the parameter’s action menu.\nCurrently, when selecting a style for attribute display, only font size and text formatting (bold, italic, underlined) are applied.\nThe attribute order can be changed using the\nicon via the Drag&Drop method.\nAttributes are removed by clicking the\nicon.\nBy default, this section contains the \"ID\" and \"Name\" attributes with preconfigured display parameters, enabling immediate viewing of the ready analytical panel.\nDisplay Settings\nThe tab settings serve to define task styling formats based on expected and actual completion dates.\nSetting\nPurpose\nStyles of design\nExpected completion date\nSelecting an attribute containing the expected task completion date.\nSelection is made from a dropdown list of \"Date\" and \"Date/time\" type attributes (including inherited ones) of the object type specified in the \"Kanban Board Object Type\" parameter on the \"Basic Settings\" tab.\nActual completion date\nSelecting an attribute defining the actual task completion date.\nSelection is made from a dropdown list of \"Date\" and \"Date/time\" type attributes (including inherited ones) of the object type specified in the \"Kanban Board Object Type\" parameter on the \"Basic Settings\" tab.\nTask created\nSelecting\nformatting style\nto be applied to tasks:\nWhen\nno\nexpected/actual completion date parameters are specified;\nWhen both conditions are met:\nThe task\ndoesn’t have\na value in the attribute selected as the \"Actual completion date\" parameter.\nThe task isn’t due yet (current datetime is\nearlier\nthan the \"Expected completion date\" parameter value plus the \"Expiration value\" (considering the \"Expiration type\" parameter)).\nSelecting from a dropdown list of predefined\nformatting styles\n; new styles can be added via the parameter’s action menu.\nDefault: \"New task style\".\nTask completed\nSelecting\nformatting style\nfor tasks where the\nactual completion date\nparameter is filled in.\nSelecting from a dropdown list of predefined\nformatting styles\n; new styles can be added via the parameter’s action menu.\nDefault: \"Completed task style\".\nAvailable when the \"Actual completion date\" parameter is filled in.\nTask overdue\nSelecting\nformatting style\napplied when both conditions are met:\nThe task\ndoesn’t have\na value in the attribute selected as the \"Actual completion date\" parameter.\nThe task is overdue (current datetime is\nlater\nthan the \"Expected completion date\" parameter value).\nSelecting from a dropdown list of predefined\nformatting styles\n; new styles can be added via the parameter’s action menu.\nDefault: \"Overdue task style\".\nAvailable when the \"Actual completion date\" parameter is filled in.\nTask deadline expires\nSelecting\nformatting style\napplied when both conditions are met:\nThe task\ndoesn’t have\na value in the attribute selected as the \"Actual completion date\" parameter.\nThe task deadline is approaching (difference between current datetime and \"Expected completion date\" is\nless\nthan the \"Expiration value\" (considering the \"Expiration type\" parameter)).\nSelecting from a dropdown list of predefined\nformatting styles\n; new styles can be added via the parameter’s action menu.\nDefault value is \"Approaching deadline task style\".\nAvailable when the \"Actual completion date\" parameter is filled in.\nExpiration type\nDetermining the deadline calculation method.\nSelecting from a dropdown list of \"WF_TASK_TERM_TYPE\" objects for\nfixed deadlines\n. Available options:\nFixed days;\nFixed minutes;\nFixed workdays;\nFixed work minutes;\nFixed work hours;\nFixed hours.\nDefault value is \"Fixed days\".\nExpiration value\nSpecifying the deadline threshold according to the expiration type. Accepting integer values.\nDefault value is \"0\".\nWIP limits\n[\n1\n]\nUsing WIP limits\npromotes more balanced task flow, increases overall workflow efficiency, and helps control the number of simultaneously processed tasks within each stage, swimlane, or group of stages/swimlanes.\nThis tab’s settings allow defining maximum and/or minimum task card quantities in cells.\nIf the limit is not met, a color indication will be applied to the current number of tasks and the limit of the corresponding item:\nGreen (#1DB577 HEX) appears when the task count falls below the lower limit\nPink (#F5347EEX) indicates when the upper limit is exceeded\nBy clicking on the\nbutton, a form for setting the limit using the following parameters will open in the registry of the \"WIP limits\" attribute:\nSetting\nPurpose\nMethod of limit setting\nSelecting the limit configuration method with two options:\nStatic setup;\nSetup by algorithm.\nLimits\nLower limit\nNumber defining the minimum allowed quantity of task cards for the configured item.\nAccepts integer values from 0 to 100 (inclusive) that don’t exceed the upper limit (if specified).\nAt least one field (\"Lower limit\" or \"Upper limit\") must be filled in to save the limit.\nDisplayed for static limit setup.\nUpper limit\nNumber defining the maximum allowed quantity of task cards for the configured item.\nAccepts integer values from 0 to 100 (inclusive) that aren’t lower than the specified lower limit (if defined).\nAt least one field (\"Lower limit\" or \"Upper limit\") must be filled in to save the limit.\nDisplayed for static limit setup.\nAlgorithm for determining the lower limit\nAlgorithm calculating the minimum allowed quantity of task cards for the configured item.\nMust return integer values from 0 to 100 (inclusive) that don’t exceed the upper limit (if specified). Returns no limit display if the value is outside this range.\nAt least one field (\"Lower limit algorithm\" or \"Upper limit algorithm\") must be file in to save the limit.\nDisplayed for algorithm-based limit setup.\nAlgorithm for determining the upper limit\nAlgorithm calculating the maximum allowed quantity of task cards for the configured item.\nMust return integer values from 0 to 100 (inclusive) that aren’t lower than the specified lower limit (if defined).\nAt least one field (\"Lower limit algorithm\" or \"Upper limit algorithm\") must be filled in to save the limit.\nDisplayed for algorithm-based limit setup.\nStages\nSelecting stages and/or stage groups for limit application.\nEach item can have only one configured limit.\nIf there are already configured limits for the selected stages and/or groups of stages, then a modal window will open to confirm the replacement of the limit.\nSwimlanes\nSelecting swimlanes and/or swimlane groups for limit application.\nEach item can have only one configured limit.\nIf there are already configured limits for the selected swimlanes/groups of swimlanes, then a modal window will open to confirm the replacement of the limit.\nFiltering\nThe parameters of this tab enable data filtering configuration for task display and define filters available to users on the Kanban board.\nSetting\nPurpose\nFiltering algorithm\nSpecifying the value filtering algorithm.\nSelection is made from a dropdown list of pre-configured algorithms; creating new\nalgorithms\nis available via the parameter’s action menu.\nThe dropdown list displays algorithms whose base object type matches or inherits from the type selected in the\n\"Kanban Board Object Type\"\nparameter.\nFilter\nDefining object filters based on\nSQL conditions\n.\nSelection is made from a dropdown list of pre-configured filters; creating new filters is available via the parameter’s action menu.\nThe dropdown list displays filters whose base object type matches or inherits from the type selected in the\n\"Kanban Board Object Type\"\nparameter.\nAdditional attributes for filtering\nSelecting attributes whose values will enable\ntask filtering\non the Kanban board.\nSelection is made from a dropdown list of all attributes (including inherited ones) of the object type selected in the\n\"Kanban Board Object Type\"\nparameter.\nThe filtering configured for the Kanban board applies to all users.\nOnly users with Kanban board editing permissions can modify these filtering parameters.\nSortings\nThis tab sets the default task sorting rule on the Kanban board for all users, and also defines additional attributes for configuring\ncustom sorting\nwhile working with the Kanban board.\nThe following parameters are used for this:\nSetting\nPurpose\nAdditional attributes for sorting\nSelected attributes will be displayed when configuring\nsorting on the Kanban board\n.\nSortings\nConfiguring the default task sorting on the Kanban board for all users.\nSorting is configured by creating registry instances; details about the configuration parameters are described further.\nClicking the\nbutton in the \"Sorting\" registry control panel will open a modal window where the following sorting parameters are defined:\nSetting\nPurpose\nStages\nSelecting stages and/or stage groups for which sorting is configured.\nTo create a sorting, a sorting element must be specified – at least one of the fields: \"Stages\" or \"Swimlanes\" must be filled in.\nSwimlanes\nSelecting swimlanes and/or swimlane groups for which sorting is configured.\nTo create a sorting, a sorting element must be specified – at least one of the fields: \"Stages\" or \"Swimlanes\" must be filled in.\nOrders\nDefining sorting conditions for Kanban board elements specified in the \"Stages\" and \"Swimlanes\" fields.\nConditions are set by creating instances in the \"Orders\" registry. Clicking the\nbutton opens a modal window where you need to specify:\nattribute type – the attribute by which sorting is configured;\nsorting direction – the direction of sorting (ascending or descending).\nBy default, sorting is performed in ascending order.\nThe order of created instances is determined automatically by the system. The sorting order can be changed using the\nbuttons in the registry control panel.\nBuilding the Kanban Board\nAfter the\nbasic configuration parameters\nare set, the Kanban board can be formed using the buttons located in the upper-left area of the workspace.\nIf a stage is to be added first, the button in the lower area of the workspace can be clicked.\nThe swimlane add button is made available when the \"Attribute for swimlane separation\" parameter is filled in.\nThe stage/swimlane group add buttons are enabled when at least one stage/swimlane not included in any group exists.\nTo create a new stage, click the\nbutton.\nThis will display a configuration area with the following stage parameters:\nSetting\nPurpose\nName\nEntering the stage name for the Kanban board.\nDefaults to the name of the first selected stage value.\nValues\nSelecting one or more flag that determine task placement in this stage.\nSelection is made from a dropdown list of values from the attribute specified in the \"Attribute for stage separation\" field in settings.\nThe dropdown list only displays values not selected in other stages.\nThe Kanban board will display all instances of the type selected in the \"Kanban Board Object Type\" field where the stage separation attribute matches at least one of the selected values.\nPosition\nDefining the need to display swimlanes in the added stage.\nWhen choosing to display without swimlanes, the stage can only be positioned at the beginning or at the end of the customizable Kanban board.\nThe purpose of this parameter is to allow adding a stage without swimlane division for creating a backlog column.\nPossible values:\nWith swimlanes;\nLeft without swimlanes;\nRight without swimlanes.\nThe default value is set to \"With swimlanes\".\nThe parameter is displayed when there is at least one swimlane on the Kanban board.\nAfter completing the configuration, click \"OK\" to add the new stage to the Kanban board with its associated object cards. Clicking \"Cancel\" will return the board to its original state.\nTo create a new swimlane, the\nbutton must be clicked.\nThe swimlane addition button is enabled when the\nAttribute for swimlane separation\nparameter is filled in.\nThis action displays a configuration area with the following swimlane parameters:\nSetting\nPurpose\nName\nEntering the swimlane display name.\nDefaulting to the first selected value’s name.\nValues\nSelecting one or more flag for task placement in this swimlane.\nSelecting from a dropdown list of the attribute specified in the\nAttribute for swimlane separation\nfield.\nThe dropdown list only displays values not selected in other stages.\nShowing all instances where the\nAttribute for swimlane separation\nmatches at least one selected value.\nWhen configuration is complete, the \"OK\" button must be clicked to add the swimlane with its associated cards. The \"Cancel\" button returns the board to its previous state.\nTo create a new group of stages, click the\nbutton; for a group of swimlanes -\n.\nThe group of stages/swimlanes addition buttons are only available when at least one stage/swimlane not added to any of the exiting group.\nThe following explains how to create the group of stages.\nGroup of swimlanes creating follows the same process.\nSetting\nPurpose\nName\nEntering the name for the group of stages.\nValue\nSelecting of one or more criteria for associating selected stages with the group of stages separation attribute.\nIf no value is selected, the group is created without attribute binding.\nValues are selected from a dropdown list of the attribute specified in the\nAttribute for group of stages separation\nfield.\nThe dropdown list shows only values not used in other groups of stages.\nThis field appears when the\nAttribute for group of stages separation\nparameter is filled in.\nStages\nSpecifying stages to include in the group.\nThe stages dropdown list displays only stages with selected values belonging to instances where the value of the\nAttribute for group of stages separation\nis among the group’s specified values or where no attribute value is specified.\nPosition\nDefining the need to display swimlanes in the added stage group.\nWhen choosing to display without swimlanes, the stage group can only be positioned at the beginning or at the end of the customizable Kanban board.\nThe purpose of this parameter is to allow adding a stage group without swimlane division for creating a backlog.\nPossible values:\nWith swimlanes;\nLeft without swimlanes;\nRight without swimlanes.\nIf the stage group is set to display without swimlanes, the same setting will be applied to all stages in that group.\nThe default value is set to \"With swimlanes\".\nThe parameter is displayed when configuring the stage group, and when there is at least one swimlane on the Kanban board.\nUpon completing the configuration, click \"OK\" button; the new group of stages will be added to the Kanban board along with its related object cards. Clicking the \"Cancel\" button will return the board to its original state.\nEach added stage, swimlane, or group of stages/swimlanes will display the\nbutton. Clicking this button opens a dropdown menu with the following options:\n1. Edit or delete the stage, swimlane, or group of stages/swimlanes.\nThe editing area allows modification of previously configured settings for the stage, swimlane, or group of stages/swimlanes. Changes are saved by clicking the \"OK\" button.\nDeleting the stage, swimlane, or group of stages/swimlanes (when no dependencies exist) occurs immediately after clicking the\nbutton.\nMultiple items cannot be added or edited simultaneously.\nAlways complete configuration by clicking \"OK\", otherwise clicking another add/edit button will automatically cancel unsaved changes in the currently open editing area.\n2. Configure WIP limits\n[\n1\n]\nfor specific stages, swimlanes, or groups of stages/swimlanes.\nIf a limit has already been created for a stage, swimlanes, or group of stages/swimlanes, then user can either edit the current limit or create a new limit (instead of the current one):\nWhen creating a new limit, the configured stage/swimlane/group of stages/group of swimlanes is automatically added to the \"Stage\"/\"Swimlane\" field. The remaining limit configuration process follows the same procedure as defined in the Kanban board settings in the\n\"WIP Limits\"\ntab.\nUsing the\nbutton on Kanban board items creates new tasks with automatic assignment to the relevant stage, swimlane, and (when configured) the set group of stages/swimlanes.\nFor more convenience, cell contents can be collapsed.\nWorking with Kanban board\nWhen working with a Kanban board, users can:\nCreate tasks\nMove tasks\nbetween cells using Drag&Drop\nFilter task display\nSorting task cards\nTo work\nwith a configured Kanban board,\nend users\nmust be granted the following access permissions:\nMenu items \"Reports\" and \"Kanban board. Extended version\":\nRead\nObject type \"Kanban board\":\nRead instances\nObject type selected in the \"Kanban Board Object Type\" field during\nconfiguration\n:\nRead instances\nCustom widget \"Kanban. Card attributes list\":\nRead\nObject type \"Kanban. Stage\":\nRead instances\nObject type \"Kanban. Swimlane\":\nRead instances\nObject type \"Kanban. Group of swimlanes\":\nRead instances\nObject type \"Formatting style and hints\":\nRead instances\nAdditionally, to move tasks between Kanban board items, permissions must be granted for:\nThe object type selected in the \"Kanban Board Object Type\" field during\nconfiguration\n:\nEdit instances\nConfigured Kanban boards can be accessed via the\nmain menu item\n.\nCreating tasks\nTasks are created on the Kanban board by clicking the\nbutton. New tasks will automatically be assigned to the relevant stage, swimlane, and (when\nconfigured\n) to the set group of stages/swimlanes.\nWhen\nWIP limits\nare configured for an item (stage, swimlane, group of stages/swimlanes), the specified limits and current task count in the cell are displayed in the following format:\n<Lower limit>/<Current task count>/<Upper limit>\nThe WIP limit allows highlighting when limits are exceeded by coloring both the current task count and the item limit using the default warning colors.\nWhen kanban board filtering is active, limit violation highlighting only considers currently displayed (filtered) tasks.\nFor example, if the \"Requirement: to do\" stage exceeds its upper limit while \"Requirement: done\" falls below its lower limit, the display will appear as:\nMoving tasks\nStages and groups of stages, as well as swimlanes and groups of swimlanes, can be rearranged using drag&drop.\nMovement of stages/swimlanes between groups is permitted when the values match the group and if the groups are not related to a directory.\nStages and stage groups\nwith the \"Left without swimlanes\"/\"Right without swimlanes\" setting can only be moved within the specified side.\nWhen the last remaining stage is dragged out of a group of stages, the empty group is automatically deleted. This same behavior applies when the last swimlane is removed from a group of swimlanes.\nAll modifications made on the Kanban board - including task reordering within cells - are automatically saved by the System with no manual confirmation required. Changes become immediately visible upon page refresh.\nFiltering tasks\nTask filtering can be performed using:\nthe search field in the control panel\nthe\nfilter in the control panel - for filtering task cards across all cells of the Kanban board;\nthe filtering option available in the action menu of a Kanban board element - for adding a filter to a specific stage, swimlane, group of stages, or group of swimlanes.\nUnlike the filtering configured in\nKanban board settings\n, this filtering applies only to the current user and is preserved in the URL (remaining active after page refresh). Kanban boards with configured filtering can be shared via URL.\nA Kanban board with configured filters can be shared by sending its URL.\nWhen creating a filter, a modal window will open where you need to set the required filtering conditions and click the \"Apply\" button:\nFilter configuration is based on\nattributes located on the task card\nand additional attributes specified during\nconfiguration on the \"Filtering\" tab\n.\nFiltering by\nmultiselect attributes\nis not supported.\nIf filtering is applied to all cells, then configuring a filter on a stage, swimlane, group of stages or group of swimlanes will sort the already filtered tasks.\nWhen a filter is applied to all cells on the Kanban board, the icon in the control panel will be replaced:\n.\nIf filtering or\nsorting\nis configured on a Kanban board element, there will be a corresponding visual indicator. To modify this filtering, select the \"Filtering\" option in the context menu; to reset it — click on\n:\nIf the Kanban board has at least one configured filter, a dropdown list becomes available next to the filter icon in the control panel, offering the following options:\nConfigure/edit the filter for all task cards;\nReset the filter for all task cards (if previously configured);\nReset all user-configured filters (configured using the\nicon in the control panel and on stages, swimlanes, groups of stages and groups of swimlanes).\nTask sorting\nBy default, all users apply the sorting configured in the\nKanban board settings\n. A user can customize sorting according to their needs and preferences using:\nthe\nsorting option in the control panel – to sort task cards across all cells of the Kanban board;\nthe sorting option available in the action menu of a Kanban board element – to configure sorting on a specific stage, swimlane, group of stages, or swimlanes.\nA Kanban board with configured sorting can be shared by sending its URL.\nWhen creating a sorting, a modal window will open for selecting the attributes to sort by and the sorting direction:\nSorting configuration is based on\nattributes located on the task card\nand additional attributes specified during\nconfiguration on the \"Sorting\" tab\n.\nThe order of sorting can be changed using the\nicon via Drag&Drop. To delete a sorting, use the\nbutton.\nSorting configured on a specific element takes priority over sorting configured via the Kanban board control panel.\nSorting configured on stages takes priority over sorting configured on swimlanes.\nWhen sorting is created on a stage, this sorting will apply to all swimlanes of that stage.\nWhen sorting is created on a swimlane, this sorting will apply to all stages of that swimlane.\nWhen sorting is applied to all cells on the Kanban board, the icon in the control panel will be replaced:\n.\nIf sorting or\nfiltering\nis configured on a Kanban board element, there will be a corresponding visual indicators. To modify this sorting, select the \"Sorting\" option in the context menu; to reset it — click on\n:\nIf the Kanban board has at least one configured sorting, a dropdown list becomes available next to the sorting icon in the control panel, offering the following options:\nConfigure/edit sorting for all task cards;\nReset sorting for all task cards (if previously configured);\nReset all user-configured sortings (configured using the\nicon in the control panel and on stages, swimlanes, groups of stages, and swimlanes).\n1\n. WIP-limits (Work In Progress — the number of tasks in progress) is a project management tool that limits the number of tasks being performed simultaneously.",
  "source": "https://docs.greendata.ru/platform/en/kanban_board_extended.html"
}