{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.424.2 от 16.08.2024\nНовые возможности\nТеперь при наличии\nправ на разрешение\nбизнес-администратор может перейти к настройкам реестра или визуала, даже если кнопка настройки скрыта с\nпанели управления\n.\nПоявилась возможность переключения между\nвизуалами\nво время настройки.\nРеализована возможность отключения фокуса первой строки для табличных\nатрибутов\nпри настройке визуала экземпляра.\nОрганизовано логирование ошибок при использовании\nкомнаты для звонков\nнеавторизованными пользователями.\nВ модуле EDoc расширены возможности форматирования текста с использованием горячих клавиш.\nИзменения и улучшения\nВо избежание ошибок пользователей  изменение атрибутов родительского типа, добавленного через\nвозможные расширения\n, теперь доступно только из карточки расширяющего типа.\nОтлажена работа параметров\nвиджета \"Дашборд\"\n, в качестве значений которых выбираются цепочечные объектные атрибуты.\nСтабилизирована подстановка значения по умолчанию в наследуемом атрибуте с множественным выбором.\nСтабилизирована работа при настройке\nпользовательского реестра\n.\nОтлажено отображение\nвизуалов по алгоритму\n.\nОтлажена работа действия \"Загрузка объекта через ETL\".\nОтлажено формирование\nуведомления о нормативных сроках\n, присылаемого по почте, в соответствии с локалью сотрудника.\nВ редакторе алгоритмов оптимизирован процесс сохранения алгоритма в папку.\nСтабилизирована работа функции\nfieldBySource\n.\nВозможность создания объекта через объектный атрибут теперь не требует проверки прав на чтение связанного типа объектов.\nВ\nаудите изменений\nотлажено отображение изменения данных атрибута.\nВ аудите действий стабилизировано отображение наименований объектов.\nДобавлена возможность установки GUF-файлов\nпри работе с API\n.\nСтабилизирован перенос ETL и визуалов при помощи GUF-файлов.\nВ модуле EDoc стабилизировано отображение межстрочного интервала при печати/экспорте документа, а также отлажен процесс формирования печатных форм.\nВ модуле EDoc отлажено отображение коммментариев в выгруженном документе, стабилизирован процесс выделения текста при помощи мыши.\nВ Web-версии приложения GreenData Messenger оптимизировано отображение модальных окон при присоединении к групповому чату, а также отлажено отображение текста в закрепленных сообщениях.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.424.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.424.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.424.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.424.2-latest.html"
}