{
  "title": "Selecting the file storage",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSelecting the file storage\nFile storage is a system designed for storing, organizing, and managing files.\nThe file storage is selected in the\nregistry\nof the \"File storage\" [FS_STORAGE] type. The basic delivery assumes the following set of directories:\nStorage settings\nTo define a directory for file storage, the user needs to open the required storage object and activate the \"Default\" flag.\nThe \"Default\" flag can be active for only one registry object. After saving an object with this flag enabled, it will be automatically disabled in the previously selected object.\nThe user running the application must have read and write permissions for the specified directory.\nAfter applying the settings, it is necessary to update the application cache. Otherwise, the system will continue using the previous configuration value.\nIf needed, the user can specify storage configuration parameters, which depend on the selected directory. Some of these parameters are listed in the table below:\nSetting\nPurpose\nFile storage URL\nPath to the folder containing the storage files.\nMove to storage when replacing content\nWhen the file content is replaced, it will be moved to the specified storage.\nDelete files permanently\nWhen the parameter’s switch is active, if the file is deleted from the registry or from the object, it will be deleted from the storage with no possibility of recovery.\nDescription\nDescription of the storage object.\nDefault\nSetting the configurable object as the default storage.\nFile storage S3\nTo use the File storage S3, the user needs to:\nSpecify the connection parameters to the S3 service in the\napplication configuration file\n.\nSelect the \"File storage S3\" instance as the default file storage.\nTo move files previously saved in the database to the S3 storage, the\nmigrateFile\nfunction can be used.\nComposite Storage\nComposite storage allows the fault-tolerant file storage across multiple data centers (DCs).\nTo use the storage, follow these steps:\nForm the storage composition.\nTo do this, open the \"Composite storage\" object. In the object profile, within the \"File storage package\" registry control panel, click the\nbutton and configure the parameters in the opened profile:\nSetting\nPurpose\nFile Storage\nSelect the file storage to be added to the composite storage.\nThe selection is made from objects of \"File Storage\" [FS_STORAGE] type (excluding the composite storage itself).\nOrder\nA number defining the priority of the selected file storage within the composite storage.\nActivate the \"Default\" flag.\nThe storage composition must contain at least one directory.",
  "source": "https://docs.greendata.ru/platform/en/selecting-the-file-storage.html"
}