{
  "title": "Системное действие. Параметры для автоматического запуска алгоритма",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСистемное действие. Параметры для автоматического запуска алгоритма\nСистемное действие\nс расширением \"Параметры для автоматического запуска алгоритма\" позволяет осуществлять автоматический запуск алгоритма во время выполнения ETL-процесса.\nДанный функционал также может быть настроен посредством преобразователя данных с настроенным\nтрансформатором \"По алгоритму\"\n.\nПри\nнастройке схемы ETL\nс панели действий и компонентов необходимо перетащить (Drag&Drop) в рабочую область элемент задачи. После чего нажатием на кнопку\nв меню действий выбрать тип \"Этап. Системное действие\":\nПараметры настройки\nДля перехода к параметрам настройки системного действия необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего откроется новая вкладка, на которой в модальном окне необходимо выбрать расширение \"Параметры для автоматического запуска алгоритма\":\nПосле чего Система отобразит соответствующие параметры настройки:\nПараметр\nНазначение\nАлгоритм для выполнения\nОпределение алгоритма, который будет запускаться при обработке текущего этапа ETL-процесса.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nВ алгоритме допустимо использование функции\netlValue\nдля обращения к входящей динамической структуре, но при этом необходимо указывать полный путь до нужной ноды, начиная с корня.\nВыполнять в одной транзакции\nПризнак, определяющий выполнение алгоритма в рамках одной транзакции.\nПри активном параметре выполнение алгоритма выполняется в одной транзакции. Если параметр неактивен, то выполняется одна транзакция для каждой функции\nsave\nв алгоритме.\nПо умолчанию параметр активен.\nВид объектов для запуска\nОпределение вида объектов для запуска алгоритма, выбранного в параметре \"Алгоритм для выполнения\".\nВозможные варианты:\nвыбор списка объектов –  алгоритм будет выполнен по объектам, выбранным в параметре \"Список объектов\";\nвыбор типа объекта и алгоритма фильтрации – инициирует запуск алгоритма по каждому объекту типа, указанному в параметре \"Тип объекта для определения объектов для запуска\", который соответствует условию фильтрации, заданному в параметре  \"Алгоритм фильтрации объектов\".\nСписок объектов\nОпределение объектов системы, по которым будет осуществлен запуск алгоритма.\nВыбор ранее созданных объектов осуществляется из выпадающего списка, добавление нового объекта доступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор списка объектов\".\nТип объекта для определения объектов для запуска\nОпределение типа объектов, по объектам которого будет осуществляться запуск алгоритма.\nВыбор ранее созданного типа объектов осуществляется из выпадающего списка, добавление нового\nтипа объектов\nдоступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор типа объекта и алгоритма фильтрации\".\nАлгоритм фильтрации объектов\nОпределение алгоритма для фильтрации объектов, по которым будет осуществляться  запуск алгоритма выполнения.\nВыбор ранее созданного алгоритма фильтрации осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПараметр доступен при выборе вида объектов для запуска \"Выбор типа объекта и алгоритма фильтрации\".\nПример\nПредположим, что в процессе выполнения ETL-процесса необходимо запустить алгоритм по рассылке\nшаблона уведомлений\nвсе пользователям Системы, которые входят только в группу доступа \"Служба безопасности\".\nРассмотрим реализацию данной задачи посредством добавления системного действия. На\nсхему\nнеобходимого ETL-процесса добавляется этап типа \"Этап. Системное действие\".\nПосле сохранения схемы ETL можно перейти к настройкам системного действия по кнопке\nв меню действий этапа. На открывшейся странице выбирается расширение \"Параметры для автоматического запуска алгоритма\", после чего параметры настроек определяются следующим образом:\nалгоритм выполнения используется для отправки шаблона уведомлений необходимым пользователям;\nПодробнее про написание алгоритма.\nДля отправления сообщения по электронной почте пользователю Системы осуществляется вызов функции\nsendMsgToSubject\nпо текущему объекту системы.\nчтобы установить, каким пользователям будет отправляться рассылка, необходимо определить следующие параметры:\nвидом объекта для запуска устанавливается \"Выбор типа объекта и алгоритма фильтрации\";\nтип объектов для определения объектов для запуска – \"Пользователь\";\nфильтрация объектов запуска задается одноименным алгоритмом.\nПодробнее про написание алгоритма.\nВ качестве типа объектов, элементы которого нужно отфильтровать, устанавливается тип \"Пользователь\".\nДля выбора атрибута \"Настроенные группы\" используется функция\nattr\n.\nВыбор группы доступа \"Служба безопасности\" осуществляется при помощи функции\ndict\n.\nВ результате данных настроек при выполнении ETL-процесса будет запущен алгоритм \"Отправка уведомлений\" по всем объектам типа \"Пользователь\", у которых в числе настроенных групп содержится только группа доступа \"Служба безопасности\".",
  "source": "https://docs.greendata.ru/platform/ru/system-action-algorithm-autorunning-parameter.html"
}