{
  "title": "Создание экземпляра типа объекта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСоздание экземпляра типа объекта\nДля создания нового экземпляра\nтипа объекта\nнеобходимо перейти в\nреестр объектов\nи нажать на кнопку\nв панели управления.\nЧерез выпадающий список кнопки\nсоздание объекта доступно в следующих режимах:\nв этом окне – отображение визуала создаваемого экземпляра объекта в текущем окне браузера;\nв модальном окне – открытие визуала экземпляра в модальном окне;\nв новой вкладке – открытие новой вкладки браузера с визуалом создаваемого экземпляра объекта.\nПо умолчанию откроется\nвизуал наследуемого типа объекта\n.\nИзменение состава и размещения атрибутов, добавление визуальных элементов, установка условий видимости/блокировки элементов осуществляется при помощи настройки\nвизуала экземпляра\n.\nНа визуале объекта следует заполнить необходимые параметры и для сохранения данных нажать на кнопку\nв панели управления.\nРасшифровка пиктограмм, которые могут быть отображены рядом с параметрами объекта.\nПиктограмма\nЗначение\nПоле обязательно для заполнения.\nПоле может быть заполнено автоматически или данное поле обязательно для заполнения и значение внесено.\nПри наведении курсора на пиктограмму будет отображена подсказка для ввода данных.\nПоле допускает ввод значений для\nмультиязычных атрибутов\n.\nПосле сохранения созданный объект отобразится в реестре объектов:\nХранение несохраненных данных\nЕсли пользователь начал заполнение данных, но не сохранил внесенные изменения при закрытии карточки, при активной\nнастройке\n\"Сохранять введенные данные при закрытии нового (несохраненного) объекта\" по нажатию в панели управления реестра объектов на кнопку\nпользователю будет отображен визуал с ранее введенными данными.\nДля очистки полей от указанных ранее значений необходимо нажать на кнопку\n.\nВидимость кнопки\nрегулируется\nнастройками кнопок панели управления\n.\nПомимо этого, при создании объекта в модальном окне кнопка\nотображается только при наличии ранее заполненных, но несохраненных данных.\nИмеются особенности предзаполнения данных в несохраненном объекте.\n1. Расчет\nсобытий\n,\nвыражений/автокалькуляций\nможет повлиять на итоговый результат отображения предзаполненных данных.\nПорядок выполнения операций при открытии экземпляра с ранее заполненными, но не сохраненными пользователем данными (каждый последующий шаг осуществляет запись значений поверх предыдущего):\nРасчет выражений/автокалькуляций.\nВыполнение алгоритма события перед открытием.\nВставка ранее введенных пользователем, но несохраненных данных.\nПовторный расчет выражений/автокалькуляций с учетом данных, восстановленных на шаге 3.\nВыполнение алгоритма события после открытия.\n2. Предзаполненные данные не могут быть пересчитаны посредством выражения.\nПример\nДопустим, в типе \"Обращения\" имеется\nвыражение\n, при помощи которого в атрибут \"Статус обращения\" устанавливается значение \"Новое\".\nПри создании нового обращения к атрибуту \"Статус обращения\" применилось данное выражение. Пользователь указал наименование и дату начала ожидания, после чего нажал на кнопку возращения к предыдущей странице без сохранения:\nПри повторной попытке создать обращение перед пользователем откроется карточка с ранее заполненными данными:\nПредположим, пользователь очистил поле статуса обращения и снова закрыл экземпляр без сохранения.\nВ типе объекта добавили выражения для установки значений в атрибуты \"Дата начала ожидания\" (текущую дату) и \"Описание\" (текст \"Опишите проблему подробнее\").\nПри следующей попытке создать обращение перед пользователем откроется визуал объекта с ранее заполненным наименованием, датой начала ожидания, отсутствующим значением статуса обращения, а также посредством выражения будет заполнено поле \"Описание\".\nПри новой попытке создания экземпляра Системой в первую очередь был выполнен расчет трех выражений с установкой значений в соответствующие атрибуты.\nДалее, поскольку в атрибуты \"Дата начала ожидания\" и \"Статус обращения\" ранее уже вносились изменения, их данные были зафиксированы Системой в памяти приложения. Значения данных атрибутов будут перезаписаны после расчета выражений значениями из памяти приложения.\n3. Если на поле имеется условие блокировки, значение такого атрибута не сохраняется для последующего предзаполнения.\nЗа исключением случая, когда установка блокировки зависит от атрибута, значение которого может быть рассчитано выражением.\nПример\nДопустим, при создании обращения поле \"Категория обращения\" доступно только после выбора значения в атрибуте \"Статус обращения\".\nСоздавая новый экземпляр, пользователь указал наименование, категорию и статус обращения, после чего нажал на кнопку возращения к предыдущей странице без сохранения:\nПри повторной попытке создать обращение перед пользователем откроется карточка только с заполненными полями \"Наименование\" и \"Статус обращения\":\nЕсли имеется выражение с установкой результата в атрибут \"Статус обращения\", тогда значение в поле \"Категория обращения\" будет сохранено в памяти приложения для последующего предзаполнения.\nЕсли в реестре активен\nрежим редактирования\n, то при создании нового объекта в верхней части реестра добавляется новая строка с фокусом на первом поле (подробнее в\nстатье\n).\nРабота с экземпляром типа объекта\nОткрыть карточку объекта для просмотра или редактирования можно из реестра посредством:\nдвойного нажатия по объекту в реестре;\nвыбора объекта в реестре с последующим нажатием на кнопку\nв панели управления реестра.\nС другими кнопками панели управления для работы с экземплярами можно ознакомиться в статье\n\"Работа с реестром объектов\"\n.\nЧерез выпадающий список кнопки\nдоступен выбор режима просмотра карточки объекта.\nПри просмотре карточки объекта в модальном окне можно открыть карточку на соседней вкладке браузера при помощи нажатия на кнопку\n.\nСостояние изменений объекта может отображаться в\nнавигационной панели\nили в шапке модального окна (в зависимости от режима открытия объекта). Данный функционал доступен при активной\nсистемной настройке \"Отображать индикацию изменений в объекте\"\n.\nПри изменениях, вносимых в объект другим пользователем, индикация для текущего пользователя не отображается.\nЧтобы при работе с Системой вкладки открывались автоматически, в том числе для просмотра объектов, необходимо разрешить работу браузера с всплывающими окнами.",
  "source": "https://docs.greendata.ru/platform/ru/creating-a-new-object-type-profile.html"
}