{
  "title": "Обновления в платформе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбновления в платформе\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.390.5 от 27.11.2023\nНовые возможности\nВ таблицах дашборда теперь доступна опция мультивыбора объектов по аналогии с реестрами.\nПри работе с поисковыми фильтрами теперь можно управлять глубиной поиска в иерархических реестрах.\nЗагрузка новой версии документа EDoc теперь доступна сразу с закладками, при этом в документе показываются изменения относительно версии в системе.\nФункцию \"newVersionFromFile\" переименовали в \"newVerEdocFromFile\" и расширили её функциональность – теперь новую версию документа из файла можно создавать алгоритмически как в режиме рецензирования, так и в режиме работы с закладками.\nДля каждой закладки в документе EDoc теперь можно оставить несколько комментариев, при этом фильтрация комментариев теперь имеет более гибкую настройку.\nНовинка в Messenger позволяет создавать закрытые чаты, для вступления в которые потребуется получить подтверждение администратора.\nИзменения и улучшения\nВ задачах с отложенным стартом теперь доступно отображение фактического времени выполнения задачи.\nОптимизирован процесс переноса прав по умолчанию в GUF-файлах.\nМодернизирована настройка управления поиском в плоских и легких реестрах.\nУлучшено отображение изображений, добавляемых в текстовый атрибут.\nСтабилизирован процесс отправки уведомлений при смене исполнителя по задаче бизнес-процесса.\nДействие при удалении объектов с настроенной двусторонней связью теперь настраивается пользователем.\nОтлажен процесс создания новой темы оформления.\nСтабилизирован процесс формирования и сохранения печатной формы во внешнем хранилище при помощи функции printEDoc.\nУстранены ошибки, мешающие корректно выполнять действия и события, добавленные через фрейм.\nПовышена стабильность работы комнаты для звонков.\nОтображение дашборда в мобильном приложении теперь может регулироваться пользователем.\nПовышена стабильность создания визуала настройки кнопок панели управления.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.390.5\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.390.5.war\nhttps://downloads.greendatasoft.ru/LTS/lts.390.5.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.390.5.html"
}