{
  "title": "etlValueForValue",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\netlValueForValue\nФункция для получения значения элемента\nдинамической структуры\n.\nРабота функции осуществляется относительно ноды, отличной от указанной в качестве коллекции входных данных и полученной, например, с помощью функции\ngetParentValue\n.\nДля получения значения элемента динамической структуры, указанного в качестве коллекции входных данных, можно использовать функцию\netlValue\n.\nСинтаксис\netlValueForValue\n(obj, name)\nПараметр\nНазначение\nobj\nЭлемент динамической структуры (коллекция или объект), содержащий искомое значение.\nname\nНаименование поля динамической структуры, при необходимости путь к которому указывается через запятую.\nЕсли необходимое поле является коллекцией, функция возвращает список элементов.\nПримечание\nДобавление функции осуществляется посредством\nручного ввода\n.\nПример\nДопустим, при загрузке производственного календаря необходимо получить описание каждого праздника из динамической структуры в\nтрансформаторе по алгоритму\n.\nДинамическая структура имеет следующий вид:\nВ качестве коллекции входных данных указан элемент \"day\", а значение требуется получить из элемента \"title\":\nАлгоритм примет следующий вид:\nДля получения значения поля \"title\" элемента \"holiday\" необходимо в качестве параметров функции\netlValueForValue\nуказать коллекцию, содержащую искомое значение, и наименование необходимого элемента.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее\nпеременные объявляются посредством функции\nvar\n;\nпроверка условий осуществляется с помощью функции\nif\n;\nпроверка на наличие значения производится посредством функции\nisNull\n;\nдля возвращения полученного значения используется функция\nreturn\n;\nпереход к элементу \"holidays\" осуществляется посредством функции\ngetParentValue\n, после чего с помощью метода\nget\nпроизводится получение элемента \"holiday\".\nВ результате выполнения алгоритма для каждого праздничного дня будет сформировано описание в соответствии с данными производственного календаря.",
  "source": "https://docs.greendata.ru/platform/ru/etlvalueforvalue.html"
}