{
  "title": "Аналитическая панель дашборда \"Структурная диаграмма\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАналитическая панель дашборда \"Структурная диаграмма\"\nАналитическая панель\nдашборда\n\"Структурная диаграмма\" позволяет выстроить диаграмму, учитывая зависимость данных друг от друга. Все значения для отображения данных заимствуются из настроенного\nисточника данных\n.\nСтруктурная диаграмма может быть представлена следующим образом:\nВ режиме редактирования визуального представления дашборда необходимо с панели \"Элементы\" перетащить (Drag&Drop) элемент \"Структурная диаграмма\" на рабочую область.\nДальнейшая настройка диаграммы выполняется по кнопке\n, в результате нажатия на которую откроется модальное окно \"Настройка диаграммы\", содержащее пять вкладок.\nПараметры настройки\nОсновные настройки\nНа вкладке \"Основное\" определяются основные параметры аналитической панели:\nПараметр\nНазначение\nНаименование\nВвод/ отображение наименования диаграммы. Это наименование будет отображено конечному пользователю в карточке.\nИсточник данных\nОпределение источника данных, на основе которого будет построена диаграмма.\nВид диаграммы\nОпределение вида диаграммы. Возможные значения (рассмотрены далее):\n1. Пончик;\n2. Пирог;\n3. Столбчатый;\n4. Столбчатый горизонтальный;\n5. Воронка;\n6. Пузырьковая.\nСтолбец для группировки\nВыбор атрибута, значение которого будет использоваться для группировки данных.\nИспользуется для настройки диаграмм всех видов, кроме \"Пузырьковой\".\nКоличество рядов данных\nОпределение количества отображаемых рядов данных.\nВыбор осуществляется посредством переключателя, возможные значения:\nОдин\nБолее одного.\nПо умолчанию установлено значение \"Один\"\n.\nПараметр отображается при настройке диаграммы вида \"Столбчатый\" или \"Столбчатый горизонтальный\".\nСтолбец для наименования ряда\nВыбор поля источника данных, значение которого будет использоваться в качестве наименования сгруппированных данных.\nПараметр отображается при настройке диаграммы вида \"Столбчатый\" или \"Столбчатый горизонтальный\", когда количество рядов данных указано \"Более одного\".\nСтолбец для агрегации значения\nВыбор атрибута, значение которого будет использоваться для агрегации значения.\nПараметр отображается при настройке всех видов диаграмм, кроме \"Пузырьковая\".\nСпособ агрегации\nВыбор способа агрегации. Используется для настройки диаграмм всех видов, кроме \"Пузырьковой\". Возможные значения:\n1. Количество;\n2. Максимум;\n3. Минимум;\n4. Среднее взвешенное;\n5. Среднее значение.\nСтолбец для радиуса\nВыбор атрибута, значение которого будет использоваться для исчисления радиуса элемента пузырьковой диаграммы (\"пузырька\").\nПараметр отображается при настройке диаграммы вида \"Пузырьковая\".\nСтолбец для оси X\nВыбор атрибута, значение которого будет использоваться для определения оси абсцисс.\nПараметр отображается при настройке диаграммы вида \"Пузырьковая\".\nСтолбец для оси Y\nВыбор атрибута, значение которого будет использоваться для определения оси ординат.\nПараметр отображается при настройке диаграммы вида \"Пузырьковая\".\nСтолбец для подписи\nВыбор атрибута, значение которого будет использоваться для подписи элементов пузырьковой диаграммы (\"пузырьков\").\nПараметр отображается при настройке диаграммы вида \"Пузырьковая\".\nПоказывать подписи на диаграмме\nПризнак, определяющий подпись элементов на пузырьковой диаграмме.\nПараметр отображается при настройке диаграммы вида \"Пузырьковая\".\nРасшифровка сектора диаграммы\nСтолбец с идентификатором сектора диаграммы\nПараметр необходим для создания расшифровки значения ряда (Drill-down).\nОтображать таблицу с расшифровкой\nОткрытие поясняющей таблицы с данными при нажатии на сектор диаграммы.\nТаблица дашборда для расшифровки\nВыбор таблицы дашборда, которая будет отображена при нажатии на сектор диаграммы динамики. Поле отображается при активном положении переключателя \"Отображать таблицу с расшифровкой\".\nПри расшифровке установить значения параметров Дашборда\nОпределение значений для параметров дашборда при расшифровке. Возможность установки значений параметра доступна при активном положении переключателя.\nПо нажатию на кнопку отображаются поля для добавления значений параметров дашборда.\nКнопка отображается при активном положении переключателя параметра \"При расшифровке установить значения параметров Дашборда\".\nПараметры дашборда\nВыбор параметра дашборда для установки значения.\nПоле отображается после нажатия на кнопку добавления параметра.\nЗначения параметров дашбордов\nВыбор значения параметра дашборда. Возможные значения:\nИдентификатор сектора диаграммы;\nКонстанта.\nПо умолчанию используется значение \"Идентификатор сектора диаграммы\".\nПоле отображается после нажатия на кнопку добавления параметра.\nНастройка стиля оформления\nНа вкладке \"Стиль оформления\" определяется размер занимаемой области диаграммы и настраиваются параметры отображения данных диаграммы.\nНа данной вкладке определяются следующие параметры оформления диаграммы:\nПараметр\nНазначение\nВысота диаграммы, %\nУстановка значений высоты и ширины области аналитической панели в процентах относительно высоты экрана.\nДля сохранения пропорций следует нажать на кнопку\n.\nПо умолчанию установлены следующие параметры: высота диаграммы – 100%, ширина – 40%.\nШирина диаграммы, %\nПалитра\nВыбор\nпалитры\nдля цветового оформления диаграммы.\nВыбор осуществляется посредством выпадающего списка из стандартного набора или созданных ранее, создание новой или редактирование выбранной палитры возможно через меню действий параметра.\nПо умолчанию установлена фирменная палитра цветов GreenData.\nЦикличность цветов палитры\nВозможность цикличного повторения цветов выбранной палитры при оформлении диаграммы.\nЕсли цвета в объявленной палитре закончатся, то при отключенной цикличности будут использоваться цвета из системной палитры.\nПо умолчанию цикличность цветов палитры включена.\nДиаграмма с накоплением\nСпособ представления рядов диаграммы для визуального сравнения данных.\nПараметры отображаются при настройке диаграммы вида \"Столбчатый\" или \"Столбчатый горизонтальный\".\nДиаграмма с группировкой\nИнтервал между группами\nУстановка интервала между группами рядов.\nНастройка производится с помощью передвижения ползунков или ввода числового значения от 0 до 100.\nПараметр отображается при настройке диаграммы вида \"Столбчатый\" или \"Столбчатый горизонтальный\".\nИнтервал между столбцами\nУстановка интервала между столбцами группы рядов.\nНастройка производится с помощью передвижения ползунков или ввода числового значения от 0 до 100.\nПараметр отображается при настройке диаграммы вида \"Столбчатый\" или \"Столбчатый горизонтальный\", когда выбран способ представления \"Диаграмма с группировкой\".\nДополнительные настройки\nНастройка на вкладке \"Дополнительно\" позволяет добавить код JSON, содержащий дополнительные опции, которые после сохранения будут отображены на диаграмме.\nНа данный момент JSON-выражения не используются для настройки элементов дашборда.\nНастройка фильтрации\nНа вкладке \"Фильтр\" можно задать дополнительную фильтрацию данных.\nПосле нажатия на кнопку добавления фильтра отобразится поле для выбора столбца, данные которого будут отфильтрованы.\nПо кнопке добавления условия фильтрации настраиваются пары параметров, в которых необходимо задать условие равенства (\"Равно\", \"Не равно\", \"Меньше\", \"Больше\", \"Меньше или равно\", \"Больше или равно\") и значение.\nПри наличии нескольких условий фильтрации переключатель И/ИЛИ регулирует взаимосвязь заданных условий.\nСортировка\nНа данной вкладке настраивается сортировка данных на диаграмме.\nВкладка недоступна при настройке структурной диаграммы вида \"Пузырьковая\".\nПараметр\nНазначение\nСтолбец для сортировки\nВыбор столбца, по которому будет осуществляться сортировка данных.\nВыбор осуществляется из выпадающего списка, где доступны столбцы, ранее выбранные на вкладке\n\"Основное\"\nв параметрах \"Столбец для агрегации значения\" и \"Столбец для группировки\".\nВ качестве сортировки по умолчанию используется столбец, выбранный в параметре \"Столбец для группировки\".\nТип сортировки\nВыбор направления сортировки (по возрастанию или по убыванию).\nПо умолчанию сортировка осуществляется  по возрастанию.\nПри наличии двух условий порядок сортировки может быть изменен методом Drag&Drop при помощи иконки\n.\nРасшифровки\nНа данной вкладке настраивается связь между двумя и более аналитическими панелями, иными словами данная настройка позволяет в режиме реального времени изменять отображение данных одной аналитической панели в зависимости от выбранного значения другой аналитической панели.\nПодробнее с настройкой расшифровок можно ознакомиться в статье \"\nДетализация данных (Drill Down Расшифровка)\n\".\nРезультат\nПосле настройки аналитической панели дашборда пользователь может сохранить диаграмму в необходимом формате и распечатать.",
  "source": "https://docs.greendata.ru/platform/ru/the-structural-diagram-dashboard.html"
}