{
  "title": "getObjects",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ngetObjects\nThe function allows accessing the attributes of objects removed to the\nRecycle bin\n.\nSyntax\ndef rb := recycleBin(typeObj,[attr]).getObjects()\nSetting\nPurpose\ntypeObj\nObject type, the instances of which were added to the Recycle bin.\nWhen working with a\nprimitive object with a surrogate key\n, the type of the object to be retrieved must be specified, not the parent type.\nattr\nType attribute(s) whose data need to be used in the current algorithm when retrieving the object.\nThis parameter is optional.\nIf the parameter is not specified, the object is formed only with the \"Name\" attribute.\nNote\nThe function is called from the\nRecycle bin\ntab on the algorithm editor toolbar.\nWhen the function is called, a modal window will open for selecting an object type, the instances of which were added to the\nRecycle bin\n.\nThe ability to view objects deleted by other users is available when the \"Run\" permission is granted for\n\"Viewing and restoring others' data from the Recycle bin\"\n.\nAfter selecting an object type, the user can optionally specify its attribute(s) to be accessed within the algorithm, then click the \"Done\" button. This will insert the following code into the algorithm:\ndef rb := recycleBin(typeObj,[attr])\ndef rb_obj := rb.getObjects()\nfor (def object : rb_obj) {\nif (object.attr == \"Attribute Value\") {\ndef id := object.ID\ndelete(id, true)  // delete object from the Recycle Bin\n}\n}\nExample\nFor example, the \"Request\" object type stores information about customer requests. If a request is processed, it is marked with the \"Closed\" status.\nOutdated requests that were placed in the Recycle bin and have the \"Closed\" status should be permanently deleted from the system, with no possibility of recovery.\nTo solve this task, the following algorithm can be used:\nWhen calling the\ngetObjects\nfunction, the \"Request object type\" is selected with the \"Status\" type attribute . As a result, the algorithm code will include a condition where the \"Closed\" status must be specified.\nMore about the functions used in the algorithm.\nWithin the algorithm, the\nrecycleBin\nfunction is used to access the Recycle bin, and the\ngetObjects\nfunction retrieves the deleted \"Request\" object.\nNext, a loop is organized over the retrieved objects using the\nfor\noperator, where the\nif\noperator checks the request status.\nThe \"Closed\" request status is added using the\ndict\nfunction.\nObjects that meet the condition are added to the id\nvariable\n, and then deleted from the Recycle bin using the\ndelete\nfunction.",
  "source": "https://docs.greendata.ru/platform/en/getobjects.html"
}