{
  "title": "Настройка гиперссылок при работе с таблицами",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка гиперссылок при работе с таблицами\nАналитическая панель дашборда \"Таблица\"\nобладает рядом свойств, которые позволяют изменять отображение данных дашборда посредством нажатия на ячейку таблицы. Представление данных может обеспечиваться одним источником или двумя, если расшифровка выбранного значения должна отображаться в ином относительно основной таблицы виде.\nНастройка гиперссылки в таблице дашборда в рамках одного источника\nПри использовании аналитической панели \"Таблица\" имеется возможность перехода\nк карточке объекта\nпосредством нажатия на ячейку таблицы. Для реализации данной настройки требуется:\n1. Настройка источника данных. Источник данных должен передавать\nКод\nвозвращаемого типа объекта.\n2. Настройка гиперссылки в представлении таблицы ( подробнее с представлением можно ознакомиться в статье\nАналитическая панель дашборда \"Таблица\"\n).\nДопустим, имеется настроенная таблица, представление которой отображает часть данных анкет клиентов, планирующих приобретение автомобиля.\nС настройками дашборда можно ознакомиться в примерах статьи\nНастройка источника данных для дашборда\n.\nТребуется произвести настройку, в результате которой при нажатии на ячейку колонки откроется карточка анкеты клиента.\n1. Настройка источника данных.\nВ таблицу \"Поля, добавленные в источник\" добавляется атрибут \"Код\" возвращаемого типа объекта, в рассматриваемом примере - это \"Анкета клиента\". Данное действие в настройках объектного источника данных осуществляется на вкладке \"Поля\".\nДля изменения наименования атрибута в источнике данных необходимо перейти в режим редактирования, откроется модальное окно, в нижней части которого на панели \"Служебное\" также имеется возможность изменения имени поля в источнике:\n2. Настройка гиперссылки в представлении таблицы\n.\nДля корректировки ранее сохраненного фильтра таблицы в режиме редактирования визуального представления дашборда необходимо открыть список представлений в панели управления настраиваемой таблицы и рядом с нужным представлением нажать на иконку редактирования\n.\nВ настройках представления на вкладке \"Настройки отображения\" добавленный в источник\nКод объекта требуется перенести в таблицу \"Колонки\"\n. Отображение данного столбца в таблице можно скрыть по соответствующей кнопке\n.\nДалее необходимо перейти в режим редактирования той колонки, по клике на ячейку которой будет открываться карточка объекта. Допустим, переход в карточку объекта \"Анкета клиента\" будет осуществляться при нажатии на ячейку колонки \"Тип деятельности\":\nВ открывшемся модальном окне редактирования колонки на панели \"Гиперссылка\" необходимо перевести переключать \"Колонка является ссылкой\" в активное положение, после чего на данной панели отобразятся два поля:\n\"при клике открывать карточку объекта с кодом в колонке\" - в данном поле указывается к какой карточке объекта необходимо выполнить переход, выбор осуществляется по имени поля источника данных и\nтолько из ранее добавленных в таблицу \"Колонки\"\n;\n\"открывать в\" - выбор метода открытия карточки объекта, доступны варианты:\nв модальном окне;\nв новой вкладке;\nв этом окне.\nВ рамках рассматриваемого примера указывается имя поля источника \"ga14\", что соответствует атрибуту \"Код\" типа объекта \"Анкета клиента\", а метод открытия карточки объекта - в модальном окне.\nДля сохранения настройки следует нажать на кнопку\nв окне редактирования колонки, а затем на кнопку\nв окне настройки представления.\nВ результате произведенных действий при нажатии на ячейку таблицы в колонке \"Тип деятельности\" открывается Анкета клиента текущей строки таблицы:\nНастройка гиперссылки в дашборде с подменой таблицы представления\nДля настройки потребуется минимум два источника данных:\nосновной источник для первой таблицы\nдополнительный источник данных для второй таблицы или диаграммы, необходимый для расшифровки значений первой таблицы.\nЦепочка связи может быть больше, соответственно для настройки можно использовать неограниченное количество компонентов.\nИсточник для построения дочернего компонента обязательно должен содержать как минимум 1 целочисленный параметр, доступный только для источников на основе SQL-запроса и алгоритма. При этом источник данных родительского компонента может не иметь параметра.\nДанный метод реализуется при помощи вкладки \"Расшифровки\" в настройках таблицы. Подробно с его настройкой можно ознакомиться в разделе \"Настройка детализации для таблиц\" статьи \"\nДетализация данных (Drill Down Расшифровка)\n\".",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-hyperlinks-when-working-with-tables.html"
}