{
  "title": "Создание связи между бизнес-процессом и типом объекта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСоздание связи между бизнес-процессом и типом объекта\nСоздание связи между бизнес-процессом и типом объекта предназначено\nдля выбора объектов, в разрезе которых будет выполняться запуск настраиваемого бизнес-процесса\n.\nНастройка связей осуществляется в таблице \"Связанные типы объектов\" карточки бизнес-процесса (подробнее,\nСоздание карточки бизнес-процесса\n):\nЧтобы настроить связь процесса и объектов Системы, необходимо\n:\n1.\nНажать на кнопку\nв таблице \"Связанные типы объектов\". Система отобразит карточку объекта:\n2.\nВнести данные\nв карточку объекта, где:\nНаименование поля\nЗначение\nТип объектов\nВыбор типа объекта из выпадающего списка, бизнес-процесс для которого настраивается.\nАвтозапуск при создании объектов\nЛогический атрибут, определяющий автоматический запуск бизнес-процесса при создании экземпляра типа объекта.\nУсловия запуска\nВыбор условия запуска (алгоритма) из выпадающего списка, заданного ранее (подробнее,\nСоздание и настройка алгоритмов\n).\nНеобязательный параметр\n. Настройка условий рассмотрена далее.\nУсловие запуска бизнес-процесса задается алгоритмом. Чтобы указать условие запуска, необходимо:\n2.1. Нажать кнопку\nв таблице \"Условие запуска\". Система отобразит форму для ввода параметров запуска.\n2.2. Указать параметры запуска, где:\nНаименование\nОтображение/ ввод наименования настройки.\nТекст сообщения\nВвод текстового сообщения для его отображения пользователю.\nАлгоритм (условие)\nВвод/ выбор из выпадающего списка алгоритма, заданного ранее (подробнее,\nСоздание и настройка алгоритмов\n). Алгоритм возвращает значения: true или false.\nПроверять в момент запуска бизнес-процесса\nЛогический атрибут, определяющий проверку настройки. Возможные значения:\nда – выполняется проверка запуска бизнес-процесса по алгоритму:\ntrue – бизнес-процесс запускается;\nfalse – бизнес-процесс не запускается, пользователю отображается соответствующее (указанное в следующем поле) сообщение.\nнет – выполняется проверка для отображения бизнес-процесса в списке доступных для запуска процессов (подробнее о\nзапуске\n):\ntrue – бизнес-процесс отображается в списке доступных к запуску процессов;\nfalse – бизнес-процесс не отображается в списке доступных к запуску процессов.\n2.3. Сохранить введенные настройки по кнопке\n, нажать\n, чтобы закрыть карточку ввода условия запуска.\n3.\nДля сохранения введенной информации о связанном объекте\nнеобходимо нажать\nи\nв карточке настройки связи.\nСписок всех настроенных связей отображается в реестре типов \"\nДО. Маршрутный объект для процесса\n\". Подробнее о работе с реестрами –\nРабота с реестром объектов\n.\nПосле создания связи в карточке объекта автоматически отобразятся кнопки \"\nЗапустить бизнес-процесс\n\", в меню \"Действие\" отобразится возможность\n\"Очистить все маршруты\n\".\nОтображение кнопки запуска бизнес-процесса не регулируется аналитиком. Отображение кнопки\nзавершения бизнес-процесса\nкорректируется аналитиком.",
  "source": "https://docs.greendata.ru/platform/ru/creating-a-relation-between-a-business-process-and-an-object-type.html"
}