{
  "title": "\"File List\" Widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"File List\" Widget\nThe \"Files List\" Widget is used for displaying files (documents) attached to the System object.\nExample of a customized widget:\nBefore you start customizing the widget, create a new\nentity\nand proceed with creating instances for this object type\nThe “File List” widget can be configured in the\nvisual edit mode\n. To do this, find the widget in the corresponding list in the \"Elements\" window and place it on the workspace.\nWidget settings\nWidget setup involves filling in the following parameters:\nSetting\nPurpose\nAttribute with files\nSelecting an object attribute of the System object that stores the attached files.\nShow classifications\nSelecting a file classification to display.\nTitle text\nEntering a title text of the file display area (optional). By default, it takes over the name of the attribute with files.\nText of the button \"Show all\"\nEntering the button name text (optional). By default, the \"Show All\" text is displayed.\nSetting example\nIn this example, the\n\"Attach files\"\nvisual attribute is used as an\nattribute with files\n. The settings also indicate that the widget will display files related to classifications: All files; Other; System files.\nAll files;\nOther;\nSystem files.\nThe widget title text is \"Files\", it is entered manually. Similarly with the \"Show all\" button text.\nOnce the setting up completed, the user will preview the widget.\nNow save the visual settings. After adding new documents to the object attribute for storing files, they will automatically be displayed in the “File List” widget.\nAttached documents can be downloaded using the\nbutton located opposite the file.\nThe \"Show All\" button, whose text can be overridden in the widget settings, is displayed only if the object attribute visual has a visual to work with files, displaying a certain number of files per page (for example, the \"Files attached for signing\" attribute visual).",
  "source": "https://docs.greendata.ru/platform/en/widget-file-list.html"
}