{
  "title": "Настройка ETL-процесса без использования источника данных",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка ETL-процесса без использования источника данных\nБазовая модель\nETL-процесса\nпредполагает извлечение данных из одного или нескольких источников, их преобразование и последующую загрузку в целевую систему. Однако в некоторых случаях необходимость в источнике данных может отсутствовать.\nДопустим, необходимо настроить ETL-процесс для получения данных из карточек пользователей системы, например, логина и id.\nВ текущей статье будет рассмотрена организация ETL-процесса без использования источника данных, которая предполагает настройку\nпреобразователя данных\nс использованием\nтрансформатора по алгоритму\n.\nШаг 1. Создание\nобъекта ETL-процесса\nДля\nсоздания объекта ETL\nнеобходимо открыть реестр объектов ETL, последовательно выбрав пункты главного меню: Интеграция → ETL.\nПосле чего по кнопке\nв панели управления создать новый экземпляр, в котором указать наименование и идентификатор объекта.\nПосле сохранения объекта ETL можно перейти к настройке схемы ETL-процесса.\nШаг 2. Настройка\nсхемы ETL-процесса\nПереход к созданию схемы ETL осуществляется по кнопке\nв панели управления.\nНа открывшейся странице необходимо:\nС панели действий и компонентов перетащить (Drag&Drop) в рабочую область элементы:\nзадача ETL, в настройках которой определить этап как \"Преобразователь\";\nконечное событие.\nДля добавления наименования преобразователю данных необходимо дважды нажать на этап, после чего ввести название.\nСоединить этапы.\nСохранить схему процесса при помощи кнопки в панели управления.\nПо кнопке\nперейти к настройке преобразователя данных.\nНастройка\nпреобразователя данных\nНа вкладке \"Основное\" необходимо настроить выходные данные преобразователя, для этого в правой части настройки \"Структура выходов элемента схемы\" следует сформировать динамическую структуру.\nВ первую очередь для будущего добавления данных пользователей системы следует создать массив – поле \"users\" типа \"ARRAY\".\nВнутри массива всегда должен быть размещен объект – поле с типом \"OBJECT\".\nДалее создается поле типа \"OBJECT\". В данном объекте добавляются поля, в которые будут передаваться данные пользователя:\n\"id\" с типом \"NUMBER\" для получения кода пользователя;\n\"login\" с типом \"STRING\" для получения идентификатора пользователя.\nВ результате чего динамическая структура примет вид:\nКогда динамическая структура сформирована, следует перейти на вкладку \"Дополнительно\" и по кнопке\nв панели управления реестра \"Трансформаторы данных\" создать новый экземпляр.\nВ открывшемся модальном выбирается тип \"ETL. Трансформатор данных. По алгоритму\", после чего параметры трансформатора настраиваются следующим образом:\nТак как в рамках текущей задачи входные данные отсутствуют, поле \"Коллекция входных данных\" не заполняется.\nв поле \"Коллекция выходных данных\" указывается поле созданной динамической структуры, в которую будут помещаться данные – users;\nв поле \"Алгоритм\" добавляется алгоритм типа \"Алгоритм. Карточки объектов\".\nСмотреть подробнее описание алгоритма.\nТак как в качестве выходных данных используется поле типа ARRAY (массив \"users\"), алгоритм должен сформировать и вернуть массив.\nДля этого при помощи функции\nvar\nсоздается новая переменная \"result\", которая посредством ArrayList определяется как\nдинамический массив\n.\nДалее при помощи функций\nfor\nи\nobjects\nорганизуется цикл по коллекции объектов \"Пользователь\".\nВ данном цикле необходимо объявить\nновую переменную\n\"resultUser\" для записи набора данных, полученных из объекта коллекции. Данная переменная представляет собой\nассоциативный массив (HashMap)\n, в которую в соответствии с полями ранее сформированной динамической структуры необходимо при помощи метода put добавить связку \"ключ-значение\":\nпо ключу id значение кода пользователя;\nпо ключу login значение идентификатора пользователя.\nПри этом ключи записываются как\nтекст\n, а значения добавляются при помощи функции\nattrByVar\n.\nДобавление набора полученных данных пользователя в результирующий массив осуществляется при помощи метода add.\nДля возвращения результирующего массива используется функция\nreturn\n.\nПосле сохранения настроек можно запустить ETL-процесс.\nЗапуск ETL\nДля\nзапуска ETL-процесса\nв\nранее созданном объекте ETL\nнажать на кнопку\nв панели управления.\nДля выведения модального окна запуска процесса в параметре \"Тип стартового объекта\" следует указать тип объекта \"ETL. Экземпляр объекта ETL\".\nПри необходимости можно настроить логирование, например, активировать признак \"Записывать в протокол результирующие структуры данных этапов\".\nВ результате выполнения данного ETL-процесса в логе будут представлены данные логина и id всех пользователей системы.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-etl-process-without-data-source.html"
}