{
  "title": "Подготовка шаблона",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПодготовка шаблона\nШаблон\n–\nпроект документа, содержащий неизменяемую часть и определение динамических полей.\nШаблон определяет основную структуру документа и содержит необходимые настройки, такие как шрифты, параметры страницы, форматирование и стили.\nРекомендуемые форматы для подготовки шаблона документов: *.XLSX и *.DOCX (MS Office 2010 и выше).\nРазметка документов\n(определение динамических полей, заполняемых данными из Системы)\nвыполняется посредством установки\n:\nзакладок\n– для текстовых редакторов;\nименованных диапазонов\n– для табличных.\nНаименования закладок\nв документе\nдолжны присваиваться осмысленно\n, данная информация будет отображаться в Системе при настройке печатных форм. Вставка закладки осуществляется каждый раз, даже если поле встречается многократно (например, поле \"Наименование Клиента\"). В последующем, источник для отображения значения в динамическом поле может быть один. Подробнее –\nСоздание карточки шаблона печатной формы\n.\nПри наличии нумерованных списков, необходимо использовать автонумерацию\n. Это позволит сохранить корректное перечисление данных в случае необходимости скрыть какой либо блок информации.\nЕсли шаблон (*.docx, *.odt) содержит изображение, оно будет отображено в формируемом документе. Предполагается использование форматированного изображения, которое будет отображаться без дополнительных настроек.\nПосле загрузки шаблона (подробнее –\nСоздание карточки шаблона печатной формы\n), Система выполнит автоматическую разметку документа, при этом каждому абзацу будет присвоен номер.\nЧтобы просмотреть автоматическую разметку, необходимо выгрузить шаблон из Системы (подробнее –\nСоздание карточки шаблона печатной формы\n).\nПосле повторной загрузки шаблона (подробнее –\nСоздание карточки шаблона печатной формы\n), автоматическая разметка выполняется заново. То есть Система выполнит повторную нумерацию абзацев.\nУказанные данные (цифры) используются для определения блоков информации. Это может использоваться для последующего скрытия данных или ограничения возможности редактирования для указанных групп пользователей. В случае повторной загрузки шаблона необходимо проверить корректность определения блоков информации.\nЕсли документ содержит повторяющиеся элементы (в том числе вложенные документы), данный блок необходимо оформить как другой шаблон документа. При этом в основном документе формируется закладка на вложенный шаблон (повторяющийся элемент). Формирование необходимого источника документа описано на странице\nСоздание карточки шаблона печатной формы\n. Пример оформления представлен –\nПримеры настройки источников данных для полей печатных форм\n.\nПри необходимости ''пронумеровать строки вложенной печатной формы *.XLSX рекомендуем'' в ячейке автонумерации указать \"=СТРОКА()-Число\" (без кавычек), где \"Число\" – размер шапки в основном шаблоне.",
  "source": "https://docs.greendata.ru/platform/ru/preparing-template.html"
}