{
  "title": "\"Filters\" tab",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Filters\" tab\nThe “Filters” tab is used to configure filters and sort type instances. Only sorted and filtered values will be displayed in the registry.\nLearn more about advanced custom filtering in the article\n“Setting up filtering panel in the registry”\n.\nSetting\nPurpose\nRegistry filter type\nSpecifies the type of registry column filter. Possible values:\nexcel;\nIn case of working with\ntype of column filter “Excel ”\nin the registry it is possible to add a filter fragment. That is, the end user can multiselect values. The action is performed similarly to working with filter in XLSX document.\nThere is also data filtering available to the user in working with attributes using string filters, for more information see the article\n“Working with the object registry”\n.\nby row;\nThe “By row” filter displays data based on the value specified in the filter row:\nunfiltered.\nWith this setting, there is no filtering tool\n.\nAdditional custom filters\nSpecifying the filters that will be available to the user in the registry control panel.\nPreviously created filters are selected using the drop-down list, creation of new filters is available through the parameter action menu.\nAdding custom filters will open a modal window to create filtering based on\ncondition-tree\n.\nCreating additional filters will be available to the user directly in the type instance registry, for more information see the\n“Working with the Object Registry”\narticle.\nDisplay the advanced search when opening the registry\nBoolean attribute that determines whether an advanced search or filter panel is displayed.\nThe default value is “No”, with the search bar collapsed\nFiltering visuals\nDefining a visual for\nconfiguring the filtering panel\nof the registry.\nThe option is available when the “Display the advanced search when opening the registry” option is active.\nPreset filters\nFilter type\nDefining the filtering method. The radiobutton type switch selects one of the three types, as a result the corresponding field for filter selection is displayed in the settings:\nFiltering algorithm;\nSQL condition;\nCondition tree.\nAlgorithm for data filtering\nEntering (selecting) an algorithm for data filtering. For more details,\n“Configuring the filtering conditions”\n.\nFor example, in the register of the “Office supplies in request” type it is required to filter the objects in which the number of goods is greater than 10. The algorithm will look as follows:\nAs a result of filtering, only objects that satisfy the specified condition will be displayed in the registry:\nThe parameter is displayed when “Filtering algorithm” filtering type is selected.\nCondition tree\nConfiguring filtering using the boolean condition constructor, for more information, see the\n“Condition tree”\narticle.\nThe parameter is displayed when “Condition tree” filtering type is selected.\nSQL based filter\nSelecting SQL-based filter.\nThe parameter is displayed when “SQL condition” filtering type is selected.\nAfter saving changes by clicking the\nbutton, the registry will be updated according to the applied settings.",
  "source": "https://docs.greendata.ru/platform/en/tab_filters.html"
}