{
  "title": "newInstance",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nnewInstance\nФункция создает новый экземпляр заданного типа объекта.\nСинтаксис\nnewInstance\n(typeObj)\nПараметр\nНазначение\ntypeObj\nТип объекта создаваемого экземпляра.\nПримечание\nВызов функции необходимо осуществлять в переменную, которую необходимо объявить при помощи функции\nvar\n.\nДобавление функции в код алгоритма осуществляется из раздела \"Объекты\" панели инструментов редактора алгоритмов.\nВ результате вызова функции откроется модальное окно \"Создание экземпляра типа\" для выбора типа объектов, экземпляр которого необходимо создать.\nДалее следует заполнить атрибуты для созданного экземпляра типа объекта посредством функции\nattrByVar\n.\nВсе обязательные атрибуты типа должны быть заполнены.\nПеременная должна быть сохранена при помощи функции\nsave\n.\nИсключением является случай, когда в\nвыражении\nили\nсобытии до сохранения\nсоздание объекта осуществляется на основе объекта, несохраненного в базе данных, между атрибутами которых установлена\nдвусторонняя связь\n.\nПример использования функции для данного случая представлен в\nстатье\n.\nПример\nАлгоритм по созданию экземпляра\nбизнес-процесса\nможет быть представлен в следующем виде:\nДля написания данного алгоритма необходимо:\nобъявить новые переменные посредством функции\nvar\n;\nв качестве значений,\nприсваиваемых\nпеременным, вызвать функцию\nnewInstance\nдля создания новых экземпляров. И в рамках данной задачи в открывшейся таблице выбрать \"Экспертиза ЮД\" для переменной\nexpUD\nи \"ДО. Экземпляр запущенного процесса\" для переменной\nprossUD\n.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nПараметры процесса (атрибуты) указать при помощи вызова функции\nattrByVar\n;\nЗначение\nатрибута \"Заявка на принятие решений\" устанавливается как текущий объект посредством\ncurrentObject\n.\nЗначению\nатрибута \"Объект\" присваивается значение переменной.\nЗначение\nатрибута \"Процесс\" указывается при помощи функции\ndict\n.\nЗначение\nатрибута \"Признак активности\" устанавливается функцией\ntrue\n.\nДля сохранения экземпляров каждого типа объекта используется функция\nsave\n.",
  "source": "https://docs.greendata.ru/platform/ru/newinstance.html"
}