{
  "title": "Events",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nEvents\nActions on the current or related objects of the System can be triggered automatically based on the specified algorithms.\nThe algorithms can be triggered depending on the events of the screen form (opening/closing) and the stage of the object’s lifecycle (saving/deleting).\nFor example, when saving a decision request, the contract number should be filled in automatically.\nIf an event is executed under a user who does not have permission to read or edit a specific attribute, or lacks edit permissions for the object itself, the\ncalculation will still be performed\n.\nThis is because by default (when\nexecAs\nis not used), event algorithms are executed under a user with the \"Administrator\" role.\nTo create events, go to the \"Events\" tab in the object type’s profile and set the necessary algorithms.\nScreen form events\nDepending on the state of the screen form, the execution of algorithms can be set:\nPre-opening form event\nof the object instance;\nPost-opening form event\nof the object instance;\nPost-closing form event\nof the object instance.\n\"Post-closing form event\" is usually used to modify related System objects based on the data of the current object.\nThe order of operations performed when opening an instance (each subsequent step overwrites the values of the previous one):\nCalculating\nexpressions/autocalculations\n.\nRunning the event algorithm before opening.\nInserting\npre-filled data\n(if any).\nRecalculating expressions/autocalculations considering the data restored in step 3.\nRunning the event algorithm after opening.\nIf attribute values are set in the\nevents before opening\nalgorithm (using the\nattr\nand/or\nattrByVar\nfunctions with the active \"Set value\" attribute), then for attributes that already have preset values, the data from the draft will be set.\nIf the attribute has a preset value and\nevent after opening\nis configured, the algorithm of which sets the value for this attribute (using\nattr\nand/or\nattrByVar\nfunctions with the active \"Set value\" attribute), then in the field will be filled with the value from the event.\nBy using the\ngetCardOpeningArg\nfunction,\nScreen form events\ncan be configured depending on the way the object is opened (in a new/current tab or in a modal window) and the selected\ninstance visual\n.\nObject type lifecycle events\nThe execution of the event algorithm can be set at the following stages of the object’s lifecycle:\nEvent before saving\nthe object instance;\nGenerated \"Events before saving\" (the result of calculating the algorithm) are immediately recorded in the profile.\nEvent after saving\nthe object instance;\n\"Events after saving\" are usually not recorded in the current object and are used in related objects of the System (based on the data of the current card).\nWhen configuring\nEvents after saving\nusing the\nattrOldValue\nalgorithm function for the changed value, it is possible to retrieve the previous saved value in the database.\nEvent before deletion\nthe object instance.\nIn lifecycle event algorithms,\ncurrent object\nwill not be saved.\nUse examples\nUse example 1\nAssume the user is required to configure the System depending on the way the client’s application is opened:\nwhen opening in a new/current tab, consider that the application has been accepted for work – change the status of the application to \"Doing\", appoint the current employee as the responsible;\nif the application is open in a modal window, the status and responsible employee of the application should not change.\nTo do this, set up the\nEvent before opening\n:\nLearn more about the algorithm\nThe variables are defined using the\nvar\nfunction;\nThe\nif\noperator is used to set conditions.\nThe\ngetCardOpeningArg\nusing the\nisTab\nmethod, the condition for opening an object in a new/current tab is checked;\nThe \"Request status\" attribute is selected using the\nattr\nfunction with the \"Set value\" attribute, where the dummy\nnull\nvalue should be replaced with the \"In progress\" value;\nUsing the\nattr\nfunction with the \"Set value\" attribute in the \"Responsible Employee\" attribute the current employee is recorded, obtained using the\nCurrentUser\nfunction;\nThe\ncurrent object\nis saved by the\nsave\nfunction.\nAs a result, the client’s request will be automatically taken into operation when opened in a new/current tab, and when opened in a modal window, the application can be previewed – the request status and the responsible employee will remain unchanged:\nUse example 2\nFor example, after saving the counterparty’s profile, it is required to send data to the message queue using ETL for integration with another system.\nTo do this, add the\nevent after saving\nalgorithm, which will be used to launch ETL:\nLearn more about the algorithm\nThe \"etlInstance\" variable is defined using the\nvar\nfunction.\nUsing the\nnewInstance\nfunction creates a new instance of the \"ETL. ETL object instance\".\nUsing the\nattrByVar\nfunction with the \"Set value\" attribute, attribute values are set:\nETL to be performed is \"Sending counterparty data to the message queue\" (an instance of the \"ETL Object\" type selected using the\ndict\nfunction);\nthe object that the ETL is running on is the current object specified using the\ncurrentObject\nfunction.\nThe ETL process is launched using the startEtl function.",
  "source": "https://docs.greendata.ru/platform/en/events.html"
}