{
  "title": "File attribute",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nFile attribute\nThe \"File\" type attribute allows users to upload, store, view, sign, and delete files in the context of the System object. This attribute is typically named \"Attachment\" and provides a relation between objects and files uploaded into the System.\nThe configuration of the file attribute can be done in one of three ways:\nAdding an\n\"existing attribute\"\n\"Attachment\":\nCreating an\nobject attribute\nwith a relation to\n\"File\"\nobject type or an inherited type:\nDirectly creating a\ntype\n\"File\" attribute.\nAfterward, depending on the business task, it is necessary to select an\nattribute visual\n, which configures the display and available actions.\nExamples of available visuals\n\"Files widget\" visual\n:\nThis visual is used by default when creating an object\nattribute\nof the\n\"File\"\ntype.\n\"Multiple files as a table\" visual\n:\n\"Single file\" visual\n:\n\"File attachment visual for signing\"\n:\n\"File attachment visual for signing (with grouping)\"\n:\nFile attachment\nThe ability to work with files is regulated by the appropriate\naccess permissions\n.\nDepending on the selected visual, file upload to the System can be performed in two ways:\nFrom disk\n— a dialog window will open to select a file:\nFrom System\n— a modal window will open to select files previously uploaded to the System:\nIn the open window, the object type must be selected in the corresponding field.\nBy default, the \"Object type\" field is set to the current type.\nTo access the list of available types, click the\nbutton, which will open a modal window where the following types are available for selection:\nObject types that the user has read access to;\nObject types that contain file attributes.\nAfter this, the file can be selected in two ways depending on the \"Select object\" switch:\nIf the switch is active, select an object of the specified type from the left table, and the files associated with the selected object will appear in the right table;\nIf the switch is inactive, no object is selected, and the list of files associated with all objects of the specified type will be displayed.\nWhen attaching a file, its classification must be determined. By default, the system will display a list of all classifications.\nThe \"Attachment\" attribute supports file versioning. Thus, when a file is modified, its previous version will still be available for viewing.\nFiles can also be attached through\nwidgets\nin the \"Files\" section.",
  "source": "https://docs.greendata.ru/platform/en/attachment-attribute.html"
}