{
  "title": "Примеры настройки источников данных для полей печатных форм",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПримеры настройки источников данных для полей печатных форм\nИсточник данных для поля печатной формы позволяет определить как будет формироваться настраиваемое значение. Данные могут формироваться посредством:\nпередачи значения атрибута без изменений из типа объекта;\nпреобразования имеющегося значения в типе объекта;\nформироваться посредством алгоритма.\nОпределение способа формирования источника данных выполняется по кнопке\n. После чего Система отобразит возможные расширения. В зависимости от выбранного шаблона расширения, форма ввода параметров будет дополнена необходимыми атрибутами для заполнения.\nДалее рассмотрены настройки самых популярных в использовании и новых (реализованных в Системе) источников.\nИсточник данных на основе атрибута\nИсточник данных на основе атрибута используется для отображения неизменяемых данных. Например, номер документа или дата.\nДля настройки данного источника необходимо выбрать расширение \"Шаблон печатной формы. Источник данных на основе атрибута\".\nПри этом,\nзначение поля \"Тип данных источника\", должен совпадать с типом данных указанного \"Атрибута типа\".\nТаким образом в шаблоне отчетной формы будет выведено значение атрибута без изменений. В рассматриваемом случае это \"Дата выдачи\", которое фактически отображает дату создания документа.\nИсточник данных на основе алгоритма\nВ случае необходимости преобразования значения при его выводе на печатную форму используется расширение \"Шаблон печатной формы. Источник данных на основе алгоритма\".\nПри этом алгоритм добавляет слово \"компания\" при отображении наименования контрагента.\nВ процессе настройки источника данных на основе алгоритма необходимо учесть, что \"Тип данных источника\" должен совпадать с типом данных значения, которое возвращает алгоритм.\nШаблон печатной формы отобразит измененное значение атрибута \"Контрагент. Наименование\".\nДля сохранения измененного вручную значения\nиспользуется \"Атрибут, в который будет сохранено измененное значение\"\n. Если этого атрибута на карточке нет, его необходимо добавить. Подробнее, о\nнастройке визуала\n.\nИсточник данных на основе шаблона\nДля использования готовых документов в формируемых шаблонах (например, для замещения повторяющихся элементов текста) применяется \"Шаблон печатной формы. Источник данных на основе шаблона\". При этом используемый документ (или встроенный шаблон) настраивается отдельно. Примером такого шаблона может быть договор залогового обеспечения при формировании пакета кредитно-обеспечительной документации.\nТакже можно настроить формирование титульного листа при создании заключения.\nПри этом и встроенный и формируемый шаблоны настраиваются как отдельные объекты типа \"Шаблон печатной формы\".\nДля быстрого ориентирования среди настраиваемых шаблонных форм рекомендуется называть вложенные документы особым образом. Например, с префиксом \"ВШ\" (Вложенный Шаблон).\nВ случае, если\nориентация документа вложенного документа отличается от основного\n, настройка последнего (основного шаблона) состоит из следующих шагов:\n1. Включить разрыв страницы в основной шаблон.\n2. Зафиксировать (создать) лист с нужной (измененной) ориентацией после разрыва страницы.\n3. Установить закладки с вложенным шаблоном на зафиксированном листе. При этом ориентация настраиваемой страницы должна совпадать с ориентацией вложенного шаблона.\n4. Если ориентация вложенного шаблона заранее неизвестна и определяется условием, то необходимо зафиксировать две закладки на листах с разной ориентацией. После чего необходимо указать алгоритм видимости этих закладок.\nВыгрузка графических объектов в печатную форму\nВ печатных формах можно отобразить формируемый график и/ или схему.\nИсточник данных на основе графика показателей\nДля отображения графика выбранного типа используется \"Шаблон печатной формы. Источник данных на основе графика показателей\".\nНастройка источника содержит следующие параметры:\nПоле\nНазначение\nНаименование\nВвод/ отображение наименования настройки.\nТип графика\nОпределение типа отображаемого графика. Возможные значения:\nколонки – отображение значений показателей колонкой для каждого среза;\nкруговая диаграмма – отображение значений показателей в виде круга;\nлинейный – отображение значений линейным графиком;\nстолбцы – отображение значений показателей столбцами.\nАлгоритм определения объекта с показателями\nВыбор/ ввод алгоритма для определения объекта, показатели которого будут отображены на графике. По умолчанию и в отсутствие алгоритма используется текущий объект.\nПоказатели\nВыбор показателей из списка.\nЗаголовок графика\nВвод текста заголовка графика.\nВысота\nОпределение высоты изображения графика, числовое значение (px).\nШирина\nОпределение ширины изображения графика, числовое значение (px).\nПосле настройки источника данных на основе графика показателей, Система отобразит в печатной форме (в рассматриваемом случае два графика, то есть настроены два \"источника данных на основе графика показателей\"):\nВидеообзор настройки\nИсточник данных на основе графа локальных объектов\nИсточник данных на основе графа локальных объектов позволяет отобразить схему (блоками которой являются локальные объекты) в формируемом документе.\nДля настройки схемы необходимо:\n1. Выбрать расширение \"Шаблон печатной формы. Источник данных на основе графа локальных объектов\".\n2. Указать атрибут типа с графом локальных объектов, где:\nПоле\nНазначение\nТип объекта\nОпределение типа объекта, атрибут которого будет использоваться.\nАтрибут типа\nВыбор атрибута типа из выпадающего списка.\n3. Сохранить введенные настройки.\nПосле отладки печатной формы, Система отобразит схему в формируемом документе:\nСвязь объектов при этом указывается стандартно. Обычно в атрибуте \"Связь\" задается тип объекта, в котором хранятся связи между объектами. То есть в этих атрибутах указывается порядок связи и информация о связываемых объектах.\nИсточник данных на основе изображения\nВ печатную форму можно вывести изображение. Для этого необходимо настроить \"Шаблон печатной формы.\nИсточник данных на основе изображения\n\"\nПредполагается\nиспользование форматированного изображения\n. В процессе настройки печатной формы отображение файла не редактируется. Поддерживается работа со следующими форматами файла:\n.*jpg\n,\n.*jpeg\n,\n.*png\n,\n.*bmp\n,\n.*tiff\n.\nДля настройки источника изображения необходимо указать:\nПоле\nНазначение\nНаименование\nВвод/ отображение наименования настройки.\nАлгоритм для определения файлов\nВыбор из списка/ ввод алгоритма, для определения файла. Алгоритм должен вернуть файл или коллекцию файлов, которые будут отображаться в ПФ.\nПример алгоритма для определения файла:\nИзображение может быть выведено в документ любого формата.\nВ случае настройки печатной формы формата *.xls(x), отображение займет указанную(настраиваемую) ячейку. То есть форма изображения определяется размером ячейки.\nИсточник данных на основе кубического источника\nВ печатной форме может быть отражен кубический источник (куб данных). Для этого, при настройке поля ПФ, необходимо выбрать \"Шаблон печатной формы.\nИсточник данных на основе кубического источника\n\".\nДанный источник предполагает следующие\nформаты файла выводимой ПФ: doc, docx, xls, xlsx.\nДля настройки источника необходимо указать:\nПоле\nНазначение\nНаименование\nВвод/ отображение наименования настройки.\nКубический источник\nОпределение кубического источника (\nтип объекта Представление куба [SYS_OLAP]\n) из выпадающего списка.\nОтображение данных кубического источника в ПФ аналогично его представлению на визуале.\nИсточник данных на основе штрих-кода\nСистема позволяет сгенерировать и вывести в печатную форму qr-код. Подробнее о\nгенерации qr-кода\n.\nДля отображения сгенерированного qr-кода формируемом документе необходимо выбрать '\n\"Шаблон печатной формы.\nИсточник данных на основе штрих-кода\n\"\n'. Дополнительной настройки данный источник не требует.\nДля каждой печатной формы генерируется индивидуальный qr-код.\nДля одного документа, независимо от количества закладок с кодом, генерируется и отображается только один qr-код. То есть\nв одном документе отображается один qr-код для всех закладок с кодом.\nЕсли qr-код необходимо отобразить на каждой странице печатной формы, закладку с данным источником нужно продублировать вручную или посредством настройки колонтитула документа.",
  "source": "https://docs.greendata.ru/platform/ru/example-setting-up-data-sources-for-print-forms.html"
}