{
  "title": "currentUserGeoLocation",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ncurrentUserGeoLocation\nThe function returns the user’s current location.\nTo determine the user’s current geolocation, activate the corresponding setting, for more details, see the\n\"User geolocation\"\n.\nSyntax\ncurrentUserGeoLocation\n(geo)\nSetting\nPurpose\ngeo\nData type of the user’s geolocation. The selection is made from the \"Directory. User location\" directory.\nNote\nIn the algorithm editor the function is available for calling from the \"Users and groups\" tab. When calling the function, a modal window will be opened to define the data type of the current user’s location.\nBy default, the city location is selected.\nLocation is determined by the user’s IP address.\nThe result of the function (taking into account the locale of the user running the algorithm) is output:\nfor \"City\"/\"Country\" values - string value;\nfor \"Longitude\"/\"Latitude\" values - numeric value.\nUse case\nThe user needs to display only those store addresses that are located in their city.\nTo do this, add filtering according to the following algorithm in\nregistry settings\nto the \"GA store chain\" object registry containing store addresses:\nIn the algorithm with the \"GA Store Chain\" basic object type, the chained attribute \"City. Name\" is inserted using the\nattr\nfunction.\nTo set up filtering, an equality is added, in its right part, the\ncurrentUserGeoLocation\nfunction is inserted from the \"Users and Groups\" tab. In the modal window that opens, the location by city is set.\nAs a result, if\nuser location option\nis active, only objects with a city corresponding to the user’s current location will be displayed in the \"GA store chain\" type registry.",
  "source": "https://docs.greendata.ru/platform/en/currentusergeolocation.html"
}