{
  "title": "Настройка ETL-процесса при загрузке данных из XLS-файлов с разных листов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка ETL-процесса при загрузке данных из XLS-файлов с разных листов\nБизнес-задача:\nнеобходимо настроить процесс, посредством которого в Систему будут передаваться данные по наличию автомобилей в автосалонах из разных городов, получаемые из загружаемого пользователем XLS-файла.\nТип объекта, по которому загружаются данные из файла, должен существовать в Системе (подробнее о\nсоздании новых типов\n).\nДанные размещены в XLS-файле в виде таблицы, наличие автомобилей в каждом дилерском центре представлено на отдельных листах с соответствующим наименованием города.\nВ Систему данные должны передаваться в экземпляры типа \"Дилер по продаже авто\":\nданные по автомобилю каждой строки XLS-файла сохраняются отдельным объектом;\nесли в Системе уже имеется объект, содержащий данные по автомобилю из файла, тогда значения его атрибутов обновляются согласно загружаемому файлу. Предотвращение дублирования данных возможно при условии уникальности объектов. В рассматриваемой задаче каждый объект может быть идентифицирован по VIN-номеру автомобиля.\nЗагрузка данных из файла может быть реализована посредством настройки\nETL-процесса\n.\nОписание данного примера настройки ETL-процесса осуществлена на основе информации, представленной в перечне следующих статей:\nСоздание объекта ETL\n;\nНастройка схемы ETL\n;\nИсточник. Файл\n;\nПриемник. Внутренний\n;\nНастройка запуска ETL\n.\nШаг 1. Создание объекта ETL-процесса\nПервоочередно для настройки  данного примера необходимо создать объект ETL-процесса, для этого:\n1. в главном меню последовательно выбираются пункты \"Интеграции → ETL\":\n2. в открывшемся окне по кнопке\n, расположенной на панели управления,\nсоздается новый объект ETL\n:\n2.1. в открывшейся карточке следует указать наименование нового объекта ETL и его идентификатор (параметры могут быть заполнены автоматически);\n2.2. в блоке параметров \"Управление логированием\" может быть изменен режим отображения лога выполнения процесса ETL. Во избежание засорения серверов рекомендуется использование режима \"Только ошибки\", но для проверки корректности выполнения ETL-процесса в данной задаче выбираются параметры:\nПараметр\nНазначение\nУровень логирования в лог экземпляра\nОтладочная информация\nЗаписывать в протокол результирующие структуры данных этапов\nДа\nШаг 2.\nНастройка схемы ETL-процесса\nПосле сохранения настроек на панели управления созданной карточки объекта ETL-процесса отобразятся дополнительные кнопки.\n1. Нажатие на кнопку\nприведет к открытию новой вкладки, на которой будет осуществляться\nнастройка схемы ETL-процесса\n.\n2. Для загрузки в Систему данных из файла необходимо с панели действий и компонентов перетащить (Drag&Drop) в рабочую область два элемента задачи:\n2.1. первый этап определить как\nИсточник типа \"Файл\"\n:\n2.2. второй этап определить как\n\"Приемник. Внутренний\"\n:\nДанный пример рассматривается при использовании двух этапов ETL-процесса, при необходимости могут быть использованы дополнительные этапы, например\nпреобразователи данных\n.\n3. Для последующей отладки в рабочую область перетаскивается конечный элемент (End Event), после чего начальный элемент соединяется с этапом источника, а затем с конечным элементом.\nТак как при настройке схемы ETL-процесса рекомендуется\nвыполнять отладку поэтапно\n, элемент\n\"Приемник. Внутренний\"\nв соединении не участвует до момента успешной отладки настроенного этапа \"\nИсточник. Файл\n\".\nСозданную схему необходимо сохранить по кнопке\nв панели управления, после чего станет возможен переход к настройкам этапов.\nШаг 3. Настройка источника\nПереход к настройкам источника осуществляется по нажатию на соответствующую иконку:\nПараметры источника\nТак как в рамках текущей задачи предполагается пользовательская загрузка файлов через интерфейс Системы, путь к каталогу и маска файлов не указывается.\nНаименование этапа можно определить как \"Загрузка данных по продаже авто\", расширением файла следует указать значение \"XLS\", после чего настроить параметры следующим образом:\nТак как заранее известно, что данные в файле располагаются со второй строки, номером первой строки с данными указывается значение \"1\" (т.к. нумерация строк начинается с 0).\nНомером первого столбца с данными указывается значение \"0\" (в XLS-файле столбец \"А\").\nТак как загрузка данных будет осуществлена с указанной в параметрах \"Номер первой строки с данными\" и \"Номер первого столбца с данными\" ячейки, можно не указывать наличие заголовков.\nЕсли в параметре \"Файл содержит заголовки\" указать значение \"Да\", Система будет искать соответствие с наименованиями атрибутов, указанных при описании динамической структуры (описание структуры будет рассмотрено далее).\nЛисты XLS-файла, необходимые для загрузки указываются в поле \"Листы книги для загрузки\" и могут быть перечислены через запятую либо заданы интервалом, например \"1-10\".\nФормирование динамической структуры\nДля формирования динамической структуры можно перейти на вкладку \"Структура выхода\" и создать её вручную, но рекомендуется использовать метод автоматического генерирования динамической структуры по данным в формате XML или JSON, которые добавляются на вкладке \"Описание структуры\".\nТипы будущих нод определяются автоматически по указанным значениям.\nПодробности описания структуры данных представлены в статье\n\"Динамическая структура данных (ETL)\"\n.\nЕсли на вкладке \"Параметры источника\" в параметре \"Файл содержит заголовки\" было бы выбрано значение \"Да\", Система бы искала в загруженном файле заголовки, идентичные тем, которые представлены в параметре \"WSDL/JSON\".\nВ данном случае Система не смогла бы считать нужные данные, т.к. заголовки в файле представлены на русском языке, а в добавленном XML на английском языке.\nПорядок полей в XML должен в точности соответствовать порядку полей атрибутивного состава загружаемого файла.\nВ данной задаче помимо данных с листа файла также будет передаваться наименование самого листа (города, в котором числится автомобиль). Для этого необходимо добавить соответствующее поле строкового типа, в данном пример — это <city>list</city>.\nПосле сохранения настроек\nна вкладке \"Структура выхода\" будет сформирована динамическая структура.\nНеобходимо проверить корректность распознанных типов полей (нод) динамической структуры для избежания последующих ошибок при получении данных.\nСохранение наименования листа XLS-файла в Системе\nДанная настройка производится после формирования динамической структуры.\nВ динамической структуре должна быть подготовлена соответствующая нода, через которую будут передаваться данные по наименованию листов XLS-файла. В рассматриваемом примере — это \"city\".\nПосле обновления страницы\nна вкладке \"Параметры источника\" в поле \"Элемент динамической структуры с названием листа\" при помощи выпадающего списка иерархии структуры выбирается нода для записи наименования листа.\nУказав необходимую ноду динамической структуры, необходимо сохранить настройки.\nСохранение номера строки данных XLS-файла в Системе производится аналогичным образом, за исключением того, что выбор ноды осуществляется в параметре \"Элемент динамической структуры с номером строки\".\nАтрибутивный состав типа объекта должен включать в себя не только атрибуты, соответствующие всем необходимым для записи в Систему столбцам XLS-файла, но и при необходимости атрибуты для записи наименования листа и номера строки.\nВ рамках данной задачи в типе \"Дилер по продаже авто\" представлен следующий атрибутивный состав, включая атрибут \"Город\" для записи наименования листа:\nОтладка источника\nТак как при настройке схемы ETL-процесса этап источника\nзаранее\nбыл соединен с начальным и конечным элементами, после сохранения настроек этапа можно сразу перейти к отладке этапа путем запуска ETL-процесса.\nДля запуска ETL-процесса необходимо перейти в реестр объектов ETL, выбрать объект ETL \"Car catalog\" и нажать на кнопку\n, расположенную на панели управления, либо нажать на данную кнопку непосредственно из карточки ETL-процесса \"Car catalog\".\nПосле нажатия на кнопку откроется модальное окно для загрузки файла:\nПо нажатию на кнопку \"Выбрать файл\" осуществляется выбор файла на устройстве пользователя, наименование выбранного файла отобразится в модальном окне, после чего следует нажать кнопку \"Запустить\".\nПри успешном выполнении ETL-процесса в правом нижнем углу экрана отобразится соответствующее уведомление:\nЕсли при выполнении ETL-процесса произошла ошибка, Система выведет уведомление следующего вида:\nОзнакомиться с процессом выполнения ETL-процесса можно при просмотре лога выполнения в протоколе запуска ETL, подробнее можно ознакомиться в статье\nНастройка запуска ETL\n.\nЕсли для корректного сохранения данных в Систему необходимо изменить формат загружаемых данных, после этапа источника следует добавить этапы\nпреобразователей\n.\nШаг 4. Настройка приемника\nДля перехода к настройкам приемника необходимо вернуться к\nсхеме ETL-процесса\nи настроить связку между этапами следующего вида:\nПосле сохранения схемы ETL-процесса осуществить переход к настройкам приемника нажатием на соответствующую иконку:\nОткроется новая вкладка, на которой осуществляются следующие настройки:\n1. В параметре \"Базовый тип объектов\" указывается тип объекта, в экземпляры которого будут передаваться полученные из загруженного файла данные. В результате чего с правой стороны от динамической структуры, полученной из источника, будут отображены все атрибуты выбранного типа.\n2. Раскрыв динамическую структуру данных, связать ноды с соответствующими  атрибутами выбранного базового типа, например:\nВ результате подобных действий будут настроены связи следующего вида:\n3. В реестре \"Настройка связей типов\" определяется необходимость создания нового объекта типа после каждой загрузки данных или обновления существующего.\nЧтобы по одним и тем же данным, загружаемым через файл, в Системе не создавались новые экземпляры типа, а при необходимости обновлялись значения атрибутов существующих объектов (например, изменилась цена или статус наличия автомобиля), в типе объекта должен быть настроен уникальный ключ.\nКлюч в типе объекта добавляется на вкладке \"Ключи\". В рассматриваемом примере Система будет выполнять автоматическую проверку объектов по VIN-номеру автомобиля и не позволит сохранить дублирующие карточки при добавлении следующего ключа:\nПри создании нового объекта типа \"Настройка связей типов\" выбираются  следующие параметры (в качестве типа связи приемника указывается \"Альтернативный ключ\", после чего в блоке \"Настройка связи через индекс\" выбирается созданный в типе объекта ключ):\nОтладка приемника\nОтладка данного этапа аналогична\nотладке источника\n- это запуск ETL-процесса.\nПо умолчанию в приемнике активны следующие параметры:\nПри отладке данного этапа с текущими параметрами будет производиться проверка корректности настроенных связей, а именно проверка соответствия типов нод с типами связанных атрибутов типа объектов. При этом объекты\nне будут сохраняться\nв Системе.\nПосле успешной отладки необходимо переключить параметр \"Отобразить результаты ETL без сохранения\" в неактивное положение.\nШаг 5. Добавление кнопки в реестр типа\nКнопку запуска ETL-процесса можно разместить на панели реестра следующим образом:\n1. В главном меню последовательно выбирать пункты \"Администрирование → Управление объектами\" → Действия над объектами\":\n2. На отобразившейся странице добавить новое действие по кнопке\n, расположенной на панели управления.\n3. В открывшейся карточке указать наименование действия \"Загрузить каталог\" — данное наименование будет использоваться на кнопке.\n4. В качестве параметра \"Модуль пользовательского интерфейса\" при помощи выпадающего списка выбрать значение \"Выполнить ETL по файлам\".\n5. Перейти к настройкам дополнительных параметров действия по кнопке \"Создать\".\n6. В открывшемся модальном окне указать ETL-процесс для запуска \"Car catalog\" и параметры запуска, после чего нажать на кнопку \"Ок\".\n7. Для отображения создаваемой кнопки в реестре типа \"Дилер по продаже авто\" необходимо:\nв блоке \"Область видимости\" в параметре \"Отображать в реестре\" выбрать значение \"Да\";\nв блоке \"Связные типы объектов\" создать новый объект и указать связь с типом \"Дилер по продаже авто\".\n8. Сохранить настройки действия.\nШаг 6. Запуск ETL-процесса\nПроцесс запуска ETL-процесса рассмотрен\nранее\n. Он также может быть осуществлен из реестра типа \"Дилер по продаже авто\" по\nдобавленной кнопке\n.\nПосле успешного выполнения ETL-процесса в реестре типа \"Дилер по продаже авто\" создадутся новые объекты.\nЕсли среди загружаемых файлов имеется автомобиль с уже загруженным в реестр типа VIN-номером, данные такого объекта будут обновлены.\nДанные даты и времени, загруженные из файла, передаются в формате UTC и по умолчанию отображаются в часовом формате пользователя. Например, в загруженном файле было указано время \"14:00\", для пользователя, находящегося в часовом поясе UTC+5, данное значение отобразится как 19:00.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-etl-process-when-loading-data-from-xls-file-from-different-sheets.html"
}