{
  "title": "Установка и авторизация в мобильном приложении GreenData",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nУстановка и авторизация в мобильном приложении GreenData\nМобильное приложение \"\nGreenData\n\" может быть установлено на устройствах на базе\nAndroid\nи\niOS\n.\nAndroid\nДля устройств на базе Android мобильное приложение \"GreenData\" может быть установлено:\nИз магазина приложений\n.\nСкачать приложение GreenData на мобильное устройство из\nGoogle Play\nможно по\nссылке\n.\nИз магазина приложений\n.\nСкачать приложение GreenData на мобильное устройство из\nRuStore\nможно по\nссылке\n.\nДля планшетов, смартфонов и прочих мобильных устройств на базе Android, подключенных через Интернет, следует использовать вариант стандартной установки.\nДля специальных устройств Android (цеховых терминалов АРМ, очков дополненной реальности и пр.) установка должна выполняться по специальному техническому варианту.\nСтандартная установка\nПоследовательность установки мобильного приложения через\nGoogle Play\n.\nОткрыть на устройстве приложение\nGoogle Play\nи в поле поиска ввести запрос \"GreenData\".\nЛибо через приложение браузера перейти на страницу\nприложения GreenData\n.\nСреди найденных приложений выбрать приложение \"GreenData\" и нажать на кнопку \"\nУстановить\n\" (\"Install\").\nПринять условия работы и выдать требуемые разрешения кнопкой \"\nПринять\n\" (\"Accept\").\nДождаться завершения процесса загрузки и установки приложения.\nНажатием на кнопку \"\nОткрыть\n\" запустить мобильное приложение.\nВ подавляющем большинстве случаев данных действий вполне достаточно для начала работы с мобильным приложением \"GreenData\" от GreenData.\nСпециальная установка\nСпециальная установка выполняется техническими специалистами (с помощью .apk файла загружаемого по USB) на специальных устройствах, на которых отсутствует индивидуальный профиль GooglePlay либо интерфейс установки.\nШаг 1. Получаем идентификатор приложения:\nОткрываем на устройстве приложение PlayMarket\nлибо переходим на адрес\nhttps://play.google.com/store/apps\nВ поле поиска вносим фразу \"GreenData\"\nи видим перечень соответствующих приложений.\nЛибо сразу переходим на страницу\nприложения GreenData\n.\nНаходим и выбираем приложение \"GreenData\",\nвнимательно смотрим на строку адреса, в которой будет показан идентификатор\nhttps://play.google.com/store/apps/details?id=\nИДЕНТИФИКАТОР\nШаг 2. Загружаем .apk файл по идентификатору\n:\nПереходим к сервису\napps.evozi.com/apk-downloader/\nВносим ранее полученный ИДЕНТИФИКАТОР в поле заполнения\nи нажимаем кнопку \" Click here to download …​ now\"\nЗагружаем .apk файл на компьютер.\nШаг 3. Установка .apk файла на устройство\n:\nподключаем Android устройство к компьютеру (по USB);\nкопируем выбранный .apk файл на устройство;\nс помощью файлового менеджера запускаем (кликом) .apk файл;\nесли потребуется разрешение на установку из внешних источников, то будет показано уведомление о необходимости включения данной настройки (следует перейти к указанной настройке, включить ее, а затем повторно установить приложение);\nесли появляется запрос подтверждения (\"Точно ли хотите поставить приложение?\"), следует нажать \"Да\" и приложение должно установиться.\nФайлы установочных пакетов совместимы с конкретными типами процессоров\n(CPU Architecture). Установка приложения на несовместимой архитектуре процессора невозможна. Если выполнена попытка установки несовместимой версии, то установка будет прервана (без каких-либо негативных последствий для операционной системы).\nДиагностика совместимости устройства\nВ большинстве случаев на Android устройствах используется тип архитектуры \"\narm64-v8a\n\", но в случаях несовместимости (с 32 битным ARM процессором) потребуется устанавливать версию приложения с маркировкой \"\narmeabi-v7a\n\".\nПри использовании партнерами специальных Android устройств специалисты GreenData могут предоставить решение для конкретной архитектуры.\nМожно заранее посмотреть версию процессора устройства в приложении\nTelegram Messenger\n. Переходим в меню, далее в настройки, прокручиваем содержимое в самый низ и замечаем фразу на серой строке \"Telegram for Android v Номер_Версии\narm64-v8a\n\".\nПри отсутствии Telegram Messenger можно установить приложение\nCPU-Z\n, в котором технические сведения доступны из характеристик \"Architecture\" и \"Kernel Architecture\".\niOS\nДля устройств на базе iOS мобильное приложение \"GreenData\" устанавливается из магазина приложений\n.\nСкачать приложение GreenData на мобильное устройство из\nApp Store\nможно по\nссылке\n.\nСтандартная установка\nПоследовательность установки мобильного приложения через\nApp Store\n.\nОткрыть на устройстве приложение\nApp Store\nи в поле поиска ввести запрос \"GreenData\".\nЛибо через приложение браузера перейти на страницу\nприложения GreenData\n.\nСреди найденных приложений выбрать приложение \"GreenData\" и нажать на кнопку загрузки (\"Install\").\nПринять условия работы и выдать требуемые разрешения кнопкой \"\nПринять\n\" (\"Accept\").\nДождаться завершения процесса загрузки и установки приложения.\nНажатием на кнопку \"\nОткрыть\n\" запустить мобильное приложение.\nВ подавляющем большинстве случаев данных действий вполне достаточно для начала работы с мобильным приложением \"GreenData\" от GreenData.\nАвторизация\nИспользование\nмобильного приложения GreenData\nпредполагает подключение к заранее созданному приложению платформы (далее — стенду).\nПри первом запуске мобильного приложения GreenData отобразится форма для ввода адреса подключаемого стенда и подтверждения действия нажатием на кнопку \"Продолжить\".\nДля получения URL из адресной строки браузера достаточно выделить часть адреса, которая включает наименование проекта и приложения и оканчивается символом \"/\", и скопировать эту часть в буфер обмена.\nДопускается ввод ссылки на стенд без указания протокола, в таком случае \"https://\" будет подставлено автоматически.\nПротокол \"http\" не поддерживается.\nНа открывшейся далее странице представлена форма для добавления приложения:\n\"Наименование\" — название подключения;\nПри наличии нескольких подключений указанное наименование позволит пользователю быстрее идентифицировать необходимое подключение.\n\"URL\" — стенд, к которому настраивается подключение;\nПо умолчанию устанавливается ссылка на ранее указанный стенд.\n\"Логин или Email\" и \"Пароль\" — учетные данные пользователя, осуществляющего подключение к стенду;\n\"Использовать доменный логин\" — признак, указывающий на то, что для аутентификации в приложении используются учетные данные домена.\nПризнак отображается если на стенде настроена возможность\nдоменного входа\n.\nПо нажатию на кнопку\nосуществится вход в приложение по указанным учетным данным, которые будут сохранены для последующей авторизации в приложении к указанному стенду. Если данные не были указаны, то откроется страница авторизации.\nЕсли стенд работает через VPN-подключение, то подключитесь к VPN.\nЦентральную часть экрана страницы авторизации занимает форма ввода учетных данных пользователя для подключения к приложению, указанному в нижней части экрана.\nДля авторизации в приложении после ввода учетных данных необходимо нажать на кнопку подключения.\nДля смены приложения, к которому осуществляется подключение — добавления нового или использования ранее сохраненного, необходимо перейти к\nсписку приложений (стендов)\nнажатием на кнопку\n.\nЕсли\nнастройками стенда\nдопускается, то на странице доступны опции:\nрегистрации\n— для создания новой учетной записи пользователя;\nвосстановления пароля\n— восстановления забытого пароля от введенного логина пользователя.\nСписок приложений (стендов)\nСписок приложений, переход к которому осуществляется нажатием на кнопку\nна странице авторизации, используется для создания подключений к разным стендам и/или для авторизации под различными пользователями.\nДля управления списком доступны следующие инструменты:\n– поиск по наименованию или URL стенда;\n– добавление нового подключения;\n– подключение к стенду.\nПо нажатию на строку приложения откроется карточка подключения для  редактирования параметров подключения.\nПри долгом нажатии на строку приложения отобразится контекстное меню с опциями копирования, удаления и редактирования параметров подключения.\nРегистрация\nДля регистрации в приложении необходимо нажать на соответствующую кнопку в левом нижнем углу экрана на странице авторизации.\nКнопка отображается в том случае, если на стенде настроена возможность\nрегистрации\n.\nНа странице регистрации необходимо заполнить соответствующие поля, после чего нажать на кнопку \"Зарегистрироваться\".\nДля завершения регистрации на открывшейся странице потребуется ввести код подтверждения, высланный на указанный при регистрации номер телефона или e-mail.\nВосстановление пароля\nДля восстановления пароля необходимо нажать на соответствующую кнопку в правом нижнем углу экрана на странице авторизации.\nКнопка отображается в том случае, если на стенде настроена возможность\nвосстановления пароля\n.\nНа отобразившейся странице необходимо указать номер телефона или e-mail, привязанные к аккаунту пользователя, затем нажать на кнопку \"Восстановить\".\nСистема вышлет код подтверждения, после ввода которого пользователь сможет указать новый пароль.\nДля дальнейшей работы с мобильным приложением ознакомьтесь с его настройками:\nВозможности и настройки мобильного приложения\n.\nДля адаптации мобильного приложения под бизнес-решение и потребности пользователей будет полезно изучить следующие статьи:\nКастомизация мобильного приложения\n;\nРекомендации по настройке отображения объектов в мобильном приложении\n.",
  "source": "https://docs.greendata.ru/platform/ru/installing_and_logging_into_mobile_app.html"
}