{
  "title": "Объектный источник данных",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбъектный источник данных\nОбъектный источник данных позволяет сделать выборку необходимых значений без прямого ввода запроса к базе данных. При формировании объектного источника данных необходимо определить требуемые типы объектов (таблицы базы данных) и связи между ними.\nПолная настройка рассматриваемого источника данных следующая:\nСоздание карточки источника данных\nДля создания объектного источника данных необходимо открыть реестр типа \"Источник данных. Объектный источник данных\", для перехода к которому можно последовательно выбрать\nпункты меню\n:\n\"Отчеты\" → \"Источник данных\".\nВ представленном реестре в панели управления нажать на кнопку\n, после чего в открывшейся форме ввода указать следующие данные:\nПоле\nНазначение\nНаименование\nВвод наименования источника данных.\nИсключать дубли\nАтрибут, определяющий исключение повторяющихся значений с помощью выпадающего списка.\nАлгоритм условного форматирования\nВыбор / ввод алгоритма для условного форматирования полученных значений.\nПараметр с единицами измерения\nОпределение атрибута с параметрами единиц измерения.\nПосле внесения необходимых изменений необходимо сохранить карточку с помощью кнопки\n.\nНастройку источника данных необходимо осуществлять, переходя по вкладкам карточки слева направо.\nВкладка \"Объекты для источника\"\nНа вкладке \"Объекты для источника\" осуществляется выбор типов объектов, участвующих в формировании источника.\nДля этого необходимо нажать на кнопку\n, после этого на экране появится форма, в которой необходимо указать необходимый тип объекта и его наименование в источнике данных.\nВкладка \"Поля\"\nНа вкладке \"Поля\" необходимо указать атрибуты выбранных ранее типов, которые будут определять формируемый источник.\nРабота с вкладкой осуществляется посредством двух таблиц:\nлевая таблица – содержит атрибуты выбранного ранее типа объекта, добавленных на вкладке \"Объекты для источника\";\nправая таблица – содержит добавленные в формируемый источник поля.\nСистема также позволяет отредактировать представление поля источника. Для этого необходимо нажать на кнопку\nслева от добавленного поля источника. Система отобразит форму для ввода данных, где:\nПоле\nНазначение\nНаименование\nВвод наименования поля.\nТип поля\nОпределение типа формируемого поля. Возможные значения:\nНа основе вычислимого показателя;\nПапка;\nПоле из источника;\nФормула.\nВ зависимости от выбранного значения состав полей в карточке изменяется.\nСист. Порядок\nВвод системного номера формируемого действия. Может быть заполнено автоматически.\nНаименование столбца\nВвод наименования столбца для выведения указанного поля.\nМетод агрегации итогов\nВыбор метода агрегации итоговых значений. Возможные значения:\nКоличество;\nМаксимум;\nМинимум;\nСреднее взвешенное;\nСреднее значение;\nСумма.\nРодительское поле\nВыбор родительского поля. То есть формируемое поле будет дочерним по отношению в выбранному.\nТип данных\nОпределение типа данных значения формируемого поля. Возможные варианты:\nДата;\nДата время;\nЛогический;\nОбъект;\nСтрока;\nЧисло.\nСкрывать поле\nПризнак, определяющий отображение поле при просмотре источника.\nПривязанный тип объекта\nТип объекта, содержащий атрибут, формирующий поле в источнике данных\nАтрибут типа\nАтрибут привязанного типа объекта.\nСтиль форматирования\nЗаполнение настроек, определяющие форматирование представления источника данных.\nСтиль форматирования шапки\nЗаполнение настроек, определяющие форматирование представления шапки столбца.\nАлгоритм условного форматирования\nВыбор/ ввод алгоритма, определяющего условное форматирование представленных значений (например, цветовое выделение только отрицательных значений). Учитывается для отображения данных настраиваемого столбца.\nИмя поля в источнике\nНаименование поля в SQL-запросе\nВходит в первичный ключ\nАтрибут, определяющий уникальность значений в поле.\nУправляющий параметр\nОпределение параметра, согласно которому будет выполнена выборка данных.\nВкладка \"Связи\"\nНа вкладке \"Связи\" определяется связь между объектами для источников (типами объектов), добавленными на одноименной вкладке.\nДля добавления связи необходимо нажать на кнопку\n.\nВ случае когда все возможные вариации связей между добавленными объектами для источника (типами объектов) созданы, кнопка\nстановится недоступной.\nВ отобразившейся форме связь настраивается при помощи следующих параметров:\nПараметр\nНазначение\nПервый объект для источника\nТип объекта к которому будет устанавливаться связь.\nВторой объект для источника\nТип объекта, связь с которым необходимо установить.\nПри наличии ранее установленной связи с определенным первым объектом в качестве источника,  вторым объектом для данной связи не может быть выбран тот же самый объект.\nТип связи\nТип связи между выбранными объектами.\nВозможны следующие варианты:\nтолько связанные строки источников (INNER JOIN);\nвсе строки первого источника (LEFT JOIN);\nвсе строки второго источника (RIGHT JOIN).\nСхематичное представление типов связи\nПоля связи\nНастройка связи между сущностями с условием логического \"И\" посредством выбора атрибутов типов объектов, выбранных в качестве объектов для источников.\nДобавление поля связи осуществляется по кнопке\n, при необходимости можно добавить несколько полей связи.\nПо указанным в форме данным, Системой автоматически сформируется SQL-запрос источника, с которым можно ознакомиться в блоке \"Служебная информация\".\nПри необходимости текст SQL-запроса может быть изменен, данная возможность доступна после выбора значения \"Да\" в параметре \"Ввести запрос вручную\".\nВкладка \"Условия фильтрации\"\nНа вкладке \"Условия фильтрации\" задаются алгоритмы фильтрации данных используемых типов объекта в источнике, а также создаются параметры источника.\nДля каждого источника может быть добавлен отдельный алгоритм.\nЗадать алгоритм можно напротив типа объекта в таблице. Для этого используются кнопки:\nКнопка\nДействие\nДобавить алгоритм фильтрации для выбранного типа объекта.\nИзменить выбранный алгоритм. Система отобразит карточку алгоритма.\nУдалить выбранный алгоритм фильтрации.\nПодробнее о работе с алгоритмами –\nСоздание и настройка алгоритмов\n.\nС помощью параметров можно ограничивать (фильтровать) данные в источнике данных. Если для алгоритма фильтрации был создан параметр, то следует сформировать соответствующий параметр источника, указав аналогичный вид ограничения. Параметрам можно присвоить следующие виды ограничений:\nДата;\nДата и время;\nДесятичное значение;\nЛогическое;\nОбъект;\nСтрока;\nЦелочисленное значение.\nВкладка \"Сортировки\"\nНа вкладке \"Сортировки\" определяется сортировка данных типов объекта, используемых в настраиваемом источнике данных.\nСортировка возможна как по возрастанию, так и по убыванию значений. Чтобы задать сортировку по полю (атрибуту) необходимо нажать на кнопку\nи в появившейся форме указать:\nПоле источника данных;\nТип сортировки. Возможные значения:\nПо возрастанию;\nПо убыванию.\nВкладка \"Агрегация\"\nНа вкладке \"Агрегация\" осуществляются следующие настройки:\nнастраиваются правила агрегации полей формируемого источника данных в таблице \"Поля с агрегатными функциями\";\nзадаются правила группировки (объединения) полей формируемого источника в таблице \"Поля для группировки\".\nВ таблице \"Поля с агрегатными функциями\" представлен список полей в источнике, а слева от них расположено поле с выпадающим списком, с помощью которого можно определить метод агрегации значений (укрупнение данных). Возможны следующие методы агрегации:\nКоличество;\nМаксимум;\nМинимум;\nСреднее взвешенное;\nСреднее значение;\nСумма.\nЧтобы сгруппировать данные полей, необходимо перенести необходимы поля из таблицы \"Поля с агрегатными функциями\" в таблицу \"Поля для группировки\". При перемещении выбранные поля исчезают из таблицы \"Поля с агрегатными функциями\".\nПри группировке полей нужно установить агрегацию для полей.\nСлужебная информация\nДля поэтапного отслеживания корректности генерации SQL-запроса на основании настроек желательно сохранять настройки карточки перед переходом на следующую вкладку настройки.\nПри этом Система отобразит сформированный SQL-запрос в группе атрибутов \"Служебная информация\", в текстовом атрибуте \"Текст SQL-запроса\".\nПо умолчанию пользователю ограничен самостоятельный ввод SQL-запроса. Однако если требуется ввести запрос вручную или отредактировать его, то следует в одноименном поле указать значение\nДа\n.\nЧтобы сохранить карточку формируемого источника, необходимо нажать на кнопку\n.\nПоследующее взаимодействие с источниками данных описано в статье\n\"Работа с источниками данных\"\n.",
  "source": "https://docs.greendata.ru/platform/ru/object-data-source.html"
}