{
  "title": "Балансовые проверки",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nБалансовые проверки\nВкладка \"Балансовые проверки\" предназначена для настройки проверок взаимоувязки отдельных показателей форм отчетности.\nДанные проверки используются для выявления ошибок, допущенных в бухгалтерской отчетности.\nНа вкладке отображаются все относящиеся к данной форме балансовые проверки в табличном виде.\nДля настройки новой логики балансовой проверки необходимо:\n1. Нажать на кнопку\nв таблице проверок. Система отобразит карточку ввода алгоритма.\n2. Внести необходимые данные, где:\nПоле\nНазначение\nНаименование алгоритма\nВвод наименования формируемого алгоритма балансовой проверки.\nФорма отчетности\nОпределение формы отчетности для использования формируемой балансовой проверки.\nЗапретить сохранение данных при нарушении проверки\nПризнак, определяющий запрет сохранения данных отчетной формы, если балансовая проверка не выполнена.\nВыполнять балансовую проверку при расчете\nЛогический атрибут, определяющий выполнение балансовой проверки при расчете.\nБлокировать расчет при нарушении балансовой проверки\nЛогический атрибут, определяющий блокировку расчета при нарушении балансовой проверки.\nФормула\nВвод\nалгоритма\nбалансовой проверки.\n3. Нажать\nдля сохранения внесенной информации.\nБалансовые проверки отчетных форм выполняются в процессе их наполнения\n. Подробнее о\nзаполнении формы отчетности\n. Система позволяет изменить значения отчетной формы в ходе ввода данных.\nВ случае обнаружения нарушений, Система уведомит об этом.\nВ процессе работы с балансовыми проверками\nдоступны следующие элементы управления\nСохранение внесенных данных с имеющимися нарушениями. Кнопка доступна в случае разрешения сохранения данных при настройке балансовой проверки.\nОтмена действий пользователя.\nВыбор режима отображения статуса прохождения балансовых проверок. Возможные значения:\nпоказать все;\nпоказать только выполненные;\nпоказать только нарушенные.\nПосле выбора балансовой проверки\nСистема отобразит следующие элементы управления:\nПоле\nНазначение\nОтображение формулы в текущей карточки объекта.\nОтображение алгоритма балансовой проверки на соседней вкладке.\nЧтобы просмотреть значения, участвующие в балансовых проверках с нарушениями, необходимо нажать\n. Система подстветит необходимые значения красным цветом.",
  "source": "https://docs.greendata.ru/platform/ru/balance-sheet-checks.html"
}