{
  "title": "exportEDocToFile",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nexportEDocToFile\nThe function generates a printed form file (hereinafter - PF) based on the PF document.\nThe function returns an object  of\n“File” type\n[FS_FILE].\nThe PF file generated based on the PF document can be exported directly from the document editor by clicking the\nbutton in the control panel.\nSyntax\nexportEDocToFile\n(rfDocument)\nSetting\nPurpose\nrfDocument\nInstance of the \"Template-based document\" type [RF_DOCUMENT] (or its ID), based on which the file will be generated.\nNote\nThe function is called from the\n\"Documents and files\"\ntab of the Algorithm Editor toolbar.\nThe name of the created file will correspond to the settings of the PF template based on which the PF document was generated.\nUse example\nFor example, when working with the \"Loan Agreement\" PF document it is required to generate a document file and attach it to the attribute of an instance of the “Client Form” type.\nPreviously, add an attribute of\n“File” type\nwith the “Attachment” name to the “Client form” object type.\nThe algorithm of PF file generation will be as follows:\nOther functions were also used to write this algorithm.\nMore.\nDeclaring the “ file_pf” variable is performed by the\nvar\nfunction.\nSaving the generated file is done via the\nsave\nfunction.\nUsing the\nattr\nfunction with the “Set value” attribute, the \"Attachment\" attribute is assigned a value stored in the “file_pf” variable.\nCurrent object\nis saved by the\nsave\nfunction.\nAs a result, the PF file generated based on the PF document, the name of which corresponds to the settings of the PF template, will be added to the \"Attachment\" attribute:",
  "source": "https://docs.greendata.ru/platform/en/exportedoctofile.html"
}