{
  "title": "Privileges by object types",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nPrivileges by object types\nUser access to System objects is controlled by\naccess permission\nsettings, which include a set of privileges (permissions and restrictions).\nEach object type has a specific set of privileges depending on its functions.\nAbbreviations may be used in the System interface for convenience and compact display of information.\nBelow is a list of privileges by object type, along with a description of access permission values.\nObject Type\nThe following privileges are available for \"Object type\" type objects:\nRead\nWrite\nCreate type instances\nDelete\nRead type instances\nEdit type instances\nDelete type instances\nR\nW\nC\nD\nIR\nIW\nID\nObject\nThe following privileges are available for \"Object\" type objects:\nRead\nWrite\nDelete\nR\nW\nD\nAlgorithm\nThe following privileges are available for \"Algorithm\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nData Source\nThe following privileges are available for \"Data source\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nPermission\nThe following privileges are available for \"Permission\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nStart page\nThe following privileges are available for \"Start page\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nAI Assistant\nThe following privileges are available for \"AI Assistant\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nCalculation Module. Reporting form indicators\nThe following privileges are available for \"Calculation Module. Reporting form indicators\" type objects:\nRead\nWrite\nRun\nDelete\nR\nW\nE\nD\nCalculation Module. Calculated indicator\nThe following privileges are available for \"Calculation Module. Calculated indicator\" type objects:\nRead\nWrite\nView calculated indicator breakdown\nDelete\nR\nW\nCT\nD\nThe value\nF\nis displayed when all the above-mentioned access permissions are granted.\nBy default, the object creator and the administrative group have the full set of access permissions when an object is created.",
  "source": "https://docs.greendata.ru/platform/en/access_permission_values_explanation.html"
}