{
  "title": "Шаблоны для визуала",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nШаблоны для визуала\nШаблоны для визуала\n– это готовые наборы элементов интерфейса, которые позволяют быстро сформировать базовую структуру карточки объекта. При дальнейшей настройке визуала добавленный набор элементов может быть изменен или дополнен необходимыми элементами.\nВиды шаблонов\nШаблоны для визуалов представлены на вкладке \"Шаблоны\" панели элементов, отображение шаблона включает в себя наименование шаблона и его обложку.\nПри настройке визуала пользователь может задействовать как системный шаблон, так и создать собственный. Собственный шаблон рекомендуется создавать в случае наличия типовой разметки, которую требуется применить для карточек разных типов объектов.\nПеречень системных шаблонов предлагает выбор следующих вариантов разметки:\n2 ряда + 2 колонки;\nшапка + группа вкладок;\nс панелью справа;\nсо статус баром.\nКоличество системных шаблонов может меняться в зависимости от наращивания функциональности Системы.\nСоздание собственного шаблона\nДля создания собственного шаблона следует выполнить последовательность действий:\n1. Настроить визуальное представление, шаблон которого необходимо создать. Важно учитывать, что в шаблон сохранится разметка текущего визуала: группы, панели, виджеты. Атрибуты и иные настройки (например,\nвизуальные алгоритмы\n) в шаблон не сохраняются.\n2. На вкладке \"Шаблоны\" в разделе \"Мои\" нажать на кнопку добавления, которая всегда располагается на месте первого шаблона.\n3. В открывшемся модальном окне осуществить настройку шаблона, добавив:\nнаименование шаблона, поле может быть заполнено автоматически;\nизображение обложки шаблона, допустимый формат загружаемых файлов: JPEG, JPG и PNG.\nЗагруженное изображение отобразится под параметрами настройки шаблона:\nЕсли изображение не было загружено, после сохранения шаблона обложка примет следующий вид:\n4. Сохранить указанные настройки шаблона.\nСозданный шаблон сохранится на вкладке \"Шаблоны\" в разделе \"Мои\".\nРедактирование шаблона\nПри наведении курсора мыши на обложку шаблона в правом верхнем углу отобразится ховер для редактирования шаблона или его удаления. При нажатии на иконку редактирования откроется окно с возможностью изменения наименования или обложки шаблона. Редактирование визуала в шаблоне невозможно, для сохранения измененного визуала необходимо сохранять новый шаблон.\nПрименение шаблона\nВставка шаблона в качестве части настроенного визуала невозможна, шаблон применяется для визуала карточки целиком.\nВ случае выбора шаблона визуал карточки будет очищен и заменен шаблоном.\nДля применения шаблона к карточке объекта необходимо нажать на выбранный шаблон.\nПосле чего система выведет уведомление следующего вида:\nПри нажатии на кнопку \"Нет\" визуал карточки не изменится, при нажатии на кнопку \"Да\" текущий визуал будет заменен набором элементов шаблона.",
  "source": "https://docs.greendata.ru/platform/ru/templates-for-object-visual.html"
}