{
  "title": "Uploading iOS app to App Store",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nUploading iOS app to App Store\nAn iOS-based app can be added to App Store by following the steps:\nSigning up\nand\nSetting up\na developer account in Apple Developer.\nSetting up\nan Apple App Store Connect account to connect Apple and GreenData accounts and registering the app in the Apple App Store Connect.\nPreparing the necessary information and content for the application, including description, screenshots, graphics, etc.\nCreating the app in the\npersonal account\nin the\nMobile apps\nsection.\nFilling in the necessary metadata and settings for the app.\nTesting\nthe application build (if necessary).\nPassing the Apple review with the\nrequirements\nand\nrecommendations\n.\nAfter successful verification,\npublishing\nthe app in Store.\nSigning up in Apple Developer Account\nTo publish an iOS mobile app under the personal brand requires the individual\nApple Developer\naccount, Apple requires software vendors to register apps under the accounts of the end owners who are responsible for the content and operation of these applications.\nCreating a developer account takes about 2 weeks.\nTo launch mobile iOS apps via the GreenData account, the Apple Developer account must be created as a company (legal entity) account, since it is not possible to add a GreenData account as a team member in an individual account, which is necessary to connect to the GreenData account.\nTo publish apps through an Apple Developer account, an annual subscription is required. To work with the GreenData Personal Account, it is enough to purchase a standard subscription (not Enterprise), but specify in the Company/Organization status in settings. The subscription is paid annually. By opting out of the auto-renewal option, the subscription renewal is done manually. Otherwise, all released apps will be removed from the App Store within 24 hours after the paid subscription period expires.\nRequired data for creating Apple Developer account:\nApple ID\n— using an existing one or creating a new one. Apple ID and Apple Developer accounts are not the same thing. (more information about creating an Apple ID account is described on the\nwebsite\n). It is recommended to use mail in the domain zone associated with the company as the mailing address, since in the future Apple may request it when registering the Apple Developer account as Company/Organization. It is also recommended to use an email address that several people in the company will have access to, since Apple will send important messages and notifications about released apps to this email.\nD-U-N-S number\n— a unique identifier assigned to the company through Dun & Bradstreet (D&B). Apple requires all companies that register in the Apple Developer Program to provide a D-U-N-S number. It is used by Apple to confirm the identity and legal status of a company registering as an Apple Developer (more information about getting a D-U-N-S number for free is described on the\nwebsite\n). In the process of receiving the D-U-N-S number, an Apple representative can call the phone number specified during registration and additionally request legal documents for the company to clarify the information. The registration time for the D-U-N-S number can take up to 30 days.\nCreating account\nTo create an account, the developer must perform the following:\non the\nApple Developer Program enrollment\n, click \"Start Your Enrollment\";\npage, click \"Start Your Enrollment\";\nlog in with an Apple ID (additionally specify the two-factor verification code received on the mobile device);\nread and accept the Apple Developer Agreement;\nto continue registration on the site, click \"Continue enrollment on the web\";\nnext, specify the \"Company / Organization\" account type  and click \"Continue\";\nin the \"Organization Information\" section, specify the following information:\nin the \"Legal Entity Name\" field, specify the company name (it must be identical to the previously entered name when registering the D-U-N-S number);\nin the \"D-U-N-S Number\" field, specify the previously received D-U-N-S number;\nfill in the CAPTCHA and click \"Continue\":\nif an error message appears in the \"Legal Entity Name\" field, click \"update your D&B profile\" and send the company information. The procedure will continue after the profile is updated;\non the \"Summary for Review\" page, read and confirm the information. Next, select \"This is the correct headquarters address for my organization\" and click \"Submit\";\nIf successful, Apple will send a confirmation letter to the email address from the Apple ID with a link to pay for membership as an Apple developer. Follow the link and pay for the subscription.\nAs a payment method, it is recommended to specify the same method that was previously used with the Apple ID, it reduces the potential problems with subscription charges.\nSetting up Apple Developer Account\nIdentifiers Registration\nPublishing the app requires to register four IDs in the Apple Developer account.\nTo do this, select \"Identifiers\" on the main account page in the \"Program resources\" section:\nIn the section that opens, next to the \"Identifiers\" heading, click\nto register a new application identifier.\nOn the page that appears, leave the \"App IDs\" item selected and click \"Continue\".\nThen leave the \"App\" type selected and click \"Continue\".\nSetting\nPurpose\nDescription\nEnter the application ID in the com companyname appname format, where the\ncompanyname\nmust be replaced with the company name, and the\nappname\nwith the future name of the application.\nBundle ID\nSelect \"Explicit\".\nIn the field under the setting, enter the application ID specified in the \"Description\" field, in the\ncom.companyname.appname\nformat.\nThe identifier format allows only Latin letters, numbers, hyphens and dots.\nCapabilities\nCheck the following boxes:\nApp Groups\nAssociated Domains\nCommunication Notifications\nIn-App Purchase (selected as default)\nPush Notifications\nDon’t select \"Broadcast Capability\" item.\nNext, click \"Continue\" and then \"Register\".\nThe registered ID will appear in the list.\nThree more identifiers must be registered in the same way:\ncom.companyname.appname.notification-service\n(identifier for the notification service),\ncom.companyname.appname.share-extension\nand\ncom.companyname.appname.widget\n, where the first part of\ncom.companyname.appname\nshould match the previously registered application identifier. and in the list of \"Capabilities\" it is necessary to mark only the \"App Groups\" item (the  \"In-App Purchase\" item remains always selected by default).\nAs a result, four format identifiers should appear in the list of identifiers:\ncom.companyname.appname\ncom.companyname.appname.notification-service\ncom.companyname.appname.share-extension\ncom.companyname.appname.widget\nwhere\ncompanyname\nis the name of the company and\nappname\nis the name of the app.\nGroups registration\nNext, register two groups as follows:\non the \"Identifiers\" page in the upper right corner, click \"App IDs\" and select \"App Groups\" from the drop-down list:\nin the window that opens, click\nnext to the \"Identifiers\" heading;\non the page that appears, leave the \"App IDs\" item selected and click \"Continue\".\non the page that opens, in the \"Identifier\" field, enter the group identifier in the\ngroup.com.companyname.appname.widget\nwhere the part of\ncom.companyname.appname\nshould match the previously registered application identifier;\nin the adjacent \"Description\" field, specify the same identifier in the\ngroup com companyname appname widget\nformat (with spaces instead of dots);\nclick \"Continue\" and then \"Register\".\nThe registered ID will appear in the list.\nRepeat the steps for the\ngroup.com.companyname.appname.share\ngroup ID.\nAs a result, four format identifiers should appear in the list of identifiers:\ngroup.com.companyname.appname.widget\ngroup.com.companyname.appname.share\nwhere\ncompanyname\nis the name of the company and\nappname\nis the name of the app.\nMatching IDs and groups\nAfter registering groups, specify them in the \"App Groups\" item for previously created IDs. To do this, click on \"App Groups\" in the upper right corner and select \"App IDs\" again in the drop-down list. Next, click on the\ncom.companyname.appname\nidentifier and click \"Configure\" in the \"App Groups\" item.\nAfter that, both groups must be marked in the drop-down list\ngroup.com.companyname.appname.widget\nand\ngroup.com.companyname.appname.share\nand then click on the \"Continue\" button. Next, click on the \"Save\" button and click on the \"Confirm\" button in the notification that appears. The ID has been successfully updated.\nRepeat the steps for the remaining identifiers in according to the table:\nGroup\nIdentifier\ngroup.com.companyname.appname.widget\ncom.companyname.appname\ncom.companyname.appname.notification-service\ncom.companyname.appname.widget\ngroup.com.companyname.appname.share\ncom.companyname.appname\ncom.companyname.appname.share-extension\nSetting up Apple App Store Connect Account\nConnecting of Apple and GreenData accounts\nTo connect the Apple and GreenData accounts, add the GreenData account to the development team associated with the Apple Developer account. To do this, sign in to the\nApple App Store Connect\nwith the Apple ID that was previously used to register for the Apple Developer program. After signing in, select the \"Users and Access\" section on the main screen:\nOn the page that opens, click\nand enter in the window that opens the following information about the account used by GreenData to create apps via the personal account:\nSetting\nPurpose\nFirst name\nUser’s first name\nLast name\nUser’s last name\nE-mail\nmail@greendata.pro\nRoles\nAdmin\nAfter selecting the \"Administrator\" role, all other roles will be marked automatically.\nAdditional resources\nAfter selecting the \"Administrator\" role, all other roles will be marked automatically.\nClick \"Next\" and \"Invite\" buttons in a new window. After sending the invitation, wait for confirmation from GreenData. Contact GreenData\nsupport\nin case confirmation is overdue..\nRegistration of the app in the Apple App Store Connect\nBefore publishing the application via the personal account, register the application in the Apple App Store Connect. To do this, on the App Store Connect page, switch to the \"Applications\" tab and then click\nnext to the \"Applications\" heading on the page that appears. In the drop-down list, select \"New app\".\nIn the window that opens, specify information about the app you are creating.\nSetting\nPurpose\nPlatform\nSelect \"iOS\".\nName\nSpecify the name of the created app.\nThe name of the app must not exceed 30 characters.\nPrimary language\nIf the information about the app on the App Store page is not localized for some countries or regions, the information in the selected primary language will be used.\nBundle ID\nThe main application’s Bundle ID .\nSKU\nThe main application’s Bundle ID .\nUser access\nLimited Access — if the app is created for a certain group of users;\nFull Access — for public distribution of the app.\nAfter all settings are filled in, click \"Create\".\nCreating an app to publish on the App Store\nGo to the\nMobile apps\nsection of the GreenData personal account and create an image for further publication in the App Store.\nFor more information about the process of creating a mobile app, see the\nCreating custom mobile app\narticle.\nFill in information about the application\nOn the page of the newly created app, enter basic information:\nSetting\nPurpose\nPreview videos and screenshots for iOS\nScreenshots and videos of the app. Screenshots are required for both the iPhone and iPad versions. The screenshot format is specified in the tips on the page and must be strictly followed.\nAdvertising text\nAdvertising information about the app.\nThe parameter is optional.\nDescription\nA brief description of the main idea of the app, its main functions and features.\nKeywords\nWords that are associated with the app. They are used to make it easier to find an app in the App Store.\nSupport URL\nA link to the support service of the created app.\nMarketing (URL)\nLink to a product or company.\nThe parameter is optional.\nCopyright\nThe name of the person or organization that owns the unique rights to the application.\nBuild\nThe selection of a build ready for release will be available after successful download of the app in the\nMobile Applications\nsection of the GreenData personal account.\nInformation for checking the app\nSelect \"Login required\" and specify \"Username\" and \"Password\" for the test account, which Apple moderators can use to check the app before publishing.\nIf any additional actions are required to log in to the app, in addition to entering the test account data, they must be described in the \"Note\" field. Contact information is entered to connect moderators with a contact person in case of problems.\nRelease of the App Store version\nIt is recommended to leave the \"Release this version automatically\" option selected.\nAfter making changes on this page, click \"Save\".\nOn the left, in the \"Information App\" section, add information about the permissions to the app content, select the category in which the app will be located in the App Store, and set an age limit.\nIn the App Privacy section, add a link to the privacy policy for the app, as well as provide information about the data collection rules.\nIn the Pricing and Availability section, select how the app will be distributed (paid/free), as well as the countries in which the application will be available.\nMore information about entering data about the app is described on the Apple website on the\nApp information\npage.\nAfter making changes, click \"Save\".\nTesting the build in the App Store\nIn case of successful upload of the app from the GreenData personal account, the build of the first version of the app will appear in the Apple App Store Connect account on the app page in the \"TestFlight\" section.\nIf the upload of the assembly image from the GreenData personal account was successful, but the build did not appear in the \"TestFlight\" section of the Apple App Store Connect website, it is recommended to check incoming email messages from Apple, and also double-check that the icons added to the personal account do not contain transparent layers.\nIf there have been no messages from Apple and the images do not contain transparent layers, contact the\nGreenData support\n.\nTo test the version, click\nnext to the \"Internal testing\" item before publishing.\nIn the window that opens, click\nnext to \"Testers\".\nNext, specify the testers who are supposed to test the app internally and send them invitations by clicking \"Add\". After confirming the invitation, the testers will have access to testing the build.\nThe testers must have the TestFlight app installed on the testing mobile devices intended.\nIf the necessary testers are not in the list of testers, add them to the \"Users and Access\" section in the Apple App Store Connect. For testers, the \"Developer\" and the \"Reports\" roles will be enough.\nPublishing an app in the App Store\nAfter testing the application or immediately after uploading it (and testing is nor required), the app can be published in the App Store for public access.\nTo do this, on the appn page in the Apple App Store Connect, go to the \"Distribution\" tab, select the desired build number in the \"Build\" section, double-check all data before sending and click on the \"Done\", then on the \"Submit for Review\", then in the window that opens click on the \"Send for App review\".\nNext, the app is sent for review by Apple.\nFor new mobile apps hosted on the App Store, the review process of the first version usually takes no more than 12 hours.\nEach app update also goes through a review process, which usually takes no more than 24 hours. This is important to consider when planning the release dates.\nIf problems are found, the moderators leave their comments in the \"App Review\" section or send them to an email from the Apple ID specified during registration in the Apple Developer account. To successfully pass the review, fix the problems specified in comments, create a new build of the app (if necessary) and re-submit it for review.\nContact the\nGreenData Support\nin case requested changes cannot be done.\nApp Updates\nIn the future, to update the app, first create a new version by clicking\nnext to the \"iOS App\" in the \"Distribution\" tab on the app page. The version number is indicated according to the\nuploaded via the GreenData\npersonal account.\nAdditionally, \"What’s new in this version?\" field will appear that is required to be filled in. In this field, it is required to specify the main new features, fixes, or text expressing generalized gratitude to users, thanks to which it was possible to identify and improve the stability of the app.\nIn the \"Build\" section below, select the build to update, and then click \"Done\" again. Then click \"Submit for Review\" and \"Submit for Review\" again in a new window.\nApple-verified apps and updates appear in the App Store within 24 hours.",
  "source": "https://docs.greendata.ru/platform/en/upload-app-in-app-store.html"
}