{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.431.2 of September 27, 2024\nNew features\nThe setup options for\nstart pages\nwere expanded.\n1. It is now possible to create a two-way connection between object attributes in different object types to establish a \"one-to-one\" connection.\n2. As a result of updates, recalculating attribute values via\nexpression or autocalculation\nfor all object type instances is done without considering settings selected in the \"Automatic expression recalculation\" field. Recalculation of system expressions is also available.\n1. When working with the\n\"Kanban Board\" dashboard\n, task profile display settings became more flexible, including enhanced attribute display options and improved filtering.\n2. It is now possible to display analytical dashboard panels such as\n\"Table\"\n,\n\"Structural diagram\"\n,\n\"Dynamics chart\"\n,\n\"Line chart\"\n,\n\"Custom chart\"\nand \"Object profile\" without background or borders.\nThe process of configuring\nFinancial statements widget\nwas simplified, now the reporting date range for generating the table can be set automatically.\nIt is now possible to view the data of deleted objects in action audit.\nThe possibility to configure the display of additional task attributes according to the target platform (mobile app or web version) was added.\nThe process of saving objects in algorithms executed on the business process route was optimized. Now only the attribute values used in the algorithm code are sent for saving, not the entire object.\nViewing registries for object types whose instances are metadata is now regulated by a specific\npermission\n.\nIt is now possible to lock a part of the document text to make changes.\nAccess to object attribute values for users having no specific permissions is now regulated based on the configured\naccess mode settings\n.\ngreendata-core:\nrestrictions:\nobj-attr-access-mode:\nstrict\nyaml\nCopied!\nThe display of\nvisuals by algorithm\nis now available in the mobile application.\nChanges and improvements\nThe uniqueness check for creating a unique key was improved;\nThe System stability when attempting to open an empty file was enhanced;\nIn the multi-selection registry, in the edit mode, the stability of saving logical attribute values was improved;\nThe stability of string filters when opening the registry in a modal window was improved;\nDisplay of data in the registry as a result of filtering and when switching read/edit modes was stabilized;\nThe date filtering in the\ntile registry\nwas stabilized;\nThe adjustment of column widths when working with registries was stabilized;\nData merging in the virtual column of the registry was improved;\nThe performance when working with the registry in the edit mode and when configuring buttons in the registry control panel was optimized;\nVerification of permissions to edit boolean attributes in the registry editing mode was stabilized;\nObject display when working with\n\"Object List General\" widget\nwas stabilized;\nVisualization of\n\"Reactions and comments to the object\" widget\nwas optimized and the hint for working with\n\"Financial statements\" widget\nwas improved.\nThe display of the\n\"Employee information\" widget\nwas improved;\nThe counter display in the\n\"Tabs management\" widget\nwas debugged;\nThe display of the\n\"File hierarchy\"\nwidget in the snapshot mode in the business process task profile was stabilized;\nThe stability of column display in the\n\"Table\" dashboard\nwhen exporting to Excel was improved;\nThe process of creating an object via\ncustom action (via a button)\nwas debugged;\nThe business process scheme configuration was optimized;\nThe process of clearing all business process routes was debugged;\nThe stability of business process signals was improved;\nThe calculation in days for the\n\"Relative Time Timer\" type\nin the business processes was stabilized;\nFor the\ndelete\nfunction, the ability to delete an object using the\ngetObject\nfunction was finalized;\nThe performance of the\ngetPlainObject\nfunction was improved;\nPossibility of transferring a variable as an argument to the function\nattrOldValue\nwas improved;\nThe operation of the\nattr\nfunction for boolean attributes was stabilized;\nThe access matrix functionality and the ability to add an access group in it was stabilized;\nThe dynamic structure parsing process using the \"XML Parsing\" ETL transformer was optimized;\nThe process of transferring updates via guf-files was stabilized. In particular, an object that has a frame with selected attribute values on its visual, custom actions in registry settings, and customization of control panel buttons in the registry.\nThe ability to customize\nnotification template\nwas stabilized;\nHiding confidential information provided in logs is now configurable using\nconfiguration file\nof the logging system;\nIn the EDoc module, the display of a text attribute with the \"Rich Text\" visual format in print form was optimized for working with bookmarks in the review mode, and during document export;\nIn the EDoc module, percentage values are now displayed correctly when exporting a document in the version comparison mode;\nIn the EDoc module, the grouping of the list by instances of nested templates in printed forms was improved;\nSaving the name of a previously created\ncall room\nwas stabilized;\nAbility to filter data in the registry was stabilized.\nAccess permissions for working with the task were stabilized.\nDisplaying of the updated list of active tasks when attempting to delete a business process step was improved.\nWorking with audit was optimized, now the administrator authentication process required for various server processes is recorded in the change audit only when the application starts.\nIn the GreenData mobile app, the business process task profile was debugged for configuring additional attributes for transition options. The display of names in the light registry was also stabilized;\nVisual of the \"Relation of the document paragraphs and approving groups\"[RF_PAR_CONFORM_GROUP] type was adjusted.\nTo ensure proper operation of full-text search mode in light and flat registries, postgresql extension “pg_trgm” was added to the System, and missing indexes “sys_au_session” were created.",
  "source": "https://docs.greendata.ru/platform/en/LTS.431.2-latest.html"
}