{
  "title": "ДО. Сервис. Создание дочернего объекта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДО. Сервис. Создание дочернего объекта\nКогда бизнес-процесс предполагает автоматическое создание дочернего объекта, необходимо настроить сервисное действие. Например, предполагается автоматическое создание объекта \"Заключение о целесообразности оформления имущества в кредит\" в ходе рассмотрения Заявки на принятие решения.\nЧтобы автоматизировать создание дочерних объектов в Системе, на бизнес-процессе необходимо настроить\nсервисную задачу\n\"Создание дочернего объекта\".\nДля этого необходимо:\n1. Вынести\nэлемент потока \"Действие\"\nв рабочую область (подробнее,\n\"Настройка схем бизнес-процессов\"\n).\n2. Указать тип элемента:\nсервисная задача (Service Task)\n.\n3. Выбрать расширение \"ДО. Сервис. Создание дочернего объекта\".\n4. Заполнить параметры настройки выбранного расширения:\nПараметр\nНазначение\nТип дочернего объекта\nОпределение типа дочернего объекта, создание которого настраивается.\nВыполнять копирование атрибутов в созданный объект\nЛогический атрибут, определяющий возможность копирования атрибутов в создаваемый объект.\nСвязывать созданный объект с маршрутным объектом\nЛогический атрибут, определяющий связь между созданным и маршрутным объектами.\nОпределить объект-источник алгоритмически\nПризнак, устанавливающий способ определения объекта-источника. При активном переключателе объект-источник определяется с помощью алгоритма, при неактивном – посредством выбора типа объекта.\nПараметр доступен при неактивном переключателе \"Связывать созданный объект с маршрутным объектом\".\nАлгоритм для определения объекта\nВыбор алгоритма для определения объекта,\nиз\nкоторого будут копироваться данные.\nПоле доступно при активном переключателе \"Определить объект-источник алгоритмически\".\nОбъект-источник данных\nВыбор типа объектов в качестве источника данных.\nВыбор осуществляется посредством выпадающего списка из всех объектов Системы.\nПоле доступно при неактивном переключателе \"Определить объект-источник алгоритмически\".\nАтрибут дочернего объекта для связи с родительским объектом\nВыбор типа, атрибут которого будет выбран для связи с родительским объектом.\nНабор атрибутов для копирования\nВыбор набора атрибутов для копирования, сформированного ранее. Набор атрибутов для копирования определяется\nтипом объектов \"Копирование атрибутов. Набор\"\n[SYS_COPY].\nПодробнее про\nалгоритмы\nи\nих создание\n.\n5. Сохранить внесенные изменения, нажав\nили\nТаким образом, создание дочернего объекта \"Технические места\" выполняется автоматически в ходе бизнес процесса.",
  "source": "https://docs.greendata.ru/platform/ru/wf-service-creating-child-object.html"
}