{
  "title": "Login page constructor",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nLogin page constructor\nLogin page\nis the first page that users encounter when logging in to the System. This page is required to enter data, which is then checked by the System to identify the registered user and provide the access to the platform.\nThe GreenData platform provides tools to create a custom Login page according to the needs of the user or business idea of the project.\nThe login page constructor is available to the user with\npermissions\nto the corresponding menu item.\nExample of a custom Login page:\nSettings\nThe settings are accessed by sequentially selecting the following items in the\nuser profile menu\n: Application Management → Login Page Constructor.\nAfter clicking the\nLogin page constructor\nmenu item, the workspace for editing the current authorization page opens in the profile menu.\nMost of the workspace is occupied by the Login page view with a panel containing several tabs on the right side of the page. The tab contains configuration options or groups of configuration options.\nThe registration page can also be customized. The option is available in the corresponding tab after enabling the\n\"Registration\"\nsetting.\nThe settings are placed on the right side of the panel:\nposition on the page\n;\nbackground and borders\n;\ncomponents\n;\nauthorization\n;\nregistration\n;\npassword change\n;\npassword recovery\n;\ncustom template\n.\nThe configuration of elements in \"Position on the page\", \"Background and borders\" and \"Components\" tabs are the same for Login and Authorization pages.\nSaving edits made when configuring the login page constructor is done by clicking\nlocated in the lower right corner of the panel.\nLet’s take a look at specifics of each setting of the authorization and registration pages.\nPosition on the page\nThis tab includes settings that allow the user to select the location and size of the Login window.\nTwo settings are responsible for the position of the Login window on the page:\nhorizontally (left, center, right);\nvertically (top, center, bottom).\nThe size of the Login window can be configured using the following settings:\nSetting\nPurpose\nWindow width, px.\nA field that takes values from\n440\n(default value) to\n1000\npixels.\nFull screen width\nA switch that (after activation) stretches the Login window to the width of the screen.\nWindow height, px.\nA field that takes values up to\n600\npixels. The minimum value depends on the filling of the window.\nFull screen height\nA switch that (after activation) stretches the Login window to the height of the screen.\nBackground and borders\nAt this stage, the user can customize the background of the page and the background of the Login window.\nPage background\nThe user can upload an image to set it as the background of the Login page. If the image wasn’t uploaded before, then the \"Upload\" button would be displayed in the constructor.\nIf the image was previously uploaded, the selected file would be displayed in the constructor. \"Delete\" and \"Edit\" buttons appear after pointing your mouse cursor at the file name.\nLogin window background\nAfter clicking \"Background color and Opacity\", a color picker appears, where you can either select a color or enter its name in HEX and RGBA formats. The opacity is adjusted using a slider.\nThe \"no color\" option returns the default color of the Login window.\n[NOTE]\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, changing the logo is not available.\nComponents\nThis section contains configuration options of various elements that populate the Login window.\nSubtitle\nThis group of settings allows the user to customize the text and the location of the title in the Login window.\nThe necessary configuration is carried out through the following panel elements:\nSetting\nPurpose\nText title\nEntering the title name.\nClicking on\nin the \"Text title\" line opens a modal window for localization settings.\nFont\nSelecting a font from the drop-down list.\nClear Sans is the default font.\nSize\nEnter a value to specify the text size. It can take values from\n16\nto\n32\npixels.\nColor text\nAfter clicking \"Color text\", a color picker appears, where you can either select a color or enter its name in HEX and RGBA formats.\nAligning\nDetermining the Title position (left, middle, right).\nFont typeface\nSelecting the font appearance. Typefaces used:\nLogo\nA group of setting options in the \"Logo\" tab allows the user to upload an image for the logo and select its position on the Login window.\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, changing the logo is not available.\nThe logo display is configured using the following panel elements\nSetting\nPurpose\nImage\nIf there’s no previously uploaded image, you can add it by clicking \"Upload\". The image replaces the button after being uploaded. \"Delete\" and \"Edit\" buttons appear after pointing your mouse cursor at the image.\nTo scale, %\nThe \"To scale, %\" field allows you to change the scale of the image (the percentage is calculated from the original image size in pixels) and can take values from\n5\nto\n300\n.\nAt the same time, a block of\n132\nby\n70\npixels is provided for the logo, so the edges of the larger image are cut off.\nImage stretching\nImage stretching allows you to set the maximum size of the file by one or two parameters, ignoring its original size.\nThis option is controlled by two checkboxes:\nStretch to the width;\nStretch to height.\n\"To scale, %\" parameter is blocked when\nat least one\nof the checkboxes is checked.\nAligning\nThe uploaded image can be aligned by:\nLeft;\nCenter;\nRight.\nDefault alignment is set to the left edge.\nInput fields\nThe user can select the style input fields. There are 3 field styles:\nThis group of setting options is similar to the group of the \"Title\" element, which parameters are described above.\nPosition\nThis options allows you to select the location of the contents of the page relative to the Login window:\nSet to the upper border;\nPlace in the center;\nSet to the lower border.\nBy default, the contents of the page are placed in the center.\nThe position changes for all the contents of the page, the distance between the elements remains fixed and cannot be changed.\nTitles and buttons\nThe sections\n\"Authorization\"\n,\n\"Registration\"\n,\n\"Password Change\"\nand\n\"Password Recovery\"\n, which will be discussed later, contain the subsections \"Header\" and \"Button\".\nThe style of headers and buttons is the same for all custom pages, it means that all the parameters of the \"Title\" and \"Button\" subsections, except for the text of the titles and button names, are interconnected.\nFor example, when changing the color of the authorization button, the setting will be automatically applied to the buttons on the registration, password change and recovery pages.\nTitle\nThe \"Title\" subsection contain the following settings:\nSetting\nPurpose\nText title\nDepending on the custom page, the name and value of the parameter will be different, for more information, see the custom page settings section.\nClicking on\nin the \"Text title\" line opens a modal window for localization settings.\nFont\nSelecting a font from the drop-down list.\nClear Sans is the default font.\nSize\nEnter a value to specify the text size. It can take values from\n16\nto\n32\npixels.\nColor text\nAfter clicking \"Color text\", a color picker appears, where you can either select a color or enter its name in HEX and RGBA formats.\nAligning\nDetermining the Title position (left, middle, right).\nFont typeface\nSelecting the font appearance. Typefaces used:\nButton\nThis set of options is intended for customization of the \"Login\" button which is used for accessing the System.\nThe necessary configuration is carried out through the following panel elements:\nSetting\nPurpose\n\"Login\" button text\nDepending on the custom page, the name and value of the parameter will be different, for more information, see the custom page settings section.\nText for the button used by users \"Login\" button text\nClicking on\nin the \"Login\" button text\" field opens a modal window for localization.\nFont\nSelecting a font from the drop-down list.\nClear Sans is the default font.\nSize\nEntering a value to specify the size of the button text (depending on the size of the text, the size of the button also changes). The \"Size\" field can take values from\n12\nto\n24\npixels.\nColor button\nAfter clicking \"Color button\", a color picker appears, where you can either select a color or enter its name in HEX and RGBA formats.\nColor text\nAfter clicking \"Color text\", a color picker appears, where you can either select a color or enter its name in HEX and RGBA formats.\nRounding of corners (px)\nThe field where you need to specify the shape of the corners of the button. The field can take values from\n0\nto\n100\npixels.\nAligning\nSpecifying the position of the button in the authorization window (left, right).\nFont typeface\nSelecting the font appearance. Typefaces used:\n+\nAuthorization\nIn the \"Authorization\" tab, the user configures the System authorization method.\nThe tab consists of three subsections:\nAuthorization method\nThe settings in this subsection determine the authorization in the application methods.\nThe tab contains a setting option “Username first, then password”, which affects the location of the login and password input fields:\nif disabled, the fields are located in the same window;\nif enabled, the fields are located in different windows, the transition between them is carried out using the “Next” and “Back” buttons.\nBy default, the switch “Username first, then password” is enabled.\nDisplaying the login to the application by domain login using the \"Use domain login\" switch:\nwhen the switch is active, a field for the \"Use domain login\" is displayed in the authorization window;\nwhen the switch is inactive, this authorization option is not available.\nTo enable the option requires settings in the application configuration file, more details in\narticle\n.\nThe ability to log in to the application without pre-registration is controlled by the “Anonymous login” switch:\nif the switch is active, the “Continue without account” element will be displayed in the authorization window, by clicking on it it is possible to log in to the application as\nanonymous user\n;\nwhen the switch is inactive, anonymous login is not possible.\nThis setting synchronizes with\n“Anonymous login” system setting\n.\nTitle\nIn addition to the\npreviously\nshown set of parameters, this subsection contains the parameter \"Authorization header text\". This parameter is used to set the name of the header on the authorization page.\nButton\nIn this section, the display of the “Login” button used by the user to log in.\nIn addition to the set of parameters discussed\nearlier\n, this subsection contains the parameter \"Login button text\". The setting configures the name of the \"Login\" button.\nRegistration\nThis section is intended to provide the user with the opportunity to go through the registration process in the application independently.\nIf the \"Registration is available\" switch is active, the footer field containing a link to go to the registration window will be displayed in the authorization page view.\nA footer is an area located at the bottom of the page.\nWhen this setting is enabled, a representation of the registration page will be displayed in the working area of the screen (an automatic transition to the \"Registration Page\" tab will occur). At the same time, the following group of settings will be displayed in the \"Registration\" section in the sidebar:\nWhen activating \"The registration is available\" option, a warning will appear asking to get familiar and give consent for the processing of personal data.\nfor SaaS-application:\nfor On-Premise solution:\nThe processing of personal data is configured in the section with the same name, for more details follow the\nlink\n.\nThe registration section provides the following settings:\nRegistration method\nSelecting a registration method determines the way to confirm account data.\nBy activating the checkbox, you can specify one of the registration methods: SMS/E-mail, or provide the user with both methods for independent selection.\nYou must select at least one registration method.\nSMS setting\nThe \"SMS setting\" subsection is available when the\nregistration method\nby SMS is active.\nIn this case, the setting is done according to the following parameters:\nSetting\nPurpose\nMask for entering phone number\nWhen active, a mask is applied to enter the phone number.\nBy default the switch is in the active position.\nSMS verification method\nSelecting a verification method by SMS. Available options:\nETL run - generating a verification code and sending a message via a configured SMS service.\nETL object to run\nSelecting an ETL process integrated with an SMS sending service.\nAn ETL process is selected from instances of the \"ETL Object\" type, for which the \"ETL. Sending SMS\" type is selected as the value of the \"Start object type\" attribute.\nThe selected ETL receives a phone number as input data (string parameter) taking into account the mask and a text message with a verification code, after which it transmits the data to the integrated service to send an SMS message.\nThe parameter is displayed when the SMS verification method is defined as \"ETL run\".\nNumber of attempts\nLimiting the number of repeated requests from user. If set to 0, repeated checks will be prohibited.\nThe default value is 1.\nTime to retry, sec\nThe waiting time before re-sending the verification code by SMS, indicated in seconds. The minimum possible value is 10.\nThe parameter is not available if the value for the \"Number of attempts\" is set to 0.\nThe default value is 60.\nExample of setting up an ETL process for registration by phone number\nTo set up an ETL, perform a number of steps as shown below.\n1. Creating an ETL object\nCreate an instance in the registry of the \"ETL object\" type, specify its name and identifier.\nSelect \"ETL. Sending SMS\" as the value of the \"Start object type\" attribute\n.\n\"ETL. Sending SMS\" is an object type in the registry of which an instance is automatically created during user self-registration. The telephone number specified by user is stored in the “Phone” attribute, and the value of the “Text” attribute is set to a text message with a confirmation code generated by System.\nThe phone number as a string parameter (with a mask and a text message containing a verification code) will be the input data for the custom ETL process.\n2. Setting up an ETL schema\nOnce the object is created, you need to proceed to\nSetting up an ETL schema\nby clicking on the button of the same name in the profile control panel.\nAdd two stages and a final activity to the ETL schema:\n“External service” source type – for sending a registration SMS message via an SMS service;\nTransformer – to record the status of sending an SMS message.\nIn the ETL process schema for registration by phone number, it is enough to place only the stage for setting up integration with an SMS service. But to track the sending status, it is recommended to add and configure the stage for tracking the sending status.\n2.1. Setting up integration with an SMS service\nFirst of all, select a suitable SMS service, where you should register and receive an api_id (token).\nAfter reading the service documentation, copy an example request to configure the URL and an example response to form a dynamic structure.\nNext, configure the \"External service\" source type:\nIn the current example:\nThe request and response formats are in JSON.\nThe value of the HTTP method is the GET method.\nThe URL is formed based on a service request example. If necessary, substitution parameters are added.\nIn the given example, four dynamic parameters {message}, {to}, {username} and {key} are inserted. They must be added on the \"Query parameter\" tab:\nThe identifiers of the added parameters must be identical to those used in the URL.\nWhere:\nthe algorithm for the {message} parameter must return a message text with a confirmation code that should be sent in an SMS, therefore \"ETL. Sending SMS\" is selected as the basic object type, and in the algorithm code, the\nattr\nfunction inserts the \"Text\" attribute.\nthe algorithm for the {to} parameter must return the user’s phone number to which the SMS message should be sent, so \"ETL. Sending SMS\" is selected as the basic object type, and in the algorithm code, the\nattr\nfunction inserts the \"Telephone\" attribute;\nthe algorithm for the {username} parameter must return the API username (it is recommended to add it to the System via a secret variable, then the algorithm will take the form:\nthe algorithm for the {key} parameter must return a key received after registration in the SMS service (it is recommended to add it to the System via a secret variable, then the algorithm will take the form:\n6.\tAn example of an SMS service response is inserted into the \"WSDL/JSON\" field, basing on which, after saving the profile, a dynamic structure is automatically formed in the \"Structure of the outputs\" parameter.\n2.2. Tracking the sending status\nTo save the SMS sending status, go to the transformer settings.\nOn the \"Additional\" tab, add a data transformer of \"ETL. Data transformer. Changing an object instance\" type and specify the following parameters:\nUsing this transformer, the message sending status received from the external service will be stored in the “Answer from external service” attribute of the “ETL. Sending SMS” type instance.\nE-mail settings\nThe “E-mail settings” subsection is available in the settings group when\nregistration method\nby E-mail is active and provides an opportunity to configure the e-mail address that will be used to send messages when a user registers in the application.\nThe subsection provides the list of previously configured\ne-mail accounts\nwith the possibility to select e-mail for mailing.\nTo edit an existing account click on\n, to create a new one click on\n, then the following parameters are configured:\nSetting\nPurpose\nMail service\nSpecifying of mail service. Possible values:\nYandex;\nMail.ru;\nGmail.\nInstruction\nContinue to the instructions for setting up the mail service.\nWhen you select a mail service, a link to the corresponding instruction will be displayed.\nEmail address\nThe email address from which messages are sent.\nApplication password\nThe password to grant access to external applications.\nThis password must be previously created in the settings of the selected mail service in the “Security” section.\nSwitching to advanced settings\nemail account\n.\nWhen adding a new account, an instance of the “E-mail account” [SYS_MAIL_ACCOUNT] type will be created, where the “Host”, “Port” and “Protocol” fields in the “Send” block will be filled in automatically according to the specified provider.\nIn this case, the value of the “Password” parameter is added to the System via\nsecret variable\n.\nButton is available after saving the account settings.\nProfile settings\nIn the \"Profile Settings\" section, the parameters for configuring user registration will be displayed, including:\ngranting the right to choose a profile;\nlist of available profiles for registration;\nability to create a new profile.\nSwitching the \"User can select profile\" switch to the active position allows the user to select a profile from the presented list.\nToggling the \"The user can select a profile\" switch to the active position will allow the user to select a profile from the drop-down list.\nIf the switch is in inactive position, default settings will be used during user registration.\nThe \"Default\" settings of the profile are as follows:\nThe creation of a new profile is carried out by\n, after clicking on it, the following settings will appear:\nSetting\nPurpose\nProfile name\nEntering the name of the user profile.\nDirectory for employee\nSelecting an instance of the \"\nEmployee directory\n\" object type [SYS_EMPLOYEE] or the type inherited from it.\nEmployee unit\nSelecting an instance of the \"Subdivision\" object type [SYS_ORG_STR] or the type inherited from it.\nAccess Groups\nSelecting an instance of the \"\n\"Access group\"\nobject type [SYS_SEC_GROUP].\nMultiple values can be selected.\nFill in all of them.\nClick \"Ok\" to save the configured profile. If you made changes to the presented settings but clicked \"Cancel\", the System will notify you:\nTo return to unsaved settings, click on the “Cancel” button; to exit the profile editing mode without saving, click on the “Yes, do not save” button.\nTo view or change the settings of an existing profile, double-click on the profile name.\nTo replace the default profile, check the box next to the selected profile.\nAfter saving the settings, the user will be able to register in the application by clicking on the link in the footer field on the authorization page.\nPersonal data processing\nIn this subsection it is possible to add a document with personal data processing during registration.\nThe following parameters are used when setting up:\nSetting\nPurpose\nAgreement file\nList of files with conditions for personal data processing.\nThe file is replaced by clicking on the edit icon, after which a modal window will open for selecting the required document on the business analyst’s personal device.\nBy default agreement templates are attached.\nMain text\nText displayed on the registration page if registration is confirmed by SMS.\nThe default value is \"I agree to the Terms and Conditions\"\n.\nLink text\nText of the link that, when clicked, will download the agreement file.\nThe default value is “of processing my personal data”\n.\nLink color\nColor of the link that, when clicked, will download the agreement file.\nThe description of other settings is similar to those given\nearlier\n.\nTitle\nIn addition to the set of parameters considered by\npreviously\n, this subsection of the \"Registration\" section contains the \"Registration header text\" parameter. This parameter is used to set the header name on the registration page.\nButton\nIn this section, the display of the “Registration” button is configured, which is used by the user during self-registration.\nIn addition to the set of parameters discussed\npreviously\n, this subsection contains the “Registration” button text” parameter. With this parameter, you can specify the name of the button used to complete registration in the System.\nWhen registering independently, according to the\nregistration method\nprovided, the new user must enter an e-mail/phone number and his new password twice in the appropriate fields and click on the “Sign up” button.\nThe password should meet at least three of the four conditions listed below:\nThe password must contain at least 8 characters.\nThe password must contain at least 1 uppercase character.\nThe password must contain at least 1 lowercase character.\nThe password must contain at least 8 characters.\nThe password must match the input mask specified in the settings of the current\nsecurity policy\n.\nTo register by SMS, confirm your consent to the\nprocessing of personal data\n.\nIf there is a field to select a\nprofile\n, the user can replace the default value with a profile available in the list.\nWhen registering by SMS, a registration code will be sent to the specified phone number, which must be entered in the appropriate field of the page that opens, and then click on the confirmation button.\nA repeated request for confirmation code is available following the\n\"Number of attempts\" and \"Time to retry, sec\"\nparameters.\nWhen registering by e-mail, an e-mail will be sent to the specified e-mail address containing a link to confirm your registration. To complete registration, follow the link.\nAfter successful registration, the app\nstart page\nwill open.\nFor the further authorization in the application, use the phone number/e-mail specified during registration. It can be changed in the User profile (see\nhere\n).\nAfter registering a user in the application, an instance of the “Employee” type is created (or a type inherited from it and specified when\nsetting up the profile\nin the “Employee Reference” field). Where:\nwhen registering by e-mail, the email address entered by the user during registration will be saved in the \"E-MAIL\" [EMAIL] attribute;\nwhen registering by SMS, the telephone number entered by the user is stored in the “Phone” attribute [PHONE];\nthe value of the \"Employee Unit\" attribute [EMP_ORG_ID] is set to the value of the \"Employee Unit\" profile parameter.\nA new instance will appear in the\nUser\nobject type [SYS_USER], where:\nthe \"Employee\" attribute (EMP_ID) will be set to the value created in the \"Employee Reference\" type of the employee;\nthe password entered during registration is recorded in the corresponding attributes of the user-defined and string-type password (PWD, CHANGE_PWD).\nExternal identity providers\nDisplays OAuth 2.0 application login, which is accomplished by moving the SSO Login switch to the active position.\nTo authorize in the application using OAuth 2.0 protocol it is necessary to make settings in the configuration file of the application, more details can be found in the\ninstructions\n.\nAfter activating the switch, the “Setting text” field will become available, through which the text of the link displayed in the authorization window is set.\nThe default value is “Login via SSO”.\nPassword change\nThe section provides options for configuring the password change page and contains two subsections:\nTitle\nIn addition to the set of parameters discussed earlier, this subsection contains the \"Header text when changing the password\" parameter. This parameter is used to set the name of the header on the password change page.\nButton\nIn this section, the display of the button on the password change page is configured.\nIn addition to the set of parameters discussed earlier, this subsection contains the parameter \"The text of the button when changing the password\". Using this parameter, the name of the button used by the user to save changes when updating the password is set.\nPassword recovery\nTo grant the user the right to restore the password, it is necessary to switch the \"Password recovery is available\" switch to the active position in this section.\nAfter that, the following settings will be displayed in the sidebar:\nTitle\nIn addition to the set of parameters considered by\npreviously\n, this subsection of the \"Password Recovery\" section contains the following settings:\nSetting\nPurpose\nHeader text when entering the e-mail\nEntering the header name for the page where the e-mail profile of the user who forgot the password is entered\nHeader text when confirming the e-mail\nEnter the header name on the page to confirm the email address.\nHeader text when changing the password\nEntering the header name for the page for entering a new password to the profile whose e-mail was specified earlier to restore access.\nButton\nIn this section, the display of buttons on password recovery pages is configured.\nSetting\nPurpose\nHeader text for the button when entering the e-mail\nEnter the name of the button on the e-mail entry page.\nButton text when confirming the password\nEnter the name of the button on the email address confirmation page.\nButton text when changing the password\nEnter the name of the button to save the changed password.\nViews of the configured password recovery pages are available on the sub-tabs:\n\"Enter e-mail\";\n\"Confirm e-mail\";\n\"Password change\".\nCustom Template\nIn this section, you can upload a zip archive file containing folders with html files. This way, you can customize the login page using html code and go beyond the capabilities provided by the constructor.\nIn the\nSaaS environment\n, when using the\nCommunity Edition\nlicense, uploading a custom template is not available.\nThe restrictions applied to the uploaded file are adjusted using\napplication configuration file\n.",
  "source": "https://docs.greendata.ru/platform/en/login-page-constructor.html"
}