{
  "title": "Анализ эффективных прав",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАнализ эффективных прав\nЭффективные права — это итоговый набор привилегий субъекта безопасности (пользователя или группы доступа), который складывается из:\nпрямо назначенных\nправ доступа\nсубъекту безопасности, настроенных для типа объекта и экземпляров типа;\nправ, унаследованных от групп доступа, в которые входит субъект безопасности;\nвида контроля прав\n, настроенного для типа объекта.\nРасчет эффективных прав может осуществляться как по конкретному объекту Системы, так и по субъекту безопасности.\nДля расчета эффективных прав необходимо последовательно выбрать пункты главного меню:\nАдминистрирование → Управление доступом → Анализ прав доступа → Анализ прав по объекту/субъекту\n.\nВ открывшемся реестре \"Анализ эффективных прав по объекту/субъекту\" необходимо создать экземпляр нажатием на кнопку\nв панели управления и указать параметры расчета.\nАнализ прав по объекту\nВ первую очередь в блоке \"Параметры\" необходимо определить критерии расчета:\nПараметр\nНазначение\nНаименование\nВвод наименования расчета. Наименование может быть сформировано автоматически.\nОбъект\nОпределение объекта Системы, эффективные права на который необходимо рассчитать.\nАнализ только по группам доступа\nЛогический признак для определения списка субъектов безопасности, эффективные права которых необходимо рассчитать.\nПри активном признаке в результате анализа будут отображены права только по группам доступа, иначе по всем субъектам безопасности.\nДля запуска расчета необходимо в блоке \"Экземпляры\" нажать на кнопку\n, в результате чего будет создан новый экземпляр расчета. По завершении расчета статус сменится на \"Выполнен\", а в столбце \"Готовность\" отобразится значение \"100\".\nРезультаты расчета будут отображены в виде таблицы в расположенном ниже блоке \"Результат анализа эффективных прав по объекту\":\nСтроками таблицы являются субъекты безопасности, столбцами – все возможные\nпривилегии\n. На пересечении строк и столбцов отображается наличие прав доступа: \"Разрешено\" или \"Запрещено\".\nЭкспорт сформированной таблицы в формате *.xlsx доступен при нажатии на кнопку\n.\nАнализ прав по субъекту\nПрежде чем выполнить расчет эффективных прав, необходимо в блоке \"Параметры\" указать параметры расчета:\nПараметр\nНазначение\nНаименование\nВвод наименования расчета. Наименование может быть сформировано автоматически.\nСубъект\nОпределение субъекта безопасности (пользователя или группы доступа), эффективные права которого необходимо рассчитать.\nАнализ по типам и объектам\nЛогический признак для определения списка объектов, эффективные права на которые необходимо рассчитать.\nПри активном признаке в результате анализа будут отображены права не только по типам, но и по всем объектам этих типов.\nВид фильтрации\nОпределение вида фильтрации объектов для анализа. Возможные варианты:\nпо всем типам, кроме указанных – эффективные права субъектов безопасности будут рассчитаны по всем типам объектов Системы, кроме указанных в поле \"Типы\";\nпо выбранным типам – расчет будет проведен только по тем типам объектов, которые указаны в поле \"Типы\".\nТипы\nПеречень типов объектов, которые в зависимости от выбранного вида фильтрации будут либо включены в расчет, либо исключены из него.\nЗапуск расчета осуществляется нажатием на кнопку\nв блоке \"Экземпляры\" – во встроенном реестре будет создан новый экземпляр расчета. Когда расчет будет завершен, его статус сменится на \"Выполнен\", а в столбце \"Готовность\" отобразится значение \"100\".\nРезультаты расчета будут отображены в виде таблиц в расположенных ниже блоках \"Результат анализа эффективных прав по типам\" и \"Результат анализа эффективных прав по объектам\" (доступен при активном признаке \"Анализ по типам и объектам\"):\nСтроками таблиц являются типы/объекты Системы, столбцами – все возможные\nпривилегии\n. На пересечении строк и столбцов отображается наличие прав доступа: \"Разрешено\" или \"Запрещено\".\nКроме того, результат анализа по типам содержит следующую информацию:\nобщее количество объектов каждого типа;\nколичество объектов типа, доступных для чтения/редактирования/выполнения/удаления;\nлогический признак одинакового доступа ко всем экземплярам типа со значениями 1 (одинаковые права на все экземпляры типа) и 0 (различные права на экземпляры типа).\nЭкспорт сформированных таблиц в формате *.xlsx доступен при нажатии на кнопку\n.\nКнопка\nв блоке \"Экземпляры\" предназначена для перехода к настройке\nматрицы сопоставления прав\n.",
  "source": "https://docs.greendata.ru/platform/ru/effective_permissions_analysis.html"
}