{
  "title": "\"File list with Electronic Signature\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"File list with Electronic Signature\" widget\nThe\n\"File list with Electronic Signature\" widget\nallows displaying files (documents) that contain a signature (electronic signature, simple electronic signature) attached to the System object.\nExamples of a customized widget:\nTo create widget, go to the Widgets tab, select the \"File list with electronic signature\" element and drag it to the workspace. To configure the widget, fill in the parameters in the object profile.\nEach parameter has a corresponding value:\nSettings\nPurpose\nAttribute with files\nSelecting the attribute of the System object that stores the attached files.\nShow classifications\nSelecting the file classification to display (if necessary).\nTitle text\nEnter the title text of the file display area (if necessary).\nText of button \"Show all\"\nEnter the text of the displayed button name (if necessary).\nSignature type\nDetermining the signature type. Possible values:\n1. Electronic Signature;\n2. Simple Electronic Signature.\nVisibility. Users and groups. Electronic Signature\nDetermining the user group for which these files will be available.\nAction with Electronic Signature\nSelecting the action to be applied to the file.\nNext, configure the parameters that define the visual of the files.\nThe size of files uploaded to the System is limited. Find more details in the\narticle\n.\nSettings\nPurpose\nVisible items number\nDetermining the number of files displayed in the table.\nGroup files into classification folders\n1. Classification algorithm (returns a collection of classification IDs belonging to the main documents group);\n2. Sorting algorithm (returns a collection of classification IDs in sorted order).\nShow date column\nDisplaying a column with the file creation date (if necessary).\nShow classification column\nDisplaying a column with classification by folder. For example, System files, Other, etc. (if necessary).\nDefault way to open files (docx)\nChoosing the way to open the file. For example, \"Open in EDoc\", \"Preview\".\nWhen clicking on the corresponding buttons, actions that will be applied to the attached files are available.\nNext, consider the available functions:\n— copy element;\n— save visual settings;\n— reset registry settings and/or add/copy/delete file;\n— download files by pre-selecting the desired files;\n— attach files from the list;\n— customize the visual of files. The flat view does not take into account the structure, the hierarchical (nested) view displays files based on the nesting elements structure;\n— sign file with electronic signature;\n— sign file with simple electronic signature;\n— pre-select and download the file;\n— download all elements;\n— select previously downloaded files or files from the system and attach them;\n— select files from a personal computer and upload to the system;\n— select version ;\n— combine signatures into a single zip file;\n— download all files and all file signatures, all signatures of one file will be combined.",
  "source": "https://docs.greendata.ru/platform/en/file-list-with-electronic-signature-widget.html"
}