{
  "title": "Architecture of system objects",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nArchitecture of system objects\nThe data entered into the System is stored as a custom object model.\nThis System model describes the structure of objects, their properties, operators, and interactions with other objects.\nEach object of the System has its own set of properties (attributes) that distinguishes objects from each other.\nDestination\nObjects allow to implement and develop the functionality of the System in automation projects.\nRelated concepts\nSince the term\nobject\nis too broad a concept, there is a clarifying classification in the System that relies on related concepts:\nAttribute – a significant feature of an object;\nObject type – complete set of characteristics;\nInstance – a set of information about a specific entity;\nObject registry – a store of information of the same type.\nObjects architecture\nAttribute\nIt can sometimes be reffered to as\nCharacteristic\nand\nObject property\n.\nThe System allows a business analyst to modify the current attribute composition of the object type at any time.\nWhen configuring each attribute, a business analyst must specify its default value, whether it is obligatory to fill it in and other options.\nThe\nAttributes\narticle describes the process of configuring attributes in more detail.\nObject type\nMay alternatively be referred to as\nClass\nor less frequently\nObject prototype\n.\nThe System architecture allows to develop new or use existing (predefined) object types.\nThe business analyst must always follow the type hierarchy in case it is appropriate to create a new object type.\nWhen creating a new object type, the parent object type from which all the parent attributes will be inherited (adapted) must be selected.\nThe missing attributes can be individually added to the created object type.\nThe composition of object type attributes includes personalized and inherited attributes.\nAddress the article on\nCreating New Object Types\nfor more information.\nThe System has a list of standard object types (\nsystem classes\n) which cannot be edited. For the list of predefined types, see the article on\nSystem Classes\n. A\nprimitive object\nis a special object type, a structure designed to store a large amount of data and for integration. For more information, see the article on\nprimitive Objects\n.\nObject instance\nA separate object of the corresponding type, which can be alternatively named\nObject\n.\nInstance is created by the System when the object card is inserted and filled in with real data.\nInstances of objects are the items that users create and modify when working in the System.\nThe composition of the Object instance attributes is determined by the specific Object type.\nObject registry\nObject registry is designed for accumulation and long-term storage of data on all instances of a certain Object type.\nThe information can be entered and added manually or through programmed input.\nObject registry is required to perform statistical processing of Object instances.\nFor more information, see\nWorking with the object registry\n.\nPrinciples of working with objects\nThe business analyst performs direct actions with the elements of the structure, and users access the data through the visual of Objects.\nThe business analyst designs the necessary structure of the Object model, using predefined and creating new Object types.\nAt the same time, all the attributes of conceived information structure are configured.\nThe ability to work with Object instancies and Object registries is valuable for users interacting with the System. The appearance of objects containing user-entered data is pre-configured by the business analyst. A\nvisual\nis responsible for the objects' appearance. It can contain different set of attributes, grouping elements and design. For more information about view settings, see the article\nVisual\n.",
  "source": "https://docs.greendata.ru/platform/en/architecture-of-system-objects.html"
}