{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.472.10 of December 15, 2025\nNew Features\nThe visibility of\nmain menu items\ncan now be managed directly through the menu interface.\nThe metadata flag can now be overridden in the\nobject type\nsettings.\nFor the\nOn-Premise\nsolution the dictionary-based translation represented by the system object type is now available, and the translator is now selected through the\nsystem settings\n.\nOnly custom object types are now displayed by default in the “Object type” registry.\nThe pagination\nsettings\nof registries were expanded.\nThe settings for\nhiding system buttons in the modal window\nwere implemented.\nThe\ndebug mode\nwas implemented. It allows testing the chart construction based on the object data before integrating it into the object.\nThe ability to create backlog columns is now available on the\nKanban board\nof the extended version.\nAn ETL transformer for integration with large language models (LLM) through a configurable request was implemented.\nThe ability to manage access to a folder in the registry was added.\nThe\nintegration audit\nwith external systems was added. It allows tracking execution results of events.\nThe ability to\nset a row limit\nreturned by the data source when constructing the\nOLAP view\nwas added.\nA new mechanism for\nauthentication in Vault\nwas implemented.\nThe ability to export *.docx documents with embedded files as objects was added.\nThe interface of the electronic document now allows placing user-action buttons.\nChanges and Improvements\nThe loading of application pages in the\nSaaS solution\nwas optimized.\nWhen selecting an attribute for an\nexpression or autocalculation\n, the attributes already used in other expressions and autocalculations are now unavailable.\nThe process of deleting an instance whose type has a configured\nautocalculation\nwith a link to a child attribute was debugged.\nWhen creating an\nindex\nin an object type, selecting a\nchild\n, custom, or\nmultiselect attribute\nis now disallowed.\nThe data processing during object profile opening was optimized.\nThe ability to add instances through the action menu of an object attribute was restored.\nThe ability to set the table name of the\nobject type\nand the field name for the\nattribute\nby user was stabilized.\nThe display of the corresponding registry in the validation error modal window was debugged when creating an instance of other type that violates the uniqueness condition for a configured key.\nThe display of objects in a child attribute was debugged when changing an attribute with a configured\nOnChanged event\n.\nThe data processing during attribute validation checks was improved.\nThe expressions defining the names of the “Setting up search filters”, “Managing parameters”, and “Setting up to redirect according to the algorithm” types were corrected.\nThe instances of the type “Action relation to object type” were corrected for the “Find and attach”, “Attach files from PC”, and “Download all files with signatures” actions.\nThe identifier of the “Download all files with signatures” action was changed.\nThe header template for instances of the “Notification Template” type - “Start of the replacement. Notification for the replaced employee” was cleared.\nThe spelling of “AI Assistant” was corrected across all system components.\nThe “Override the action options” attribute group on the “Action relation to object type” type visual was localized.\nThe extension for the previously deleted attribute \"WF. Activity Flag\" [WPT_IS_ACTIVE] in the \"WF. Process task\" type was removed to stabilize the application startup and build the cache.\nThe process of adding existing object types to the\nsubject area\nwas improved.\nThe process of deleting an associative relation was improved.\nThe support for\nkeyboard shortcuts\nwas added.\nThe data loading when opening a registry was optimized.\nThe automatic update of instances with regard to filtering in the registry was improved.\nIn the editing settings of\nregistry columns\n, the “Editing in registry allowed” switch is now enabled by default.\nThe registry update was improved when a\nOnChanged event\ntriggers for a registry displayed on a visual through an\nobject attribute\n.\nThe ability to select a parent was added when creating a folder in the registry.\nThe saving of created nested folders in the “Custom filters” registry was improved.\nThe application of a configured styling algorithm for registries was debugged when switching registries.\nThe algorithms for MangoOffice were moved into a separate folder in the object profile algorithm registry.\nIn the\nregistry edit mode\n, the display of column filter buttons was stabilized when multiselect and grouping are enabled.\nThe placement of search filters in registries was stabilized.\nThe modal windows of various system modules were optimized.\nThe icons for system\nmain menu items\nwere replaced.\nThe display of the visual name of an instance after its modification was debugged.\nThe display of attribute contents of the\n“Text”\ntype with the “Text with complex formatting support” and “Multiline input” visuals is now limited to 4000 characters by default.\nThe display of objects in an attribute with the\n“Multiple objects as a table”\nvisual was stabilized.\nThe application of the layout settings for instances of object attributes with the\n“Selecting reference values as a button”\nvisual was debugged.\nThe operation with the\n“Multiple objects as a table (full list)”\nobject attribute visual was stabilized.\nThe\nstart pages\nin the base delivery were corrected.\nThe error notification was improved when attempting to save a\nuser\nwith a selected\nemployee\nalready linked to another user.\nThe application of the styling algorithm for registry cells with an\naggregated header\nwas stabilized.\nThe display of overridden modal window buttons was debugged.\nThe process of renaming\nattribute groups\n, including the use of keyboard shortcuts, was stabilized.\nThe display of the file attachment button according to the specified position in the\ncontainer\ncell was debugged.\nThe opening of the selected tab in a modal window was stabilized.\nThe duplicate of the “Tasks” main menu item was removed.\nThe visual of the “Security policy” [SYS_PASSWORD_POLICY] type was corrected.\nThe ability to scale the executor dropdown list in the\ntask registry\nwas added.\nThe display of the content of the\n\"Text\" widget\nand attributes of the\n\"Text\" type\nwith the \"Text with complex formatting support\" and \"Multiline input\" visuals was stabilized.\nThe settings of the\n“Employee information”\nwidget were improved: the ability to wrap text in displayed data names was added.\nThe functionality of the widget implemented in the\ndevelopment environment\nwas debugged.\nThe ability to recalculate values in the\n“Map point”\nwidget when changing the address using an algorithm was improved.\nThe ability to switch displayed registries when selecting child object types in the\n“Object registry”\nwidget was restored.\nThe operation of stage-visibility algorithms was restored when working with the\n\"Advanced status bar\"\nwidget.\nThe “Ok” button was replaced with “Complete task” for\nbusiness process\ntasks opened in a modal window.\nThe ability to edit subprocesses from the\nmain business process flowchart\nwas restored.\nThe transition to the next stage was debugged when completing a business process task using an algorithm.\nThe opening of completed business-process tasks was stabilized.\nThe ability to suspend the regulatory task deadline was debugged.\nThe display of the number of periods in the\nOLAP\nview was stabilized according to the configured settings.\nThe application of the formatting style and conditional formatting algorithm of a column in the\n“Table” analytical dashboard\nwas improved.\nThe chart construction time in the\ndashboard\nwas optimized.\nThe creation of tasks in the\n“Kanban Board” analytical dashboard\nwas stabilized.\nThe placement of stages and swimlanes in the group was stabilized in the\nextended Kanban board\nwhen the group is modified.\nThe display of the\n\"Table\" analytical dashboard\nwas debugged when sorting by aggregation fields was applied.\nThe execution of conditions in value aggregation algorithms was debugged.\nThe parameter requirements were reworked when configuring the\nmessenger\nfunction.\nThe support for using the Null value when adding a chart series in the\nuniversal chart\nconstruction algorithm was restored.\nThe assignment operator of the “searchOptions” variable in the\nobjectsWithOptions\nfunction call was fixed.\nA confirmation window for installing a ready-made solution from the\nMarketplace\nwas added.\nThe value selection during configuration of the\ncondition tree\nwas optimized.\nThe operation of\nsearch filters\nwas stabilized.\nThe operation of the search field when selecting an extension was debugged.\nThe operation of the search field was debugged when selecting an extension.\nThe operation of the SQL-based filter was stabilized when selecting an object through the popup dialog window.\nThe localization of the name and avatar display of the AI assistant in the chat was fixed.\nThe import of dates during the\nExcel object loading\nwas stabilized.\nThe size of image files uploaded into the system using cropping was optimized.\nThe\nUser blocking history\nnow includes data about activation periods, reasons, and blocking activity.\nThe login for\nuser authorization\ncan now be entered without case sensitivity.\nAccess to the registry and instances of the “User” type is now granted when the “Run”\npermission\nto “View Metadata” and/or “User Administration” is available.\nThe display of an error was added when the user lacks permission to view the classification while attempting to upload a file.\nThe access to the navigation window of a profile for a user without administrative permissions was stabilized.\nThe ability to log out from the application account is now available to all users.\nThe permissions of the “All Users” group were corrected to display the configured states of\nattribute groups\nand the visibility of\nmain menu items\n.\nThe\n“Search by GUID”\nwas improved.\nIn the case of an unsuccessful login, the user’s IP address is now displayed in the “Comment” field.\nThe ability to use templates from the Marketplace is now controlled only through configuration parameters in the\napplication configuration file\n.\nThe error displayed in the log in case of problems with the license file was corrected.\nThe export and import of the\nreporting form\nwere stabilized.\nThe permission check for viewing the computable indicator breakdown was corrected.\nThe settings of the Analysis of Financial and Economic Activity Module were modernized: the permissions, table names, field names for tables, identifiers, and action visuals for configuring TB and AC file recognition were corrected.\nThe TB file upload process was debugged.\nThe comparison of data in a new instance of an embedded template and the display of changes after updating values from sources were stabilized.\nThe color display of edits made by users working simultaneously with the document was improved.\nThe processing of styles of text inserted into the document was modernized.\nThe work with the document was optimized: the tools for commenting and selecting text fragments were improved.\nThe display of text in table cells was improved.\nThe loading and application of the specified formatting of the uploaded version from a file were stabilized.\nThe display of a bookmark in the document marked in the bookmark panel was synchronized.\nThe insertion of the paragraph sign and the preservation of table boundary positions when a page break occurs were improved.\nIn the version comparison mode, the link between a bookmark in the document and the survey sheet, and the transition to the object when clicking a bookmark not participating in comparison, were stabilized.\nThe opening of an uploaded file containing footnotes and a table with merged cells was debugged.\nThe ability to select the export file format when settings are applied was restored.\nThe copying of a fragment from a platform document with a specified number of spaces was improved.\nThe export of a document to the *.pdf format was debugged.\nThe synchronization of user and access-group data was improved.\nFor iOS-based devices:\nThe ability to exchange voice messages was implemented.\nThe camera operation during a call for Pro-series devices was fixed.\nThe stability of domain authorization was increased.\nThe display of the tile registry was improved.\nFor Android-based devices:\nThe session recovery and chat operations were accelerated.\nThe display of the name in the object profile was restored.\nThe deletion of objects from the child attribute registry was debugged.\nThe ability to place action buttons in one line was added.\nThe connection to a\nGreenData Meet\nmeeting is now available without application authorization.\nThe creation and connection to a meeting in\nGreenData Meet\nwas stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.472.10-latest.html"
}