{
  "title": "Профиль пользователя",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПрофиль пользователя\nПрофиль пользователя GreenData – единый аккаунт, при помощи которого пользователь получает доступ к\nличному кабинету SaaS\n(далее – ЛК), возможность авторизации в приложениях, созданных на платформе GreenData, право создания встреч в\nGreenData Meet\n, а также расширенные возможности на площадке\nМаркетплейса\n.\nДля создания профиля пользователя необходимо пройти\nпроцесс регистрации\n, во время которого пользователь принимает условия\nпользовательского соглашения\nи\nполитики конфиденциальности\n.\nВ случае обновления указанных документов для продолжения использования сервисов компании потребуется подтвердить согласие с новыми условиями.\nВ профиле пользователя:\nфиксируются данные пользователя, которые будут использоваться для отображения:\nвладельца/участника проекта как в собственном ЛК, так и в ЛК других пользователей при совместной работе над проектом;\nавтора оценки/отзыва к приобретенному продукту на площадке маркетплейса;\nпредоставляется возможность будущего размещения продукта на площадке маркетплейса от представителя юридического лица;\nуказываются данные о создателе продукта, размещающем приложение на площадке маркетплейса;\nдобавляются платежные реквизиты и подписывается агентский договор между создателем продукта и компанией GreenData для возможности размещения платного продукта на площадке маркетплейса;\nформируется отчетность по продажам платных продуктов пользователя.\nНастройка профиля пользователя\nНастройки профиля пользователя представлены в следующих разделах:\nУчетная запись\nРаздел содержит данные аккаунта пользователя, используемые при владении продуктом в ЛК, при размещении оценок, отзывов и публикации продуктов на площадке маркетплейса.\nПодробнее о параметрах учетной записи.\nПараметр\nНазначение\nУстановка фото профиля.\nОсновная информация\nТип пользователя\nОпределение типа пользователя, используемое для\nразмещения продуктов\nот частного лица. Возможное значение:\nФизическое лицо;\nСамозанятый.\nДля\nразмещения продуктов\nот частного лица допускается использование только одного типа пользователя.\nИмя\nВвод имени пользователя.\nПо умолчанию устанавливается значение, указанное при регистрации пользователя.\nФамилия\nВвод фамилии пользователя.\nПо умолчанию устанавливается значение, указанное при регистрации пользователя.\nОтчество\nВвод отчества пользователя.\nИНН\nИНН используется для идентификации физического лица или индивидуального предпринимателя при\nразмещении продуктов\n.\nПосле подписания\nагентского договора\nполе блокируется, в данном случае изменение ИНН возможно только при обращении в службу поддержки по адресу\nhelp@greendata.ru\n.\nПоле доступно после подтверждения E-mail, указанного при регистрации.\nСтрана\nСтрана регистрации пользователя. Выбор осуществляется из выпадающего списка.\nПлатное размещение продуктов доступно только резидентам РФ.\nПосле подписания\nагентского договора\nполе блокируется, в данном случае изменение Страны возможно только при обращении в службу поддержки по адресу\nhelp@greendata.ru\n.\nПо умолчанию устанавливается значение, указанное при регистрации пользователя.\nКонтактные данные\nТелефон\nВвод телефона пользователя.\nE-mail\nОтображение E-mail пользователя.\nЗамена E-mail доступна в разделе\n\"Дополнительные настройки\"\n.\nПо умолчанию устанавливается значение, указанное при регистрации пользователя.\nМои платежные реквизиты\nДанный раздел предназначен для добавления платежных реквизитов физического лица/самозанятого.\nДобавление платежных реквизитов доступно пользователю после подтверждения E-mail, указанного при регистрации профиля.\nДля\nразмещения\nплатного\nпродукта\nот частного лица заполнение платежных реквизитов является обязательным.\nНа указанный счет получателя будет осуществляться перевод денежных средств за приобретение размещенного продукта.\nДля добавления реквизитов следует нажать на кнопку\nи в открывшемся модальном окне в поле \"Банк\" ввести название, БИК, SWIFT или ИНН Банка получателя.\nПосле начала ввода можно выбрать наименование из выпадающего списка.\nПосле выбора банка БИК и корреспондентский счет будут заполнены автоматически, необходимо добавить номер расчетного счета в поле \"Счет получателя\" и нажать на кнопку \"Добавить\".\nТаким образом можно добавить несколько расчетных счетов. Все добавленные счета отображаются в таблице, где они могут быть отредактированы или удалены.\nДля осуществления выплат денежных сумм, полученных в результате продажи продуктов, будет использоваться счет, указанный в поле \"Основной счет получателя\".\nПо умолчанию значением данного поля устанавливается первый добавленный в профиль счет получателя.\nДля удаления счета получателя, указанного в качестве основного, необходимо предварительно выбрать другой счет в поле \"Основной счет получателя\".\nОрганизация\nРаздел предназначен для хранения данных организации для\nразмещения продукта\nот представителя юридического лица.\nДобавление организации доступно пользователю после подтверждения E-mail, указанного при регистрации профиля.\nНа вкладке \"Общая информация\" в поле \"Название\" необходимо ввести наименование организации.\nПосле начала ввода можно выбрать наименование из выпадающего списка.\nПосле выбора организации большинство полей будут заполнены автоматически, можно дополнительно указать отрасль и количество сотрудников из выпадающих списков и при необходимости заменить подписанта, после чего нажать на кнопку \"Сохранить\".\nНа маркетплейсе организация может быть добавлена только один раз. При попытке добавления одной и той же организации несколькими пользователями система выведет уведомление следующего вида:\nДля удаления добавленной организации необходимо нажать на соответствующую иконку:\nУдаление организации невозможно при наличии продуктов, в которых указан создатель \"Представитель юридического лица\" (даже для продуктов в статусе \"Черновик\").\nПри попытке удаления такой организации Система выведет уведомление со списком привязанных к организации продуктов.\nПосле добавления организации отобразится вкладка \"Платежные реквизиты\". Процесс добавления реквизитов организации аналогичен описанному\nранее\n.\nДля\nразмещения\nплатного\nпродукта\nот представителя юридического лица заполнение платежных реквизитов является обязательным.\nПри успешном прохождении\nмодерации и публикации\nпервого платного продукта\nагентский договор считается заключенным, а также становится доступна вкладка \"Агентский договор\" для хранения договора между создателем продукта (представителем юридического лица) и компанией GreenData:\nОтозвать подписанный агентский договор можно только при обращении в\nслужбу поддержки\n.\nПосле заключения агентского договора отобразится вкладка \"Отчетность\", предназначенная для хранения и управления отчетами по продажам платных продуктов, размещенных от лица организации (представителя юридического лица).\nДанные представлены в виде таблицы, которая включает: отчетный период, файл отчета в формате PDF, расчетный счет для выплат, статус согласования.\nОтчет формируется автоматически\nв первый рабочий день месяца\n, следующего за отчетным. Одновременно с этим на электронную почту приходит уведомление о необходимости его согласования.\nПри получении отчета необходимо скачать его нажатием на ссылку в таблице и ознакомиться с содержимым.\nВ течение\nтрех рабочих дней\nс момента появления отчета необходимо согласовать/отклонить полученные данные, выбрав в соответствующей строке таблицы один из вариантов:\n\"Согласен\" – при выборе данного варианта отчет считается согласованным;\n\"Не согласен\" – в данном случае отчет будет отклонен, при этом необходимо указать причину отказа:\nПосле проведения проверки и устранения замечаний отчет будет повторно сформирован и направлен на согласование.\nЕсли пользователь не дал обратную связь в течение трех рабочих дней, то согласно агентскому договору отчет считается согласованным.\nПосле согласования отчета и завершения модерации статус отчета изменится на \"Проверка отчета завершена\", после чего на указанный расчетный счет будет произведена соответствующая выплата.\nРасчетный счет для выплат может быть изменен для всех периодов, отчет по которым еще не согласован.\nДля этого необходимо перейти на вкладку \"Платежные реквизиты\" и сменить основной расчетный счет.\nДополнительные настройки\nВ данном разделе осуществляется смена  пароля и E-mail пользователя.\nДопускается изменение только подтвержденного текущего E-mail.\nАгентский договор\nРаздел предназначен для хранения договора между создателем продукта (физическим лицом или самозанятым) и компанией GreenData, который считается заключенным после публикации первого платного продукта.\nОтозвать подписанный агентский договор можно только при обращении в\nслужбу поддержки\n.\nДля размещения\nплатного\nпродукта от частного лица в разделе\n\"Учетная запись\"\nдолжен быть указан соответствующий тип пользователя, ИНН и выбрана страна \"Россия\". Кроме того, необходимо указать платежные реквизиты в разделе\n\"Мои платежные реквизиты\"\n.\nОтчетность\nВ данном разделе осуществляется хранение и управление отчетами по продажам платных продуктов, размещенных физическим лицом или самозанятым. Раздел становится доступным после заключения\nагентского договора\n.\nОтчет формируется автоматически\nв первый рабочий день месяца\n, следующего за отчетным. Процесс формирования и согласования отчетов описан\nранее\n.\nСчет получателя может быть изменен для всех периодов, отчет по которым еще не согласован.\nДля этого необходимо перейти в раздел\n\"Мои платежные реквизиты\"\nи сменить основной счет получателя.",
  "source": "https://docs.greendata.ru/platform/ru/user-profile.html"
}