{
  "title": "Релиз LTS.398",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРелиз LTS.398\nПатч LTS.398.1 от 09.02.2024\nИзменения и улучшения\nДля легкого реестра стабилизировано отображение пользовательских действий в выпадающем списке.\nПри установке guf-файла налажен процесс проверки состава обновлений на недостающие объекты.\nОптимизированы настройки для предпросмотра документа в цепочечном атрибуте.\nСтабилизирован процесс алгоритмического формирования печатной формы в одной и нескольких транзакциях с последующим сохранением во внешнем хранилище.\nСтабилизирована настройка, позволяющая заменять пароль пользователя.\nУсовершенствованы системные настройки.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.398.1\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.398.1.war\nhttps://downloads.greendatasoft.ru/LTS/lts.398.1.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nПакет обновлений LTS.398.1 от 06.02.2024\nНовые возможности\nМодернизировали архитектуру системных настроек. Теперь настройки сгруппированы по функциональному назначению, а каждая группа настроек представлена отдельным системным типом.\nВ панели главного меню появилась легенда с информацией о разработчике платформы. Для On-Premise решений предусмотрена возможность скрытия легенды.\nПри создании типа объектов добавили проверку корректности заполнения наименования идентификатора.\nВ модуле EDoc появилась возможность экспортировать документ в формате .docx вместе с комментариями, а открытие шаблона из карточки шаблонов теперь по умолчанию осуществляется в новом редакторе.\nДобавлена валидация для файлов формата .pdf, получаемых из внешнего хранилища.\nВ GreenData Messenger появилось распределение чатов по папкам.\nИзменения и улучшения\nУсовершенствовали функционал для построения универсального графика.\nДля легкого реестра стабилизировано отображение пользовательских действий в выпадающем списке.\nОптимизированы настройки и повышена стабильность работы виджетов \"Реестр объектов\", \"Расширенный статус-бар\", \"Текстовое сообщение\" и \"Проводник\".\nСтабилизирован процесс создания задач в аналитической панели \"Канбан-дочка\".\nОптимизированы настройки для сохранения версий файла во внешнем хранилище.\nСтабилизирован процесс отправки электронных сообщений в соответствии с заданными настройками html-разметки шаблона.\nТеперь атрибуты, доступные только для чтения, не учитываются при выполнении алгоритмов onChange-события.\nСтабилизирована работа редактора алгоритмов, в том числе отлажен процесс выполнения алгоритмов с параметрами, для которых значения по умолчанию задаются алгоритмом.\nВ модуле EDoc улучшена производительность при сбросе сравнения версий документа.\nДоработана возможность открытия приложения по указанному пути от лица анонимного пользователя.\nВ GreenData Messenger повышена стабильность звонков.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.398.1-details.html"
}