{
  "title": "Разметка файла шаблона в MS Word",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРазметка файла шаблона в MS Word\nШаблон\n– проект документа, содержащий неизменяемую часть и определение динамических полей. Шаблон определяет основную структуру документа и содержит необходимые настройки, такие как шрифты, параметры страницы, форматирование и стили.\nРекомендуемые форматы для подготовки шаблона документов: *.XLSX и *.DOCX (MS Office 2010 и выше).\nСоздание закладок\nЗакладка\n– настраиваемый и переиспользуемый объект текста для транслирования данных из заявки.\nВ текстовом редакторе MS Word в рамках процесса разметки проекта документа создаются закладки.\nВ поля документа, для которых созданы закладки, будут выгружаться данные из Системы по правилам, определенным в источнике данных для этой закладки.\nНаименования закладок в документе необходимо указывать с учетом, что данная информация будет отображаться в Системе при настройке печатных форм. Вставка закладки осуществляется каждый раз, когда в документе встречается настроенное поле, даже если оно встречается многократно (например, поле \"Наименование Клиента\"). При этом источник данных для отображения значения в динамическом поле может быть один.\nНумерованные списки\nДля нумерованных списков в проекте документа необходимо использовать автонумерацию. Это позволит сохранить корректное перечисление данных в случае необходимости скрыть какой-либо блок информации.\nУзнать подробнее о настройке нумерованных списков в Системе можно в публикации\nВкладка \"Разметка документа\" (при работе с шаблоном печатной формы)\n.\nНастройка свойств таблицы\nОбщая настройка таблицы\nПри формировании шаблона пользователь может произвести настройку свойств таблиц. Посмотреть данные о столбцах, строках и ячейках таблицы можно с помощью кнопки \"Свойства\" на панели \"Макет\".\nВ рамках примера будет использован документ с исходной и измененной таблицей.\nПосле\nзагрузки\nшаблона в Систему пользователь может открыть его и убедиться, что все параметры таблицы были учтены.\nНастройка столбцов\nПеред\nзагрузкой\nшаблона печатной формы пользователь может настроить\nсвойства столбцов\nтаблицы в MS Word. Для этого необходимо перейти во вкладку \"Макет\" и нажать на кнопку \"Свойства\", предварительно выбрав нужную таблицу. В открывшемся окне следует перейти во вкладку \"Столбец\" и указать ширину каждой колонки таблицы в\nпроцентном соотношении\n.\nВ рамках примера будут рассматриваться 2 одинаковые таблицы, однако для одной из них была настроена ширина столбцов в процентах.\nПосле\nзагрузки\nшаблона в Систему пользователь может открыть его и убедиться, что все параметры столбцов таблицы были учтены.\nУзнать подробнее о настройке таблиц в Системе можно в публикации\neDoc.Вкладка \"Разметка документа\" при работе с шаблоном печатной формы\n.",
  "source": "https://docs.greendata.ru/platform/ru/edoc-doc-project-layout-in-word.html"
}