{
  "title": "Setting permissions for an object type",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting permissions for an object type\nTo configure access permissions by editing the object type profile (the\nObject types registry\n), you need to specify the\nPermissions control type\n. The System implements the following permissions control types:\nNo value is selected/All users have full access\nAll users are permitted to read\nControlling permissions of responsible employees\nInheriting permissions from a related object\nSystem control of permissions\nThe\nAll users have full access\ntype permits reading and editing of an object type instance to all users. But the permission to create and delete an instance must be assigned separately (for more information, refer to\nSetting permissions to create (edit) object types\n). The data is available for viewing to all users of the System.\nIf you select the\nControlling permissions of responsible employees\n, type, you need to edit access permissions in the process of setting up the Curation Matrix (for more information, refer to\nConfiguring permissions for a business process (Curation Matrix)\n). In this case, access permissions are determined by those responsible for the object type. Including the permissions to delete a route object, which are issued to the author (initiator) before the generation of the first user task (according to the process settings) and to the manager.\nThe\nInheriting permissions from a related object\ntype borrows the access permissions of the parent object, which is selected in the\nInherit permissions attribute\n(\nExample\n). If the user does not have the permissions to edit the parent object, the creation of child objects is automatically not allowed.\nThe\nSystem control of permissions\nregulates the ability to view and write an object instance. It can be configured in the System: ''Administration → Access to system objects''. For more information, refer to\nConfiguring System permissions\n. But the\npermission to create and delete an instance\nmust be assigned separately (for more information, refer to\nSetting permissions to create/edit object types\n).\nIf you restrict access permissions to previously created object types, these restrictions will not apply to instances of this type that have already been created. The assigned permissions are applied when the object is created.\nTo apply newly assigned permissions to previously created instances of an object type, you need to ensure\nConfiguring the default permissions\n.\nTo do this:\n1. Click\nin the Object type profile. The System will display the\nDefault permissions settings\nform.\n2. Specify access restrictions for object type instances. To add or delete access permissions of the user(s) and/or user groups, use the\nAdd group or user\nbutton, and then specify permissions to read, write, and delete instances of the object type.\n3. To save the changes, click\n.\n4. To apply the changes, click\n. The System will request for confirmation:\n5. Agree to apply the changes and click\nYes\n.",
  "source": "https://docs.greendata.ru/platform/en/setting-permissions-for-an-object-type.html"
}