{
  "title": "\"QR code\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"QR code\" widget\nThe \"QR Code\" Widget\nis designed for creating and displaying QR codes that can be used to:\nNavigate to a specified link;\nFill an attribute with entered text;\nCall a specified phone number;\nSend a message to a specified email address;\nNavigate to a required system object.\nExample of a customized widget:\nSetup\nAdding the widget to an object profile is performed in the\nvisual\nediting mode. On the \"Elements\" panel, navigate to the \"Widgets\" tab and from the \"User Information\" section, drag and drop the \"QR Code\" widget into the workspace of the profile.\nAfter clicking the\nbutton, a modal window for configuring the widget’s\nparameters\nwill open. Alternatively, if the system contains previously configured QR code settings objects, the following modal window will appear:\nSelection of a previously created settings object is available in the dropdown list; creation of a new one is performed by clicking the\nbutton.\nParameters\nThrough the widget parameters:\nThe name of the widget settings object is specified;\nBy default, it is populated as \"QR Code Settings\".\nThe\nQR code content\nis defined;\nThe\nQR code styling\nis configured.\nIn the lower part of the settings window, the preview field displays the result of the configured QR code.\nQR Code Content\nThe result of scanning the QR code depends on its content settings. The following options are available:\nLink — an option where the QR code will store a link for navigation.\nSetting\nPurpose\nStatic/Algorithm\nSelecting the method for passing the link into the QR code.\nURL\nInserting/inputing of a static link.\nThis field is displayed when using the static link passing method.\nLink definition algorithm\nDefining an algorithm that will return the link.\nSelection of a previously created algorithm of type \"Algorithm. Object Cards\" is made from a dropdown list; adding a new\nalgorithm\nis available through the parameter’s action menu.\nThe algorithm runs based on the object whose visual contains the widget.\nThis field is displayed when passing the link via an algorithm.\nScanning the configured QR code or clicking the link that appears when hovering over the QR code will navigate to the specified link.\nWhen hovering over the QR code, the URL can be copied using the\nbutton.\nText — an option where the QR code will contain a text message.\nSetting\nPurpose\nStatic/Algorithm\nSelecting the method for passing text into the QR code.\nText\nInserting/inputting a text message.\nMaximum allowed number of characters is 1000.\nThis field is displayed when using the static text passing method.\nText Definition Algorithm\nDefining an algorithm that will return the text.\nSelection of a previously created algorithm of type \"Algorithm. Object Cards\" is made from a dropdown list; adding a new\nalgorithm\nis available through the parameter’s action menu.\nThe algorithm runs based on the object whose visual contains the widget.\nThis field is displayed when passing text via an algorithm.\nScanning the configured QR code will open the user’s search service, where the specified text will be used as the search query.\nWhen hovering over the QR code, the text can be copied using the\nbutton.\nPhone — an option where the QR code will contain a phone number.\nSetting\nPurpose\nStatic/Algorithm\nSelecting the method for passing the phone number into the QR code.\nPhone\nInserting/inputting a phone number.\nThis field is displayed when using the static phone number passing method.\nPhone number definition algorithm\nDefining an algorithm that will return the phone number.\nSelection of a previously created algorithm of type \"Algorithm. Object Cards\" is made from a dropdown list; adding a new\nalgorithm\nis available through the parameter’s action menu.\nThe algorithm runs based on the object whose visual contains the widget.\nThis field is displayed when passing the phone number via an algorithm.\nScanning the configured QR code or clicking the phone number that appears when hovering over the QR code will open the calling application with the specified number pre-filled.\nWhen hovering over the QR code, the phone number can be copied using the\nbutton.\nEmail — an option where the QR code will contain an email address.\nSetting\nPurpose\nStatic/Algorithm\nSelecting the method for passing the email into the QR code.\nEmail\nInserting/inputting an email address.\nThis field is displayed when using the static email passing method.\nEmail definition algorithm\nDefining an algorithm that will return the email address.\nSelection of a previously created algorithm of type \"Algorithm. Object Cards\" is made from a dropdown list; adding a new\nalgorithm\nis available through the parameter’s action menu.\nThe algorithm runs based on the object whose visual contains the widget.\nThis field is displayed when passing the email via an algorithm.\nScanning the configured QR code or clicking the email that appears when hovering over the QR code will open the user’s email client, where the specified address will be automatically populated in the recipient field.\nWhen hovering over the QR code, the email can be copied using the\nbutton.\nSystem object link — an option where the QR code will contain a link to open a menu item page, object, or object registry.\nSetting\nPurpose\nMenu Item/Object/Registry\nThe system object that needs to be accessed via the QR code.\nMenu Item\nSelecting the\nmenu item\nwhose link will be stored in the QR code.\nThis field is displayed when \"Menu Item\" is selected as the system object to open.\nObject Type\nDefining the object type whose object link will be contained in the QR code.\nSelecting of a previously created object type is made from a dropdown list; adding a\nnew type\nis available through the parameter’s action menu.\nThis field is displayed when \"Object\" or \"Registry\" is selected as the system object to open.\nObject\nDefining the object whose link will be contained in the QR code.\nSelection of a previously created object is made from a dropdown list; adding a\nnew object\nis available through the parameter’s action menu.\nThis field is displayed when \"Object\" is selected as the system object to open.\nVisual\nDefining the instance visual for the selected object type.\nSelecting a previously created visual is made from a dropdown list; adding a\nnew visual\nis available through the parameter’s action menu.\nIf no value is specified, the default visual is used.\nThis field is displayed when \"Object\" is selected as the system object to open.\nRegistry\nDefining the registry visual for the selected object type.\nSelection of a previously created\nregistry visual\nis made from a dropdown list; creating a new one or editing the selected one is available through the parameter’s action menu.\nThis field is displayed when \"Registry\" is selected as the system object to open.\nScanning the configured QR code or clicking the button that appears when hovering over the QR code will open the system object specified in the widget settings.\nQR Code Styling\nQR code styling is configured using the following parameters:\nParameter\nPurpose\nShape\nSelecting the shape of the area where the QR code is placed - square or circle.\nWidth (px)\nDefinition of the QR code width in pixels.\nAccepts integer values from 100 to 2000.\nDefault QR code width is 200px.\nBackground Color\nSelecting the background color for the QR code, defined using a color picker component.\nForeground Color\nSelecting the QR code color, defined using a color picker component.\nBackground Image\nAdding an image as a background for the QR code.\nThe image can be uploaded via a button or dragged into the parameter area. When adding via button, the upload method is selected: from disk or from the system.\nWhen adding an image from disk, a new instance of type \"File\" [FS_FILE] is created in the System.\nImage files in *.jpg, *.png, or *.jpeg formats can be used.\nThis parameter is displayed when the \"Circle\" shape is selected.\nBorder\nBoolean parameter defining whether to add a stroke around the area where the QR code is placed.\nDefault value is \"No\".\nThickness (px)\nBorder thickness.\nDefault value is 2.\nThis parameter is available when the QR code has a stroke.\nColor\nBorder color.\nThis parameter is available when the QR code has a stroke.\nLogo\nAdding a logo to the center of the QR code.\nThe logo can be uploaded via a button or dragged into the parameter area. When adding via button, the upload method is selected: from disk or from the system.\nWhen adding a logo from disk, a new instance of type \"File\" [FS_FILE] is created in the System.\nLogo files in *.jpg, *.png, or *.jpeg formats can be used.\nHint\nBoolean parameter defining whether to add a hint for the user.\nHint text\nInserting/inputting of hint text to be placed below the QR code.\nMaximum hint text size is 200 characters.\nThis field is displayed when the \"Hint\" parameter is active.\nUse example\nFor example, on the visual of an object containing news about an upcoming webinar, a QR code needs to be placed for navigating to a page with contact details.\nTo do this, in the\nvisual\nediting mode of the instance, drag and drop the \"QR Code\" widget into the workspace.\nNext, navigate to the widget settings by clicking the\nbutton and define the following configuration parameters:\nIn this case, navigation to the contacts page is required, so \"Link\" should be selected as the QR code content, and the static URL should be specified in the corresponding field.\nThe QR code styling can be configured according to preferences or corporate style.\nFor adding a logo, an image without a background in *.png format can be used.\nAfter saving the settings, the visual may be as follows:",
  "source": "https://docs.greendata.ru/platform/en/qr-code-widget.html"
}