{
  "title": "sequenceNextVal",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nsequenceNextVal\nФункция используется при автонумерации объектов для присваивания следующего порядкового значения, возвращаемое значение хранится в поле \"Текущее значение\".\nФункция увеличивает последовательность на 1\nпри каждом вызове функции\n.\nНапример, при использовании функции в\nвыражении\nрекомендуется деактивировать параметр \"Рассчитать в момент создания новых объектов\", чтобы избежать присвоения номера объекту, который может быть не сохранен после создания (данный номер будет утерян).\nИли, например, если в качестве автоматического пересчета выражения выбраны значения \"При изменении атрибутов, используемых в алгоритме\"/\"При изменении любых атрибутов данного типа\", тогда при изменении значений соответствующих атрибутов функция может вызваться повторно, что в свою очередь приведет к изменению номера последовательности для текущего объекта\"\nСинтаксис\nsequenceNextVal\n(sequenceIdObj)\nПараметр\nНазначение\nsequenceIdObj\nОбъект типа\n\"Автонумерация\"\n[SYS_SEQUENCE] (или дочернего типа), через который осуществляется присваивание порядкового номера заданному объекту.\nПримечание\nПрежде чем использовать функцию\nsequenceNextVal\n, необходимо создать экземпляр типа\n\"Автонумерация\"\n[SYS_SEQUENCE] (или дочернего типа).\nПо умолчанию значение последовательности начинается с 1, при необходимости текущее значение может быть изменено при настройке данного экземпляра или при помощи функции\nsetSequenceCurrVal\n.\nВызов функции осуществляется с\nвкладки \"Дополнительные\"\nпанели инструментов редактора алгоритмов.\nПри вызове функции откроется модальное окно для выбора созданной ранее последовательности автонумерации:\nВ указанный объектный атрибут автоматически устанавливается целочисленное значение. После создания нового объекта, ему будет присвоен следующий порядковый номер.\nПример\nДопустим, что наименования заявок на кредит должны задаваться автоматически с учетом последовательной нумерации.\nДля этого необходимо в типе объектов\n\"Автонумерация\"\n[SYS_SEQUENCE] создать новый экземпляр с наименованием \"Номер заявки на кредит\".\nДалее в типе объектов по формированию заявок на кредиты в\nвыражении\nдля расчета значения атрибута \"Наименование\" использовать следующий алгоритм:\nПри настройке\nвыражения\nпараметр \"Рассчитать в момент создания новых объектов\" неактивен.\nПри вызове функции\nsequenceNextVal\nнеобходимо выбрать созданный экземпляр автонумерации \"Номер заявки на кредит\".\nТаким образом, наименование формируется посредством функций\ntext\nи\nsequenceNextVal\n.",
  "source": "https://docs.greendata.ru/platform/ru/sequencenextval.html"
}