{
  "title": "getCardOpeningArg",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ngetCardOpeningArg\nФункция позволяет определить параметры открытия экранной формы:\nспособ открытия (в новой/текущей вкладке или в модальном окне);\nкод\nвизуала экземпляра\n.\nФункция возвращает объект класса CardOpeningArg.\nСинтаксис\ngetCardOpeningArg\n()\nПараметры отсутствуют.\nПримечание\nВызов функции осуществляется с вкладки\n\"Экранные формы\"\nпанели инструментов редактора алгоритмов.\nПри вызове функции в код алгоритма вставляется конструкция следующего вида:\ndef cardOpeningArg = getCardOpeningArg()\nif (isNotNull(cardOpeningArg)) {\ndef cardOpeningMode = cardOpeningArg.getOpeningMode()\ndef cardOpeningVisualId = cardOpeningArg.getVisualId()\nif (cardOpeningMode.isTab() and cardOpeningVisualId = 100500) {\n// ...\n}\n}\nФункция\ngetCardOpeningArg\nпредполагает получение экземпляра класса CardOpeningArg. По умолчанию полученный экземпляр присваивается в переменную cardOpeningArg.\nПри работе с функцией используются следующие методы:\nМетод\nНазначение\ngetOpeningMode\nВозвращает экземпляр класса CardOpeningMode. При работе с функцией используются следующие методы:\nisTab – возвращает логическое значение, определяющее открытие объекта в новой/текущей вкладке;\nisModal – возвращает логическое значение, определяющее открытие объекта в модальном окне.\ngetVisualId\nВозвращает код\nвизуала экземпляра\n.\nПример\nДопустим, требуется настроить работу Системы в зависимости от способа открытия заявки клиента:\nпри открытии в новой/текущей вкладке считать, что заявка взята в работу – статус заявки сменить на \"В работе\", исполнителем назначить текущего сотрудника;\nесли заявка открыта в модальном окне, то производится ее просмотр – статус и исполнитель заявки при этом не должны изменяться.\nДля этого в карточке типа \"Заявки клиентов\" необходимо перейти на вкладку \"События\" и настроить\nсобытие перед открытием\n:\nС помощью функции\ngetCardOpeningArg\nпроверяется способ открытия объекта. После чего задается условие: если объект был открыт в новой/текущей вкладке (метод\nisTab\nвернул значение\ntrue\n), то статус заявки изменяется на \"В работе\", а в качестве ответственного сотрудника указывается текущий.\nДля написания данного алгоритма также были использованы другие функции.\nВ коде алгоритма:\nпеременные определены посредством функции\nvar\n;\nчерез оператор\nif\nзадаются условия;\nатрибут \"Статус заявки\" выбирается с помощью функции\nattr\nс признаком \"Установить значение\", где фиктивное значение\nnull\nследует заменить на значение \"В работе\";\nпосредством функции\nattr\nс признаком \"Установить значение\" в атрибут \"Ответственный сотрудник\" записывается текущий сотрудник, полученный с помощью функции\ncurrentUser\n;\nтекущий объект\nсохраняется функцией\nsave\n.\nВ результате настройки заявка клиента будет автоматически взята в работу при открытии в новой/текущей вкладке, а при открытии в модальном окне может быть осуществлен предпросмотр заявки – статус заявки и ответственный сотрудник останутся без изменений:",
  "source": "https://docs.greendata.ru/platform/ru/getcardopeningarg.html"
}