{
  "title": "newInstance",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nnewInstance\nThe function creates a new instance of the specified object type.\nSyntax\nnewInstance\n(typeObj)\nParameter\nPurpose\ntypeObj\nAn object type of the created instance.\nNote\nThe function is called using the\nbutton, located in Algorithm editor on the \"Objects\" tab.\nTo use the function, declare a new variable using the\nvar\nfunction.\nSpecify the\nnewInstance\nfunction as the value of the variable.\nIn the \"Instantiating a type\" modal window, select an object type which instance is created by the algorithm.\nNext, fill in the attributes for the created instance of the object type using the\nattrByVar\nfunction.\nAll mandatory attributes must be filled in.\nSave the variable using the\nsave\nfunction.\nThe exception is when object in the\nexpression\nor\nevent before saving\nis created based on an object unsaved in the database whose attributes have\ntwo-way relation\n.\nAn example of using the function for this case is given in this\narticle\n.\nExample\nThe algorithm for creating an instance of the\nbusiness process\ncan be written as follows:\nIn order to write the algorithm, it will required to:\ndeclare new variables using the\nvar\nfunction;\nas values\nassigned\nto variables, select the\nnewInstance\nfunction to create new instances. As part of the example, you need to select \"UD expertise\" for the\nexpUD\nvariable and \"WF. Instance of the running process\" for the\nprossUD\nvariable.\nSeveral other functions are used in writing this algorithm.\nSee more\nProcess parameters (attributes) are specified using the\nattrByVar\nfunction;\nThe\nvalue\nof the \"Application for decision-making\" attribute is specified using the\ncurrentObject\nfunction.\nThe\nvalue\nof the \"Object\" attribute is assigned with the value of a variable.\nThe\nvalue\nof the \"Process\" attribute is specified using the\ndict\nfunction.\nThe\nvalue\nof the \"Activity sign\" attribute is specified using the\ntrue\nfunction.\nThe instance of each object type is saved using the\nsave\nfunction.",
  "source": "https://docs.greendata.ru/platform/en/newinstance.html"
}