{
  "title": "filterAlg",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nfilterAlg\nФункция для ограничения перечня объектов при помощи ранее созданного алгоритма фильтрации.\nФункция используется совместно с функцией\nobjectsWithOptions\n.\nСинтаксис\nfilterAlg\n(alg, [param: paramValue])\nПараметр\nНазначение\nalg\nАлгоритм\nтипа\n\"Алгоритм. Условие фильтрации для выбора элементов\".\nparam\nПараметры алгоритма фильтрации, перечисленные через запятую (при их наличии).\nПараметр необязательный. Используется при наличии параметров алгоритма фильтрации.\nparamValue\nЗначения параметров алгоритма фильтрации.\nЗначения параметров могут быть переданы, например, при помощи функций\nattr\n,\ndict\n,\nvar\n.\nПараметр необязательный. По умолчанию используется значение null.\nПримечание\nВызов функции осуществляется с вкладки\n\"Источники\"\nпанели инструментов редактора алгоритмов, в результате чего откроется модальное окно, в котором необходимо выбрать алгоритм фильтрации и нажать на кнопку \"Готово\".\nПри вызове функции в код алгоритма будет добавлена функция с параметрами алгоритма фильтрации (при их наличии), для которых необходимо определить значения вместо фиктивных переменных\n\"null\"\n.\nПример\nНеобходимо сформировать список именинников будущего месяца среди сотрудников службы безопасности.\nАлгоритм может принять следующий вид:\nС помощью функции\nfilterAlg\nосуществляется фильтрация пользователей Системы, входящих в группу доступа \"Служба безопасности\".\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nОбъявление новых переменных выполняется с помощью функции\nvar\n.\nДля получения номера следующего месяца используются функции\ngetMonth\n,\nplusMonths\nи\ncurrentDate\n.\nПоиск именинников реализуется циклом посредством функции\nforEach\n, где коллекция объектов задается функцией\nobjectsWithOptions\n, в качестве параметра фильтрации которой выбирается ранее созданный алгоритм посредством функции\nfilterAlg\n.\nДля определения вхождения пользователя в группу доступа \"Служба безопасности\" используется функция\nuserHasGroup\n.\nДля сравнения\nмесяца\nрождения пользователя с номером следующего месяца используется оператор\nif\n.\nАтрибуты \"День рождения\", \"Наименование\" добавляются при помощи\nattrByVar\n.\nДля отображения результата выполнения алгоритма в логе применяется функция\nprintout\nс использованием функции\ntext\n.\nВ результате выполнения алгоритма в логе будет отображен сформированный список:",
  "source": "https://docs.greendata.ru/platform/ru/filteralg.html"
}