{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease\nLTS.456.6\nof May 16, 2025\nIn release\nLTS.456\n, a new\nsystem setting\nwas added in the \"Additional\" section. In some cases, the default value could cause the section’s settings to reset when updating the instance.\nPlease check the system settings in the \"Additional\" section and, if necessary, revert them to the values required for the correct operation.\nThe issue was present in the following public versions:\nLTS.456.4\n.\nThese versions have been revoked, and additional patches have been released that fix the issue:\nLTS.456.6\n.\nNew features\nIt is now possible to create a subject area based on a custom description using AI.\nAt the moment the subject area generation only supports Russian language, other languages will be available later.\nThe procedure for\ninstalling updates\nwas improved:\nNow, when downloading multiple *.guf files, there is no need to keep track of the order of objects.\nChecking an update provides a complete list of missing objects with the ability to export a list of errors that can be applied when generating an update on the source instance.\nNow the status of a payment made using\nwidget “Payment” widget\ncan be saved and processed on the platform level.\nThe list of\nevents\nwas extended, now triggering algorithms can be configured based on opening and/or closing an instance.\nManaging\nanonymous login mode\nis now possible directly from the app.\nTo optimize disk space usage, a mechanism for timely deleting temporary files was implemented.\nThe option to lock file previews that contain comments and/or corrections is now available via\nsystem settings\n.\nIt is now possible to control the permissions of files uploaded to the System and check them for malicious content via\nconfiguration file parameters\n.\nChanges and improvements\nThe ability to clear pre-filled values when\ncreating an object\nis now available in the modal window.\nThe ability to create an object via a child attribute and close the modal window via hotkeys was improved.\nThe process of filtering by the “ Configured groups” user attribute of the “Security principal” type was debugged.\nThe validation error text when grouping by attribute is impossible was improved.\nThe “Module” [SYS_MODULE] object type was deleted.\nIn the object type “Task Scheduler. Launch algorithm” [SYS_SCHED_ALG] object type the value in the “Algorithm to be execute” field was added.\nHiding buttons\non the registry control panel can now be applied to an object attribute with\n“Registry for multiselect attribute” visual\n.\nThe display of content in\ngrouping\ncontainers when the window scale or width changes was stabilized.\nThe process of scrolling the contents of the text attribute and workspace depending on the cursor location was debugged.\nA tooltip was added to the visual in the “Marketplaces and external systems” system settings.\nThe process of deleting a copy of a dashboard was debugged.\nThe data loading in\nanalytical dashboards\nwas optimized.\nThe ability of filtering and sorting\ntable\ndata when the “Periodic automatic data update” option is active was debugged.\nThe description of validation error when attribute values change as a result of moving a task between\nkanban board\nstages was improved.\nChanging the relationship  type of the\nobject data source\nwas stabilized (was implemented in\nLTS.454.2\n).\nThe work of\nSQL-based data sources\nwas stabilized.\nThe mechanism of business process completing was improved: in case of failed validation the error description is displayed in the route.\nThe settings transfer when copying a business process version was optimized.\nProcessing of switching to the previous page when completing a business process task was improved: if there is no information about the previous page, the user will remain on the current page.\nThe ability to process arithmetic method calls for a numeric value when compiling an algorithm was improved.\nThe possibility of filtering by SQL condition with parameters was stabilized.\nThe settings for the\n“Sign the file using a simple e-signature”\naction were improved.\nThe execution of a scheduled action on ETL process start with required attributes was stabilized.\nGeneration of updates containing widgets was stabilized.\nThe process of verifying access permissions to objects when installing updates was improved.\nWhen the password policy is active during the authentication password change process, the error text for entering a password that does not meet the security criteria was adjusted.\nThe ability to connect to Oracle Database via ETL was debugged.\nWorking with The Analysis of Financial and Economic Activity module (AFEA) was optimized.\nThe ability to change the preview mode to the bookmark mode was stabilized.\nThe process of generating and downloading a print form with the active “Optimize document generation” setting was debugged.\nWorking with an electronic document when setting line spacing was stabilized.\nSaving the size of images in the generated printed form with the “Scale image” feature disabled and displaying the number according to the specified tabulation was stabilized.\nThe ability to view the contents of documents created after previewing using the “Open in EDoc” button was stabilized.\nThe ability to generate a printed form by attached file with hidden objects was stabilized (hidden objects are not processed by the system).\nWhen the “Block file preview with comments and/or corrections” feature is active, it is now possible to preview *.xlsx, *.pptx and *.pdf files without comments and/or corrections.",
  "source": "https://docs.greendata.ru/platform/en/LTS.456.6-latest.html"
}