{
  "title": "newSavingCheck",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nnewSavingCheck\nФункция применяется для формирования описания\nпроверки для объектов\n.\nСинтаксис\nnewSavingCheck\n( )\nПараметры функции отсутствуют.\nРабота с функцией предполагает заполнение полей экземпляра класса SavingCheck.\nПримечание\nДобавление функции в код алгоритма осуществляется из раздела \"Дополнительные\" панели инструментов редактора алгоритмов.\nПри вызове функции в код алгоритма добавляется конструкция следующего вида:\ndef check := newSavingCheck()\ncheck.isValid := false /* результат проверки */\ncheck.hintText := \"Возникла ошибка!\" /* текст проверки */\ncheck\nГде в поле\nhintText\nприсваивается текстовое сообщение, которое будет отображено в модальном окне проверки при заданном в поле\nisValid\nрезультате проверки.\nЕсли алгоритм возвращает:\ntrue – проверка не отображается;\nfalse – текст, используемый в алгоритме, отображается в модальном окне проверки;\nnull – проверка не отображается.\nПримеры\nПример №1\nДопустим, перед сохранением карточки держателя кредитной карты требуется реализовать проверку указанного возраста.\nДля этого в типе \"Держатели кредитных карт\" на вкладке \"Проверки\" необходимо добавить алгоритмическую проверку \"Проверка на возраст\", с жизненным циклом \"Перед сохранением\".\nДанный алгоритм будет осуществлять проверку возраста, указанную в поле \"Дата рождения\", перед сохранением карточки. Если держатель карты окажется несовершеннолетним, появится модальное окно  ошибки валидации входных данных с текстовым сообщением, указанным в алгоритме.\nПример 2\nНапример, необходимо реализовать проверку по превышению кредитного баланса над текущим перед удалением карточки держателя кредитной карты.\nДля этого в типе \"Держатели кредитных карт\" на вкладке \"Проверки\" необходимо добавить алгоритмическую проверку \"Проверка на баланс\", с жизненным циклом \"Перед удалением\".\nДанный алгоритм будет осуществлять проверку баланса, сравнивая значения в полях \"Кредитный баланс\" и \"Текущий баланс\". Если сумма кредитного баланса превысит текущий, при попытке удаления карточки будет отображено модальное окно ошибки валидации входных данных с текстовым сообщением, указанным в алгоритме.",
  "source": "https://docs.greendata.ru/platform/ru/newsavingcheck.html"
}