{
  "title": "\"Graph\" analytical dashboard",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Graph\" analytical dashboard\nThe Graph dashboard is a visualization tool that helps to analyze the relationships between objects represented as a graph diagram with the ability to filter data.\nPreliminery setup\nTo successfully configure the \"Graph\" dashboard, we need:\nobject model on the basis of which the links will be generated;\nTo use icons as graph nodes, add a \"String\" type attribute with the \"Icon Selection\" visual.\ndata source containing nodes, links, and icons of the future graph. If necessary, filtering conditions are set in the source;\ndashboard in which a generated data source is added to the source management.\nSetup\nIn the visual editing mode, drag-and-drop the analytical panel from the element panel tab of the same name from the \"Source-based panels\" section to the\ndashboard\nworkspace.\nClick\nto open a modal window where the settings are presented in the tabs:\nBase\n;\nStyle of design\n;\nFilter\n;\nAdditional\n;\n\"Base\" tab\nOn this tab, specify the name of the chart and select the data source added in the dashboard settings. After that, the identifiers of the fields containing the necessary values for the formation of nodes and links of the chart are specified.\n\"Base\" tab settings\nSetting\nPurpose\nData source\nSelecting the data source on the basis of which the nodes and relationships of the graph will be determined.\nThe selection is made via the drop-down list from data sources previously added in the dashboard source management.\nName\nName of the graph.\nNode connectivity\nThe field with the code of the node object from which the connection is coming\nSpecifying the value of the node of the graph from which the connection will proceed. The corresponding source field with the object code is selected via the drop-down list.\nField of the node to which the connection is coming\nDetermining the value of the node of the graph to which the connection will go. The corresponding source field with the object code is selected via the drop-down list.\nThe field with the name of the node from which the connection is coming\nThe name of the node to which the connection is coming.\nThe corresponding source field with the object code is selected via the drop-down list.\nThe field with the link name\nThe name of the connection that will be displayed in the hint of the arrow connecting the nodes of the graph. The corresponding source field with the object code is selected via the drop-down list.\nOpen an object by clicking on an element of the graph\nAn option that allows users to navigate to the object profile by clicking on an element of the graph.\nBy default, the switch is inactive.\n////\nDisplay the graph as a tree\nA graph visualization method in which elements are arranged down the hierarchy, starting from the root node.\nBy default, the switch is inactive.\nTree drawing depth\nAutomatically determine the rendering depth\nDetermining the depth of graph rendering by the System.\nThe field is available when the \"Display the graph as a tree\" switch is active.\nBy default, the switch is active.\nGraph drawing depth\nThe number of links directed downwards from the root element.\nThe root element from which the links come out is determined automatically.\nThe field is available when the \"Display the graph as a tree\" switch is active.\nThe field is blocked if the \"Determine automatically the drawing depth\" switch is active.\n////\n\"Style of design\" tab\nThis tab allows users to adjust the size of the chart area, select the color scheme of the elements and the way the graph nodes are displayed.\n\"Style of design\" tab settings\nSetting\nPurpose\nChart height, %\nSetting the values of height and width of the analytical dashboard area in percent relative to the screen height.\nTo save the proportions, click on the\nbutton.\nThe following parameters are set by default: chart height - 100%, width - 40%.\nChart width, %\nFix nodes\nThe setting that determines the behavior of nodes when moving:\nif the switch is active, when the user moves a node on the graph, the remaining nodes will not change their position;\nif the switch is inactive, moving one node by the user may cause the intersecting nodes to shift (in the case of overlapping node regions).\nBy default, the switch is inactive.\nThe algorithm of the node color to which the connection is coming\nSelecting/adding an algorithm to determine the color of the root nodes.\nThe field is available when the \"Display nodes as icons\" switch is inactive.\nThe algorithm of the node color to which the connection is going\nSelecting/adding an algorithm to determine the color of the nodes to which the connection is going.\nThe field is available when the \"Display nodes as icons\" switch is inactive.\nThe algorithm for the color of the arrows\nSelecting/adding an algorithm to determine the color of the arrows on the graph.\nDisplay nodes as icons\nA setting that determines the node display type.\nWhen the switch is active, the nodes are displayed as icons specified in the parameters:\nField with the name of the node from which the connection is coming;\nField with the icons of the node from which the connection is coming.\nWhen the switch is inactive, the nodes are displayed as tiles, which color can be set in the parameters:\nThe algorithm of the node color from which the connection is coming.\nThe algorithm of the node color to which the connection is going.\nField with the icons of the node from which the connection is coming\nSelecting the source field containing the icon of the node from which the connection is coming.\nThe field is available when the \"Display nodes as icons\" switch is active.\nField with the node icons to which the connection is coming\nSelecting the source field containing the node icon to which the connection is coming.\nThe field is available when the \"Display nodes as icons\" switch is active.\nDisplay graph as a tree\nA method of graph visualization, in which the elements are arranged down the hierarchy, starting from the root node.\nThe switch is disabled by default.\nTree drawing depth\nDetermine automatically the depth of drawing\nDetermining the depth of graph drawing by the System.\nThe field is available when the “Display the graph as a tree” switch is active.\nThe field is locked when the “Partial data loading” option located on the “Advanced” tab is active.\nThe switch is active by default.\nGraph drawing depth\nNumber of connections directed downwards from the root element.\nThe root element, from which the connections come out, is determined automatically.\nThe field is available when the “Display graph as a tree” switch is active.\nThe field is locked when the option:\nis active.\n“Load data in stages” located on the “Advanced” tab\n;\n“Determine automatically the depth of rendering” located on the “Design style” tab\n.\nNode grouping\nField with the code of the node groups from which the link is coming\nSelecting the source field that contains the object code of the node group object from which the connection is coming.\nField with the code of the node groups to which the link is coming\nSelecting the source field that contains the object code of the node group object to which the connection is coming.\nField with the name of the node groups from which the connection is coming\nSelecting the source field that contains the name of the node group from which the connection is coming.\nField with the name of the node groups to which the connection is coming\nSelecting the source field containing the name of the node group to which the connection is coming.\nColor algorithm of the node from which the connection is coming\nSelecting/adding an algorithm to specify the color of the node group from which the connection is coming.\nThe field is available when the “Display a group of nodes as icons” switch is inactive.\nColor algorithm of the node to which the connection is coming\nSelecting/adding an algorithm to determine the color of the node group to which the connection is coming.\nThe field is available when the “Display a group of nodes as icons” switch is inactive.\nDisplay a group of nodes as icons\nA setting that allows determining the type of node group display.\nWhen the switch is active, node groups are displayed in the form of icons specified in the parameters:\n“Icon field for the nodes from which the connection is coming”;\n“Field with icons for the nodes to which the connection is coming”.\nWhen the switch is inactive, node groups are displayed as tiles, the color of which can be set in the parameters:\n“Color algorithm of the node from which the connection is coming”;\n“Color algorithm of the node to which the connection is coming”.\nThe switch is locked if the values in the fields “Field with the code of the node groups from which the connection is coming from” and “Field with the code of the node groups to which the connection is coming” are not specified.\nField with icons for the nodes from which the connection is coming\nSelecting the source field that contains the icon of the node group from which the connection is coming.\nThe field is available when the “Display a group of nodes as icons” switch is active.\nField with icons for the nodes to which the connection is coming\nSelecting a source field that contains an icon of the node group to which the connection is coming.\nThe field is available when the “Display a group of nodes as icons” switch is active.\n\"Filter\" tab\nOn this tab, settings for data filtering appear by clicking\n.\n\"Filter\" tab settings\nSetting\nPurpose\nControl element\nSelecting an element from the drop-down list that shows the control elements created on the current dashboard.\nGraph elements\nSelecting a graph element from the drop-down list. Posssible values:\nField of the node from which the connection is coming;\nField of the node to which the connection is coming;\nLink object code field.\n\"Additional\" tab\nThis tab determines the settings for grouping graph nodes, adding actions to the diagram, and expanding the capabilities of the diagram using JSON code.\n\"Additional\" tab settings\nSetting\nPurpose\nPartial data loading\nPartial data loading\nAn option that allows optimizing the loading of a large amount of data.\nThe option is applicable when building a graph based on SQL source only, since partial data loading can only be done using a recursive sql query.\nExample of sql query.\nWITH RECURSIVE R AS (\nSELECT DISTINCT E1.*, 1 AS DEPTH\nFROM EDGE E1\nLEFT JOIN EDGE E2\nON (E1.FROM_NODE = E2.TO_NODE AND (EDGE_TYPE_PARAM IS NULL OR E2.EDGE_TYPE = EDGE_TYPE_PARAM))\nWHERE (CASE\nWHEN ROOT_ID_PARAM IS NULL\nTHEN E2.FROM_NODE IS NULL AND E2.TO_NODE IS NULL AND E2.EDGE_TYPE IS NULL\nELSE E1.FROM_NODE = ROOT_ID_PARAM\nEND)\nAND (EDGE_TYPE_PARAM IS NULL OR E1.EDGE_TYPE = EDGE_TYPE_PARAM)\nUNION ALL\nSELECT E.*, DEPTH + 1\nFROM R\nINNER JOIN EDGE E ON R.TO_NODE = E.FROM_NODE\nWHERE (MAX_DEPTH_PARAM IS NOT NULL AND DEPTH < MAX_DEPTH_PARAM)\nAND (EDGE_TYPE_PARAM IS NULL OR E.EDGE_TYPE = EDGE_TYPE_PARAM)\n)\nSELECT NODE_FROM.ID      AS NODE_FROM_ID,\nNODE_FROM.NAME    AS NODE_FROM_NAME,\nNODE_TO.ID        AS NODE_TO_ID,\nNODE_TO.NAME      AS NODE_TO_NAME,\nET.ID             AS EDGE_TYPE_ID,\nET.NAME           AS EDGE_TYPE_NAME,\nCT_FROM.id        as CT_FROM_ID,\nCT_FROM.name      as CT_FROM_NAME,\nCT_FROM.id_847360 as CT_FROM_ICON,\nCT_FROM.ldjiwwd   as CT_FROM_PICTURE,\nCT_TO.id          as CT_TO_ID,\nCT_TO.name        as CT_TO_NAME,\nCT_TO.id_847360   as CT_TO_ICON,\nCT_TO.ldjiwwd     as CT_TO_PICTURE\nFROM R\nINNER JOIN EDGE RR ON R.TO_NODE = RR.TO_NODE\nINNER JOIN NODE NODE_FROM ON NODE_FROM.ID = RR.FROM_NODE\nINNER JOIN NODE NODE_TO ON NODE_TO.ID = RR.TO_NODE\nINNER JOIN EDGE_TYPE ET ON ET.ID = RR.EDGE_TYPE\nINNER JOIN CI_TYPE CT_FROM ON CT_FROM.id = NODE_FROM.node_type\nINNER JOIN CI_TYPE CT_TO ON CT_TO.id = NODE_TO.node_type\nWHERE EDGE_TYPE_PARAM IS NULL\nOR RR.EDGE_TYPE = EDGE_TYPE_PARAM\nUNION\nSELECT NODE_FROM.ID      AS NODE_FROM_ID,\nNODE_FROM.NAME    AS NODE_FROM_NAME,\nNODE_TO.ID        AS NODE_TO_ID,\nNODE_TO.NAME      AS NODE_TO_NAME,\nET.ID             AS EDGE_TYPE_ID,\nET.NAME           AS EDGE_TYPE_NAME,\nCT_FROM.id        as CT_FROM_ID,\nCT_FROM.name      as CT_FROM_NAME,\nCT_FROM.id_847360 as CT_FROM_ICON,\nCT_FROM.ldjiwwd   as CT_FROM_PICTURE,\nCT_TO.id          as CT_TO_ID,\nCT_TO.name        as CT_TO_NAME,\nCT_TO.id_847360   as CT_TO_ICON,\nCT_TO.ldjiwwd     as CT_TO_PICTURE\nFROM R\nINNER JOIN NODE NODE_FROM ON NODE_FROM.ID = R.FROM_NODE\nINNER JOIN NODE NODE_TO ON NODE_TO.ID = R.TO_NODE\nINNER JOIN EDGE_TYPE ET ON ET.ID = R.EDGE_TYPE\nINNER JOIN CI_TYPE CT_FROM ON CT_FROM.id = NODE_FROM.node_type\nINNER JOIN CI_TYPE CT_TO ON CT_TO.id = NODE_TO.node_type\nIf this setting is active, by clicking on a node with the left mouse button and then selecting\n“Show/hide outgoing nodes”\noption, the graph data will be loaded in parts, loading of each next part will be initiated by opening the next graph node on the interface.\nTo draw the graph with this setting, it is required to configure the connection between the node, from which the outgoing nodes should be shown, and the drawing conditions specified in the SQL source. To do this, add a parameter type connection to the source parameter by clicking on the\nbutton.\nThe parameter is available when manually specifying the graph rendering depth on the \"Display style\" tab.\nParameter type\nSelecting the parameter type to configure the connection between the node, from which the partial data loading is performed, and the SQL source.\nThe following parameter types can be set using the drop-down list:\ngraph depth - the number of links directed downward from the root element;\nroot node - the element from which the graph will be drawn;\nconnection type - the type of nodes connection, which is selected for drawing the graph.\nSource parameter\nSelects the source parameter to configure the connection between the node, from which the partial data loading is performed, and the SQL source.\nThe selection is made from the parameters of the SQL source added to the dashboard.\nAdding an action to the diagram\nButton with action\nSelecting/adding an action to the diagram.\nButton name\nButton name.\nIf the default icon is assigned to the action (for example, the \"Favorites\" action), then an icon will be displayed instead of the specified name.\nDisplay the button on the diagram\nDisplaying the action button in the dashboard control panel.\nDisplay the button in the context menu\nDisplaying the action button in the context menu of the graph element.\nVis.js (Json) settings\nA parameter where additional chart options are set using JSON code.\nWorking with the graph\nWhen working with the graph, the user has a number of options.\nBy default, the buttons are placed in the lower left corner of the area to offset the chart, and in the right corner to change the scale and center the graph.\nThe user can adjust the scale of the graph using the mouse wheel if the business administrator has added the appropriate option to the JSON code when configuring the dashboard.\nThe buttons in the graph control panel are:\nrefresh\nallows users to get the most updated version of the graph;\nopen in new window\n;\ngraph export\nis used to download the graph on a computer as .png;\nsearch area\nis used for searching for objects based on query. The nodes of the corresponding objects are highlighted on the diagram.\nThe area of the Graph analytical panel is interactive, the user can create a logical structure or arrange elements at his discretion by moving nodes.\nRight-clicking on a node opens a context menu with the following buttons:\nshow path to element\n– displaying the path from the selected element to the root node;\nopen in new tab\n– opening the selected node’s object profile in a new tab;\nThis option is available both in the context menu and by double-clicking on a node, if the business administrator has activated the appropriate setting.\nshow/hide outgoing nodes\n– adjusting the depth of graph rendering;\ngroup\n– grouping of objects by a common feature (previously configured by a business analyst).\nThe business analyst can add additional buttons to the graph control panel and the node’s context menu when configuring the dashboard.\nUse case\nUsing the Graph dashboard, model the links between the various components of the computer. Consider the step-by-step setup.\nStep 1. Creating an object model\nAs part of the task, create two object types:\n\"Computer components\" is a directory that contains information about computer parts;\nComponent instances are created in the type registry, icons can be added to the graph:\n\"Links between components\" is a type for storing a list of links between various computer components.\nTo specify the links between each component, object attributes of the \"Computer components\" type are created in the object type:\nInstances are added to the type registry, which define the links between components:\nStep 2. Creating of a data source\nBased on the created object model, now we can create an\nobject data source\n.\nThe \"Computer components\" object type is added to the source twice.\nNext, based on the attribute composition of the added object types, the fields of the source are determined on the \"Fields\" tab.\nThe listed objects are linked to each other through attributes such as \"Links between components\".\nStep 3. Preparing the dashboard\nAfter creating the\ndashboard\n, click\nto access the visual editing mode.\nNext, add the data source created in Step 2 by clicking the \"Source management\" button.\nDrag and drop the \"Graph\" dashboard to the workspace.\nClick\nto access the settings.\nStep 4. Setting up the \"Graph\" dashboard\nThe following parameters should be specified in the modal window of the Graph dashboard:\non the \"Base\" tab, the source of the Components dashboard is selected, after which the corresponding source fields are specified in the node link settings.\nUsing the switches, configure the graph display in the form of a tree with automatic rendering depth and activate the option to open an object by clicking on an element of the graph:\non the \"Style of design\" tab, set the nodes and configure their display as icons:\nAs a result, the graph will be as follows:\nAdditional settings\nIt is also possible to configure:\n1. Sorting by filter.\nConsider the filtering setting:\nwith root node selection\n;\nnodes by link type\n.\nFor example, in order to configure the\ndisplay of links from a specific node\n:\nDrag and drop the\n\"Control element\"\ndashboard to the workspace, in the settings of which specify the values of the following parameters:\nSave the visual to automatically create a dashboard parameter, the name of the parameter is set to the name of the control element by default.\nThe created parameter will be inserted into the \"Link to parameter\" field automatically after saving the dashboard visual.\nIn the settings of the \"Graph\" dashboard, go to the \"Filter\" tab and add a filter in which the link of the corresponding control with the graph element is configured.\nAs a result of these settings, a relationship tree will be built in the graph display area, the root node of which will be the object selected in the control element:\nFor example, it is also possible to configure\nnode filtering by link type\n. The computer components can be related not only by \"includes\" but also by compatibility.\nTo do this, it is necessary to:\nCreate the object type \"Component link type\" by adding two instances in it – \"Includes\" and \"Compatible\".\nIn the \"Links between components\" object type, add an object attribute of the \"Component link type\" type, and when creating new instances, select the required link type.\nIn the data source:\nadd a new \"Component link type\" object type;\ndefine the source fields for the added type;\nset up a link between the \"Links between components\" and \"Component link type\" types;\nset the filtering conditions.\nTo do this, a source parameter is created on the \"Filtering conditions\" tab:\nA filtering algorithm is added for the \"Links between components\" object type:\nIn the algorithm, specify the name and identifier of the algorithm and select the data source.\nTo write an algorithm:\nselect the basic object type, and then use the\nattr\nfunction to insert the attribute \"Component link type\" in the left side of the condition;\ncreate a filter parameter and add it to the right side of the condition with the\nparam\nfunction.\nAfter that, associate the filter parameter with the previously added source parameter:\nDrag and drop the\n\"Control element\"\ndashboard to the workspace, in the settings of which specify the values of the following parameters:\nSave the visual to automatically create a dashboard parameter, the name of the parameter is set to the name of the control by default.\nIn source management, associate the source parameter with the dashboard parameter.\nAs a result of these settings, a relationship tree will be built in the graph display area according to the link type selected in the control element:\nThe link tree can be filtered by link type and\nroot node\nat the same time.\nFor example, this way user can view the compatibility configuration for each individual computer component.\n2. Data grouping.\nThe graph nodes can be grouped by a common feature, for example, by the company of the manufacturer (within the considered example there are components of A, B, C, etc).\nTo implement it will require:\nAdd the \"Brand\" attribute to the \"Computer components\" object type and, when creating instances, fill in the value of this attribute if necessary.\nIn the data source, add the corresponding source fields:\nWhen configuring the “Graph” analytical dashboard, go to the “Design style” tab and select values for node grouping parameters.\nIf necessary, the grouped nodes can be displayed as icons.\nAdding an individual icon to each group is done similarly to adding an icon to a component.\nGrouping is performed only for nodes located at the same level of the hierarchy.\n3. Displaying nodes as images\nThe nodes of a graph can be presented as images:\nTo implement it will require:\nAdd an “Image” attribute of type “File” to the object type “Computer components” with\n“Image” visual\n.\nGo to the type registry and add the required files in the object profiles:\nIn the data source, add the corresponding source fields:\nIn the settings of the “Graph” analytical dashboard go to the “Design style” tab, where:\nactivate the switch of the “Display nodes as icons” parameter;\nspecify the fields added to the source as the values of the parameters “Field with icons of the node from which the connection is coming” and “Field with icons of the node to which the connection is coming”.\nIf there is no image, the node will be displayed as a tile, the color of which can be set in the parameters:\n“Color algorithm of the node from which the connection is coming”;\n“Color algorithm of the node to which the connection is coming”.\nIn\nprovided example\n, no image is loaded for the “Periphery” node.\n4. Additional options via JSON code.\nFor example, in the \"Settings Vis.js (Json)\" parameter on the \"Advanced\" tab, add the following code:\n{\"layout\": {\"improvedLayout\":true,\"hierarchical\": {\"enabled\":true,\"direction\": \"UD\",\"shakeTowards\":\"roots\",\"sortMethod\": \"directed\",\"levelSeparation\":200,\"nodeSpacing\":250}},\"nodes\":{\"color\":\"#eeeeee\"},\"interaction\":{\"multiselect\":false,\"hover\":true,\"navigationButtons\":false,\"keyboard\":true},\"edges\":{\"color\":\"#aaaaaa\",\"smooth\":{\"enabled\":true,\"roundness\": \"0.5\",\"forceDirection\": \"vertical\"}}}\nasciidoc\nCopied!\nWith this setting, the graph will be as follows:\nMore information about the graph library can be found\non external resource\n.",
  "source": "https://docs.greendata.ru/platform/en/the-graph-dashboard.html"
}