{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.445.4 от 27.01.2025\nНовые возможности\nУлучшен интерфейс для\nсоздания\nи\nработы с алгоритмами\n, помимо этого, для пользователей On-premise-решения появилась возможность отладки алгоритма.\nВ\nпредметной области\nпоявилась возможность добавления потомков на диаграмму.\nУсовершенствован поиск\nглавного меню\n, теперь вместе с результатом поиска доступно отображение его вложенных пунктов.\nИзменения и улучшения\nСтабилизировано возвращение по кнопке \"Назад\" из нового экземпляра в реестр с установленным фильтром по атрибуту.\nВосстановлено корректное поведение при нажатии на элемент развертывания/скрытия выпадающего списка в модальном окне выбора типа при создании экземпляра.\nСтабилизирована возможность выбора значений в объектных атрибутах, ссылающихся на примитивный тип объекта.\nСкорректирована проверка прав на открытие объекта в дочернем атрибуте.\nСкорректировано отображение выбранных значений в заблокированном атрибуте.\nУлучшена обработка\nвыражений\nпри установке значения в дочерний атрибут создаваемого экземпляра.\nСтабилизирована возможность пересчета\nвыражений\nв типе объекта.\nОтлажены процессы\nредактирования\nячейки реестра и применения алгоритма блокировки редактирования поля к колонке, добавленной в\nобъединенную шапку\n.\nСтабилизировано отображение кнопки настройки в реестре \"Шаблон дашборда\".\nВ\nнастройках реестра\nвосстановлена работоспособность опций \"Наименование модального окна при создании нового объекта\" и \"Заголовок в карточке детализации\".\nВ\nрежиме редактирования реестра\nстабилизирована возможность выбора объектов, ссылающихся на себя.\nОтлажена возможность перемещения\nряда\nиз\nгруппы атрибутов\nв свободную область и применение опций \"Отображать переключатель как радиокнопки\" для\nгруппировки \"Группа вкладок\"\n.\nСтабилизировано отображение и отлажена возможность обновления данных в\nвиджетах \"Дашборд\"\n, размещенных в скрытых\nэлементах группировки\n.\nОптимизированы настройки\nвиджета \"Текст\"\n.\nДоработаны настройки атрибутов представления и порядка фактов\nмногомерного куба.\nВ\nаналитической панели \"Таблица\"\nстабилизирована возможность\nрасшифровки данных\n, а сохранение изменений ширины и расположения столбцов теперь осуществляется только в настройках представления.\nПри создании новых\nаналитических панелей\n, где допускается настройка ширины и высоты элемента, определены значения по умолчанию.\nСтабилизирована возможность настройки\nаналитической панели дашборда \"Канбан-доска\"\n.\nДля ряда функций в редакторе алгоритмов оптимизирован внешний вид модальных окон.\nВ\nобъектном источнике данных\nскорректирована возможность создания алгоритма фильтрации.\nДоработана возможность\nустановки обновлений\nс иерархическими объектами, ссылающимися на объекты устанавливаемого guf-файла.\nПри удалении пользовательской\nтемы оформления\n, установленной по умолчанию, в системе по умолчанию используется системная тема \"Материал\".\nОтлажена работа алгоритмов проверок при завершении задачи.\nСтабилизировано сохранение выбранного значения роли сотрудника при настройке сервисной задачи.\nПри работе с\nаудитом\nдоработаны возможности фильтрации и экспорта данных.\nСтабилизировано отображение выпадающего списка с результатами запроса\nсервиса DaData\n.\nПри работе с\nтрансформированной отчетностью\nстабилизировано отображение количества страниц в формах отчетности и алгоритма в соответствии с выбранной строкой формы отчетности.\nСтабилизировано отображение строк в форме отчетности при масштабировании экрана.\nВ модуле EDoc стабилизированы загрузка, печать и скачивание электронного документа, в том числе отображение разрывов строк, применение алгоритмов видимости, соблюдение ширины столбцов и соответствующее количество листов.\nВ модуле EDoc отлажена возможность редактирования шаблона  и процесс загрузки файла шаблона в печатную форму.\nВ модуле EDoc стабилизированы процессы добавления комментария к выделенному фрагменту, принятия правок электронного документа и закрепление цвета правок пользователя в рамках одного документа.\nПри работе с\nчат-ботом\nотлажено получение уведомлений и отображение чатов в\nмобильном приложении GreenData\nтолько в случае перевода чата на оператора.\nВ\nGreenData Messenger\nстабилизированы звонки и доработана возможность поиска по фрагменту ссылки и стабилизировано отображение созданного чата во всех версиях.\nОтображение карточки\nдашборда\nскорректировано в зависимости от прав доступа пользователя.\nСкорректировано наименование атрибутов и настроек электронного адреса в типе \"Персональные данные\" [SYS_EMPLOYEE].\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.445.4\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.445.4.war\nhttps://downloads.greendatasoft.ru/LTS/lts.445.4.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.445.4-latest.html"
}