{
  "title": "Системное действие. Параметры для автоматического запуска ETL",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСистемное действие. Параметры для автоматического запуска ETL\nСистемное действие\nс расширением \"Параметры для автоматического запуска ETL\" дает возможность инициировать запуск другого ETL-процесса в ходе выполнения основного ETL-процесса.\nДанный функционал также может быть настроен посредством преобразователя данных с настроенным\nтрансформатором \"Запуск вложенной ETL\"\n.\nПри\nнастройке схемы ETL\nс панели действий и компонентов необходимо перетащить (Drag&Drop) в рабочую область элемент задачи. После чего нажатием на кнопку\nв меню действий выбрать тип \"Этап. Системное действие\":\nПараметры настройки\nДля перехода к параметрам настройки системного действия необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего откроется новая вкладка, на которой в модальном окне необходимо выбрать расширение \"Параметры для автоматического запуска ETL\":\nПосле чего Система отобразит соответствующие параметры настройки:\nПараметр\nНазначение\nОбъект ETL\nВыбор объекта ETL, который будет запущен в ходе выполнения основного ETL-процесса.\nАлгоритм для формирования параметров запуска ETL\nОпределение алгоритма для формирования параметров стартового экземпляра запускаемого объекта ETL.\nВ поле \"Базовый тип объектов\" алгоритма должен быть выбран\nтип стартового объекта\nзапускаемого объекта ETL.\nВ поле \"Контекстный тип объекта\" алгоритма должен быть указан тип стартового объекта текущего ETL-процесса (на схеме которого расположено настраиваемое системное действие).\nДля получения значения атрибута экземпляра текущего ETL-процесса можно воспользоваться функцией\ncontextObjAttr\n.\nПример\nПредположим, что имеется ETL-процесс для отправки\nисключений календаря\n(данных по рабочим и праздничным дням) в\nочередь сообщений\n– \"Отправка исключений календаря в очередь\":\nА при выполнении ETL-процесса \"Синхронизация календаря праздничных дней из внешнего сервиса\", используемого для выгрузки исключений в календарь, появилась необходимость отправки данного календаря в очередь сообщений.\nРассмотрим реализацию данной задачи посредством добавления системного действия.\nГотовая интеграция на основе ETL по загрузке данных о праздничных и рабочих днях в календарь доступна для установки на\nмаркетплейсе\n.\nВ данном случае на\nсхему ETL\n\"Синхронизация календаря праздничных дней из внешнего сервиса\" добавляется этап типа \"Этап. Системное действие\".\nПосле сохранения схемы ETL можно перейти к настройкам системного действия по кнопке\nв меню действий этапа. На открывшейся странице выбирается расширение \"Параметры для автоматического запуска ETL\", после чего параметры настроек определяются следующим образом:\nв качестве объекта ETL выбирается ETL-процесс для запуска – \"Отправка исключений календаря в очередь\";\nалгоритм для формирования параметров запуска ETL формируется следующим образом:\nбазовый тип –\nтип стартового объекта\nETL-процесса \"Отправка исключений календаря в очередь\" –\nзначение по умолчанию \"ETL. Экземпляр объекта ETL\"\n;\nконтекстный тип –\nтип стартового объекта\nETL-процесса \"Синхронизация календаря праздничных дней из внешнего сервиса\" – \"ETL. Синхронизация календаря праздничных дней\";\nв коде алгоритма необходимо передать значение атрибута контекстного типа \"Календарь\" в атрибут базового типа, в качестве которого можно использовать любой подходящий по типу атрибут, например, \"Объект, по которому запускается ETL\".\nдля записи значений в атрибут \"Объект, по которому запускается ETL\" вызывается функция\nattr\nс признаком \"Установить значение\";\nполучение значения атрибута \"Календарь\" экземпляра текущего ETL-процесса осуществляется функцией\ncontextObjAttr\n.\nВ результате данных настроек при выполнении ETL-процесса \"Синхронизация календаря праздничных дней из внешнего сервиса\" будет осуществлен запуск ETL-процесса \"Отправка исключений календаря в очередь\" для отправки календаря в очередь сообщений.",
  "source": "https://docs.greendata.ru/platform/ru/system-action-etl-autorunning-parameter.html"
}