{
  "title": "Работа с ETL через API",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРабота с ETL через API\nИспользование\nAPI\nпредоставляет возможность выполнять различные операции для взаимодействия с\nETL-процессами\n, например, осуществлять их запуск, мониторинг состояния или передачу данных.\nВозможность работы с ETL через API регулируется наличием права на \"Выполнение\" соответствующего объекта ETL.\nДля обеспечения гибкости, масштабируемости и возможности интеграции с другими системами и инструментами при отправлении HTTP-запросов поддерживаются методы GET, POST, PUT, DELETE.\nПри этом используются HTTP-запросы следующего\nвида\n:\n{url}/hooks/etl/{token}/{ident_ETL}?{query_params}\ntext\nCopied!\nгде:\n{url} – адрес приложения, к которому осуществляется запрос;\nhooks – наименование API;\netl – плагин для работы с ETL;\n{token} –\nтокен для подключения\n;\nПараметр \"token\" используется опционально.\nС доступными способами аутентификации можно ознакомиться в\nстатье\n.\n{ident_ETL} – идентификатор\nобъекта ETL\n;\nПараметр \"ident_ETL\" используется опционально.\nИдентификатор объекта ETL может быть передан через параметр запроса.\nИдентификатор объекта ETL может содержать переменные, например:\nВ таком случае для запуска ETL-процесса запрос может принять следующий вид:\nhttps://demo-distr.greendatasoft.ru/hooks/etl/OBJECT_ETL/258\ntext\nCopied!\n{query_params} – параметры запроса в зависимости от выполнения определённых операций или получения данных.\nВ примерах, рассматриваемых в текущей статье, предположим, что:\nадрес стенда, к которому осуществляется запрос –\nhttps://demo-distr.greendatasoft.ru/\n;\nдля аутентификации используется\nпользовательский токен\n, указанный в заголовке запроса \"X-LowCode-Private-Token\".\nС остальными вариантами аутентификации посредством HTTP-запроса можно ознакомиться в\nстатье\n.\nДля удобства в этой статье будет рассмотрена отправка запросов при помощи приложения Postman. В качестве альтернативы можно использовать иные приложения.\nВ Системе возможно настроить информирование пользователя (ответное сообщение от ETL), перенаправление HTTP-клиента на заданную карточку объекта, передачу значения атрибута в ETL.\nЗапуск ETL\nДля запуска ETL-процесса через API достаточно в HTTP-запросе передать идентификатор\nобъекта ETL\n, к которому осуществляется запрос.\nЭто можно сделать через параметр пути \"ident_ETL\" или параметр запроса \"ident\".\nНапример, идентификатор\nобъекта ETL\n– ETL_FOR_API, в таком случае для запуска ETL-процесса можно отправить следующий GET-запрос:\nВ данном случае идентификатор\nобъекта ETL\nпередается через параметр запроса:\nhttps://demo-distr.greendatasoft.ru/hooks/etl?ident=ETL_FOR_API\ntext\nCopied!\nЕсли же указать идентификатор\nобъекта ETL\nв параметре пути \"ident_ETL\", тогда запрос примет вид:\nhttps://demo-distr.greendatasoft.ru/hooks/etl/ETL_FOR_API\ntext\nCopied!\nПередача данных в ETL посредством POST-запроса\nПри POST-запросе передачу данных на ETL осуществляют через тело запроса.\nВ рассмотренном примере то, что указано на вкладке \"Body\", запишется в\nэкземпляр объекта ETL\nв параметр \"Ответ внешнего сервиса\".\nРаспознавание параметров GET-запроса\nПри GET-запросе передачу данных на ETL осуществляют через параметры запроса.\nРаспознавание GET-запросов в приложении может быть настроено через параметр запуска ETL\n\"Объект с настройкой ETL\"\n, добавленного в\nобъекте ETL\n.\nПередаваемые в запросе данные могут быть разобраны в:\nДинамическую структуру\n.\nПри активном параметре \"Разбирать параметры get-запроса в динамическую структуру (Ответ внешнего сервиса в виде json)\" запись полученных данных осуществляется в параметр\n\"Ответ внешнего сервиса\"\n.\nАтрибуты экземпляра объекта ETL\n.\nПри активном параметре \"Разбирать параметры get-запроса в атрибуты экземпляра\" запись полученных данных осуществляется в атрибуты объекта\nстартового типа\n.\nПример настройки.\nДопустим, через параметр GET-запроса будет передана фамилия, которую требуется сохранить в качестве значения одноименного атрибута в экземпляре объекта ETL. Помимо этого на основании полученных данных необходимо записать динамическую структуру в качестве ответа внешнего сервиса.\nДля этого необходимо выполнить следующие действия:\n1. Создать дочерний тип \"Дочерний экземпляр объекта ETL\" от типа \"ETL. Экземпляр объекта ETL\", в атрибутивном составе которого добавить строковый атрибут с идентификатором \"SURNAME\".\n2. Создать\nобъект ETL\n[OBJECT_ETL] со следующими настройками:\nв параметре \"Тип стартового объекта\" выбрать ранее созданный тип объекта \"Дочерний экземпляр объекта ETL\" – это позволит при запуске ETL-процесса создавать экземпляры указанного типа;\nв параметре \"Объект с настройкой ETL\" добавить объект, в котором установить значение \"Да\" параметрам:\nРазбирать параметры get-запроса в атрибуты экземпляра;\nРазбирать параметры get-запроса в динамическую структуру (Ответ внешнего сервиса в виде json).\n3. Для передачи значения атрибута в ETL\nHTTP-запрос\nдолжен содержать:\nпараметр пути – OBJECT_ETL (идентификатор\nобъекта ETL\n);\nпараметр запроса, содержащий:\nидентификатор атрибута стартового типа объекта ETL – SURNAME;\nпередаваемое значение – Ivanov.\nПример GET-запроса:\nhttps://demo-distr.greendatasoft.ru/hooks/etl/OBJECT_ETL?SURNAME=Ivanov\ntext\nCopied!\nВ результате выполнения запроса в типе \"Дочерний экземпляр объекта ETL\" будет создан\nэкземпляр объекта ETL\n, в котором:\nв атрибут \"Фамилия\" будет сохранено значение \"Ivanov\":\nв качестве ответа внешнего сервиса будет записана следующая динамическая структура:\nЛогирование стартового запроса\nСтартовый запрос – HTTP-запрос, при помощи которого осуществлен запуск ETL.\nВозможность записи информации о данном запросе в лог настраивается через параметр запуска ETL\n\"Объект с настройкой ETL\"\n, добавленный в\nобъекте ETL\n.\nДля записи в протокол записи ETL (лог) данных стартового запроса необходимо установить значение \"Да\" параметру\n\"Логирование стартового запроса\"\n.\nНапример, если осуществлен следующий запрос:\nВ лог выполнения будет добавлена следующая информация:\nВ данном примере идентификатор\nобъекта ETL\nсодержит переменную, которая будет записана в лог в качестве значения pathVariables:\nНастройка ответного сообщения от ETL\nНастройка ответа от ETL предполагает его формирование в ходе выполнения процесса ETL.\nДля настройки ответного сообщения необходимо на\nсхеме ETL-процесса\nперейти в настройки\nконечного события\n.\nЕсли конечных событий несколько, сформированные ответы могут отличаться, в зависимости от настроек каждого элемента.\nДля отправления ответа ETL внешнему сервису достаточно в настройках конечного события активировать одноименный признак. В результате чего отобразятся параметры настройки ответа внешнему сервису.\nПараметр\nНазначение\nАлгоритм формирования ответа\nФормирование ответного сообщения на основании алгоритма (рассмотрено\nдалее\n).\nАлгоритм должен возвращать текст или необходимый код.\nАлгоритм HTTP статуса ответа\nФормирование\nкода ответа сервиса\nна основании алгоритма (рассмотрено\nдалее\n).\nАлгоритм должен возвращать целое числовое значение.\nЕсли алгоритм не задан, по умолчанию при успешном выполнении запроса используется код 200.\nПеренаправлять запрос при вызове внешним сервисом\nЛогический атрибут, предоставляющий возможность перенаправления запроса.\nАдрес перенаправления настраивается в параметре \"Алгоритм адреса для перенаправления\".\nАлгоритм адреса для перенаправления\nОпределение алгоритма перенаправления запроса. Алгоритм должен вернуть\nтекст\nс URL-адресом.\nПри перенаправлении на внешние ресурсы указываются абсолютные URL-адреса.\nДля перенаправления в рамках приложения, например, на карточку какого-либо объекта, достаточно использовать относительный URL-адрес (рассмотрено\nдалее\n).\nДопустим, запуск ETL-процесса с идентификатором \"ETL_FOR_API\" осуществляется при помощи запроса:\nhttps://demo-distr.greendatasoft.ru/hooks/etl/ETL_FOR_API\ntext\nCopied!\nПосле активации параметра \"Сформировать ответ внешнему сервису\" по умолчанию сформируется ответ в формате JSON в виде данных, которые пришли на конечное событие.\nНапример, если перед конечным событием расположен источник со следующими настройками:\nВ таком случае при отправлении запроса будет получен следующий ответ:\nАлгоритм формирования ответа\nДля формирования ответного сообщения используется алгоритм, возвращающий текстовое сообщение при помощи функции\ntext\n, например:\nПри запуске ETL-процесса через URL браузер не сможет разобрать полученные символы, но зафиксирует сформированный ответ.\nHTTP статуса ответа\nДля замены HTTP статуса ответа используется алгоритм, возвращающий целое число, например:\nПеренаправление HTTP-клиента\nДопустим, при HTTP-запросе необходимо настроить перенаправление на:\nСтраницу компании GreenData.\nКарточку объекта Системы.\nДля этого в настройках конечного события необходимо выбрать значение \"\nДа\n\" в параметре \"Перенаправлять запрос при вызове внешним сервисом\", после чего в параметре \"Алгоритм адреса для перенаправления\" добавить алгоритм, в котором указать URL-адрес перенаправления посредством функции\ntext\n.\nДля перенаправления на страницу компании GreenData в алгоритме в виде текста необходимо указать абсолютный URL-адрес:\nВ результате чего при HTTP-запросе браузер откроет запрашиваемую страницу:\nДля перенаправления на карточку объекта в алгоритме в виде текста достаточно указать относительный URL-адрес:\nВ результате запроса браузер присвоит заголовку ответа \"\nLocation\n\" URL карточки, указанной в алгоритме, после чего будет открыта страница \"https://demo-distr.greendatasoft.ru/card/837805\".",
  "source": "https://docs.greendata.ru/platform/ru/working-with-etl-via-api.html"
}