{
  "title": "Настройка схемы ETL",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка схемы ETL\nСхема ETL представляет собой последовательность выполнения этапов ETL-процесса, необходимых для извлечения данных из различных источников, их преобразования и загрузки в целевую систему.\nПереход к созданию/настройке схемы ETL осуществляется по кнопке\n, доступной в\nпанели управления\nреестра\nобъектов ETL\nили непосредственно в карточке сохраненного объекта ETL.\nСоздание схемы ETL-процесса предполагает перетаскивание (Drag&Drop) необходимых действий и компонентов в рабочую область с последующим выбором типа добавленных элементов, определение порядка обработки данных посредством настройки связей и сохранение схемы.\nСохранение схемы ETL осуществляется при помощи кнопки\nв панели управления.\nПо нажатию на кнопку\nсформированная в рабочей области диаграмма будет сохранена на устройство пользователя в формате svg.\nПри необходимости в поле \"Наименование\" можно заменить наименование объекта ETL.\nСодержание схемы\nРабота со схемой процесса ETL аналогична настройке схем бизнес-процессов (подробнее,\n\"Настройка схем бизнес-процессов\"\n).\nИсключением является использование таймеров. В схемах ETL\nработа с элементом\nTimer Intermediate Catch Event\nв настоящий момент\nне реализована\n. Альтернативная организация работы по таймеру представлена\nдалее\n.\nПри разработке схем ETL используются следующие элементы:\nисточник данных\n;\nпреобразователь данных\n;\nприемник данных\n;\nсистемное действие\n;\nшлюз\n;\nграничное событие\n;\nподпроцесс\n.\nДля\nсоздания нового элемента\nна схеме процесса ETL необходимо\nперетащить его\nс плавающей панели слева.\nДля\nсоздания связи\nнеобходимо\nвыделить исходный элемент и протянуть стрелку\nдо элемента-назначения.\nДля выбора типа элемента ETL-процесса необходимо нажать на этап, после чего в открывшемся контекстном меню нажать на кнопку\n.\nДля\nпросмотра параметров элемента\nпроцесса необходимо в контекстном меню этапа необходимо нажать на кнопку настроек\n.\n1.\nПросмотр параметров\nэлемента\nдоступен после его сохранения\nна схеме ETL.\n2.\nНаименования элементов задаются на самой схеме процесса ETL\nпосле двойного клика по нему.\nОтладка схемы ETL\nПри настройке схемы ETL-процесса рекомендуется\nвыполнять отладку каждого вновь добавленного элемента процесса ETL.\nДля этого следует:\nСоединить настроенный этап с конечным элементом (End Event).\nСохранить схему ETL-процесса.\nЗапустить ETL-процесс.\nПри использовании на схеме процесса этапа \"\nИсточник. Внешний сервис\n\" предполагается получение ответа внешнего сервера, который в зависимости от настроек может быть получен из алгоритма,\nочереди сообщений\n,\nслушателя e-mail сообщений\nили\nчерез API\n.\nДля отладки процесса ожидаемый ответ внешнего сервера может быть сымитирован.\nДля этого\nзапуск ETL\nосуществляется по кнопке действия или путем создания экземпляра объекта ETL, при этом на открывшейся карточке экземпляра объекта ETL необходимо вручную указать данные для отладки в параметре \"Ответ внешнего сервера\", расположенном на вкладке \"Общие\".\nВ случае настройки простого ETL-процесса, состоящего из\nисточника\nи\nприемника данных\n, между ними рекомендуется добавить\nпреобразователь\n.\nВ случае изменения логики процесса в отлаженной схеме добавленный преобразователь данных упростит процесс перенастройки типов связи (подробнее о настройке типов связей:\n\"Приемник. Внутренний\"\n).\nВ случае разветвления процесса ETL его выполнение будет происходить \"сверху–вниз\".\nПри успешном выполнении ETL-процесса в правом нижнем углу экрана отобразится соответствующее уведомление:\nИначе будет отображено уведомление следующего вида:\nОзнакомиться с процессом выполнения ETL-процесса можно в логе, расположенном в соответствующем\nэкземпляре объекта ETL\n.\nПросмотр всех экземпляров объектов ETL доступен при последовательном выборе пунктов главного меню: Интеграция → Протокол запуска ETL:\nАльтернатива таймера\nВ настоящий момент использование элемента \"\nTimer\n\" на схеме ETL не реализовано. Для запуска процесса ETL с задержкой по времени можно:\nреализовать запрос с задержкой;\nНапример, работая в среде PostgreSQL, необходимо выполнить команду\nSELECT pg_sleep(1.5)\n.\nс помощью алгоритма использовать функцию\nsleep(3000)\n, указывая время задержки в миллисекундах.\nДля вычисления времени выполнения процесса необходимо сравнить дату создания\nэкземпляра ETL\nс текущей. Это задается с помощью алгоритма на элементе\n\"Трансформатор\"\nсхемы ETL.\nАлгоритм может принять следующий вид:\nВ алгоритме объявлены\nновые переменные\n:\nпервой при помощи функции\nattr\nприсваивается значение атрибута \"Дата создания\"\nэкземпляра ETL\n;\nвторой –\nтекущая дата\n;\nтретьей – количество секунд между датой создания\nэкземпляра ETL\nи текущей, которое вычислено при помощи функции\nreportDatesBetween\n.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-an-etl-schema.html"
}