{
  "title": "Setting up an instance for the GreenData mobile app",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up an instance for the GreenData mobile app\nTo customize\nGreenData’s mobile app\nfor specific tasks and user preferences, a number of customizations need to be made in the web version of the app (on the instance).\nThe web version app settings allow defining:\nstart page of the mobile app\n;\nthe composition and sequence of\nmenu items of the mobile application\n;\nthe display of and access to system objects:\nobject type registry\n;\nobject instance\n;\ndashboard\n;\nstart a business process\nby object.\nThe changes made at the instance will be displayed in the mobile application only after re-authorization.\nDesign theme\nBy default,\nmobile application\nuses the \"Mobile Material\" system theme.\nTo configure a custom theme, select the following items sequentially in\nuser profile menu\n: Application Management → Theme designer.\nThe user can configure the theme if they have\naccess permissions\nto the corresponding item\nuser profile menu\n.\nA new design theme can be created in the \"Mobile app theme\" section using the\nbutton or using the copy option\nin the hover of an existing theme.\nThe custom theme is edited in\ntheme designer\n, which is displayed on the right side of the workspace after clicking on the icon in the theme hover\n, the theme is deleted by clicking on the icon\nfollowed by confirmation of the action in the modal window.\nChanging the settings for the design theme is available to the user if they have\nthe permission\nto \"Write\" the corresponding instance of the design theme. Otherwise, editing the theme will not be available.\nThe system theme can only be copied.\nWhen setting up the\nmobile application\ntheme, the color palette of the application elements is set for light and dark themes.\nThe theme designer specifies the name of the custom theme and defines the colors (the color palette for the light and dark themes are set in the appropriate sections):\nThe color is selected using the Color picker on the palette or by entering the color code in RGBA or HEX formats.\nmain – the main contrasting color of the application, which is used for buttons, the side menu and the header of the home page;\nsecondary – the color used for icon buttons, attributes, outlines, and lines;\ntertiary – the color of links inside the application;\nwarnings – the color that is used for \"warning\" type notifications and as a warning marker;\nerrors – the color used for error alerts;\nbackground – the background color of the profiles and registers;\ntext – the color of the main text, registers, headings in the profile and in the registry header.\nTo save edits in the theme designer, click on the \"Save\" button.\nIf necessary, the \"Reset changes\" button to undo the edits made and return to the last saved version can be used.\nTo use the theme, set the corresponding check:\nThe default theme will be displayed for all users of the application. In there is no of\naccess permissions\nto \"Read\" the default user theme, the system theme \"Mobile Material\" will be displayed to the user.\nLogin pages\nThe authorization, registration, password recovery and change pages (hereinafter referred to as login pages) in the mobile application can be designed qccording to the user’s business idea and preferences.\nLogin pages are configured in\nlogin page constructor\n, which is accessed by sequentially selecting\nuser profile menu\nitems:  Application management → Theme designer.\nThe user can configure the login pages if they have\naccess permissions\nto the corresponding\nuser profile menu\nitem.\nThe settings set in the constructor are adapted to display the pages in\nmobile version of the application\nafter activating the \"Apply settings in mobile application\" switch in the \"Mobile application\" section and saving the settings.\nThe applied page display settings will be available to the user after reopening the authorization page.\nExample of a customized user authorization page:\nIf the authorization page is customized on the instance:\nThe authorization page in the GreenData mobile app will look as follows:\nStart page\nBy default, in the mobile app, the user can customize the start page by defining the visibility of standard widgets (more details in the\n\"GreenData Mobile App\"\narticle).\nThe default menu view (its location) and buttons in the start page toolbar are defined via\nsystem settings\nof the mobile app.\nThe ability to set a custom start page in the mobile app is provided with the following settings:\nWhen creating/customizing\nstart page\n, the “Use in mobile app” switch must be activated.\nIf the start page is used as:\nobject, the “Use in mobile app” switch must be activated in the\nvisual\nsettings;\nRecommendations for customizing an object’s visual for display in a mobile app are provided\nbelow\n.\nregistry, then it is important to consider the features discussed\nbelow\n.\nThe user must have permissions to view the page, more examples of issuing start page permissions can be found in the\narticle\n.\nMenu items\nMobile application menu items are configured in the registry of the “Mobile application menu” object type, for quick access to which\nsequentially select\nmain menu items\n:\nAdministration → Settings → Mobile menu settings.\nBy default, the mobile application menu contains the following items: \"Tasks\", \"Dashboards\", \"Chats\" and \"Contacts\".\nThese items cannot be deleted, but it is possible to hide unnecessary ones via\naccess to system objects\n, where security principal (users/access groups) should be removed from the “Read” permission of the corresponding instances of the “Mobile application menu” object.\nThe visibility of the menu item to go to the web version of the application and the ability to send performance logs via the “Settings” menu item are specified via\nsystem settings\nof the mobile application.\nAdding a new item to the menu of the mobile application is done by clicking\nand selecting the type of the menu item to be created:\nObject - opening an\nobject\nprofile;\nRegistry - opening\nregistry type\n;\nThe visual of an object opened from the registry is controlled by\nregistry setting\n\"Visual on opening\".\nTasks - opening a list of user tasks that are grouped by “Today”, “This week”, and “All” periods;\nThe visual of the task opening is defined in\nstage settings\n.\nExternal link - opening an external link in the browser of the mobile device.\nNext, the parameters of the selected type of mobile application menu item are defined:\nSetting\nPurpose\nName\nThe name of the menu item in the mobile application.\nIdentifier\nIdentifier for recognizing the object in the System.\nIt is allowed to enter an identifier of up to 23 characters, without spaces and special characters, consisting of letters of the Latin alphabet, digits and underscores starting with a letter.\nOrder\nSpecifying the order of the item in the menu.\nThe order of system objects cannot be changed.\nIcon\nThe icon that will be placed next to the menu item.\nThe icon is selected from the drop-down list.\nExpanded by default\nThe parameter is not supported in the mobile version of the application.\nParent menu item\nParameter is not supported in the mobile application.\nAlgorithm to determine object\nSelecting the algorithm to determine the object that will be opened by clicking on the menu item.\nA previously created algorithm is selected from the drop-down list,\ncreating a new algorithm\nis done via the parameter action menu.\nThe parameter is displayed when customizing the menu item of the mobile application of the “Object” type.\nAlgorithm to determine visual (optional)\nSelecting an algorithm to determine the visual of the object that will be opened when the menu item is clicked.\nA previously created algorithm is selected from the drop-down list,\ncreating a new algorithm\nis done via the parameter action menu.\nIf the object visual is not specified, the first visual of the object with the active “Use in mobile application” setting is displayed considering the availability of access permissions.\nRecommendations for customizing the visual of an object for display in a mobile app are provided\nbelow\n.\nThe parameter is displayed when customizing the menu item of the mobile application of the “Object” type.\nObject type to display\nSelecting the type of object whose registry is to be opened by clicking on the menu item.\nWhen setting up a menu item of the “Tasks” type, the object type “WF. Process task” object type and its child types are available for selection.\nThe parameter is displayed when customizing the menu item of the mobile application of the “Registry”/“Tasks” type.\nRegistry\nSelecting the registry to be opened by clicking on the menu item.\nOnly registries of the “Flat registry”, “Light registry” or “Tile registry” type are available for displaying a menu item of the “Registry” type.\nIf no option is specified, then the default registry is displayed.\nThe parameter is displayed when customizing the menu item of the mobile application of the “Registry”/“Tasks” type.\nLink\nA link to go to an external resource that will open a browser (third-party application) on the mobile device when clicked.\nThe parameter is displayed when setting the menu item of the mobile application of the “External link” type.\nIt is required to save the entered data by clicking on\n.\nObject setup\nTo display an object in the mobile app, follow these steps:\nOpen a previously created or\ncreate new object type\n.\nGo to\ntype registry\nand create/open the object.\nGo to\nvisual\nedit mode using\nand customize the visual according to the following guidelines:\nwhen setting up\ngrouping\n, it is recommended to arrange elements in one\ncolumn\n, if needed - no more than two columns;\ndo not overload the interface with a large number of rows, columns and tabs, as it is important to keep the data simple and readable;\nconsider the screen scale of your mobile device;\nTo see an example of a customized visual, it is possible to switch to developer mode in the browser and enable the mobile view of the page display by specifying the necessary screen parameters.\nnote that some\nwidgets\nand\nvisuals for attribute\nare not available in the mobile app.\nList of supported widgets.\n\"Employee Information\" widget\n;\n\"Comments to the object\" widget\n;\n\"Reactions and comments to the object\" widget\n;\n\"Button\" widget\n;\n\"Map point\" widget\n;\n\"Media\" widget\n(video only);\n\"Title by attribute\" widget\n;\n\"Image\" widget\n;\n\"Tip\" widget\n;\n\"Text message\" widget\n;\n\"Attach files\" widget\n;\n\"Figure\" widget\n.\nSave the visual by clicking the\nbutton in the control panel or the “Ok” button in the element panel.\nOpen the\nvisual\nsettings via the actions menu available by clicking\n.\nActivate the “Use in mobile app” toggle and save the changes.\nGrant the required\npermissions\nto work with the object.\nIf an object is selected to be displayed on\nstart page\nor in\nmenu item\n, it is possible to select the displayed visualization.\nMore information about configuring the object visual (including task) opened from the registry is\nbelow\n.\nIf the visual of the object is not specified, the first visual of the object with the active “Use in mobile application” option will be displayed if the corresponding access permissions are granted.\nButtons and actions\nThe buttons and actions configured for display in\nobject control panel\nin the web version have a number of features when displaying the same object in the header in the mobile version:\nno more than three buttons are displayed on the right side of the object header.;\nin some cases,\nicon will be displayed as one of the three possible buttons. Clicking on it opens a context menu containing:\nbuttons that cannot be placed in the header due to exceeding the maximum allowed number;\naction buttons where the name is not hidden in the settings or the icon is not set;\nwhen placing buttons, the order is considered: first, the basic buttons for working with the object are displayed\n,\n,\n, if available there are free places in the header according to the specified order – action icons (in the settings of which the name is hidden), if necessary, the\nbutton is added;\nThe save button\ncan be\nredefined\nby the batch action \"Save and exit\".\nis not displayed in the object header\nTo update the data, use the basic functionality of the user interface of the mobile application – swipe down on the screen.\nonly actions available for the mobile application can be displayed in the object header (more information\nbelow\n);\nnames and icons of actions can be\nredefined\nwhen configuring related object types (with the exception of the \"Favorites\" action);\nicon is always used to display the \"Favorites\".\nUsing dashboards\nIt is possible to place\ndashboard\nwith customized analytical dashboards in the mobile app.\nHowever, it is worth considering that only the following analytical dashboards are supported in the mobile app:\nTable\n;\nStructural diagram\n;\nDynamics chart\n;\nUniversal graph\n;\nControl element\n.\nUsing registry\nThe mobile format supports displaying registries of the “Flat registry” ,\n“Light registry”\n,\n“Tile registry”\n, and\n“Task registry”\ntypes.\nColumn visibility is determined depending on the registry type:\nin a flat registry, only one column is supported to be visible;\nin\ntile registry\nup to two columns can be placed;\nin the\nlight registry\n, all columns of the selected registry are displayed. The width of the registry columns is adjustable in\nsettings\nregistry.\nThis extends the last column placed on the device screen to the right margin, while the remaining columns can be viewed using horizontal scrolling.\nOpening an object from the registry.\nWhen opening an object from the registry, the visual specified in\nregistry settings\nin the “Object visual when opening” parameter is used.\nThe visual when opening a task is specified by\nstage settings\n.\nIf the visual of the object is not specified, the first visual of the object with the “Use in mobile app” option activated will be displayed if the required permissions are granted.\nButtons and actions\nThe buttons and actions configured for display in the registry control panel in the web version have a number of features when displaying the same registry in the header in the mobile version:\nThe buttons locked in the web version are not displayed in the mobile application;\nIf there is no permissions to create an object,\nand\nbuttons are not displayed.\nthe ability to start an action is supported only in the registry of the\n\"Tile registry\"\ntype  via the \"Override click\" option.\nUsing actions\nThe mobile application supports the following system actions:\nStart process;\nSave;\nBack;\nFavorites,\nas well as actions that are configured as a user interface module that specify \"Call algorithm\" or \"Perform algorithm redirect\".\nThe use of batch actions is not supported.\nBusiness process customization\nTo work with business processes, including\ntasks\n, it is necessary to create the corresponding\nbusiness processes\nin the web version of the platform and to\ncustomize\nthem for use in the mobile app.\nTo verify that the connection between the mobile app and the platform is working correctly, follow the steps:\nOpen an empty object registry in the mobile app.\nCreate an object instance and start a business process.\nOpen a task in the mobile application, fill in the required data and save the task profile without completing it.\nVerify that the data is displayed both on the platform and in the mobile app.\nComplete the task in the mobile app and on the platform to make sure that there is a correct connection between them.",
  "source": "https://docs.greendata.ru/platform/en/setting-up-mobile-app.html"
}