{
  "title": "Обзор модуля \"Печатные формы\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОбзор модуля \"Печатные формы\"\nЭлектронные документы\nпозволяют пользователю представить актуальные данные (из объектов и реестров) в формате обычных офисных документов, а также организовать вывод сведений в печатные форматы (например, справки для последующей распечатки, подписания и архивного хранения).\nВозможности электронных документов\nПечатные формы\n– набор инструментов Системы, позволяющий сформировать электронный офисный документ (Word, Excel, PDF), автоматически подставить в него актуальные данные (из атрибутов объектов, справочников или подсчитанные алгоритмически) с последующей выдачей (выгрузкой) файла или его распечаткой.\nДля работы с электронными документами в системе необходимо использовать формат *.docx.\nПри этом\nвыгрузка из системы\nвозможна в следующих форматах: *.docx, *.xls, *.xlsx, *.pdf.\nНа базе модуля \"Печатные формы\", который специализируется на формировании документов офисного формата, развивается и наращивает функционал более универсальный модуль\nЭлектронные документы\n(eDoc), который позволяет:\nучитывать правила (условия сделки или процесса) при заполнении документа;\nзаполнять опросный лист, ответы которого учитываются в формируемом документе;\nинтерактивно согласовать разделы документа различными сотрудниками;\nсогласовывать документ с контрагентами;\nфиксировать возможные замечания к документу;\nформировать протоколы разногласий.\nОбщая схема работы\nРабота пользователя с экранными формами (карточкой объекта или реестра экземпляров) предполагает нажатие кнопки \"Печатная форма\" на панели действий. Система подставляет данные текущего объекта в заранее подготовленный шаблон документа и предоставляет пользователю универсальный документ в одном из двух видов:\nВариант 1\n: Документ для печати (скачивается как файл);\nлибо\nВариант 2\n: Интерактивный формуляр (web-документ в окне браузера).\nВозможности печатной формы (печатного документа формата Word, Excel, PDF) ориентированы именно на последующую распечатку документа и не предполагают коррекцию данных. Если печатный документ корректируется пользователем, то изменения происходят в локальном файле и НЕ поступают в Систему.\nЕсли пользователь открывает электронный документ в режиме web-версии, то становятся возможными поступление новых сведений и коррекция данных (значений, атрибутов, характеристик), представленных в документе. При этом изменения оперативно вносятся в Систему (поле выполнения операции сохранения).\nРежимы взаимодействия с электронными документами\nВозможности работы и ограничения при работе пользователей с электронными документами регулируются и настраиваются бизнес-аналитиком.\nПри работе с электронным документом (web-версией) в Системе поддерживаются и могут быть настроены следующие режимы взаимодействия:\nкоррекция данных\n(содержащихся в полях подстановки)\nкомментирование\n(суждения по отношению к блокам документа);\nсогласование\n(маркер согласия/несогласия по отношению к параграфу).\nДля формирования электронного документа в систему предварительно загружается шаблон офисного файла, содержащий внутреннюю маркировку:\nв шаблоны\nDOCX\nвнедряются \"\nЗакладки\n\";\nв шаблоны\nXLSX\nвнедряются \"\nИменованные диапазоны ячеек\n\".\nПосле однократного выполнения автоматической разметки шаблона система подстановки содержимого станет подставлять контент именно в эти (ранее обозначенные) именованные области документа.\nПодставляются именно данные (контент), а не команды форматирования. Поэтому крайне желательно все требуемое форматирование заранее выполнить средствами офисных программ, в которых разрабатывается файл шаблона.\nИнтерфейс работы Системы с электронным документом (web-версией) поддерживает режим комментирования (комментарии и ответы на комментарии) по отношению к любому фрагменту текста или атрибута, а также предусматривает возможность отправки на согласование (сотрудникам/подразделениям) используемых формулировок текста (параграфов).\nВыполнение настройки печатных форм предполагает понимание архитектурных принципов динамической сборки документа, представленных на рисунке ниже.\nКлючевые объекты eDoc\nСистема подстановки содержимого для формирования электронного документа использует множество взаимодополняющих объектов. Состав этих объектов может меняться в зависимости от специфики решаемой задачи и типа источников информации.\nПри этом ключевыми объектами модели подстановки остаются:\nШаблон печатной формы\n[RF_PATTERN];\nЗакладка шаблона печатной формы\n[RF_BOOKMARK];\nШаблон печатной формы. Источник данных\n[RF_PATTERN_SOURCE].\nСочетание ключевых объектов определяет по какому шаблону будет сформирован документ и какие закладки должны быть заменены реальными данными, полученными из источников данных печатной формы.\nПонятия и термины системы eDoc\nШаблон печатной формы\n– это объект Системы, определяющий способ выдачи (\"Печатная форма\" или \"Веб-документ\") и результирующий формат (DOCX, XLSX, PDF) документа, а также непосредственно связанный с файлом шаблона, содержащим структуру и команды форматирования документа.\nПараграф\n– логический текстовый фрагмент документа (абзац текста, строка заголовка, фрагмент примечания и др.). Как правило параграфом считается блок символов, заканчивающийся на специальный символ конца строки. Последовательность параграфов выделяется из шаблона документа автоматически. Параграф характеризуется уникальным (в масштабе конкретного шаблона) числовым номером.\nЗакладка\n– именованное место (в формате DOCX), специально внедренное в структуру шаблона для последующей подстановки туда реальных данных при формировании документа. Крайне желательно логично и осмысленно именовать закладки (не допуская использования пробельных символов).\nИменованный диапазон ячеек\n– именованное пространство (в формате XLSX), которое связано с месторасположением набора ячеек (таблицы подстановки реальных данных) в табличном документе. Именованный диапазон может состоять из одной или нескольких ячеек и не должен содержать пробельных символов в своем наименовании.\nИсточник данных\n– гибкий объект Системы, способный предоставить актуальные данные для подстановки их в нужное место шаблона. Источник данных способен гибко собирать данные из различных объектов Системы (атрибутов объекта, в результате исполнения алгоритма, по результатам выполнения SQL-запроса и пр.)\nРазумеется, для полноценной работы системы подстановки данных необходима наличие связей с основной моделью объектов Системы. Поэтому (чуть подробнее) визуализируем ключевые объекты в виде принципиальной схемы.\nПринципиальная схема системы подстановки\nСоздание шаблона печатной формы\nСоздание нового шаблона печатной формы сопровождается выбором базового типа объекта, атрибуты которого должны быть отражены в электронном документе. Также должна быть выполнена привязка шаблона печатной формы к документам Системы (заполняется специальная связь шаблона с типом/типами объектов) и загрузка файла (предварительно подготовленного шаблона офисного документа). В случае необходимости преобразования документа в иной формат (например, в PDF) в свойствах шаблона уточняется результирующий формат документа для выгрузки.\nВ процессе загрузки файла (офисного документа) в нем автоматически выявляются логические фрагменты: параграфы, закладки или именованные диапазоны. Параграфы автоматически нумеруются Системой, закладки и диапазоны ячеек вносятся в реестр \"Закладка шаблона печатной формы\". При анализе файла шаблона (при включении соответствующей настройки) могут автоматически создаваться не только закладки, но и источники данных печатной формы.\nСоздание закладок и источников\nСоздание закладок и источников данных настоятельно рекомендуется выполнять именно в автоматическом режиме (при загрузке файла шаблона).\nХотя действия по настройке шаблона в значительной мере автоматизированы, они могут потребовать от бизнес-аналитика ручного повтора и настройки отдельных операций (например, формирования списка источников данных).\nРучное создание закладки\nподразумевает выбор существующего источника данных, уточнение типа закладки, а также настройку отображения данных (формата значения).\nРучная настройка источника данных\nпредполагает указание типа источника (число, строка, дата, объект, таблица), а также настройку формата предоставляемых данных (формата значения). При этом особое внимание должно быть уделено расширению источника данных.\nРасширения источников данных\nНастройка источника данных предполагает выбор бизнес-аналитиком подходящего расширения источника (одного из возможных расширений). Применение/включение расширения добавляет в источник специфический набор свойств, позволяющих получать информацию из выбранного типа ресурса.\nКорректное заполнение и настройка свойств источника (полученных из расширения) определяет возможность последующей подстановки (различных данных) в область закладки/именованного диапазона. В результате подстановки генерируется полноценный документ, который сохраняется/фиксируется Системой.\nСохранение сгенерированного документа\nДействие командной кнопки\nПечатная форма\nсопровождается генерированием электронного документа по шаблону. Каждый раз генерируется новый документ, который сохраняется/фиксируется Системой. По умолчанию результат в виде новой записи сохраняется в реестр \"Документ, сгенерированный по шаблону\" [RF_DOCUMENT].\nЕсли сгенерированный документ должен быть доступен из карточки объекта (базового типа), то рационально добавить в состав атрибутов базового типа объекта существующий атрибут \"\nПрикрепленные файлы\n\" [SYS_FILE_ID].\nПоявление такого атрибута позволит при просмотре электронного документа в режиме разметки\nприкреплять сформированный файл\nк текущему объекту.\nДля реализации действий с электронным документом (коррекция данных, комментирование, согласование) в Системе предусмотрены специализированные элементы, представленные на схеме ниже.\nМодель объектов активных режимов\nПо результатам срабатывания системы генерации электронного документа пополняется реестр \"Документ, сформированный по шаблону\" [RF_DOCUMENT], куда заносится запись о документе. Но возможность использования режимов работы с EDoc связана со специализированными объектами Системы:\nза возможность\nкоррекции данных\nв опросном листе отвечает\n\"Элемент опросного листа шаблона\" [RF_QUESTION];\nдля\nкомментирования\nпараграфов/элементов документа может использоваться\n\"Комментарий к документу, сформированному по шаблону\" [RF_DOCUMENT_COMMENT];\nвозможность\nсогласования\nреализуется объектом\n\"Согласование источников данных документа, сформированного по шаблону\" [RF_DOCUMENT_CONFORM].\nОбъекты обеспечения режимов работы EDoc выделены на схеме ниже акцентированным желтым цветом.\nМатериалы настоящей статьи должны обеспечить обзорное представление о терминологии, архитектурных компонентах EDoc и ключевых взаимосвязях объектов Системы.\nПрикладные рекомендации по практическим настройкам электронных документов см. в публикации\nЭтапы работы с электронными документами\n.\nВыводы\nЗначительная часть пользователей Системы очень заинтересована в возможности предварительного просмотра сведений в формате привычного офисного документа. Именно поэтому бизнес-аналитик должен владеть не только настройкой визуала экранных форм (карточек объектов и реестров), но и уметь выполнять настройку электронных документов (максимальную гибкость возможностей обеспечивает формат DOCX).\nПлатформа GreenData постоянно развивает инструментальные возможности электронных документов и интегрирует их с основной бизнес-логикой. Это позволяет выполнять коррекцию документов и бизнес-процессов без остановки деятельности, без отключения пользователей и без технических перерывов.",
  "source": "https://docs.greendata.ru/platform/ru/electronic-documents.html"
}