{
  "title": "XLS files template loader set up",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nXLS files template loader set up\nThe System implements data import from Excel files with the ability to create instances of objects, including child objects.\nData import involves downloading files using a template in the *.xls format. The user can edit the data upload template if necessary.\nThe data loading process consists of the following steps:\nSetting up a template for uploading data from a file.\nFirst, create an object type for storing data.\nSetting the display of the button for loading data\n(setting the action \"Loading local objects from Excel\").\nUser loading data\n.\nCreating a template\nTo create a template, in the navigation menu, select:  Administration→ Object Management→ Object Types.\nGo to the object type registry\n\"xls file upload template for object types\" [SYS_XLS_TEMPLATE]\n, create a new instance, specify the name and save by the\nbutton (more details\nabout working with the registry\n).\nGo to the editor by clicking the \"Excel template editor\" button (the button will become available after saving the instance profile).\nThe Excel template editor window opens.\nNext, upload a file that will be used as a template. To do this, select the appropriate action in the menu next to the template name and download the *.xls template file\nAs a result, the uploaded template file will be displayed on the right side of the editor.\nSelecting the object type and the upload area\nTo upload data, specify the upload area, then match the file cells with the object attributes.\nTo do this, select the previously created object type for storing data using the drop-down list and click \"Add\".\nAfter that, the configuration area consisting of two blocks will appear.\nIn the first block\n, there are settings for defining a section of the template. The section is an area of the template that needs to be associated with the specified data storing object type.\nTo determine the upload section, fill in the following parameters:\nTo bind a cell to a parameter, click on the cell in the template, then click the\nbutton. To cancel the cell binding, click\n.\nSetting\nPurpose\nThe beginning of the section\nThe parameter by which the beginning of the section is determined.\nPossible options:\nfixed cell – the beginning of the section is counted from the selected cell,\nnot including\nit;\nfloating cell – the beginning of the section is counted from the selected cell, considering the condition specified in the \"Search by\" field;\nthe first empty cell – the beginning of the section is counted from the first empty cell after the selected one in the loading direction (the loading direction is set by\nnext\n).\nTo bind a cell as the beginning of a section, select a cell in the template, then click\n.\nEnd of the section\nThe parameter by which the end of the section is determined.\nPossible options:\nfixed cell – the section ends at the selected cell,\nnot including\nit;\nfloating cell – the end of the section is determined by the selected cell, considering the condition specified in the \"Search by\" field;\nthe first empty cell – the end of the section is the first empty cell after the selected one in the loading direction (the loading direction is set by\nnext\n);\nend of the sheet – the end of the section is considered the end of the sheet.\nTo bind a cell as the end of the section, select a cell in the template, then click\n.\nThe end of the section should not be the last loaded row. It is recommended to select the next non-empty cell or the \"First empty cell\" option as the end of the section.\nSearch by\nSelect a condition to search for a cell in the template. Possible options:\nradius – search by the contents of the selected cell within the specified radius in all directions;\nvalue in the loading direction – search by the contents of the selected cell in the loading direction (the loading direction is set by\nnext\n).\nThe\nfield is available when a floating cell is selected.\nRecognition method for column\nSpecifying the method for recognizing the contents of the cell. Possible options:\nstrict name equality  – search for a cell whose contents strictly correspond to the contents of the selected cell (case-sensitive);\ncontains the name – search for a cell whose contents include the contents of the selected cell;\na custom regular expression is a search for a cell whose contents satisfy a regular expression (for more information,\nabout regular expressions\n).\nThe field is available when a fixed or floating cell is selected.\nThe field becomes available only after binding the cell.\nSkip empty rows/columns\nThe section may contain empty cells. To exclude rows/columns containing empty cells, activate this option and select the row/column to be searched.\nPossible options:\nfixed cell;\nfloating cell.\nTo bind a cell, select a cell in the template and then click\n.\nSkip rows/columns if value equal\nThis parameter is used to exclude rows/columns containing the specified value.\nPossible options:\nfixed cell;\nfloating cell.\nTo bind a cell, select a cell in the template and then click\n:\nin the first field, specify the row/column to search for the value;\nin the second field, specify a value for skipping row/column (the field is available for manual input).\nRecord matching\nSelecting the data matching method when uploading a file. Possible options:\ninsertion – creation of new instances in the registry each time data is loaded from a file;\nupdate – search in the registry for the object type of existing instances by attribute values included in the specified\nkey\n. If an instance is found, it will be updated, otherwise a new instance will be created.\nKey for matching\nSelection\nkey\nfor attribute mapping.\nThe\nfield is available when selecting the \"Update\" option in the \"Record Matching\" field.\nDownload direction\nPossible options:\ndown – loading is performed in a column from the cell specified in the \"Beginning of the section\" parameter;\nto the right – loading is performed in a row from the cell specified in the \"Beginning of the section\" parameter.\nAfter setting the parameters, it is recommended to save the template by clicking\n.\nMapping cells to attributes\nThe second block\nof the settings area contains all the attributes of the selected object type.\nFor correct upload, match the attributes with the file cells by filling in the following parameters:\nA search field by attribute name is available to navigate to the required attribute.\nTo quickly clear all bindings to cells, use the\nbutton located under the attribute search field.\nWhen mapping, it is recommended to use column names rather than data cells. This will make the template more flexible.\nSetting\nPurpose\nUse it to check if the file matches the template\nWhen activated, the attribute becomes a \"key attribute\". If it cannot be found when parsing the file, then the upload stops, it is concluded that an unsuitable file has been transferred.\nThe parameter is not available when selecting the \"Value\" or \"Parameter\" options as a way to bind a cell to an attribute.\nThe method of binding the cell to the attribute\nPossible options:\nvalue – the specified value will be set as the attribute value for all instances;\nfixed cell;\nfloating cell;\nstatic cell – the contents of the specified cell will be loaded as the attribute value for all instances;\nparameter – the value of the specified parameter will be loaded as the attribute value for all instances.\nTo select this option, create a parameter in the \"Object Parameters\" field of the template instance card.\nWhen setting the parameter, an algorithm of the type \"Algorithm. Object profiles\" [SYS_ALG_CARD], which is calculated based on the object on whose profile the file upload action was triggered.\nThe default value is \"Fixed cell\".\nTo bind a cell to an attribute, select a cell in the template, then click on the\nbutton.\nThe method of recognizing column\nPossible options:\nstrict equality of names;\ncontains the name;\na custom regular expression.\nThe\nfield is available when a fixed or floating cell is selected.\nThe field becomes available only after binding the cell.\nAction with an empty value\nSelecting an option to fill in the attribute value with empty cell contents. Possible options:\nmissing (leave the value empty);\nfill in the previous non-empty value.\nfield is available when a fixed or floating cell is selected.\nAutomatically exclude spaces\nA parameter that determines whether to exclude spaces at the beginning and at the end of the cell content when loading a value into an attribute.\nparameter is not available when selecting the \"Value\" and \"Parameter\" options as a way to bind a cell to an attribute.\nMatching by attribute\nSelecting the attribute of the object type to which the cell value should be associated.\nThe parameter is only available for\nattributes of the \"Object\" type\n.\nThis way, all attributes that require data to be loaded from a file are configured.\nThe number of sections can be increased if necessary,\nadding new types of objects\nand\nmapping their attributes to cells\n. To exclude a section from the template, click\nbutton.\nAfter completing the setup, save the template by clicking\n.\nMapping cells to attributes of the \"Child object\" type\nTo map template cells to an attribute of the \"Child object\" type, it is recommended to add a new section to the template, while selecting\nobject type\nused as a child attribute.\nWhen mapping a cell to\nChild object type attribute\n, a field for selecting the type of object to store data becomes available.\nWhen clicking the \"Add\" button, the settings area will be displayed, where link for the object is selected in the same way\ndownload area\nand\nmatch cells with attributes\n.\nChecking data loading\nThe result of data loading can be checked using the \"Upload objects\" and \"Upload objects from a new file\" options.\nWhen selecting the \"Load objects\" option, the current template will be used to load the data.\nWhen selecting the \"Upload objects from a new file\" option, to upload data, add the file that has the same structure as the current template.\nTo check the upload result, open the registry of the previously created object type for storing data and make sure that the upload is correct.\nTemplate refinement\nThe editor allows adjusting the settings of the current template during the\ndata loading\n.\nThe uploaded file will be displayed in the right part of the template editor, and all detected inconsistencies with the basic template will be highlighted in the left part of the template editor as follows:\nAfter making changes, save the template by clicking\nand then clicking \"OK\". The system will display the appropriate notification:\nAfter clicking \"Yes\", a notification will appear about creating and saving an updated template:\nAs a result, a new (refined) template will be generated, which is determined by the object type\n\"Template for uploading xls files for objects\" [SYS_XLS_OBJ_TEMPLATE]\n. In the future, this template will be saved for the current object, on whose profile the file upload action was triggered.",
  "source": "https://docs.greendata.ru/platform/en/excel_loader.html"
}