{
  "title": "getParentValue",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ngetParentValue\nФункция для получения значения элемента\nдинамической структуры\n, расположенного в иерархии выше текущего элемента (указанного в качестве коллекции входных данных).\nСинтаксис\ngetParentValue\n(number, name)\nПараметр\nНазначение\nnumber\nКоличество уровней (шагов), на которое необходимо \"подняться\" по динамической структуре.\nname\nНаименование поля динамической структуры, значение которого требуется получить.\nПримечание\nДобавление функции осуществляется посредством\nручного ввода\n.\nЕсли при работе с функцией\ngetParentValue\nв качестве параметра \"name\" указано поле типа BOOLEAN, NUMBER, STRING или DATETIME, то функция вернет значение, хранящееся в данном поле.\nТакже параметром \"name\" функции\ngetParentValue\nможет быть наименование:\nобъектной ноды (поле типа OBJECT), которая хранит значение в виде\nассоциативного массива (HashMap)\n, содержащего в качестве значений другие элементы динамической структуры, а их названия – в качестве ключей.\nРабота со значением объектной ноды осуществляется при помощи метода\nget\n;\nколлекции (поле типа ARRAY), которая хранит значение в виде\nдинамического массива\n, содержащего в качестве значений другие элементы динамической структуры.\nЧаще всего работа с коллекцией осуществляется посредством цикла\nfor\n.\nПосле чего значения полученных элементов динамической структуры можно извлечь с помощью метода\ngetValue\n. Если необходимый элемент является коллекцией, метод возвращает список элементов.\nПример\nДопустим, при загрузке производственного календаря необходимо получить описание каждого праздника из динамической структуры в\nтрансформаторе по алгоритму\n.\nДинамическая структура имеет следующий вид:\nВ качестве коллекции входных данных указан элемент \"day\", а значение требуется получить из элемента \"title\":\nАлгоритм примет следующий вид:\nПереход к объекту \"holidays\" осуществляется посредством функции\ngetParentValue\n.\nС помощью метода\nget\n(подробнее о работе с\nассоциативным массивом (HashMap)\n) производится получение элемента \"holiday\". После чего с помощью метода\ngetValue\nосуществляется получение коллекции данных.\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее\nпеременные объявляются посредством функции\nvar\n;\nпроверка условий осуществляется с помощью функции\nif\n;\nпроверка на наличие значения производится посредством функции\nisNull\n;\nдля возвращения полученного значения используется функция\nreturn\n;\nдля получения значений полей \"id\" и \"title\" элемента \"holiday\" применяется функция\netlValueForValue\n.\nВ результате выполнения алгоритма для каждого праздничного дня будет сформировано описание в соответствии с данными производственного календаря.",
  "source": "https://docs.greendata.ru/platform/ru/getparentvalue.html"
}