{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.469.7 of October 23, 2025\nNew features\nDuring the initial login to applications based on\nSaaS and Private Cloud solutions\n, the system now prompts users to complete a short survey to determine their professional role, industry, and tasks they solve.\nSaaS and Private Cloud solutions\nnow feature an AI-powered assistant implemented to support and consult users on platform capabilities based on selected knowledge base data.\nIt is now possible to manage the number of data series in\nstructural diagrams\nof \"Column\" and \"Horizontal Column\" types.\nIt is now possible to format code in the algorithm editor using the\nCtrl\n+\nShift\n+\nF\nkeyboard shortcut.\nThe messenger function has been implemented to automate setting user\nstatus\nfor a specified period of time.\nThe new isInTreeObjects function now allows checking if an object is part of a hierarchy and retrieving collections of its child or parent objects in filtering algorithms.\nThe process of configuring an email address for sending messages during user registration in the application is now simpler - accounts can now be created directly from the\nlogin page constructor\n.\nIt is now possible to fully manage access permissions through update packaging, including replacing default permissions and permissions for existing objects.\nFlexible configuration for binding IP addresses to user accounts has been added for system access control.\nIt is now possible to automatically copy text blocks from the source file or template into the generated document.\nChanges and improvements\nHotkey support was added for working with ETL and business process schemas.\nThe display of the employee who made the last changes to a system object was adjusted.\nThe functionality of hotkeys when opening the chat on the additional panel was improved.\nAutomatic\nmain menu\nupdates were added when creating/editing/deleting menu items.\nThe object opening through the configured\nmain menu item\nwas debugged.\nThe process of generating instance names for the \"Custom registry settings\" [SYS_REGISTRY_CUSTOM] type was debugged.\nExpressions for instance names were added for the \"Permission control settings by condition tree\", \"Access permission control settings\", and \"Algorithm execution settings\" types.\nInstance deletion was stabilized when dependent objects exist.\nThe ability to ignore optional\nobject type validations\nwhen saving an object type using\ncustom actions\nwas debugged.\nStorage of unsaved attribute values was restored when input data validation errors occur during object saving.\nThe ability to create SQL-based data sources from the\nsource attribute\nconfiguration modal window was added.\nThe creation of objects through the child attribute was stabilized.\nExcessive buttons were removed from the subject area control panel.\nExport of large data volumes from the registry was optimized through the\n\"Use streaming export\" system setting\n.\nPerformance was improved when opening\nlight registries\n.\nTile registry\nnow supports\nbatch actions\nfor click override.\nThe display of related child objects in the task registry, located on the visual of the parent object, was debugged.\nThe display of the\nsystem settings\nregistry was restored.\nThe placement of\nsearch filters\nin the registries was adjusted.\nFor file type attributes with the\n\"Image\" visual\n, the ability to define available file upload methods was added: from disk and/or from the system.\nCode display in the algorithm editor placed on a visual using\nframes\nwas debugged.\nCustom widget\nfunctionality was stabilized when placed in\nside panels\n.\nSaving the slider position in the attribute with\n\"Input field with step slider\"\nwas stabilized when saving the object.\nDisplay of the\n\"Status Bar\"\nwidget was stabilized.\nTransfer of the\n\"Image\"\nwidget via\nupdates\nwas debugged.\nDisplay of the\n\"Financial Statements\"\nwidget on tile registry visuals was fixed.\nSwitching between tabs and sections on the\n\"Financial Statements\"\nwidget visual is now synchronized.\nFunctionality of the\n\"Calendar Booking\"\nwidget was stabilized.\nProcessing of the\n\"Signal Start Event\"\nstage was stabilized.\nDisplay of the\nGantt chart\nduring scrolling was debugged.\nThe ability to change attribute order on task cards was added to the extended version of the\nKanban board\n.\nTable display with breakdowns was stabilized for the analytical panel of the\n\"Key Performance Indicators\"\ndashboard.\nSorting by aggregation fields was debugged for the analytical panel of the\n\"Table\"\ndashboard.\nLogic for configuring field aggregation and grouping in\nobject data sources\nwas stabilized.\nThe clearing of relations with system objects was debugged when deleting an algorithm code.\nClearing values of multiselect attributes via the\nclearMultiSelectValue\nfunction was stabilized.\nThe ability to set a primitive object as a value for an object attribute using the\nattr\nfunction was debugged.\nFunctionality of the\ndictPrimitive\nand writeWfLog functions was restored.\nThe ability to access attributes of objects obtained via the\ngetObject\nor\ngetObjectByIndex\nfunctions was debugged, using autocomplete and the\nattrByVar\nfunction.\nThe functionality of the\ndocxToPdf\nfunction was stabilized when converting an Excel document to a PDF file.\nThe configuration of additional parameters for\nactions\nwith the \"Call algorithm\" and \"Execute ETL by files\" user interface modules was restored.\nPerformance of the\ncondition tree\nwas improved when changing node state.\nAsynchronous algorithm execution in ETL processes was optimized.\nThe\n\"View metadata\"\npermission is now required to create algorithms.\nApplication of\npermissions for attributes\nof the \"Child object\" type was stabilized.\nTransfer of object types via updates was debugged when\nkeys/indexes\ncontaining object attributes of the parent type exist.\nOperation of\naudit\nnormalization schedules was debugged.\nThe ability to\nlimit calls to excessive HTTP API methods\nwas stabilized.\nFor reporting forms, the row collapsing logic was adjusted: the \"Can be collapsed\" parameter now controls the collapsing capability, while the \"Collapsed\" parameter controls the default state.\nOperation of the\nbalance sheet checks\nalgorithm was stabilized.\nExport of reporting forms to Excel was debugged.\nThe visibility of images in the document generated from the template was debugged.\nPerformance was improved when generating the document and updating values from the source.\nFormatting application to document text was fixed when bookmarks are present.\nData display in the document and questionnaire was restored when updating values from the source.\nComment display in the document was debugged, the ability to export the document file in the current format was restored, and version comparison of the template-generated document was stabilized.\nNow, the document generated from the template with bookmarks is created in the corresponding mode.\nThe display of the document with locks based on the user’s role and permissions was debugged.\nThe creation of a new document version from a file was stabilized.\nThe process of managing access permissions to the\nelectronic document\nwas debugged.\nMicrophone usage indication during audio calls was stabilized.\nA special \"Favorites\" chat is now available in the GreenData mobile application for storing important messages, files, and notes.",
  "source": "https://docs.greendata.ru/platform/en/LTS.469.7-latest.html"
}