{
  "title": "sendMsgToEmail",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nsendMsgToEmail\nОтправка сообщения по электронной почте.\nСинтаксис\nsendMsgToEmail\n(pattern, email_address, [reply_to], [object], [files], [email_account])\nПараметр\nНазначение\npattern\nШаблон уведомления (экземпляр типа\n\"Шаблон уведомления\"\n[SYS_EMAIL_NOTIFICATION] или\n\"Уведомление в календарь\"\n[SYS_CALENDAR_NOTIFY]).\nemail_address\nАдрес электронной почты, на который необходимо направить уведомление.\nМожет быть указан\nтолько один адрес электронной почты\n, который задается в виде:\nстроки (указывается в кавычках – \"..@..\");\nатрибутом посредством функции\nattr\n.\nreply_to\nСписок адресов электронной почты, на которые получатель сможет отправить ответное письмо.\nE-mail адреса передаются в виде строковых значений\nдинамического массива\n(коллекции объектов arrayList).\nПри отсутствии значения параметра ответное письмо поступит на адрес электронной почты, с которого осуществляется отправка текущего сообщения.\nПараметр необязательный.\nЕсли изменение адреса почты для получения ответного письма не требуется, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nobject\nОбъект Системы, к которому привязывается алгоритм. Если шаблон письма содержит алгоритмы, их выполнение произойдет в рамках указанного объекта.\nПараметр необязательный.\nЕсли объект не назначается, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nfiles\nПрикрепляемые файлы (к указанному типу объекта).\nМожно указать к прикреплению отдельный файл или их массив.\nПараметр необязательный.\nЕсли прикрепление файлов к сообщению не требуется, но необходимо указать последующие параметры функции, тогда в параметр следует передать значение\nnull\n.\nemail_account\nАдрес электронной почты, с которого выполняется рассылка уведомлений.\nПараметр необязательный.\nПри отсутствии значения параметра для отправки сообщений используется электронный адрес учетной записи пользователя,\nвыбранной по умолчанию\n.\nПримечание\nВызов функции осуществляется с\nвкладки \"Сообщения\"\nпанели инструментов редактора алгоритмов.\nВ результате чего откроется модальное окно для выбора\nшаблона уведомления\n.\nВыбор признака \"Объект\" обеспечивает определение типа объектов, параметры которого будут использоваться в алгоритме.\nВ результате чего в код алгоритма вставится функция с выбранным шаблоном сообщения и фиктивными переменными, которые следует заменить на необходимые значения.\nВыполняется обязательная проверка\nсистемной настройки\n\"Интеграция с почтовым сервисом\". Если настройка не выполнена, отправка сообщения невозможна.\nБазовым типом алгоритмов, используемых в шаблоне уведомлений, должен выступать тип, по объекту которого осуществляется отправка e-mail сообщения.\nАлгоритмы с базовым типом, не соответствующим типу, по объекту которого осуществляется отправка e-mail сообщения, не будут учитываться Системой.\nПримеры\nПример № 1\nНа электронный адрес\nivanov@greendatasoft.ru\nнеобходимо отправить шаблон сообщения \"Напоминание о днях рождения\".\nПри этом файлы к письму не прикрепляются, рассылка выполняется с электронного адреса, указанного по умолчанию.\nПример № 2\nНеобходимо отправить сообщение (шаблон \"Назначение ответственного\") по электронному адресу \"Руководителю Подразделения\" (определяемого как атрибут) по текущему объекту.\nДополнительно файлы к письму не прикрепляются, рассылка выполняется с электронного адреса, указанного по умолчанию.\nПример № 3\nНа электронные адреса сотрудников необходимо организовать рассылку сообщения, сформированного по шаблону уведомления \"Новые условия договора\", с прикреплением документа и указанием почты для получения ответного сообщения.\nАлгоритм может принять следующий вид:\nПри вызове функции\nsendMsgToEmail\nвыбирается необходимый шаблон, после чего производится замена фиктивных переменных функции:\nадреса электронной почты, на которые будет осуществляться отправка письма, передаются через цепочечный атрибут \"E-mail\", добавленный при помощи функции\nattr\n;\nадреса электронной почты \"\nivanov@greendatasoft.ru\n\" и \"\npetrov@greendatasoft.ru\n\", которые могут быть использованы получателем текущего письма для отправки ответного, передаются в виде массива. Элементы данного массива указываются как строковые значения при помощи функции\ntext\n;\nобъект Системы, к которому привязывается алгоритм, не назначается, поэтому указывается значение\nnull\n;\nприкрепляемый к письму файл \"Договор на подпись\" добавляется при помощи функции\ndict\n;\nпараметр \"email_account\" не задан, поэтому для отправки сообщений будет использован электронный адрес учетной записи пользователя,\nустановленной по умолчанию\n.",
  "source": "https://docs.greendata.ru/platform/ru/sendmsgtoemail.html"
}