{
  "title": "Creating an ETL object",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCreating an ETL object\nThe ETL object is the main entity of the ETL process with basic attributes and a schema\n.\nTo create an ETL object, you need to:\n1. Select from the navigation menu: Setting up ETL→ ETL processes registry.\n2. Click\nin the registry control panel to create an ETL object profile. The System will display an input form:\n3. Enter the required data, where:\nSetting\nPurpose\nName\nEntering the name of the custom ETL object.\nIdentifier\nEntering the object ID. It can be formed automatically.\nChart\nDisplaying the chart code when the ETL schema is ready; it is formed automatically.\nLogging level\nChoosing the logging level from the drop-down list. Possible values:\nInformation on stages: displaying errors (if any) and data on the progress;\nDebug information: displaying errors (if any), data on the progress (including actions and results);\nFull log: displaying the full log of the ETL process. Recommended when setting up a process;\nOnly errors: displaying errors (if any) in the ETL process.\nStart object type\nDefining the type of the start object. Specifying the object type\nETL. ETL object instance\n, or its child type. For more information, refer to\nSetting up ETL start\n.\nThe full list of types in the parameter’s drop-down list becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nRecord the resulting data structures in the log\nA boolean attribute that defines the recording of the resulting data structure in the log.\nParse get-request parameters into instance attributes\nA boolean attribute that defines the ability of get-request parameters to get into the attributes of an instance of the object type generated.\nComment\nEntering a user comment for the custom ETL object.\n4. Save the ETL object profile using the\nbutton. The System will display possible actions for the ETL object.\nSetting\nPurpose\nIncluding a custom ETL in the service pack. For more information, refer to\nCreating updates from the object profile\n.\nCreating/setting up an ETL schema. For more information, refer to\nSetting up an ETL schema\n.\nRunning a customized ETL process. For more information, refer to\nSetting up ETL start\n.\nImplementing ETL cache invalidation.\nImplementing a customized ETL process for the files specified.",
  "source": "https://docs.greendata.ru/platform/en/creating-an-etl-object.html"
}