{
  "title": "Виджет \"Этап процесса\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Этап процесса\"\nВиджет \"Этап процесса\" отображает ФИО и контактные данные исполнителя этапа бизнес-процесса\n(чаще всего этапа прохождения экспертизы) текущего маршрутного объекта.\nПример настроенного виджета:\nПеред тем как приступить к настройке виджета, необходимо сформировать новую\nсущность\nи перейти к созданию экземпляров для данного типа объекта.\nВиджет \"Этап процесса\" можно настроить в режиме настройки\nвизуала экземпляра\n. Для этого необходимо найти нужный виджет в соответствующем списке в окне \"Элементы\" и вынести его на рабочую область.\nПараметры виджета\nНастройка виджета предполагает заполнение следующих параметров:\nПараметр\nНазначение\nНаименование этапа\nВвод наименования этапа бизнес-процесса.\nАлгоритм определения ответственного сотрудника (возвращает ID сотрудника)\nВыбор алгоритма, который определяет идентификатор сотрудника, ответственного по маршрутному объекту.\nАлгоритм определения списка сотрудников чата\nВыбор алгоритма, который определяет через функцию\ndict\nсписок сотрудников общего чата.\nАлгоритм сворачивания/разворачивания виджета (возвращает true/false)\nВыбор алгоритма, который определяет состояние виджета при открытии карточки экземпляра. Возможные варианты:\ntrue – виджет развернут;\nfalse – виджет свернут.\nАтрибут с результатом экспертизы\nВыбор объектного атрибута с результатом экспертизы.\nАлгоритм определения цвета (возвращает цвет в виде строки)\nВыбор алгоритма, который определяет цвет элемента справа от наименования этапа. Цвет необходимо указать в алгоритме в формате HTML.\nАлгоритм определения роли сотрудника\nВыбор алгоритма, который определяет роль (должность) ответственного сотрудника.\nСкрыть время экспертизы\nПризнак, позволяющий отображать информацию о датах начала и окончания этапа бизнес-процесса и о фактическом и нормативном времени завершении этапа\nАлгоритм определения даты начала (возвращает дату)\nВыбор алгоритма, который определяет дату принятия задачи (этапа бизнес-процесса) в работу.\nПараметр недоступен при активном признаке \"Скрыть время экспертизы\".\nАлгоритм определения окончания начала (возвращает дату)\nВыбор алгоритма, который определяет дату завершения работы над задачей (этапом бизнес-процесса).\nПараметр недоступен при активном признаке \"Скрыть время экспертизы\".\nАлгоритм определения фактического времени (возвращает секунды)\nВыбор алгоритма, который определяет фактический период работы над задачей (этапом бизнес-процесса).\nПараметр недоступен при активном признаке \"Скрыть время экспертизы\".\nАлгоритм определения нормативного времени (возвращает секунды)\nВыбор алгоритма, который определяет нормативный период работы над задачей (этапом бизнес-процесса).\nПараметр недоступен при активном признаке \"Скрыть время экспертизы\".\nАтрибут с именем сотрудника\nВыбор атрибута типа \"Персональные данные\" с информацией об имени ответственного сотрудника.\nПараметр доступен после добавления алгоритма определения ответственного сотрудника.\nАтрибут с подразделением сотрудника\nВыбор атрибута типа \"Персональные данные\" с информацией о подразделении ответственного сотрудника.\nПараметр доступен после добавления алгоритма определения ответственного сотрудника.\nАтрибут с телефоном сотрудника\nВыбор атрибута типа \"Персональные данные\" с информацией о контактном телефоне ответственного сотрудника.\nПараметр доступен после добавления алгоритма определения ответственного сотрудника.\nАтрибут с адресом почты сотрудника\nВыбор атрибута типа \"Персональные данные\" с информацией об адресе электронной почты ответственного сотрудника.\nПараметр доступен после добавления алгоритма определения ответственного сотрудника.\nПример настройки\nНастройка алгоритмов виджета может быть представлена следующим образом:\nПри настройке фактического и нормативного периода использовалась функция\ngetWorkDatesBetween\n, которая рассчитала количество секунд в периодах. В параметрах функции следует указать экземпляр\nТипа объекта \"Календарь\"\nопределяющий рабочие и праздничные дни.\nПосле сохранения настроек Система отобразит виджет в карточке экземпляра.\nПри нажатии на кнопку\nоткроется чат с сотрудником, указанным в виджете.\nЕсли нажать на кнопку\nоткроется модальное окно с сотрудниками, определенных алгоритмом, и администраторами Системы. После выбора необходимых сотрудников следует нажать на кнопку \"Открыть\". После этого откроется общий чат с выбранными сотрудниками.",
  "source": "https://docs.greendata.ru/platform/ru/process-stage-widget.html"
}