{
  "title": "Релиз LTS.400",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРелиз LTS.400\nПатч LTS.400.4 от 28.02.2024\nИзменения и улучшения\nМодернизирована функция parseSignature при получении подписи из внешнего хранилища.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.400.4\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.400.4.war\nhttps://downloads.greendatasoft.ru/LTS/lts.400.4.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nПатч LTS.400.3 от 25.02.2024\nИзменения и улучшения\nСтабилизирован процесс выгрузки данных из аналитической панели \"Таблица\" с соблюдением заданного формата значений.\nСтабилизирована функциональность Web-версии приложения GreenData Messenger.\nВ модуле EDoc отлажен процесс вставки данных из буфера обмена.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.400.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.400.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.400.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.\nПатч LTS.400.2\nИзменения и улучшения\nВ\nизбранном\nстабилизирована возможность фильтрации объектов.\nПатч LTS.400.1\nНовые возможности\nВ модуле EDoc в режиме работы с закладками реализовано сравнение разных документов, сформированных на основании одного шаблона печатной формы.\nПакет обновлений LTS.400.0\nНовые возможности\nПоявился новый виджет \"Чат по объекту\". Теперь чаты можно привязывать к объектам системы и контролировать доступ к переписке в зависимости от прав доступа на объект.\nПри приеме сообщений через ETL появилась возможность аутентификации mTLS с поддержкой nginx.\nУсовершенствование функции deletePlainObjects позволяет удалять все объекты в примитивном типе.\nПри работе с функцией doAfterCommit добавлена обработка функций с EvaluateLocalContext.\nРеализовали автоматическое сохранение изменений при перемещении объекта между папками в папочном реестре.\nИзменения и улучшения\nОптимизирован функционал переноса CI\\CD.\nМодернизированы настройки виджета \"Реестр объектов\".\nПри работе с фреймом добавлена поддержка локализации.\nПри настройке визуала объекта оптимизированы опции атрибута.\nСтабилизирован выбор значений объектного атрибута в карточке объекта.\nОтлажен процесс выполнения алгоритма блокировки для целочисленного атрибута.\nСтабилизирована настройка визуала дашбордов.\nОптимизировали права административной группы доступа для возможности каскадного удаления зависимых групп доступа.\nУпрощен процесс взаимодействия с диалоговым окном при удалении связанных объектов.\nСтабилизирован процесс удаления объекта при наличии зависимости по дочернему атрибуту.\nПри работе с бизнес-процессами усовершенствовали настройки выбора типа объекта генерируемой задачи.\nОптимизированы настройки компонента \"Коммуникационная панель\".\nВ реестрах стабилизировано отображение границ и процентного значения атрибутов.\nОптимизировали настройки преобразования содержимого загружаемой подписи.\nВ модуле EDoc отлажен процесс скачивания сформированного документа с добавленными комментариями.\nДля GreenData Messenger усовершенствована логика отображения закрепленных и непрочитанных сообщений в папках.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.400.4-details.html"
}