{
  "title": "User authorization via external provider",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nUser authorization via external provider\nTo simplify the process or as part of a security policy, user login to the application can be configured using domain authentication and/or the OAuth 2.0 protocol (e.g., via the KeyCloak provider).\nDomain authentication\nDomain authentication allows users to log in to the GreenData application using credentials stored in an external provider, such as the Microsoft Active Directory service (hereinafter referred to as AD).\nAccess to the external provider where credentials are stored can be configured via the following protocols:\nLDAP – a protocol that enables the authentication process in the application and provides the ability to both query and modify data (user accounts and access groups) stored on the LDAP server;\nWith domain authentication, a user account is created (on first login) or updated in the system, with the appropriate access groups assigned.\nFor more details on the configuration process, see\nSetting up the Domain Authorization (LDAP)\n.\nIf necessary, domain user data can be retrieved by accessing the directory service via\nalgorithms\n, for example, when assigning a business process task to a domain user who has not yet logged in to the application and therefore the\nuser\nand\nemployee\ndo not yet exist in the application.\nKerberos – a protocol that enables users to authenticate in the application without transmitting a login and password but cannot be used for authorization as it does not transmit any user data;\nFor more details on configuring domain authentication via the Kerberos protocol together with LDAP, see\nDeploying an application with SPNEGO and Kerberos authentication on Linux servers\n.\nNTLM\n– a protocol that provides user authentication but is considered less secure compared to Kerberos.\nDomain authentication must be configured using only one of the protocols\n.\nSimultaneous use of multiple types of domain authentication is not allowed, as some settings will be ignored by the System.\nFor example, if LDAP and Kerberos authentication settings are configured simultaneously, the System will use LDAP as the authorization method, and Kerberos settings will be ignored.\nOAuth 2.0\nOAuth 2.0 is an authentication method that allows users to log in to multiple applications or systems using a single account.\nThis method allows users to log in to the GreenData application without entering their login and password on the GreenData page; instead, they enter their credentials on the OAuth 2.0 provider’s page.\nTo enable authorization in the application via the OAuth 2.0 protocol, the user need to:\nConfigure the application configuration file; for more details, see the\ninstructions\n.\nActivate the setting in the login page constructor; for more details\nhere\n.\nEvent Configuration\nLogin to the application using domain authentication and the OAuth 2.0 protocol can be accompanied by the events before and after user authorization.\nFor example, a pre-authorization event can be used to add a user to the necessary application\naccess groups\nbased on information received from the external provider.\nA post-authorization event can launch required processes for the user who logged into the application.\nTo configure events:\nGo to the\nobject registry\nof \"Identification provider\" [SYS_IDENTITY_PROVIDER] type.\nCreate or open an identification provider object.\nFor domain authentication configuration, use the existing \"Domain authentication\" object; for OAuth 2.0 provider configuration, the user can create a new settings object.\nIn the identity provider settings object, specify the parameters:\nSetting\nPurpose\nName\nName of the identification provider settings object.\nIdentifier\nUnique identifier for the created settings object.\nIdentification provider type\nIn base supply objects, the value is specified by the System and cannot be changed.\nWhen creating a new object, the default \"OAuth 2.0\" value is used.\nEvent before user authorization\nSelecting an algorithm to be called when authenticating a user via the configured provider, i.e., before the user is authorized in the system.\nThe algorithm does not run against any object and operates only with data received from the external provider.\nTo\nretrieve and modify\ndata from the external provider, use the\ngetExternalUserProviderContext\nfunction, which returns an object available only during user authorization on the platform.\nWhen working with this function in the algorithm, the following methods can be used:\ngetAuthenticationProviderData - retrieves data from the external provider as a HashMap class;\nThe user can apply methods such as put, remove, get, containsKey, size, isEmpty, etc., to the obtained object.\nFor example, to add new keys to the HashMap or to modify the set of external groups.\naddExternalGroup - adds external groups to a user, does not return anything;\nremoveExternalGroup - removes external groups from a user, does not return anything;\ngetDomainName - retrieves the domain name of the user logging into the application (applicable only for \"Domain authentication\" identity provider type).\nWhen creating an event via the parameter action menu, a template with a brief description and usage of this function with available methods is inserted into the algorithm code.\nEvent after user authorization\nSelecting an algorithm to be called after the user is authorized via the configured provider and assigned access groups.\nThe algorithm runs against the user logging into the platform.\nData from the external provider is read-only; to\nretrieve\nit, use the\ngetExternalUserProviderContext\nfunction.\nWhen working with this function in the algorithm, only methods that do not modify data can be used.\nUsing methods like addExternalGroup, removeExternalGroup, and getAuthenticationProviderData with methods such as put, remove, etc., will result in an error, which will be logged during algorithm execution.\nWhen creating an event via the parameter action menu, a template with a brief description and usage of this function with available methods is inserted into the algorithm code.\nEnable provider\nToggle that defines whether the identity provider settings object is active.\nSave the identity provider object by clicking\nin the control panel.",
  "source": "https://docs.greendata.ru/platform/en/user_authorization_via_external_provider.html"
}