{
  "title": "Отображение расшифровки при расчете методики",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОтображение расшифровки при расчете методики\nНа платформе GreenData реализован функционал, позволяющий пользователю оперативно взаимодействовать с\nрасчетами показателей методики\nи получать результаты обработки данных в удобном виде.\nВ данной статье будут детально рассмотрены возможности работы с атрибутом\n\"Временный результат расчета\"\n, а также способы отображения расшифровки данных.\nВыбор даты для просмотра расчетов методики\nПросмотр результатов расчета может осуществляться следующими возможными способами:\nРасчет только на отчетную дату;\nРасчет по дате, выбранной пользователем из выпадающего списка.\nРассмотрим подробнее возможные варианты настройки:\nРасчет на отчетную дату\nВ рамках работы с карточкой расчет данных производится на отчетную дату и/или на другие даты, отсчитываемые от отчетной даты (количество периодов расчета зависит от алгоритмов, используемых в методике расчета).\nВыбранная дата расчета автоматически отобразится в атрибуте \"Временный результат расчета\" [\nCALC_CARD_RISK_RESULT\n], при этом поле с отчетной датой будет заблокировано, отображая только одну дату, на которую выполнялся расчет. Если расчет осуществлялся для временного ряда (т.е. сразу на несколько периодов), то поле с датой будет доступно для переключения между периодами, участвовавшими в расчете.\nПри наведении курсором на поле будет отображаться следующая информация: \"Для методики установлен одиночный режим расчета, для расчета на несколько дат используйте рядный режим.\"\nПросмотр расчетов, выполненных за несколько периодов (на несколько отчетных дат)\nПроизвести расчет за период (интервал динамики методики) пользователь может несколькими способами:\nв специальных карточках расчета типа \"РМ. Расчет денежных потоков\" [\nCF_CALC_CARD\n] (уже содержат необходимые атрибуты для расчета;\nв карточках расчета при условии ручного добавления требуемых атрибутов.\nПри этом в случае настройки интервала в специальных карточках расчета типа \"РМ. Расчет денежных потоков\" пользователю не нужно производить дополнительные настройки, так как тип объекта содержит необходимые атрибуты. Во втором же случае, при настройке интервала в карточке расчета, пользователю необходимо добавить в экземпляр указанные атрибуты и заполнить их.\nИнтервал динамики методики можно настроить с помощью следующих атрибутов:\nАтрибут\nИдентификатор\nНазначение\nДата начала анализа\nCF_START_DATE\nНижняя граница интервала динамики.\nДата окончания анализа\nCF_END_DATE\nВерхняя граница интервала динамики.\nТип динамики\nCALC_CARD_DYN_TYPE_ID\nПериодичность составления финансовой отчетности.\nПосле выполнения расчета за несколько периодов пользователю будет доступен выбор даты (включая граничные значения) из выпадающего списка в атрибуте \"Временный результат расчета\".\nПросмотр расшифровки расчета методики\nНа платформе GreenData реализована возможность просмотра результата расчета показателей методик в удобном виде. Пользователь может увидеть формулу, а также наименования и значения показателей, которые использовались для расчета вычисляемых элементов.\nСуществует 2 способа отображения расшифровки данных:\nна месте таблицы расчета: таблица расшифровки отображается вместо таблицы с этапами методики и деревом вычислимых показателей;\nсправа от таблицы расчета: таблица расшифровки и исходная таблица с деревом этапов и вычислимых показателей отображаются рядом.\nОтображение расшифровки на месте таблицы расчета\nАтрибут \"Временный результат расчета\" [\nCALC_CARD_RISK_RESULT\n] содержит в себе данные о вычисляемых показателях. Для того, чтобы посмотреть детальную информацию о расчете, пользователю необходимо нажать на рассчитанное значение в таблице или дважды кликнуть на наименование вычисляемого показателя. Расшифровка отобразится на месте таблицы расчета, а над ней появится навигационная цепочка, с помощью которой можно вернуться на исходное положение.\nОтображение расшифровки справа от таблицы расчета\nВ атрибуте \"Временный результат расчета\" существует опция на визуале для отображения блока расшифровки вычислимого показателя справа от таблицы расчета. Данная опция позволяет пользователю переключать расшифровку различных показателей, не упуская текущую позицию в иерархии вычислимых показателей методики.\nПо умолчанию данная опция отключена. Включить ее можно с помощью кнопки\nв настройках атрибута \"Временный результат расчета\" в режиме визуального редактирования экземпляра типа объекта.\nПосле этого пользователь сможет посмотреть расшифровку данных справа от таблицы вычисляемых показателей. По умолчанию расшифровка скрыта от пользователя. Чтобы она отобразилась на экране, необходимо нажать на рассчитанное значение в таблице или дважды кликнуть на наименование вычисляемого показателя.",
  "source": "https://docs.greendata.ru/platform/ru/displaying-decryption-in-methodology-calculation.html"
}