{
  "title": "General procedure for setting permissions",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nGeneral procedure for setting permissions\nAccess permissions define the ability to read, edit, delete and create new instances of an object type.\nFor correct access permissions granting the following configuration order must be observed:\n1. Access control type\nThe main setting of access permissions to type instances is the definition of\n\"Permissions control type\"\nin the object type profile.\nWhen creating a new object type with the \"Object\" [SYS_OBJECT] parent, \"System permission control\" is set by default. In other cases, the permission control is inherited from the parent type.\nWhen copying an object type, the permission control of the original type is preserved.\nFor more information about permission control types for object type instances, refer to the\narticle\n.\n2. Setting default permissions\nDefault permissions are set in the object type profile optionally\nwhen the following permissions control types are selected\n:\n* All users have configured permissions for all instances of the type;\n* System control of permissions;\n* System control of permissions by group.\nDefault permissions apply only to new objects. To apply these permissions to all existing objects of the type, click the \"Apply default permissions to existing objects\" button.\nPermission recalculation should be performed with caution, as previously configured default permissions may include special access logic, and if recalculated, they will be applied to already existing objects.\nWhen configuring permissions for structural groups, only users directly included in the structural group are considered, as group nesting is not supported in this context.\nAccess permissions for actions in the \"Restricted\" section take precedence over permissions granted for actions in the \"Allowed\" section.\nFind more on applying access permissions\nhere\n.\nThe ability to edit permissions to the System objects for security principals has the following restriction:\n3. Access to system objects\nIf local access to the objects is required, go to the main menu section \"Administration\" → \"Access control\" → \"Access to objects\".\nOn the page that opens, select the object type and instances of the type to which the local access permission settings should be applied.\nThen, using the\nbutton, select the security principal type for which access is to be set up.\nThen using the checkboxes the permissions are granted and denied.\nThe full list of types in the \"Object type\" drop-down menu becomes available after clicking the \"Show all types\" button\n. This button is displayed if the user has the \"Run\" permission for\n\"View system types in the \"Object type\" registry\"\n.\nWhen the \"Object type\" is selected, a button\nwill also appear next to the field. Clicking it will display the full list of available instances of this type in the registry:\nFind the general rules for applying permissions\nhere\n.\nTo export information on the configured access permissions to Excel, click on the\nbutton and wait until the file is loaded.",
  "source": "https://docs.greendata.ru/platform/en/general-procedure-for-setting-permissions.html"
}