{
  "title": "getRespEmp",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\ngetRespEmp\nФункция для получения ответственного сотрудника по указанной роли в рамках запущенного бизнес-процесса по маршрутному объекту.\nФункция используется в\nалгоритмах\nтипа\n\"Алгоритм. Карточки объектов\"\n.\nСинтаксис\ngetRespEmp\n(role, object, processInstanceId)\nПараметр\nНазначение\nrole\nРоль, по которой будет осуществляться поиск ответственного.\nАргумент принимает экземпляр объекта типа \"Группа доступа\" или его Код.\nГруппа доступа может быть передана как числовое значение, или, например, с использованием функций\nparam\n,\ndict\nили\nvar\n– как параметр, справочное значение или переменная.\nobject\nМаршрутный объект, по которому запущен бизнес-процесс.\nАргумент принимает экземпляр объекта типа \"Объект\" или его Код.\nМаршрутный объект может быть передан как числовое значение, или, например, с использованием функций\nparam\n,\ndict\nили\nvar\n– как параметр, справочное значение или переменная.\nprocessInstanceId\nЭкземпляр запущенного бизнес-процесса, по которому будет осуществляться поиск ответственного.\nАргумент принимает экземпляр бизнес-процесса по объекту (экземпляр типа \"ДО. Экземпляр запущенного процесса\") или его Код.\nЭкземпляр запущенного бизнес-процесса может быть передан как числовое значение, или, например, с использованием функций\nparam\n,\ndict\nили\nvar\n– как параметр, справочное значение или переменная.\nЕсли в рамках экземпляра запущенного  бизнес-процесса локальный ответственный не найден, то  поиск\nглобального ответственного\nосуществляется по всем экземплярам запущенного процесса по заданному маршрутному объекту.\nПримечание\nВызов функции осуществляется с вкладки\n\"Пользователи и группы\"\nпанели инструментов редактора алгоритмов, в результате чего в код алгоритма добавится функция с фиктивными переменными, которые следует заменить на необходимые значения.\nФункция возвращает динамический объект типа \"Ответственные сотрудники\" [SYS_OBJ_RESP].\nЕсли локальный ответственный не найден, функция осуществляет поиск\nглобального ответственного по всем экземплярам запущенного процесса по маршрутному объекту, при его отсутствии функция вернет null.\nПример\nДопустим, в компании существует процедура приема на работу, которая включает в себя несколько этапов:\nизначально по каждому кандидату запускается процесс согласования приема на стажировку, именуемый в системе как \"Согласование кандидата\";\nпо завершении стажировки запускается второй процесс согласования приема в штат. В этом процессе необходимо переиспользовать ответственных сотрудников, которые участвовали в приеме кандидата на стажировку.\nПри\nнастройке этапов второго бизнес-процесса\nпри\nназначении ответственных\nпо\nзадаче\nможно выбрать способ определения списка сотрудников для выбора ответственного \"По алгоритму\", используя алгоритм следующего вида:\nФункция\ngetRespEmp\nпозволяет получить динамический объект типа \"Ответственные сотрудники\" с ролью \"Куратор\" по процессу \"Согласование кандидата\" по текущему объекту:\nв качестве роли искомого ответственного при помощи функции\ndict\nвыбирается группа доступа\n\"Куратор\"\n;\nв рамках задачи запуск бизнес-процессов производится по текущему объекту, поэтому в качестве маршрутного объекта указывается функция\ncurrentObject\n;\nэкземпляр запущенного бизнес-процесса передается в функцию через\nпеременную\nprID\n.\nДля написания данного алгоритма также были использованы другие функции.\nВ первую очередь необходимо найти завершенные бизнес-процессы \"Согласование кандидата\" по текущему объекту, для этого применяется функция\nobjectsWithOptions\nс методом \"filterAlg\", где для установки значения параметра кода текущего объекта используется функция\ncurrentObject\n.\nПеременные в алгоритме задаются при помощи функции\nvar\n.\nДалее с использованием функции\nforEach\nсоздается цикл по коллекции \"ДО. Экземпляр запущенного процесса\", которая в свою очередь добавляется при помощи\nobjectsWithOptions\n.\nДля получения первого созданного процесса применяется метод .get со значением \"0\".\nВ переменную\nprID\nпри помощи функции\nattrByVar\nзаписывается Код найденного процесса.\nПо полученной при помощи функции\ngetRespEmp\nзаписи ответственного можно получить объект ответственного сотрудника, используя функцию\ngetObject\n.\nДля назначения ответственного по второму бизнес-процессу необходимо передать код полученного ответственного сотрудника, для этого применяются функции\nreturn\nи\nattrByVar\n.",
  "source": "https://docs.greendata.ru/platform/ru/getrespemp.html"
}