{
  "title": "Release details, version LTS.403.2",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.403.2\nPatch LTS.403.2 of March 15, 2024\nChanges and improvements\nStabilization in working with compiled algorithms with the \"text\" function used;\nOptimizations in registry object filtering;\nUpdates in viewing panels on the object profile according to the given settings.\nPatch LTS.403.1 of March 14, 2024\nNew features\nA possibility to configure column titles for the \"Table\" analytical panel was added.\nChanges and improvements\nImprovements in multidomain authorization.\nPage loading stabilizations.\nUpdate package LTS.403.0 of March 12, 2024\nNew features\nFor user to get identified in the System, it’s now possible to setup integration with some external authentication providers.\nA new getExternalUserProviderContext is added to receive information on user signing in with an external authentication provider.\nChanges and improvements\nImprovements in working with registry objects with possibility of multiselect;\nStabilizations in importing reporting form templates;\nNew possibilities in exporting dashboard charts in .pdf format;\nIt’s now possible to add ETL schema stage without default value;\nImprovements in running business processes;\nChanges in viewing notification templates according to the given layout and links operability;\nImprovements in viewing object name according to visual settings;\nStabilizations in viewing object profile attribute groups according to the given settings;\nImprovements in viewing \"Status bar (Advanced)\" widget stage names;\nUpdates in viewing system buttons at the registry control panel;\nUpdates in color changing for all menu item icons using design settings;\nThe list of message reactions was updated in GreenData Messenger.",
  "source": "https://docs.greendata.ru/platform/en/LTS.403.2-details.html"
}