{
  "title": "Настройка схем бизнес-процессов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка схем бизнес-процессов\nБизнес-процесс – схема взаимодействия, алгоритм, по которому действуют пользователи для достижения результата (включая выполнение системных автоматических действий).\nПереход к настройке\nсхемы\nбизнес-процесса осуществляется из\nкарточки бизнес-процесса\nпосле выбора\nверсии процесса\nпо кнопке\n.\nОтладка схемы бизнес-процесса осуществляется на рабочей области карточки бизнес-процесса посредством перетаскивания (Drag&Drop) и настройки необходимых элементов.\nДля\nсоздания нового элемента\nна схеме бизнес-процесса необходимо\nперетащить его\nс панели слева.\nДля\nсвязи элементов на схеме\nследует\nвыделить исходный элемент и протянуть стрелку\nдо элемента-назначения.\nНаименования элементов задаются на самой схеме бизнес-процесса после двойного клика по нему.\nВ панели управления представлены следующие возможности:\n– кнопка для сохранения BPMN схемы;\n– кнопка для сохранения диаграммы, сформированной в рабочей области, на устройстве пользователя в формате svg;\n– кнопка, по нажатию на которую в модальном окне будут открыты\nнастройки бизнес-процесса\n;\n– кнопка для присвоения текущей версии статуса \"Актуальная версия\" (подробнее про\nверсионность  бизнес-процессов\n);\nКнопка доступна при наличии права на редактирование объекта бизнес-процесса в случае открытия схемы версии бизнес-процесса со статусом \"Черновик\" или \"Архив\".\nПри наличии права на редактирование объекта бизнес-процесса в поле \"Наименование\" можно заменить наименование бизнес-процесса.\n\"Статус версии процесса\" отображает статус текущей версии;\n\"Версия процесса\" – элемент для смены/создания версии бизнес-процесса.\nПереключение между существующими версиями процесса осуществляется через выпадающий список, создание новой версии процесса доступно через меню действий.\nКаждый элемент бизнес-процесса обладает набором соответствующих параметров, для просмотра которых необходимо нажать на соответствующий элемент схемы и в отображаемых пиктограммах-действиях\nвыбрать кнопку\n\"\nНастройка\n\"\n.\nПросмотр свойств элементов доступен только после первого сохранения бизнес-процесса.\nПосле нажатия на кнопку настройки\nСистема отобразит карточку выбранного элемента схемы бизнес-процесса.\nПараметры настройки зависят от группы элемента.\nСхема бизнес-процесса реализуется в Нотации BPMN 2.0 и состоит из следующих групп элементов:\nсобытия (Event)\n:\nначальные\n;\nпромежуточные\n;\nконечные\n;\nшлюзы (ExclusiveGateway)\n;\nдействия (Task)\n;\nзоны ответственности (пулы и дорожки)\n;\nартефакты (сноски)\n.\nИнструмент \"Лассо\"\nиспользуется для одновременного выделения нескольких объектов на схеме.\nНастроенные этапы бизнес-процесса определяются в Системе как\nтип объекта\n\"\nДО. Этап бизнес-процесса\n\" (или его дочерний тип).\nЗапущенный бизнес-процесс определится как\nтип объекта\n\"\nДО. Экземпляр запущенного процесса\n\" (или его дочерний тип). Данные типы объектов содержат как системные, так и пользовательские атрибуты.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-business-process-flowcharts.html"
}