{
  "title": "newPdfFile",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nnewPdfFile\nФункция используется для работы с экземплярами\nобъекта типа \"Файл\"\n[FS_FILE] с целью их дальнейшего изменения  посредством использования дополнительных методов.\nСинтаксис\nnewPdfFile\n([fsFile])\nПараметр\nНазначение\nfsFile\nФайл формата PDF, в который необходимо внести изменения.\nВ качестве параметра ID существующего файла (объекта типа\n\"Файл\" [FS_FILE]\n) может передаваться в виде переменной, атрибута, параметра или числового значения.\nЕсли ID файла не указан, тогда создается новый файл в соответствии с настройками, заданными в алгоритме.\nРабота с функцией предполагает использование\nметодов\nэкземпляра класса PdfFile.\nПримечание\nПри выборе функции\nnewPdfFile\nс вкладки\n\"Документы и файлы\"\nв код алгоритма вставляется конструкция следующего вида:\ndef pdfFile:= newPdfFile(fsFile)\npdfFile.insertText(text, style)\nsave(pdfFile.getFile())\nФункция\nnewPdfFile\nпредполагает создание экземпляра класса PdfFile на основе выбранного значения параметра. По умолчанию созданный экземпляр присваивается в переменную \"pdfFile\".\nПри работе с функцией используются следующие методы:\nМетод\nНазначение\ninsertText\nИспользуется для добавления текста в файл формата PDF в соответствии с переданными значениями в параметры:\ntext – текст, который будет добавлен в файл (возможно указание непосредственно текста, переменной или алгоритма, возвращающего необходимый для вставки текст);\nstyle – стиль форматирования текста (экземпляр типа объекта\n\"Основной стиль форматирования\" [STYLES_DICTIONARY_INST]\n).\naddEmptyPage\nПрименяется для добавления пустой страницы.\naddPages\nИспользуется для добавления страниц из другого файла формата PDF с возможностью настройки ориентации.\naddPages(PdfFile, [PageOrientation])\nВ методе задействованы параметры:\nPdfFile – файл формата PDF, страницы которого надо добавить в текущий файл.\nВ рамках алгоритма параметр может быть передан посредством функций\ndict\n,\nattr\n,\nattrByVar\n,\nparam\nили\nvar\n.\nВременным решением является запись параметра с использованием функции\nnewPdfFile\n.\nПланируемая доработка позволит передавать в качестве первого аргумента метода непосредственно сам объект.\nPageOrientation – ориентация, к которой надо привести страницы добавляемого файла:\nPORTRAIT – ориентация страницы по вертикали;\nLANDSCAPE – ориентация страницы по горизонтали.\nЕсли ориентация не задана или в случае передачи любого другого значения, по умолчанию используется ориентация добавляемого файла.\npageCount\nВозвращает количество страниц в PDF-файле.\ngetFile\nВозвращает объект типа\n\"Файл\" [FS_FILE]\n.\nfile\nСоздает объект типа\n\"Файл\" [FS_FILE]\n.\nДля работы с данным методом необходимо использовать\nпеременную\n.\nПри создании нового объекта обязательным является указание наименования и классификации файла посредством методов:\nsetFileName – наименование файла, заданное как\nтекст\n;\nsetKindId – классификация файла, которая добавляется как объект, выбранный в справочнике \"Классификация файла\" [FS_FILE_KIND] при помощи функции\ndict\n.\nИспользование данных методов при изменении существующего файла позволяет заменить его наименование и классификацию.\nДля сохранения изменений необходимо использовать функцию\nsave\n, в которую передать объект типа \"Файл\" [FS_FILE].\nПримеры\nПример №1\nДопустим, имеется кредитный договор в формате DOCX, который хранится в атрибуте \"Заявка клиента\". Требуется преобразовать файл в формат PDF и добавить на титульный лист текущую дату и уникальный код сделки, хранящийся в атрибуте \"Уникальный код идентификации договора\", после чего сохранить полученный файл в атрибуте \"Прикрепленные файлы\".\nАлгоритм примет следующий вид:\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nПеременные pdf, pdfFile определены посредством функции\nvar\n.\nФайл формата DOCX преобразован в формат PDF посредством функции\ndocxToPdf\n.\nАтрибуты \"Заявка клиента\", \"Уникальный код идентификации договора\", \"Прикрепленные файлы\" выбираются с помощью функции\nattr\n.\nС помощью метода insertText в файл добавляется текст с применением указанного стиля форматирования, который задается выбором\nобъекта типа \"Основной стиль форматирования\"\nпосредством функции\ndict\n.\nС помощью функции\ncurrentDate\nзадается текущая дата, формат которой устанавливается посредством функции\ndateFormat\n.\nСохранение полученного файла производится с помощью функции\nsave\n.\nТекущий объект задается при помощи функции\ncurrentObject\n.\nПосредством функции\nattr\nс признаком \"Установить значение\" в атрибут \"Прикрепленные файлы\" записывается файл, хранящийся в переменной pdfFile и полученный при помощи метода\ngetFile\n.\nТекущий объект сохраняется функцией\nsave\n.\nВ результате будет создан файл формата PDF, в котором будут отображены уникальный код сделки и текущая дата с применением указанного стиля форматирования:\nПример №2\nДопустим, на основе трех документов формата PDF необходимо сформировать новый PDF-файл для представления нового летнего меню ресторана, последовательно добавив в него:\nДанные из файла \"Утвержденное меню\" вертикально.\nДанные из файла \"Иллюстрации блюд\" горизонтально.\nПустую страницу.\nДанные из файла \"Лицензии ресторана\" с ориентацией добавляемого файла.\nНовый файл должен быть сохранен под названием \"Летнее меню\" с классификацией файла \"Прочее\". Помимо этого в лог алгоритма необходимо вывести количество страниц созданного меню.\nАлгоритм примет следующий вид:\nДля создания нового PDF-файл используется функция\nnewPdfFile\nбез указания ID, которая присваивается в\nпеременную\npdf.\nОбъединение PDF-файлов \"Утвержденное меню\", \"Иллюстрации блюд\" и \"Лицензии ресторана\", ранее загруженных в систему, реализуется при помощи метода\naddPages\n, где:\nв качестве первого аргумента указывается добавляемый файл, для этого используется функция\nnewPdfFile\nс указанием ID соответствующего объекта, например, при помощи функции\ndict\n;\nпри помощи второго аргумента определяется ориентация страницы:\nPORTRAIT – ориентация страницы по вертикали;\nLANDSCAPE – ориентация страницы по горизонтали;\nabc – ориентация добавляемого файла (использование любого другого значения отличного от PORTRAIT/LANDSCAPE).\nПустая страница при помощи метода\naddEmptyPage\nсогласно постановке включается в перечень страниц после добавления данных файла \"Иллюстрации блюд\".\nДля написания данного алгоритма также были использованы другие функции.\nСмотреть подробнее.\nПри помощи функции\nprintout\nи метода\npageCount\nв лог алгоритма выводится количество страниц созданного PDF-файла.\nДля сохранения сформированного PDF-файла в системе необходимо объявить\nновую переменную\n\"file\", в которой при помощи метода\nfile\nсоздать объект типа \"Файл\" на основе сформированного документа.\nЕсли бы изменения вносились в существующий объект типа \"Файл\", было бы достаточно сохранить переменную \"file\" при помощи функции\nsave\n. Но так как в данной задаче формируется новый файл, посредством методов\nsetFileName\nи\nsetKindId\nв обязательном порядке указывается наименование и классификация файла:\nнаименование файла \"Летнее меню\" указывается при помощи функции\ntext\n;\nвыбор классификации файла \"Прочее\" осуществляется в справочнике \"Классификация файла\" при помощи функции\ndict\n.\nВ результате выполнения алгоритма в Системе может быть создан файл следующего вида:",
  "source": "https://docs.greendata.ru/platform/ru/newpdffile.html"
}