{
  "title": "Configuring the Task Scheduler",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nConfiguring the Task Scheduler\nIn order to\nautomatically perform an action\nin the System, you need to create a\nschedule for its launch\n. The start time is set\nin CRON format\n.\nTo create several automatic actions for one schedule, go to the \"Task Scheduler\" menu item and click\nto create a new object.\nIn the new registry profile, you need to fill in general settings:\nSetting\nPurpose\nName\nEntering the name of the setting.\nSchedule of operation\nEntering the start period of the algorithm ((for more information, see\nCRON Scheduler\n).\nThe \"Schedule is active\" switch\nThis switch confirms the launch of the system action according to the schedule. However, it’s advised to activate it\nonly after configuring all the settings\n.\nWhen setting up a schedule, you need to fill in the general settings without changing the state of the \"Schedule is valid\" switch. Then you should create new system actions in the \"Task Scheduler\" child attribute without changing the state of the \"Schedule is active\" switch in the action profile.\nAfter that, you can activate the switch and save the data.\nThen, the \"Schedule is valid\" switch of the previously configured system action profiles will be activated.\nIn a similar way, the user can cancel the schedule action for all system actions by disabling the \"Schedule is valid\" switch in the general schedule settings.\nAfter\nsaving the schedule profile with the active attribute \"Schedule is valid\", the user can\ndisable\nthe execution of certain tasks by changing the settings.\nRemember that actions with the\nactive switch\nrelated to an\ninactive schedule\nwill not be performed, as the work time will not be connected to actions.\nSystem Action settings\nThe user can configure system actions by clicking\nin the \"Task Scheduler\" child attribute.\nAfter that, a window with possible types of system actions will appear on the user’s screen.\nAfter selecting the required type of action, the user will see a window with the settings of the system action, which may differ depending on the selected type. Let’s take a look at examples of setting up a schedule to run:\nAlgorithm\n;\nCalculation\n;\nETL\n.\nOther actions are configured similarly. The number of system actions may vary depending on the increase in the functionality of the System.",
  "source": "https://docs.greendata.ru/platform/en/configuring-the-task-scheduler.html"
}