{
  "title": "Права доступа на атрибуты типа",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПрава доступа на атрибуты типа\nНастройка прав\nКонтроль прав на просмотр и редактирование\nзначений атрибутов\nв карточке экземпляра типа может регулироваться бизнес-аналитиком.\nДля управления правами на атрибуты необходимо в панели управления карточки типа объектов нажать на кнопку\n.\nВ результате чего в новой вкладке откроется матрица атрибутов типа.\nПо умолчанию отображаются только собственные атрибуты типа.\nДля атрибутов типа, унаследованных от родительского типа,  предусмотрена возможность переопределения прав на уровне наследуемого типа.\nДля отображения атрибутов родительского типа необходимо активировать опцию \"Показать атрибуты родительского типа\".\nПо умолчанию группам доступа \"Все пользователи\" и \"Административная группа\" предоставляется право на чтение и редактирование значений атрибутов.\nДля выдачи прав на атрибуты по заданным условиям необходимо выбрать один или несколько атрибутов и нажать на кнопку\n.\nВ открывшемся модальном окне для выбранных атрибутов можно настроить два типа доступа:\nтолько чтение – доступен только просмотр значения;\nредактирование – доступны просмотр и изменение значения.\nДля настраиваемого типа доступа в параметре \"Наименование условия\" необходимо выбрать/создать условие-фильтр, возвращающее true или false.\nДля каждого атрибута можно настроить один тип доступа или разграничить права, используя кнопку\n.\nС сочетанием прав на чтение и редактирование можно ознакомиться в таблице.\nЧтение\nЗапись\nВидимость значения атрибута\nВозможность изменения значения атрибута\nnull\nnull\nnull\nnull\n1\n1\n1\n1\n1\n0\n1\n0\n0\n1\n1\n1\n0\n0\n0\n0\nnull\n1\n1\n1\nnull\n0\n0\n0\n1\nnull\n1\n0\n0\nnull\n0\n0\nГде:\n1 – условие задано и возвращает true;\n0 – условие задано и возвращает false;\nnull – настройки типа доступа не заданы, что равнозначно положительному результату выполнения условия (true).\nНеобходимо внимательно осуществлять выдачу прав на атрибуты!\nЕсли под пользователем выполняется алгоритм, а в коде алгоритма устанавливается значение атрибуту, на редактирование которого у пользователя нет прав, то такой алгоритм не выполнится – в лог работы алгоритма запишется ошибка.\nПользователю будет отображено уведомление вида \"Недостаточно прав для редактирования атрибута\".\nЕсли под пользователем выполняются\nвыражение\n/\nавтокалькуляция\nили\nсобытие\n, изменяющие значение атрибута, на чтение или редактирование которого у пользователя нет прав, либо отсутствуют права на редактирование самого объекта, то\nрасчет будет произведен\n.\nЭто связано с тем, что по умолчанию (если не используется\nexecAs\n) выполнение\nвыражений\n/\nавтокалькуляций\nи\nсобытий\nосуществляется под пользователем с ролью \"Администратор\".\nЕсли значение атрибута задано по умолчанию или рассчитано\nвыражением\n, сохранение нового экземпляра типа осуществляется вне зависимости от наличия прав у пользователя на редактирование данного атрибута.\nПосле сохранения настроек, в матрице атрибутов типа будут отображены типы доступа и заданные к ним условия-фильтры, которые могут быть открыты в соседней вкладке браузера при нажатии на условие.\nРедактирование настроенных условий для атрибута осуществляется после выбора атрибута и нажатия на кнопку\n(одновременное редактирование условий для нескольких атрибутов невозможно).\nДля того чтобы переопределить условия для нескольких атрибутов, необходимо задать их заново по кнопке\n.\nПрименение прав\nПри работе с карточкой экземпляра права на значения атрибутов применяются\nв реальном времени\nсогласно таблице:\nПример\nВ зависимости от статуса заявки на получение кредита необходимо настроить права на атрибуты для пользователей разными ролями по следующим правилам:\nсотрудники отдела по работе с клиентами\nмогут редактировать данные заявки на кредит при оформлении до тех пор, пока статус заявки не изменится на \"Проверка (экспертизы)\", при этом просмотр результатов экспертиз для них недоступен.\nредактирование поля \"Результат проверки СБ\" доступно только\nспециалистам и начальникам службы безопасности\nво время статуса \"Проверка (экспертизы)\", остальные поля заявки в период всех статусов доступны только для чтения.\nредактирование поля \"Результат проверки ЮР\" доступно только\nспециалистам и руководителям юридического отдела\nво время статуса \"Проверка (экспертизы)\", остальные поля заявки в период всех статусов доступны только для чтения.\nДля решения поставленной задачи потребуется выполнить ряд шагов, рассмотренных далее.\nШаг 1. Подготовка объектной модели\nВ рамках примера создается тип объектов \"Заявка на получение кредита\".\nВ типе объекта формируется следующий атрибутивный состав:\nВ атрибутивном составе типа содержатся объектные и дочерние атрибуты, ссылающиеся на иные типы объектов.\nВ рамках рассматриваемого примера отметим, что тип объекта \"Статус\" включает в себя объекты \"Оформление\", \"Проверка (экспертизы)\", \"Принятие решения\", \"Завершено\", которые будут использоваться при формировании условий для выдачи прав на атрибуты.\nНеобходимые роли добавляются в качестве объектов в типе \"Должность\".\nШаг 2. Управление правами на значения атрибутов\nДля настройки прав на атрибуты необходимо в панели управления типа объектов \"Заявка на получение кредита\" нажать на кнопку\n.\nДальнейшее управление правами осуществляется на открывшейся вкладке с матрицей атрибутов типа согласно постановке.\nНапример, выбираются атрибуты, возможность редактирования которых должна быть только у сотрудников отдела по работе с клиентами, после чего нажимается кнопка\n.\nВ открывшемся модальном окне необходимо задать условие для типа доступа \"Редактирование\":\nУсловие может быть сформировано как из окна настройки, так и выбрано ранее созданное. В данном случае условие формируется следующим образом:\nТекущий пользователь, работающий с заявкой – сотрудник отдела по работе с клиентами;\nЗаявка должна находиться в статусе оформления.\nПросмотр значений данных атрибутов доступен всем пользователям Системы.\nКогда заявка находится в статусе проверки (экспертизы), редактирование значения:\nдля атрибута \"Результат экспертизы СБ\" должно быть доступно только\nспециалистам и начальникам службы безопасности\n:\nдля атрибута \"Результат экспертизы ЮР\" – только\nспециалистам и руководителям юридического отдела\n:\nПри этом просмотр значений экспертиз, которые будут представлены на статусах проверки (экспертизы) и принятии решения, доступен только вышеупомянутым ролям, поэтому необходимо определить тип доступа \"Чтение\" с добавлением условия:\nШаг 3. Настройка визуала\nДобавление и расположение элементов карточки заявки на кредит осуществляется в рамках поставленной бизнес-задачи\nв режиме редактирования визуала\n.\nДля демонстрации хода заявки при настройке визуалов используется\nвиджет \"Расширенный статус бар\"\n.\nНастроенная карточка заявки на кредит может принять следующий вид (возможности ввода и просмотра значений атрибутов будут соответствовать заданным правам):\nпри работе от лица сотрудника отдела по работе с клиентами:\nв статусе оформления заявки доступно редактирование полей на оформление заявки на кредит:\nзначения полей с оценкой экспертиз недоступны даже для просмотра:\nЕсли у пользователя отсутствуют права на просмотр и редактирование значения атрибута, поле такого атрибута будет заблокировано с отображением подсказки \"Значение пусто или у вас нет прав\".\nпри работе от лица специалиста или начальника службы безопасности:\nдоступен просмотр данных заявки без возможности редактирования при любом статусе заявки:\nдоступен выбор значения результата решения экспертизы СБ, когда заявка находится в статусе проверки (экспертизы), и просмотр решения результата экспертизы Юр без возможности редактирования (когда заявка находится в статусе проверки (экспертизы)/принятия решения):\nпри работе от лица специалиста или руководителя юридического отдела:\nтакже доступен просмотр данных заявки без возможности редактирования при любом статусе заявки;\nдоступен выбор значения результата экспертизы Юр, когда заявка находится в статусе проверки (экспертизы), и просмотр решения результата решения экспертизы СБ без возможности редактирования (когда заявка находится в статусе проверки (экспертизы)/принятия решения):",
  "source": "https://docs.greendata.ru/platform/ru/permissions-for-type-attributes.html"
}