{
  "title": "Basic and custom registries",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nBasic and custom registries\nThe registry settings of the object type allow editing its\nvisual\naccording to individual preferences of the System user, which helps to facilitate convenient interaction with the platform elements.\nA single data type registry can have different sets of settings, so the user can work with the same registry to accomplish different tasks.\nEach object type has a default registry. Within the platform, it is possible to create and configure two types of registry:\nbasic registry\n;\ncustom registry\n.\nThe custom registry is created from the basic registry, which allows to automatically apply changes in the basic registry settings to the inherited custom registry.\nAccess permissions\nSaving settings\nSaving registry settings (for example, a specified\nsorting\nor\ndata filtering\n) is performed by clicking the\nbutton:\nIf there is no basic registry (there are no registries available by clicking the\nbutton), but the user has permissions to create instances of the \"Basic registry settings\" [SYS_REGISTRY] type, the basic registry will be created.\nIf the user has permissions to edit the current registry, the settings will be saved in the current registry.\nIf the user does not have permissions to edit the current registry and has no permissions to create instances of the \"Custom registry settings\" [SYS_REGISTRY_CUSTOM] type, a custom registry will be created.\nIf the user does not have permissions to edit the current registry and create instances of the basic and custom registries, the settings will not be saved.\nViewing and creating a registry\nThe\nbutton is used to view existing registries and create new ones..\nThe button display is adjusted in the\nregistry control panel settings\n.\nAccess to the drop-down list is provided with\npermissions\nto \"Read\" the \"Basic registry settings\" [SYS_REGISTRY] and/or \"Custom registry\" [SYS_REGISTRY_CUSTOM] object types.\nTo create or copy an existing registry, the user must have\npermissions\nto \"Create instances\" of the \"Basic registry settings\" [SYS_REGISTRY] and/or \"Custom registry\" [SYS_REGISTRY_CUSTOM]  object types.\nIf the user has permissions to only one registry and does not have permissions to \"Create instances\" of the \"Basic registry settings\" [SYS_REGISTRY] or \"Custom registry\" [SYS_REGISTRY_CUSTOM] object types, the drop-down list will be unavailable.\nBasic registry\nA basic type registry is a set of registry settings set up in the System based on the default object type.\nThe user is able not only to customize the existing registry, but also to create copies of it, preserving all attributes and other elements of the base registry for correct display of information according to specific tasks.\nInitially, the default registry is installed in the new object type. Based on it, user can create the first basic registry by clicking on the\nbutton, which opens the modal window\nsettings\nof the basic registry.\nSave changes by clicking on the\nbutton.\nTo create a copy of the basic registry, display a list of existing registries using the\nbutton, and after selecting the basic registry, click on the\n.\nIn the modal window that opens, just fill in the basic information:\nname of the created copy;\nlink to the object type the copy will be generated based on (can be filled in automatically).\nIn addition, the user will be able to configure the display of columns in the registry and other settings for displaying and filtering\nregistry\ninstances).\nAfter making the necessary changes, save them using the\nbutton and click on the \"Ok\" button.\nThe created copy of the basic registry will be automatically displayed on the user’s screen.\nCopies of the basic registry take on a similar level in the hierarchical list of existing registries.\nTo be able to edit attribute values directly in the object type registry, open the registry settings, go to the \"Display styles\" tab and activate the \"Use default editing mode\" setting switch\nOnce this is done, it is possible to change the attribute values in the registry by clicking once with the left mouse button on the field to be edited\nCreating a menu item\nTo quickly navigate to the required registry in the System, create a new menu item. To do this, go to the\nmenu settings\nand create a menu item of the \"Registry\" type. In the profile of its creation it is necessary to fill in the name and identifier of the object, necessarily indicating the object type based on which the registry is built and select the configured registry.\nIf the field is filled in and the user has\npermissions\nto the specified basic registry, then:\nif the user has selected a different\nbasic registry\nor a child of it by default, the basic registry specified in the “Registry” field will be displayed;\nif the user has selected\ncustom registry\nby default, a child of the one specified in the “Registry” field - the default custom registry will be displayed.\nIf the user does not have\npermissions\nto the basic registry specified in the “Registry” field or the “Registry” field is not filled in, the default registry will be displayed.\nTo set a registry to \"default\", display the entire list of registries and click on the\nbutton to the left of the name.\nAccess to the basic registry\nIt is important to ensure that all users who will work with the created copy of the registry are granted access. To do this, go to the menu item \"Access to system objects\", specify the object type \"Basic registry settings\", select the necessary registry and assign the necessary permissions to the appropriate user group.\nAfter assigning the necessary permissions, make sure to save the changes.\nCustom registry\nThe distinguishing feature of the custom registry from the basic registry is that in case the user does not have permissions to edit the basic registry, the user cannot create a copy of it - instead, the window of creating a custom registry with a filled in link to the object type opens.\nTo create a new custom registry, display the list of existing registries using the\nbutton. In the list that opens, select the basic registry and click on the\nbutton.\nSimilar to setting up the basic registry, basic information needs to be entered:\nRegistry\nname\n;\nObject type\nbased on which the registry is created (can be filled in automatically).\nAfter saving the changes, the user registry will be displayed on the screen, located at the second level of the hierarchical list of existing registries.\nIt is important to note that in the process of creating a custom registry, the user cannot make changes that relate to data visualization. These settings are possible only after the registry is created.\nTo be able to edit attribute values directly in the object type registry, open the registry settings, go to the \"Display styles\" tab and activate the \"Use default editing mode\" setting switch.\nOnce this is done, it is possible to change the attribute values in the registry by clicking once with the left mouse button on the field to be edited.\nCreating a menu item\nThe process of creating a menu item to quickly navigate to a custom registry is similar to creating a menu item for a basic registry, however, there is one difference: the user does not have the option to specify a custom registry in the \"Registry\" field, while only the basic ones are available.\nAccess to the custom registry\nIf there is a need to grant access to the user registry to certain users or groups of users, it is required to assign them the necessary permissions. To do this, go to the menu item \"Access to system objects\", specify the object type \"Custom registry settings\", select the necessary registry and assign the necessary permissions to the appropriate user group.",
  "source": "https://docs.greendata.ru/platform/en/basic-and-custom-registries.html"
}