{
  "title": "Настройка иерархического отображения файлов",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка иерархического отображения файлов\nНастройка иерархического представления файлов используется для определения правил (условий) фильтрации (классификации) прикрепленных файлов при их отображении. Представляет собой настроечный тип объекта\n\"Настройка иерархического отображения файлов\" [FS_HIER]\n.\nДанный настроечный тип используется для работы с виджетами\n\"Иерархия файлов\"\nи\n\"Проводник\"\n, отображающими иерархию прикрепляемых файлов.\nИерархическое представление\nРассмотрим (упрощенную) принципиальную схему организации иерархического представления файлов.\nНастройка иерархического представления файлов предполагает:\nсоздание именованной записи иерархии c уточнением типа объекта;\nсопоставление иерархии нескольких вершин, связанных с атрибутами типов, классификацией и файловыми тегами.\nАлгоритмическое воздействие на элементы иерархии является вариативным и зависит от характера решаемой задачи.\nНастройка\nДля настройки иерархического представления файлов необходимо:\nПерейти в реестр типа\n\"Настройка иерархического отображения файлов\" [FS_HIER]\n, создать новый экземпляр типа нажатием на кнопку\nи заполнить параметры настройки:\nПараметр\nНазначение\nНаименование\nВвод наименования настройки.\nТип объекта\nОпределение типа объекта, иерархическое представление файлов которого настраивается.\nРежим просмотра по умолчанию\nВыбор режима просмотра файлов, используемого по умолчанию. Возможные значения:\nплиточный;\nтабличный.\nВ случае работы с\nвиджетом \"Проводник\"\nдля отображения файлов данная настройка не учитывается.\nАлгоритм видимости кнопки \"Удалить теги\"\nВыбор/ ввод алгоритма для определения условий отображения кнопки \"Удалить теги\". Используется в\nвиджете \"Проводник\"\n.\nАлгоритм видимости кнопки \"Присвоить теги\"\nВыбор/ ввод алгоритма для определения условий отображения кнопки \"Добавить теги\". Используется в\nвиджете \"Проводник\"\n.\nАлгоритм наименования скачиваемых файлов\nВыбор/ ввод алгоритма для наименования файлов при скачивании нескольких файлов в виде архива.\nАлгоритм наименования скачиваемого архива\nВыбор/ ввод алгоритма для наименования архива при скачивании нескольких файлов в виде архива.\nЗатем необходимо настроить отображение вершин. Каждая вершина (узел) представляет собой дочерний тип объекта.\nЧтобы задать вершину иерархии, необходимо нажать\nи заполнить следующие основные параметры:\nПараметр\nНазначение\nНаименование\nВвод наименования настройки (вершины). Это наименование отобразится пользователю, если узел не будет скрыт.\nНастройка иерархического отображения файлов\nВыбор настройки иерархии из выпадающего списка. Данная иерархия задается типом объекта\n\"Настройка иерархического отображения файлов\" [FS_HIER]\n, для которого настраивается вершина.\nРодитель\nВыбор родительской вершины иерархии.\nНастройка определения файлов\nТип объекта\nОпределение типа объекта с атрибутом, содержащим файлы для отображения в настраиваемой вершине.\nВыбор осуществляется посредством выпадающего списка из всех типов объектов Системы.\nАлгоритм определения объектов\nВыбор алгоритма для определения объектов. При этом, базовый тип у этого алгоритма должен быть равен типу объекта, на визуале которого используется виджет.\nАлгоритм должен возвращать объект или коллекцию объектов, содержащих файлы.\nАтрибут типа\nОпределение атрибута типа, содержащего файлы для отображения в настраиваемой вершине.\nАлгоритм определения файлов\nВыбор алгоритма для определения файлов для отображения в настраиваемой вершине.\nАлгоритм будет выполнен по объектам, которые были возвращены алгоритмом, указанным в поле \"Алгоритм определения объектов\".\nИспользуется при пустом значении поля \"Атрибут типа\".\nНастройка определения классификаций\nКлассификации\nВыбор классификаций прикрепленных файлов для отображения.\nВыбор осуществляется посредством выпадающего списка из экземпляров типа\n\"Классификация файла\" [FS_FILE_KIND]\n.\nАлгоритм определения классификаций\nВыбор алгоритма для определения классификаций.\nАлгоритм будет выполнен по объектам, которые были возвращены алгоритмом, указанным в поле \"Алгоритм определения объектов\".\nИспользуется при пустом значении поля \"Классификации\".\nПри необходимости в блоке \"Настройка ограничений на действия с файлами\" могут быть заданы ограничения на действия с файлами, а в блоке \"Настройка визуализации вершин в проводнике\" осуществляется настройка отображения вершин в проводнике посредством следующих параметров:\nПараметр\nНазначение\nНастройка ограничений на действия с файлами\nНастроить ограничение на перемещения файлов\nОпределение способа задания ограничения на перемещение файлов. Возможные варианты:\nпо алгоритму с классификациями;\nпо алгоритму с файлами.\nАлгоритм с классификациями, для которых недоступно перемещение файлов\nОпределение алгоритма, посредством которого будет задано ограничение на перемещение файлов.\nАлгоритм должен возвращать классификации.\nАлгоритм с файлами, для которых недоступно перемещение\nОпределение алгоритма, посредством которого будет задано ограничение на перемещение файлов.\nАлгоритм должен возвращать коллекцию файлов.\nНастроить ограничение замены файлов\nОпределение способа задания ограничения на замену файлов. Возможные варианты:\nпо алгоритму с классификациями;\nпо алгоритму с файлами.\nАлгоритм с классификациями, для которых недоступна замена файлов\nОпределение алгоритма, посредством которого будет задано ограничение на замену файлов.\nАлгоритм должен возвращать классификации.\nАлгоритм с файлами, для которых недоступна замена файлов\nОпределение алгоритма, посредством которого будет задано ограничение на замену файлов.\nАлгоритм должен возвращать коллекцию файлов.\nНастроить ограничение выбора актуальной версии\nОпределение способа задания ограничения выбора актуальной версии файлов. Возможные варианты:\nпо алгоритму с классификациями;\nпо алгоритму с файлами.\nАлгоритм с классификациями, для которых недоступен выбор актуальной версии\nОпределение алгоритма, посредством которого будет задано ограничение на выбор актуальной версии файлов.\nАлгоритм должен возвращать классификации.\nАлгоритм с файлами, для которых недоступен выбор актуальной версии\nОпределение алгоритма, посредством которого будет задано ограничение на выбор актуальной версии файлов.\nАлгоритм должен возвращать коллекцию файлов.\nНастроить ограничение удаления файлов\nОпределение способа задания ограничения на удаление файлов. Возможные варианты:\nпо алгоритму с классификациями;\nпо алгоритму с файлами.\nАлгоритм с классификациями, для которых недоступно удаление файлов\nОпределение алгоритма, посредством которого будет задано ограничение на удаление файлов.\nАлгоритм должен возвращать классификации.\nАлгоритм с файлами, для которых недоступно удаление файлов\nОпределение алгоритма, посредством которого будет задано ограничение на удаление файлов.\nАлгоритм должен возвращать коллекцию файлов.\nАлгоритм с классификациями, для которых недоступно добавление файлов\nОпределение алгоритма, посредством которого будет задано ограничение на добавление файлов.\nАлгоритм должен возвращать классификации.\nАлгоритм с классификациями, для которых недоступна версионность\nОпределение алгоритма, посредством которого будет задано ограничение на версионность файлов.\nАлгоритм должен возвращать классификации.\nНастройка визуализации вершин в проводнике\nСкрыть вершину\nПризнак, определяющий отображение файлов вершины. При установке признака будут скрыты файлы вершины, при этом папки будут отображены.\nСкрыть в правой части папки классификаций\nПризнак, определяющий отображение папок классификаций. При установке признака в правой части проводника будут скрыты папки классификаций и отображены файлы из этих папок.\nСкрыть узел\nПризнак, определяющий отображение наименования родительского узла в виджете.\nСкрыть заголовок\nПризнак, определяющий отображение наименования заголовка узла в виджете.\nВыстроить иерархию папок классификаций\nПризнак, определяющий построение иерархии папок классификаций при отображении. При установке признака Система учитывает полученные классификации до первой общей папки, после чего отобразит их структуру: от общей папки до указанных классификаций.\nОтобразить иконку папки\nПризнак, определяющий отображение иконки папки.\nСкрыть вершину, если отсутствуют связанные объекты\nПризнак, определяющий отображение вершины в зависимости от наличия объектов. При установке признака вершина будет скрыта, если посредством алгоритма, указанного в поле \"Алгоритм определения объектов\", не были найдены объекты, содержащие файлы.\nЗапретить прикрепление файлов\nПризнак, определяющий возможность прикрепления файлов. При установке признака будет запрещено прикрепление файлов в текущей вершине. На дочерние вершины признак не распространяется.\nАлгоритм стилизации для папок\nОпределение алгоритма стилизации папок.\nВыбор осуществляется из выпадающего списка заранее подготовленных\nстилей форматирования\n.\nАлгоритм стилизации для файлов\nОпределение алгоритма для наглядного выделения файлов. Посредством алгоритма можно, например, задать подсветку файлов, добавленных после указанной даты.\nВыбор осуществляется из выпадающего списка заранее подготовленных\nстилей форматирования\n.\nВ случае необходимости настройки отдельных наборов классификаций (например, для Поручителей-ФЛ и Поручителей-ЮЛ) необходимо добавить\nдве\nвершины с соответствующими алгоритмами определения объектов для текущего узла.\nЕсли настроенный алгоритм определения объектов для текущего узла возвращает пустую коллекцию, этот узел не отображается в\nвиджете \"Иерархия файлов\"\n.",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-file-hierarchical-view.html"
}