{
  "title": "Custom widgets",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCustom widgets\nThis module is currently under development and has limited functionality.\nIn the On-Premise solution, access to the module is possible after adding\nparameters to the application’s configuration file\n.\nDepending on the needs of the product being developed, standard tools may not be sufficient during the\nvisual setup\n.\nThe System provides functionality that allows users to create their own\nwidgets\nwith individual settings and define their final appearance.\nCreating custom widgets requires basic knowledge of HTML markup.\nCreating custom widgets is available to users with the\n\"View metadata\"\nand\n\"Edit metadata\"\npermissions.\nTo navigate to the widget development environment, select the following main menu items: Administration → Settings → Widget development environment.\nThe main elements of the widget development environment interface are:\nSetting\nPurpose\n\"Widgets\" Block\nContains custom and system widgets, organized into folders.\n\"Widget components\" Block\nContains templates of ready-to-use widget components.\nSettings area\nUsed for code creation.\nPreview area\nDesigned for previewing the final display of the widget and its settings.\nFor compact display and ease of use, the size of the elements in the development environment can be adjusted by moving the dividing lines between them left/right, and blocks or areas can be completely hidden by clicking\nor\nbuttons between them.\n\"Widgets\" Block\nThis block contains custom and system widgets located in folders of the same name.\nViewing and hiding folder contents is managed by clicking the\nand\nbuttons next to the folder name.\nSystem widgets\nCreating and editing widgets in the \"System\" folder is not available.\nWidgets located in the \"System\" folder can be used as ready-made templates when creating custom widgets. The current set includes the following widgets:\n\"Text\"\n,\n\"Button\"\n, and\n\"Navigation panel\"\n. Given the active development of the System, the list of available widgets will be regularly updated, allowing users to extend functionality and customize the interface according to their needs.\nHovering over the name of a widget will reveal the\nbutton, which, when clicked, will copy the widget to the \"Custom\" folder, where its contents will be available for editing.\nCustom widgets\nThe \"Custom\" folder contains all widgets created by user. Hovering over the folder will display the following buttons:\n– creating a new folder inside the current one;\n- creating a new widget inside the current folder.\nClicking the\nbutton will create a new widget containing the\nSettings.html\nand\nView.html\nfiles (the process of working with these files is described\nfurther below\n):\nBy default, the widget is named \"Custom widget\" and has the\nicon. The widget can be renamed by double-clicking its current name, and its icon can be changed by clicking it and selecting a new one from the list of available icons.\nHovering over the widget name will display buttons for copying\nand deleting\nthe widget.\nIf a widget is used in the System, deleting it will open a modal window listing all\ninstance visuals\nwhere it was placed for deletion confirmation.\nWidgets can be moved between folders using Drag&Drop via the\nelement to the left of the widget name.\nTo quickly locate a required widget, the search by name bar can be used.\n\"Widget components\" Block\nThis block contains templates of widget components.\nTemplates can be added by dragging and dropping (Drag&Drop) a component from the \"Widget components\" block into a file opened in the\nSettings area\n.\nAs a result, the selected component’s code template will be added to the file, and its final display will be available in the preview area:\nSettings\nCreating a custom widget involves using two files:\nSettings.html\ntemplate:\nThis file is used to define widget settings displayed in a modal window when clicking the\nbutton while placing the widget on a visual;\nView.html\ntemplate:\nThis file defines the final display of the widget based on the settings selected by user.\nWhen changes are made to the file, an indicator will appear to the left of its name, and the\ncontrol panel\nwill display a\nbutton. Clicking it will save all changes and remove the indicator.",
  "source": "https://docs.greendata.ru/platform/en/custom-widgets.html"
}