{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.419.3 от 18.07.2024\nНовые возможности\nРазрешено наследование от системного типа \"Ответственные сотрудники\"\nдля возможности добавления своей бизнес-логики при работе с ответственными на маршруте бизнес-процесса.\nУправление отображением кнопок в панели управления реестра стало более гибким и удобным, а блокировка кнопок \"Создать\", \"Копировать\", \"Редактировать\" и \"Удалить\" теперь регулируется правами на карточку объекта.\nВ настройках действия появился признак, позволяющий акцентировать внимание на добавляемую в панель управления кнопку.\nТеперь комнаты для звонка доступны и для мобильной версии.\nТеперь при помощи\nновых параметров конфигурационного файла\nможно предоставлять логи без конфиденциальной информации, а аудит ошибок просматривать через удобный интерфейс.\nИзменения и улучшения\nНастройка\nдерева условий\nстала более удобной – теперь уточнение объектных атрибутов осуществляется через специальную кнопку, а обновленный перечень операторов адаптирован под работу с цепочными объектными и дочерними атрибутами.\nПри некорректно заданном условии в дереве условий теперь осуществляется очистка соответствующих полей.\nДоработано отображение атрибута денежного типа в\nвиджете \"Таблица атрибутов\"\n.\nВ виджете\n\"Финансовая отчетность\"\nстабилизировано применение выбранных настроек, а в виджете\n\"Вычислимый показатель\"\n– корректное отображение результата расчета.\nПри вынесении атрибута типа \"Файл\" в колонку реестра, по умолчанию отображается ссылка на предпросмотр файла.\nСтабилизировано применение стиля форматирования для колонки реестра.\nСкорректировано поведение при попытке сброса настроек реестра, расположенного в несохраненном экземпляре объекта.\nАктуализированы идентификаторы состояния объекта во избежание ошибок при удалении связанных объектов.\nВ панели управления стабилизирована работоспособность кнопок, доступных по иконке троеточия.\nДоработана возможность переопределение действия кастомных кнопок модальных окон.\nСтабилизирован вызов процесса автокомпиляции алгоритма.\nПри вызове функции algWithParams доработана возможность изменения папки выбираемого значения.\nНалажена работоспособность функций getAnalyticValues и analytRowValueByVar.\nНа маршруте бизнес-процесса исключена возможность отката процессов и неуспешно завершенных элементов маршрута.\nСкорректировано содержимое лога, формируемое при смене пароля пользователя.\nСтабилизирован перенос обновлений, содержащих шаблон печатной формы с изображениями.\nДоработано применение настройки цвета кнопок панели главного меню.\nВ модуле EDoc доработано сравнение версий документов и формирование файлов печатной формы.\nВ модуле EDoc доработано добавление комментариев при работе пользователя с документом на нескольких страницах или отсутствием прав на добавление комментария.\nПереименован ряд системных действий.\nОптимизирована работа реестров.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.419.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.419.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.419.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.419.3-latest.html"
}