{
  "title": "\"Secret variable\" object type",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Secret variable\" object type\nTo properly store non-disclosure data, the System has a special\nsystem type\ncalled the\n\"Secret variable\"\n[\nSYS_SECRET_VARIABLE\n]. It allows the System to store passwords to external databases, user signatures, etc.\nTo configure a secret variable, the user needs to create a new instance in the registry of the \"Secret Variable\" type by clicking the\nbutton (see more about working with registries\nhere\n).\nSetting up\nIn the opened window, fill in the following parameters:\nSetting\nPurpose\nName\nEntering a unique setting name.\nIdentifier\nEntering a type instance identifier.\nValue\nEntering value that should be hidden.\nThe data display mode is configured by clicking the\n/\nicon above the field:\n– show value;\n– hide value.\nBy default, the value is hidden.\nEncryption  required\nA boolean attribute that determines the use of value encryption.\nAfter selecting the \"Yes\" value, the specified variable is saved in encrypted form. The data will be displayed in encrypted form in subsequent views.\nIf the attribute value is empty or if \"No\" is selected, the variable is displayed without encryption.\nWhen using the value in algorithms with the\nsecretVariable\nfunction, the initial variable is taken into account without encryption.\nBy default, the value is stored in encrypted form.\nThe\nvalue\nof this attribute is characterized by the following features:\nnot fixed by the\naudit\nSystems;\nthe\nvalue\nof the variable is not transferred during\nSystem update\nvia GUF files. The value of the secret variable must be specified manually on the updated instance;\nthe value is accessed inside the algorithm using the\nsecretVariable\nfunction;\nwhen accessing a variable, this value is considered as a password;\ndata is stored in the application cache, available for cache type invalidation.\nThe variable can be used as a\nglobal value\n(more commonly used in algorithms) that can only be changed by the System administrator.\nStorage locations\nThe System supports the following options for storing secret variables:\nFor applications running on a single node:\non disk in the\nconfig/secret_variable.csv\nfile;\nin HashiCorp Vault storage (find more about configuring the secret storage in Vault\nhere\n);\nin the main database (find more about configuring the secret storage in the database\nhere\n).\nFor applications running on multiple nodes:\nin HashiCorp Vault storage (find more about configuring the secret storage in Vault\nhere\n) – recommended option;\nin an NFS network file system;\nin the main database (find more about configuring the secret storage in the database\nhere\n).\nUse case\nThe secret variable can be used when generating the\nETL process\n, where the same type of connection to various databases is configured. In other words, the address for connecting to the database may change during operation. In this case, the database URL for connection is set by the secret variable.\nThe algorithm returns the URL (as the global value) required during connection.\nIf the database URL is changed, it is enough to set a new value in an instance of the \"Secret variable\" type once without editing algorithms.",
  "source": "https://docs.greendata.ru/platform/en/object-type-secret-variable.html"
}