{
  "title": "newVerEdocFromFile",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nnewVerEdocFromFile\nФункция формирует\nновую версию документа печатной формы\n(далее – ПФ) на основе файла, ранее загруженного в Систему.\nЗагрузка версии из файла, сохраненного на локальном устройстве пользователя, может быть осуществлена непосредственно из редактора документа ПФ при помощи кнопки\nв панели управления на\nвкладке \"История документа\"\n.\nКроме того, создание новой версии документа может быть осуществлено при помощи кнопок\nи\nнапротив необходимой версии на\nвкладке \"История документа\"\nредактора документа ПФ или путем копирования последней версии документа посредством функции\nnewVerEDoc\n.\nСинтаксис\nnewVerEdocFromFile\n(documentId, fsFile, [name])\nПараметр\nНазначение\ndocumentId\nДокумент ПФ, версию которого необходимо создать.\nВ параметре передается Код объекта типа \"Документ, сформированный по шаблону\" [RF_DOCUMENT].\nfsFile\nЭкземпляр\nтипа \"Файл\"\n[FS_FILE] (или его Код), на основе которого будет создана новая версия документа.\nname\nНаименование формируемой версии.\nПараметр может быть передан как текстовый\nатрибут\n, текстовая\nпеременная\nили\nтекст\n.\nЕсли значение параметра не задано, сформированной версии будет установлено наименование \"Версия N\", где N – номер версии документа.\nПримечание\nВызов функции осуществляется с вкладки\n\"Документы и файлы\"\nпанели инструментов редактора алгоритмов.\nПосле вызова функции откроется модальное окно для выбора объекта типа \"Документ, сформированный по шаблону\".\nВ результате работы функции будет создана новая версия документа, при этом:\nтип новой версии будет совпадать с типом последней версии документа (\"Работа с закладками\" или \"Рецензирование\");\nесли в последней версии документа содержатся необработанные правки, то при создании новой версии правки будут приняты автоматически;\nесли загруженный документ имеет какие-либо изменения по сравнению с последней версией документа в системе, то эти изменения в новой версии отобразятся как правки внешнего пользователя: добавленный текст будет отображен зеленым шрифтом, удаленный – зеленым зачеркнутым шрифтом;\nв новой версии документа отобразятся комментарии пользователей, содержащиеся в файле;\nв новой версии документа к тексту будет применено форматирование (цвет шрифта, цвет выделения текста, начертание текста: зачеркнутый, подчеркнутый, курсивный, жирный стиль текста) в соответствии с файлом.\nПример\nДопустим, работа с документом ПФ \"Кредитный договор\" осуществляется в режиме рецензирования. Требуется создать новую версию документа с наименованием \"Финальная версия\" на основе файла, ранее загруженного в Систему.\nАлгоритм может принять следующий вид:\nВ результате выполнения данного алгоритма в истории документа \"Кредитный договор\" будет отображена сформированная версия с наименованием \"Финальная версия\" для работы в режиме рецензирования.\nПри наличии в загруженном файле каких-либо изменений по сравнению с последней версией документа эти изменения в новой версии отобразятся как правки внешнего пользователя: добавленный текст будет отображен зеленым шрифтом, удаленный – зеленым зачеркнутым шрифтом.",
  "source": "https://docs.greendata.ru/platform/ru/newveredocfromfile.html"
}