{
  "title": "color",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ncolor\nThe operator for setting the color.\nThe operator is used in \"Algorithm. Condition for visual\"\ntype\nalgorithms.\nSyntax\n\"name\"\nSetting\nPurpose\nname\nThe color according to the HTML format.\nThe parameter value can be passed by:\ncolor code in HEX format, for example:\n\"#FFFFFF\"\n;\ncolor name in English in lowercase, for example:\n\"blue\"\n;\n* color code in RGB format, for example:\n\"rgb(255, 0, 0)\"\n.\nThe parameter value must be enclosed in double or single quotes.\nNote\nThe operator is called from\n\"Sources\" tab\non the toolbar of the algorithm editor, which opens the color picker with the option to select a color on the palette or enter a color code in RGBA and HEX formats.\nIt is also possible to select a color palette through a drop-down menu.\nWhen selecting a color, a HEX color code enclosed in double quotes will be added to the algorithm code.\nUse example\nIt is required to customizing the highlighting of the \"Task status\" attribute depending on the specified value.\nThis task can be accomplished by configuring the widget\n\"Title by attribute\"\n. To do this, in\nthe visual editing mode of an instance\n, drag the widget from the \"Elements\" panel to the workspace, then specify the \"Task status\" attribute in the settings and set the value style algorithm:\nThe color for the attribute value is determined using an algorithm:\nthe\nif\noperator sets a condition, depending on which the\nreturn\nfunction returns the desired color or\nformatting style\nof the text;\nthe color is selected using the\ncolor\noperator, the formatting style is set using the\nstyle\noperator.\nAs a result of the configuration, the task status will be displayed depending on the attribute value:\nWhen working with the \"Title by attribute\" widget, the default text color is black.\nIf the style algorithm returns only color, it will be applied to the text background.\nThe text color can be set by customizing the formatting style.",
  "source": "https://docs.greendata.ru/platform/en/color.html"
}