{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.473.7 от 16.12.2025\nНовые возможности\nКаталог шаблонов приложений на\nстартовой странице\nСистемы теперь может динамически адаптироваться на основании результатов\nопроса\n.\nТеперь при создании типа объекта автоматически устанавливается\nвид контроля прав\n, унаследованный от родительского типа.\nРеализована возможность\nпересчета экземпляров типа\nдля примитивных объектов.\nРеализован\nвиджет \"Просмотр PDF\"\nдля отображения и изменения PDF-файлов на визуале объекта с возможностью выделения, добавления текстовых заметок и вставки изображений.\nПерегенерация задачи бизнес-процесса теперь доступна при\nпросмотре схемы маршрута\n.\nВ представлении\nмногомерного куба (OLAP)\nтеперь доступна фильтрация измерений и фактов.\nРеализован быстрый переход к настройкам куба из его\nпредставления\n.\nДля линейных графиков появилась возможность\nнастройки стиля маркеров\n: как для всей диаграммы, так и для отдельной серии.\nДоступ к файлу, загруженному в Систему, предоставляется при выполнении одного из следующих условий:\nпользователь является автором файла;\nпользователь обладает правом на \"Чтение\" объекта Системы, с которым связан файл.\nДля возможности просмотра\nвсех файлов\nв Системе реализовано новое\nразрешение\n.\nТеперь в\nконфигурационном файле приложения\nможно явно задать версию используемого хранилища Vault.\nВ\nконфигурацию приложения\nдобавлены параметры для управления сервисами транскрибации и суммаризации.\nРеализована поддержка отображения и интерактивного заполнения чекбоксов в документе, сформированном по шаблону, и при его экспорте.\nКонтактные данные в профиле стали интерактивными: теперь при нажатии на e-mail или телефон открывается соответствующее приложение, кроме того добавлены кнопки для копирования данных в буфер обмена.\nИзменения и улучшения\nНа стартовой странице скорректирована ссылка для перехода на страницу платформы GreenData в социальной сети\nВКонтакте\n.\nПереработаны сообщения об ошибках для случаев, когда устанавливаемый тип объекта уже существует на стенде.\nБлокировка атрибута, настроенная через права доступа, теперь корректно применяется и сохраняется при попытке изменить значение атрибута через событие\nonChanged\n.\nНалажена работа с multiselect-атрибутами примитивного объекта в алгоритмах.\nУнифицировано хранение описания для всех задач:\nатрибут \"Описание\" [SYS_TASK_NOTE] исключен из типа объекта \"Пользовательская задача\" [SYS_USER_TASK];\nатрибут \"Описание задачи\" [TASK_DESCRIPTION] перемещен из типа \"ДО. Задача на процессе\" [WF_PROCESS_TASK] в родительский тип объекта \"Задача\" [SYS_TASK].\nСтабилизировано создание экземпляров в дочернем атрибуте без необходимости сохранения родительского объекта.\nСкорректирована логика работы при\nудалении взаимосвязанных объектов\nс опцией \"Заменить на\".\nВ карточке еще несохраненного объекта теперь доступен выбор папки для сохранения.\nСтабилизирована работа с singleselect-атрибутами при наличии двусторонней связи.\nВ ранее настроенных\nавтокалькуляциях\nвосстановлены значения настройки \"Атрибут для сохранения значения\" и доработала логика выбора данного значения.\nСтабилизирована возможность копирования экземпляра иерархического списка.\nОтлажена возможность предзаполнения полей в новом несохраненном объекте посредством алгоритма с использованием функции\nattrByVar\nдля атрибута\nпримитивного типа\n.\nДля корректной установки обновлений, связанных с экземпляром типа \"Сотрудник\" [SYS_EMP], добавлены объекты \"Шаблон текстового сообщения для типа Сотрудник\" и \"Настройка получения разрешенных уведомлений (Сотрудник)\".\nСкорректирована локализация атрибута \"Блокировка пользователя\" типа \"Пользователь\".\nДоработана логика выбора объектов справочника в качестве параметров  алгоритма.\nСтабилизирована работа горячих клавиш.\nДоработана возможность создания\nдвусторонней связи\nна атрибутах.\nВ легком реестре отлажена фильтрация по логическому и объектному атрибутам в группе фильтров.\nНалажено сохранение настроек\nпоисковых фильтров\nв пользовательском реестре.\nПри добавлении колонок в реестр отлажена работа опции \"Выбрать все\" при выделении отфильтрованных элементов.\nСтабилизированы сортировка и фильтрация в реестрах.\nОтлажено открытие реестра с расширенными поисковыми фильтрами при наличии на выбранном визуале атрибута с алгоритмом предупреждения.\nВ\nплиточном реестре\nстабилизирована работа навигации.\nОтлажен запуск действия при переопределенном клике в плиточном реестре.\nСкорректирован URL при использовании расширенного и строкового фильтров в реестре.\nНалажено отображение экземпляров\nобъектного multiselect-атрибута\nпри заполненной настройке \"Поле, по которому выводится наименование атрибута\".\nОптимизирована загрузка плиточного реестра, встроенного в объект с большим набором данных.\nДля атрибута типа \"Файл\" с визуалом\n\"Множественные файлы в виде таблицы\"\nтеперь можно закрепить необходимый для отображения реестр.\nУскорена загрузка визуала.\nНалажено применение и сохранение собственных\nшаблонов для визуала\n.\nОтлажено обновление данных атрибутов карточки задачи, вынесенного на визуал с помощью\nфрейма\n.\nСтабилизирована работа опции \"Открыть в новом окне\" для дочернего атрибута.\nТеперь ширина\nгруппы вкладок\nсохраняется стабильной при выравнивании по центру.\nВосстановлена работа отфильтрованных выпадающих списков с папками.\nДля примитивного объекта отлажено обновление значений атрибутов во фрейме.\nИсправлена работа ограничения по типу динамики для атрибута типа \"Дата\" с визуалом\n\"Календарное измерение с иерархией, с ограничением типа динамики по другому объекту\"\n.\nОтлажено отображение виджета\n\"Чат по объекту\"\nповерх открывшегося модального окна.\nОтлажена возможность изменения цвета элементов в навигационной панели.\nСтабилизировано завершение задачи с размещенным на ней виджетом\n\"Финансовая отчетность\"\n.\nОтлажена выдача прав на выполнение вложенных подпроцессов в рамках основного бизнес-процесса.\nВ представлении OLAP реализовано отображение измерений в алфавитном порядке.\nСтабилизировано открытие объектов из канбан-доски с их последующим закрытием.\nДля стабильности настройки скопированного дашборда в\nисточниках данных на основе SQL\nдоработана поддержка кириллицы в псевдонимах столбцов.\nДля аналитической панели \"Таблица с индикаторами\" стабилизировано отображение и добавлена возможность настройки расшифровок Drill Down.\nВ аналитической панели\n\"Таблица\"\nналажена работа алгоритма условного форматирования.\nОптимизирована работа\nобъектного источника данных\nпри большом количестве полей.\nОтлажена работа редактора алгоритмов при использовании ключевых слов в наименованиях переменных.\nВосстановлена корректная работа алгоритмов после установки обновления этих алгоритмов.\nНалажено открытие вложенного алгоритма фильтрации при нажатии на кнопку\nAlt\n.\nСкорректирована подсказка для функции\ndeduplicate\n.\nСтабилизирована работа функции\nattrByVar\n.\nОтлажена работа фильтра в модальном окне при вызове функции\nform\n.\nСтабилизировано применение классификации файлов, загружаемых при помощи действия с модулем пользовательского интерфейса\n\"Добавить файлы в атрибут\"\n.\nСкорректировано отображение выпадающего списка для\nпользовательского действия\nтипа \"Папка\".\nДобавлена проверка заполнения всех обязательных полей объекта при его сохранении с помощью пользовательского действия.\nОтлажен процесс настройки действия\n\"Удалить дубль объекта\"\n.\nОптимизирована работа\nдерева условий\n.\nОтлажено отображение дерева условий при сворачивании условия.\nДобавлена возможность сравнения кода текущего пользователя со справочным значением при работе с деревом условий.\nДля атрибута\n\"Прикрепленные файлы\"\nотлажена работа алгоритма фильтрации классификаций.\nНалажена возможность прикрепления файлов к примитивным объектам.\nСкорректирован набор проверки прав при\nвыполнении ETL по файлам\n.\nЗамена адреса электронной почты и номера телефона сотрудника теперь доступна только при наличии прав на \"Запись\" объекта.\nНалажен перенос визуала при помощи обновления.\nСтабилизирован перенос объектов при наличии singleselect-атрибутов с двусторонней связью.\nОтлажен перенос\nзагрузчика xls-файлов\nпосредством обновлений.\nОптимизирована работа аудита.\nВ\nаудите изменений\nналажена фиксация комментария к атрибуту.\nИсправлено отображение старых и новых значений атрибутов в дашборде аудита изменений.\nСтабилизирована возможность просмотра аудита при активной\nкоммуникационной панели\n.\nПри восстановлении пароля по e-mail налажено соответствие требованиям действующей парольной политики.\nДоработано решение, позволившее оптимизировать загрузку страниц приложения на модели\nSaaS\n.\nСтабилизированы выбор даты и загрузка отчетности в\nмастере консолидации\nпри нестабильном или медленном соединении.\nОтлажена работа с чужими комментариями в документе.\nСтабилизировано отображение текста документа при наличии скрытых таблиц и таблиц со скрытым содержимым.\nВ истории документа, сформированного по шаблону, налажено скачивание выбранной версии.\nТеперь работа с правками недоступна в режиме сравнения версий.\nОптимизирована работа с элементами опросного листа с учетом алгоритмов видимости.\nОтлажено отображение элементов опросного листа и введенных значений.\nВ режиме сравнения версий документа налажено обновление значений из источника данных.\nДобавлена возможность отключения фильтрации в опросном листе после перехода в режим сравнения версий.\nДля источника со значением формата \"Число с разделителем\" отлажена подсветка значения в опросном листе.\nВ документе, сформированном по шаблону, отлажено добавление изображений из текстового атрибута со сложным форматированием.\nОтлажено применение условного форматирования в документе формата Excel.\nСтабилизирован процесс выгрузки печатной формы при включённой настройке прикрепления результирующего файла к объекту.\nДоработана возможность перехода в режим рецензирования и скачивания файла, сформированного при помощи пользовательского действия.\nСтабилизирована загрузка версии из файла.\nОтлажено применение начертания жирности для нумерованных списков загруженной версии из файла.\nИсправлено отображение названия чата с пользователем \"Администратор\".\nПоявился удобный способ сохранять важные сообщения, файлы и заметки в диалоге с самим собой через специальный чат \"Избранное\".\nСкорректировано отображение наименования встречи при повторном подключении к ней организатора.\nОтлажено использование камеры и микрофона, выбранных при подключении к\nвстрече\n.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:lts.473.7\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.473.7.war\nhttps://downloads.greendatasoft.ru/LTS/lts.473.7.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.473.7-latest.html"
}