{
  "title": "Recommendations for debugging algorithms",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRecommendations for debugging algorithms\nCreating algorithms is regularly accompanied by cases where the program code and the result of its execution are questionable and involve testing, checking, and debugging. Therefore, GreenData has built-in tools for\ndebugging\nalgorithms listed later in this article.\nDebugging recommendations\nBefore using these tools, some basic organizational recommendations should be considered.\n1.\nUse the built-in debugging tools\n.\nThe built-in tools of the algorithm editor can be used to execute the algorithm line by line. Algorithm execution can be stopped (interrupted) by the user.\n2.\nThe algorithm must be compiled\n.\nThe system allows saving the uncompiled code of an algorithm, but the algorithm is executed only after its compilation.\nDo not try to save defective code of an algorithm containing obvious syntax errors. If the algorithm contains an incorrect (underwritten, incomplete) language construction, it is better to save this algorithm while commenting the problematic code section.\n3.\nUse single-line comments\n.\nUse single-line comments to:\nadd an author’s note above the following function with a non-obvious operator;\nadd an author’s note (on the right) on the line of the current operator;\ncomment the problematic operator or the uncompleted expression.\nExamples of single-line comments.\n4.\nUse multi-line comments\n.\nUse multiline comments for:\nadding a detailed textual explanation;\ncommenting several lines/problematic operators of the algorithm.\nExamples of multi-line comments.\nDebugging tools\n1.\nsendPopUpMsg\n(for more details refer to the\nsendPopUpMsg\narticle)\ntriggers a non-modal notification pop-up window;\nis used to diagnose the triggering of algorithm branches;\ndesigned to display scalar values (strings, numbers…​);\nsendPopUpMsg cannot display data structures (arrays, ArrayList, HashSet, HashMap, etc.).\nExamples of SendPopUpMsg.\n2.\nprintout\n(for more details refer to the\nData structures\n)\nis used to diagnose the triggering of an algorithm;\nsupports displaying\nscalar\nvalues and\ndata structures\n;\nprintout examples.\n3.\nwriteWfLog\nis used for complex logging situations of business process algorithms;\ndoes not display data, but saves them to the special table (wf_trace_log).\nConclusions\nThe technique of debugging problem algorithms involves:\nframing the problematic code sections with comments;\nUse of the universal printout function to monitor the variable values in the algorithm’s log;\nmodifying and changing the program code taking into account the monitoring data;\ngradual reduction of the commented operators.\nAlthough the described technique allows to diagnose and debug almost any algorithm, in debugging practice it will be useful to\nsendPopUpMsg\nto temporarily notify the user about the triggering of critical operators and branches of the algorithm.",
  "source": "https://docs.greendata.ru/platform/en/recommendations-for-debugging-algorithms.html"
}