{
  "title": "Кастомизация мобильного приложения",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nКастомизация мобильного приложения\nВнешний вид и функционал\nмобильного приложения\nмогут быть адаптированы под задачи бизнеса и потребности пользователей за счет гибкой настройки различных элементов:\nнастройка\nстраницы авторизации\nпредоставит возможность кастомизировать дизайн, определить способы входа и доступные действия в соответствии со стандартами безопасности (возможность\nрегистрации и восстановления пароля\nпользователя);\nизменение\nтемы оформления\nпозволит задать корпоративные цвета в соответствии брендбуком компании;\nнастройка\nглавной страницы приложения\nпредоставит возможность персонализировать страницу под конкретные бизнес-задачи или ролевую модель пользователя;\nопределение\nсостава и последовательности пунктов меню\nсформирует структуру меню мобильного приложения.\nИнтерфейс и функциональность мобильного приложения определяются настройками подключаемого приложения платформы (далее — стенд).\nИзменения, произведенные на стенде, отобразятся в мобильном приложении только после повторной авторизации на стенде.\nСтраница входа\nВместо стандартной страницы входа мобильного приложения можно использовать стартовую страницу стенда, адаптированную под мобильное устройство.\nКастомизация страницы входа, в том числе предоставление возможности самостоятельной регистрации и восстановления пароля реализуется через\nконструктор страницы входа\n.\nДля настройки стартовой страницы мобильного приложения потребуется:\nОткрыть\nконструктор страницы входа\n, последовательно выбрав в\nменю профиля пользователя\n: \"Управление приложением\" → \"Конструктор страницы входа\".\nНастройка страницы входа возможна при наличии\nправ доступа\nк соответствующему пункту\nменю профиля пользователя\n.\nНастроить внешний вид и функциональность страницы входа с учётом того, что в мобильном приложении не поддерживаются настройки:\nраздела \"Положение на странице\";\nраздела  \"Внешние провайдеры идентификации\";\nраздела \"Пользовательский шаблон\";\nдля самостоятельной регистрации по sms.\nВ разделе \"Мобильное приложение\" активировать переключатель \"Применить настройки в мобильном приложении\".\nСохранить настройки.\nТема оформления\nЦветовая схема мобильного приложения по умолчанию задается системной темой оформления \"Mobile Material\", которая может быть заменена на пользовательскую.\nИзменение и установка темы оформления осуществляется на стенде, где в\nменю профиля пользователя\nнеобходимо последовательно выбрать: \"Управление приложением\" → \"Настройки оформления\".\nНастройка темы оформления возможна при наличии\nправ доступа\nк соответствующему пункту\nменю профиля пользователя\n.\nТемы мобильного приложения размещаются в одноименном блоке, подробнее про настройку темы описано в статье\n\"Конструктор тем\"\n.\nДля выбора темы оформления мобильного приложения, которая будет отображаться для всех пользователей, необходимо установить соответствующую отметку:\nПри отсутствии\nправа доступа\nна \"Чтение\" установленной по умолчанию пользовательской темы пользователю будет отображена системная тема \"Mobile Material\".\nПраво выбора между светлой и темной темой предоставляется пользователю в настройках мобильного приложения в разделе \"Оформление\".\nГлавная страница\nНа главной странице можно настроить:\nсодержимое стартовой страницы;\nрасположение меню\n;\nпанель инструментов\n.\nСодержимое стартовой страницы\nВ настройках мобильного приложения пользователь может выбрать, что отображать на главном экране: стартовую страницу или чаты.\nВ iOS и Android-версиях мобильного приложения наименование настроек может отличаться.\nПо умолчанию отображается стартовая страница, которую пользователь может персонализировать, перейдя в настройки в нижней части стартовой страницы  и определив  необходимые для отображения разделы при помощи переключателей.\nНа стенде имеется возможность настроить и установить фиксированные страницы для отдельных субъектов безопасности (пользователей или групп доступа). Например, клиентам, использующим мобильное приложение, отображать на стартовой странице каталог товаров, а менеджерам — реестр заказов.\nДля этого необходимо:\nСоздать/настроить\nстартовую страницу\nс учетом\nрекомендаций по настройке отображения объектов системы в мобильном приложении\n.\nНа вкладке \"Настройки\" панели элементов активировать переключатель \"Использовать в мобильном приложении\".\nВыдать права доступа необходимым субъектам безопасности на просмотр страницы, подробнее с примерами выдачи прав стартовой страницы можно ознакомиться в\nстатье\n.\nРасположение меню\nПо умолчанию вид меню в мобильном приложении устанавливается в соответствии с\nсистемной настройкой \"Расположение меню в мобильном приложении\"\n.\nПользователь может изменить расположение меню в настройках мобильного приложения в разделе \"Вид меню\":\n\"Меню по кнопке бутерброд\" представляет собой кнопку открытия меню, расположенную в левом верхнем углу стартовой страницы;\n\"Быстрое меню внизу экрана\" — статичный вид меню, расположенный в нижней части экрана на всех страницах приложения.\nДанное меню включает до пяти кнопок:\nпервая — для перехода на стартовую страницу;\nвторая, третья и четвертая кнопки — слева направо в заданном порядке из перечня пунктов меню перемещаются первые три настроенные\nпункта меню\n;\nпоследняя — для открытия меню.\nПанель инструментов\nКнопки, размещенные в хедере стартовой страницы, а также их порядок определяются в блоке\nсистемных настроек мобильного приложения\n\"Настройка панели инструментов стартовой страницы\".\nВ панель инструментов можно добавить не более трех кнопок.\nПункты меню\nОдним из аспектов персонализации мобильного приложения является возможность настройки содержимого меню. Например, можно добавить пункты по работе с бизнес-процессами по оформлению отпуска, командировкам, согласованию документов и т.д.\nРасположение кнопки для открытия меню может быть определено по умолчанию в настройках стенда или настроено пользователем в мобильном приложении, подробнее описано\nранее\n.\nСистемные\nПо умолчанию меню мобильного приложения включает пункты:\n\"Задачи\"\n,\n\"Дашборды\"\n,\n\"Чаты\"\nи\n\"Контакты\"\n— для открытия страницы с соответствующим содержимым;\nДанные пункты нельзя удалить, но можно скрыть их отображение для конкретных субъектов безопасности.\nДля этого на стенде необходимо:\nПоследовательно выбрать пункты меню \"Администрирование\" → \"Управление доступом\" → \"\nДоступ к объектам системы\n\".\nВ поле \"Тип объекта\" выбрать \"Меню мобильного приложения\".\nВ отобразившемся реестре выбрать пункт меню, который необходимо скрыть.\nЗабрать права на \"Чтение\" у необходимого субъекта безопасности.\nСохранить внесенные изменения по кнопке\n.\n\"Настройки\"\n— пункт меню, через который осуществляются пользовательские настройки;\nДанный пункт меню не может быть скрыт или удален.\nВ пункте меню \"Настройки\" содержится настройка \"Отправить лог работы\", посредством которого предоставляется возможность отправки файла с логом работы мобильного приложения в формате *.txt;\nВидимость данной настройки регулируется\nсистемной настройкой мобильного приложения \"Доступна отправка логов\"\n.\n\"Перейти в браузер\"\n— ссылка на стенд, используемый при\nподключении\n;\nВидимость пункта регулируется\nсистемной настройкой мобильного приложения \"Доступен переход в браузер\"\n.\n\"Выход\"\n— выход из аккаунта пользователя.\nДанный пункт меню не может быть скрыт или удален.\nПользовательские\nДля добавления нового пункта меню мобильного приложения необходимо:\nОткрыть реестр типа \"Меню мобильного приложения\", для быстрого перехода к которому можно последовательно выбрать\nпункты главного меню\n: \"Администрирование\" → \"Настройки\" → \"Настройка мобильного меню\".\nСоздать экземпляр, указав тип создаваемого пункта меню:\nобъект – для открытия карточки\nобъекта\n;\nреестр – для открытия\nреестра типа\n;\nВизуал объекта, открываемого из реестра, регулируется\nнастройкой реестра\n\"Визуал объекта при открытии\".\nзадачи –  для открытия списка задач пользователя;\nВизуал открытия задачи определяется в\nнастройках этапа\n.\nвнешняя ссылка – открытие внешней ссылки в браузере мобильного устройства.\nУказать параметры создаваемого пункта меню:\nПараметр\nНазначение\nНаименование\nНаименование пункта меню в мобильном приложении.\nИдентификатор\nИдентификатор для распознавания объекта в Системе.\nПорядок\nОпределяет очередность расположения пункта в меню.\nПорядок системных объектов нельзя изменить.\nИконка\nИконка, которая будет расположена рядом с пунктом меню.\nВыбор иконки осуществляется из выпадающего списка.\nРазвернут по умолчанию\nПараметр не поддерживается в мобильной версии приложения.\nРодительский пункт меню\nПараметр не поддерживается в мобильной версии приложения.\nАлгоритм определения объекта\nВыбор алгоритма для определения объекта, который будет открыт по нажатию на пункт меню.\nВыбор ранее созданного\nалгоритма\nосуществляется из выпадающего списка, создание нового или редактирование выбранного доступно через меню действий параметра.\nПараметр отображается при настройке пункта меню мобильного приложения типа \"Объект\".\nАлгоритм определения визуала объекта (опционально)\nВыбор алгоритма для определения визуала объекта, который будет открыт по нажатию на пункт меню.\nВыбор ранее созданного\nалгоритма\nосуществляется из выпадающего списка, создание нового или редактирование выбранного доступно через меню действий параметра.\nЕсли визуал объекта не указан, то с учетом наличия прав доступа отображается первый по порядку визуал объекта с активной настройкой \"Использовать в мобильном приложении\".\nРекомендации по настройке визуала объекта для отображения в мобильном приложении представлены в\nстатье\n.\nПараметр отображается при настройке пункта меню  мобильного приложения типа \"Объект\".\nТип объекта для отображения\nВыбор типа объекта, реестр которого необходимо открыть по нажатию на пункт меню.\nПри настройке пункта меню типа \"Задачи\" для выбора доступен тип объекта \"ДО. Задача на процессе\" и его дочерние типы.\nПараметр отображается при настройке пункта меню мобильного приложения типа \"Реестр\"/\"Задачи\".\nРеестр\nВыбор реестра, который необходимо открыть по нажатию на пункт меню.\nДля отображения пункта меню типа \"Реестр\" доступны только реестры вида \"Плоский реестр\", \"Легкий реестр\" или \"Плиточный реестр\".\nЕсли параметр не указан, тогда отображается реестр, используемый по умолчанию.\nПараметр отображается при настройке пункта меню  мобильного приложения типа \"Реестр\"/\"Задачи\".\nСсылка\nСсылка для перехода на внешний ресурс, по нажатию на которую будет открыт браузер (стороннее приложении) на мобильном устройстве.\nПараметр отображается при настройке пункта меню мобильного приложения типа \"Внешняя ссылка\".\nСохранить настройки нажатием на кнопку\nв панели управления.\nПорядок пунктов меню\nВ зависимости от важности и предпочтений последовательность добавленных пунктов меню может быть изменена в реестре типа \"Меню мобильного приложения\" при помощи кнопок\n.\nПорядок системных объектов изменить нельзя.\nВ мобильном приложении не поддерживается иерархия, видимость пунктов меню необходимо настраивать в плоском виде.",
  "source": "https://docs.greendata.ru/platform/ru/customizing_mobile_app.html"
}