{
  "title": "Конструктор тем",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nКонструктор тем\nКонструктор тем позволяет пользователю самостоятельно настроить цветовое оформление интерфейса Системы в мобильной и web-версии приложения.\nНастройка\nДля перехода к настройкам тем оформления необходимо в\nменю профиля пользователя\nпоследовательно выбрать пункты: Управление приложением → Настройки оформления.\nНа открывшейся странице представлены три блока:\nТема оформления – набор системных тем оформления.\nПо умолчанию используется системная тема \"Материал\".\nПользовательские темы – темы оформления, созданные пользователями приложения.\nТемы мобильного приложения – темы оформления, используемые в\nмобильном приложении GreenData\n.\nПо умолчанию используется системная тема \"Mobile Material\".\nПри наведении курсора мыши на тему оформления в ховере доступны опции копирования\n, редактирования\nи удаления\nтемы.\nДля системных тем оформления доступна только возможность копирования темы.\nСкопированная тема для web-версии приложения будет размещена в блоке пользовательских тем, после чего она может быть отредактирована.\nИзменение параметров настройки темы оформления доступно пользователю в том случае, если он обладает\nправом\nна \"Запись\" соответствующего экземпляра темы оформления. В противном случае редактирование темы оформления будет недоступно.\nПросмотр и редактирование параметров настройки темы оформления осуществляется через конструктор тем, доступный по нажатию на иконку\nв ховере темы.\nВ приложении имеется возможность использования темы оформления из другого приложения. Для этого необходимо\nустановить файл\nв формате\n*.guf\n.\nНастройка темы для web-версии приложения\nВ конструкторе тем представлен обширный набор параметров, посредством которых настраивается цветовое оформление элементов интерфейса Системы:\nприложение\n;\nкнопки\n;\nчекбоксы\n;\nнавигационная панель\n;\nглавное меню\n;\nполе поиска меню\n;\nформы\n;\nреестры\n;\nкарточка\n.\nВ первую очередь рекомендуется указать название темы, впоследствии при необходимости оно может быть отредактировано.\nОтображение всех текстовых элементов интерфейса Системы настраивается в конструкторе тем при помощи набора следующих параметров:\nПараметр\nНазначение\nШрифт\nВыбор шрифта текста из выпадающего списка.\nПо умолчанию используется шрифт \"Clear Sans\".\nРазмер\nВыбор значения для определения размера (кегля) шрифта из выпадающего списка.\nПо умолчанию установлен 14 кегль.\nНачертание шрифта\nВыбор представления внешнего вида шрифта. Используемые начертания:\n— жирность;\n— курсив.\nИзменение цвета элементов интерфейса Системы осуществляется нажатием на поле цвета\n, расположенное\nрядом с настраиваемым параметром. В результате чего откроется color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA, HEX, HSVA.\nПриложение\nПараметр\nНазначение\nЦвет текста\nОпределение цвета текста для следующих элементов:\nосновного текста карточек объектов;\nплоских реестров;\nатрибутов в виде ссылок.\nПри использовании параметра цвет устанавливается посредством открывшегося color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA, HEX, HSVA.\nЛоготип страницы загрузки\nВыбор изображения для логотипа страницы загрузки.\nЗагрузка изображения доступна при нажатии на кнопку \"Загрузить изображение или гиф\". После загрузки вместо данной кнопки отображается выбранное изображение.\nПри наведении курсора мыши на загруженное изображение отобразится ховер с иконками\nдля удаления и замены изображения.\nВ качестве логотипа страницы может быть использован файл в формате jpg, png или gif. При загрузке изображения в неподдерживаемом формате Система отобразит вместо загруженного изображения элемент\n.\nРазмер изображения не должен превышать 1 МБ. Иначе Система уведомит об ошибке:\nВ\nSaaS окружении\nпри использовании\nлицензии\nCommunity Edition\nзамена логотипа  страницы загрузки недоступна.\nФавикон\nВыбор изображения для иконки, которая располагается перед названием страницы во вкладке браузера.\nЗагрузка изображения доступна при нажатии на кнопку \"Загрузить изображение или гиф\". После загрузки вместо данной кнопки отображается выбранное изображение.\nПри наведении курсора мыши на загруженное изображение отобразится ховер с иконками\nдля удаления и замены изображения.\nВ\nSaaS окружении\nпри использовании\nлицензии\nCommunity Edition\nзамена фавикона недоступна.\nКнопки\nФорма углов кнопки задается в поле \"Скругление углов кнопок\". Доступные значения:\nXS\nS\nM\nL\nXL\nЧекбоксы\nНавигационная панель\nГлавное меню\nПараметр\nНазначение\nЛоготип\nВыбор изображения для отображения в главном меню.\nЗагрузка изображения доступна при нажатии на кнопку \"Загрузить изображение\". После загрузки вместо данной кнопки отображается выбранное изображение.\nПри наведении курсора мыши на загруженное изображение отобразится ховер с иконками\nдля удаления и замены изображения.\nЗагрузка логотипа допустима в формате jpg и png.\nПри загрузке изображения в неподдерживаемом формате Система отобразит вместо загруженного изображения элемент\n.\nРазмер изображения для логотипа не должен превышать 1 МБ.\nИначе Система уведомит об ошибке:\nВ\nSaaS окружении\nпри использовании\nлицензии\nCommunity Edition\nзамена логотипа недоступна.\nМасштабируемость, %\nПоле \"Масштабируемость, %\" позволяет менять масштаб логотипа (процент рассчитывается от оригинального размера картинки в пикселях) и может принимать значения от\n5\nдо\n300\n.\nПо умолчанию установлено значение масштаба 100%.\nДля логотипа предусмотрен блок размера\n316\nна\n43\nпикселей, поэтому края картинки большего размера обрезаются.\nВыравнивание\nПри помощи кнопок\nзагруженное изображение можно выровнять по:\nлевому краю;\nцентру;\nправому краю.\nПо умолчанию выравнивание установлено по левому краю.\nПоле поиска меню\nФормы\nРеестры\nКарточка\nПараметр \"Выпадающие списки/календарь/поиск в тулбаре\" влияет на отображение следующих элементов Системы:\nЭлемент Системы\nОтображение элемента\nВыпадающий список\nВыпадающий список выбора папки\nВыпадающий список объектов/типов объектов\nКалендарь для версионных атрибутов\nОкно поиска в карточке\nДля сохранения сформированного цветового решения (темы) необходимо нажать на кнопку\n.\nНастройка темы мобильного приложения\nПри настройке темы оформления\nмобильного приложения\nзадается цветовая палитра элементов приложения для светлой и темной тем.\nСоздание новой темы осуществляется по кнопке\nили при помощи опции копирования\n, доступной в ховере существующей темы, редактирование существующей пользовательской темы доступно при выборе опции\n.\nСистемная тема оформления может быть только скопирована.\nРедактирование пользовательской темы оформления доступно при наличии у пользователя\nправа\nна \"Запись\" соответствующего экземпляра темы оформления.\nВ\nконструкторе тем\n, расположенном в правой части рабочей области, указывается название пользовательской темы и определяется цветовая палитра для светлой и темной тем:\nосновной – главный контрастный цвет приложения, который используется для кнопок, бокового меню и шапки стартовой страницы;\nвторостепенный – цвет, используемый для кнопок-иконок, атрибутов, обводки и линий;\nтретичный – цвет ссылок внутри приложения;\nпредупреждения – цвет, который применяется для уведомлений типа «предупреждение» и как маркер предупреждения;\nошибки – цвет, используемый для оповещений об ошибках;\nфон – цвет фона карточек и реестров;\nтекст – цвет основного текста, реестров, заголовков в карточке и в шапке реестра.\nВыбор цвета осуществляется при помощи компонента color picker на палитре или посредством ввода кода цвета в форматах RGBA или HEX.\nДля сохранения внесенных правок в конструкторе тем необходимо нажать на кнопку \"Сохранить\".\nПри необходимости по кнопке \"Сбросить изменения\" можно отменить внесенные правки и вернуться к последней сохраненной версии.\nВыбор темы\nДля выбора темы оформления приложения по умолчанию необходимо установить соответствующую отметку.\nДля web-версии приложения у пользователя имеется возможность выбора темы оформления, отличной от заданной по умолчанию, при помощи нажатия на необходимую тему.\nВыбранная по умолчанию тема мобильного приложения будет отображаться для всех пользователей приложения. В случае отсутствия\nправа доступа\nна \"Чтение\" установленной по умолчанию пользовательской темы пользователю будет отображена системная тема \"Mobile Material\".",
  "source": "https://docs.greendata.ru/platform/ru/theme-designer.html"
}