{
  "title": "Route administration",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRoute administration\nAdministration of business process routes includes a set of actions to maintain the correct operation of current business processes with the possibility of changing and adjusting them.\nBusiness process route administration is available when\n\"View route objects\"\nand\n\"Route administration\"\npermissions are present.\nRoute administration involves working with the following functions:\nprocess rollback\n;\nskipping a stage\n;\ntask regeneration\n;\nclear all routes\n;\nbusiness process restart\n;\nOpening the related object\n.\nInformation about the user who performed a function is recorded in the System and is available in the audit mode ( see\n“Audit”\nfor more details).\nProcess rollback\nThe rollback function is designed to return to the specified stage. To roll back the business process, the user needs to go to\nviewing the business process map\nand click on the\nbutton next to the task name:\nSkipping a stage\nThe function is designed to skip the following stages:\nservice action\n, which failed with an error;\ntimer\n;\nsignal intermediate catch event\n;\nsummarizing parallel\ngateway\n;\nsummarizing inclusive\ngateway\n.\nTo skip a stage and resume the business process, the user needs to go to\nviewing the business process map\nand click on the\nbutton next to the task name:\nTask regeneration\nThe regeneration function is designed to automatically delete a selected task and create a new one.\nTask regeneration can be performed in two ways:\nwhen\nviewing the business process diagram\nby clicking the\nbutton next to the task name:\nin the\ntask registry\nusing the corresponding action in the\ncontrol panel\n:\nClear all routes\nThe function of clearing all routes is intended for deleting all running process instances and all tasks on them. To clear the routes, run the\nClear all routes\ncommand in the route object profile.\nBusiness process restart\nBusiness process restart can be specified using the\ncontinueTrace\nfunction. The business process restart function allows tracing the business process again after an error has occurred.\nOpening the related object\nThe \"Open related object\" button in the registry control panel is designed for quick navigation to the object related to the selected task.\nDepending on the task type, the following will be opened:\nroute object\n- when selecting a\nbusiness process task\n;\nobject\nthe relation\nto which is configured - when selecting a\nuser task\n.",
  "source": "https://docs.greendata.ru/platform/en/route-administration.html"
}