{
  "title": "Работа с алгоритмами ЖЦ",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nРабота с алгоритмами ЖЦ\nАлгоритмы жизненного цикла\n(далее ЖЦ) запускаются в момент сохранения и/или удаления объекта и могут быть привязаны к разным\nсобытиям\n:\nдо сохранения объекта;\nпосле сохранения объекта;\nперед удалением объекта.\nПри написании алгоритма ЖЦ необходимо учитывать некоторые особенности, обусловленные тем, к какому именно событию он будет привязан.\nЕсли алгоритм привязывается к событию\nдо сохранения\n, то он оперирует значениями атрибутов, которые были только что изменены при редактировании объекта. То есть будут использованы уже новые значения этих атрибутов, а не те, которые были сохранены в базе данных до момента редактирования.\nЕсли алгоритм ЖЦ используется в событии\nпосле сохранения\n, то в нём никак нельзя повлиять на текущий объект (например, изменить значения его атрибутов), так как его сохранение уже произошло.\nВызов функции \"\nsave\n\" для объекта, к событиям которого привязывается алгоритм ЖЦ, недопустим. Использование этой функции в алгоритме ЖЦ может привести к зацикливанию. Однако сохранение любых иных объектов с помощью этой функции в алгоритме ЖЦ не запрещено.\nПри настройке\nсобытия после сохранения\nпосредством функции алгоритма\nattrOldValue\nдля измененного значения имеется возможность получения предыдущего сохраненного значения в БД.\nПримеры\nПример № 1\nПредставленный алгоритм ЖЦ привязывается к событию\nдо сохранения\nобъекта и используется для подсчёта количества изменений контрольного показателя некоего технологического процесса (новое значение показателя всякий раз записывается оператором или системой в атрибут \"Контрольный показатель процесса\" объекта).\nПосле запуска технологического процесса оператор (система) меняет значение атрибута логического типа \"Процесс запущен\" на\ntrue\nи сохраняет объект.\nВ момент сохранения запускается алгоритм, в котором при помощи функции\niif\nпроверяется текущее значение этого атрибута.\nТак как проверка возвращает \"Истина\", то с помощью функции\nattr\n(в режиме \"установить значение\") значение атрибута \"счётчик\", которое изначально равнялось\n-1\n, устанавливается равным\n0\n.\nВ дальнейшем при любом изменении значения атрибута \"Контрольный показатель процесса\" и последующем сохранении объекта, значение атрибута \"счётчик\" будет увеличиваться на единицу.\nПроисходить это будет до тех пор, пока оператор (система) не остановит процесс и не поменяет значение атрибута \"Процесс запущен\" на\nfalse\n, в этом случае, после сохранения объекта значение атрибута \"Счётчик\" будет вновь установлено равным\n-1\n.\nПример № 2\nДопустим, необходимо настроить вывод уведомления при изменении цены после сохранения карточки товара.\nДля этого создается \"Событие после сохранения\" со следующим алгоритмом:\nОператор\nif\nсравнивает изменение значение поля \"Цена\", хранимое в БД (полученное функцией\nattrOldValue\n), и введенное на интерфейсе (полученное функцией\nattrNewValue\n).\nКогда значение отличается, посредством функции\nsendPopUpMsg\nосуществляется вывод уведомлений значений:\nкоторое было сохранено в БД (полученное функцией\nattrOldValue\n);\nкоторое сохранилось в БД после сохранения карточки (полученное функцией\nattrNewValue\n).\nВ результате после изменения цены и сохранения карточки объекта Система выведет уведомления о текущей и последней сохраненной цене товара:",
  "source": "https://docs.greendata.ru/platform/ru/working-with-life-cycle-algorithms.html"
}