{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.471.9 of November 18, 2025\nNew features\nThe ability to create user tasks outside of business process contexts was added: it is now possible to manually create a task and assign it to a specific assignee.\nThe button settings and the name of the modal window were updated when creating a new object.\nETL processes were stabilized and optimized: they now operate without a persistent technical connection to the database, which eliminates timeout issues and saves database resources.\nTo facilitate working with large volumes of data change information in the System, reports based on\naudit\ndata were configured.\nThe user data synchronization process was optimized: it is now possible to disable synchronization for each data provider individually via\nconfiguration file parameters\n.\nThe administrators can now manage permissions for actions of individual meeting participants.\nThe option to view connection parameters was added to the meeting window.\nA \"Raise hand\" feature was implemented, allowing users to signal the meeting organizer when they want to ask a question or speak.\nChanges and improvements\nThe display of the\nquestionnaire\ntitle upon first system login was adjusted.\nThe display of the success message upon data saving when creating an instance in a child attribute was debugged.\nA check for\nattribute settings\nconsistency was added: it is now impossible to create a mandatory attribute without specifying a default value for existing objects.\nThe process of creating instances in a\nprimitive object type\n(or child type) registry was stabilized.\nThe logic for changing the order of objects in a child attribute was improved.\nThe filtering of values for the object attribute with multiple selection was debugged.\nSubject area elements found via search are now highlighted in light blue instead of yellow.\nThe deletion of objects in the registry edit mode with multiple selection was debugged.\nThe display of the object filtering modal window in the registry was adjusted.\nThe opening of the specified object registry was stabilized when selecting an instance in an object attribute with the active \"Select object via pop-up window\"\noption\n, and the display of the selected value was debugged.\nThe display of the file signing indicator was debugged in a \"File\" type attribute with the\n\"File attachment visual for signing\"\nvisual.\nThe functionality of the styling algorithm for chained attribute values was restored.\nThe functionality of custom actions via the button placed on the visual using the frame was set up.\nThe functionality of expressions when making changes to an attribute in the tile registry, displayed on the visual through the frame, was debugged.\nThe functionality of the styling algorithm for tab names was restored.\nSaving the business process schema when adding/removing elements was stabilized.\nThe operation of the\n\"Table\"\ndashboard with pinned columns and configured grouping was stabilized.\nThe position of the checkbox for multiple object selection in the\n\"Table\"\nanalytical panel was adjusted.\nThe display of the selected value in the\n\"Control element\"\nanalytical panel was stabilized.\nData grouping by series was restored when building a\nstructural diagram\nwith the active \"More than one data series\" option.\nThe operation of a\nbatch action\nplaced on a\nprimitive object with a surrogate key\nvisual was debugged.\nAdding a new condition when configuring filtering based on a\ncondition tree\nwas debugged.\nThe ability to sign files in the\n\"Explorer\"\nwidget was debugged.\nWorking with signed files was stabilized.\nHTML layout is now preserved correctly when sending individual emails to each user, ensuring consistent email display for all recipients.\nAdding related objects to an\nupdate\nfile containing an algorithm was debugged.\nETL migration via GUF file was debugged.\nPassword masking during user migration using an\nupdate\nwas added.\nThe transfer of attributes using GUF files was stabilized.\nDisplaying a record for a failed object creation attempt was adjusted in the\naudit of actions\n.\nA vulnerability in light registry column names was eliminated.\nWorking with bookmarks in a document associated with multiple questionnaire elements was debugged.\nCollaborative work with numbered lists was stabilized.\nThe processing of numerical data and dates in document text was improved when comparing document versions.\nWorking with bookmarks in document version comparison mode was debugged.\nThe display of questionnaire element values was stabilized when updating values from a data source.\nExporting a document file from an object profile was debugged.\nWhen hiding a questionnaire item, all associated comments are now automatically deleted.\nThe display of comparison results between the document version and standard formulations was set up.\nThe performance was optimized when changing a text attribute with manual adjustments in the questionnaire.\nThe creation of a document version from a file with locks was debugged.\nThe document preview in *.docx format was stabilized.\nThe functionality of the visibility algorithms for elements in the document was debugged.\nThe display of links during document export in *.xlsx format was set up.\nWhen a user is blocked during a substitution period (vacation, sick leave), the system now also suspends sending push notifications to them.",
  "source": "https://docs.greendata.ru/platform/en/LTS.471.9-latest.html"
}