{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.446.3 от 04.02.2025\nНовые возможности\nБлагодаря новой возможности установки классификации по умолчанию упрощен процесс загрузки файлов через атрибуты с\nвизуалами для прикрепления файлов для подписания\n.\nВ связанных типах реализована поддержка\nавтокалькуляции\nдля подсчета количества объектов в атрибутах с настроенной\nдвусторонней связью\n.\nОптимизировано и сгруппировано\nменю профиля пользователя\n.\nРасширен\nперечень этапов\n, которые можно запустить далее по процессу в случае возникновения ошибки на данном этапе.\nВ системе появилось\n\"Составное хранилище\"\n, позволяющее организовать отказоустойчивое хранение файлов в хранилищах, расположенных в разных ЦОДах.\nПоявилась возможность формирования и установки обновления для пересчета эффективных прав по субъектам, для которых изменились права доступа.\nВ документах EDoc теперь можно определить действующую версию по соответствующему статусу.\nИзменения и улучшения\nДоработана логика работы признака\n\"Пересохранять родителя\"\nпри наличии настроенной в типе\nавтокалькуляции\n.\nОтлажен процесс установки\nдвусторонней связи\nмежду различными атрибутами одного типа объектов.\nДоработано отображение заблокированного атрибута при настроенном пользователем стиле оформления.\nСтабилизировано открытие карточек объектов, на визуале которых содержится\nвиджет \"Проводник\"\n.\nПоправлена локализация\nвиджета \"Текст\"\n.\nСтабилизирована работа с карточками объектов при одновременной работе на нескольких вкладках.\nДоработана логика предоставления права на видимость кнопки и открытие\nнастроек реестра\n.\nОптимизирован процесс настройки\nпользовательских кнопок\nпанели управления реестра.\nСтабилизирована работа с реестром при создании/изменении объектов в\nрежиме редактирования\n.\nОтлажено отображение границ плиточного реестра в дочернем объекте.\nСтабилизирован процесс удаления экземпляров анализа эффективных прав.\nПри дублировании объектов по ключу отлажено отображение соответствующих объектов в модальном окне ошибки валидации данных.\nДоработан процесс передачи данных несохраненного объекта в алгоритм, вызванный\nпо кнопке\nиз карточки данного объекта.\nВ алгоритмах отлажена возможность объявления\nHashMap\nпри помощи [:] и проверки элемента ассоциативного массива на null.\nДоработка функций\nnewVerEDoc\nи newVerEdocFromFile позволяет возвращать экземпляр типа \"Версия документа eDoc\".\nОтлажено выполнение переопределенного действия сохранения.\nДоработана возможность добавления действия с модулем пользовательского интерфейса \"Импорт данных по формам из Excel\" в\nпакетное действие\n.\nОтлажен процесс переноса\nобновлений\n, содержащих источник данных,\nдашборд\nс незаполненным источником данных,\nOLAP\n,\nETL\nили\nвиджет \"Таблица атрибутов\"\n.\nСтабилизирован процесс\nустановки обновлений\nпакетного GUF.\nОтлажена возможность использования\nсервиса DaData\n.\nРасширен список\nскрываемых конфиденциальных данных\nдля файла логирования.\nВ формах отчетности стабилизирована возможность прокрутки данных таблицы.\nСтабилизирована проверка электронной подписи на валидность.\nПри использовании с\nредактора документов eDoc\nотлажено соблюдение формата текста при его вставке или загрузке в документ и стабилизирована совместная работа с документом несколькими пользователями при добавлении переносов строк и разрывов страниц.\nВ модуле EDoc при сравнении версий стабилизировано отображение данных о пользователе, вносившим изменения, а также доработана возможность копирования изображения из документа eDoc с помощью горячих клавиш.\nВ модуле EDoc после формирования печатной формы и прикрепления файла к объекту стабилизировано отображение колонтитулов в документе и сохранение файла в указанном атрибуте.\nВ мобильном приложении GreenData стабилизировано получение push-уведомлений.\nВ GreenData Messenger доработан процесс изменения прав чата пользователя в реальном времени.\nСкорректирован атрибутивный состав и визуал объекта типа\n\"Объект ETL\"\n[SYS_ETL_OBJ].\nСкорректирован визуал объектов типа\n\"Хранилище файлов\"\n[FS_STORAGE].\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.446.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.446.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.446.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.446.3-latest.html"
}