{
  "title": "Source. External service",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSource. External service\nThe \"External service\" source type is used for:\nRequesting data from an external service;\nSending a request to an external service without further interaction.\nTo use this source, set up the\nETL schema\nby dragging the task element into the workspace from the actions and components panel.\nThen define the added stage as\nSource: External service\n:\nConfiguration parameters\nAccess the settings of the \"External service\" data source\nafter saving the ETL schema\nby clicking the stage icon:\nThis opens a new tab where settings are divided into three tabs:\n1. Basic settings\nSee the description of \"Basic settings\" settings.\nBasic settings are divided into three blocks:\nService type and address\n.\nAdditionally\n.\nResponse structure description\n.\nService type and address\nIn the \"Service type and address\" block, the following settings are specified:\nSetting\nPurpose\nRequest format\nDefining the request format for the external service.\nPossible values:\n• JSON;\n• MULTIPART;\n• Simple value;\n• SOAP;\n• XML.\nIf no value is specified, the system expects JSON by default.\nAnswer format\nDefining the answer format from the external service.\nPossible values:\n• Binary content - answer format where binary content is saved without preserving the name (it can be saved through response header processing), not recommended;\n• File - answer format where a dynamic structure is automatically created with two \"STRING\" nodes (content and name);\n• ignore - answer format where the source does not accept data from the external service;\n• JSON;\n• Text;\n• XML.\nIf no value is specified, the system expects JSON by default.\nHTTP Method\nDefining the HTTP method for interacting with the external service.\nPossible values:\n• DELETE - deletes data on the external service;\n• GET - retrieves data from the external service (parameters can be set dynamically in the\n\"Query parameter\"\ntab or directly in the \"URL\" field);\n• HEAD - requests headers identical to those retrieved by the GET method;\n• POST - retrieves data from the external service with the option to send a message (requires a request body);\n• PUT - modifies data on the external service.\nGET and POST are the most commonly used methods.\nURL\nLink to the external service.\nThe URL of the external service can include a static GET request parameter, for example:\nDynamic configuration of a substitution parameter is done in the\n\"Settings\"\ntab.\nProxy settings\nConfiguring proxy server data for the external service. The user can select from previously added settings using the dropdown menu. To add new settings, click the actions menu on the right side of the field and select \"Add\" from the context menu.\nUse automatic proxy settings\nDepending on the server where the application is installed, proxy settings may be determined automatically.\nAdditionally\nSetting\nPurpose\nResponse algorithm\nSelecting an algorithm for creating a user message. The field is set up for sending a message after ETL process interruption. Find more on\nalgorithms\nand\nmessage distribution\n.\nValidation algorithm\nSelecting a validation algorithm required to interrupt ETL for incorrectly received source data. Find more on\nalgorithms\n.\nResponse structure description\nAdding a response structure description from the external service in the \"WSDL/JSON\" field in XML or JSON format (as specified in the \"Response format\" parameter) is necessary for automatic generation of the source’s dynamic output structure (find more details in the \"Dynamic data structure (ETL)\" article).\nA dynamic structure can be manually created, but it’s not recommended for complex hierarchical schemes due to high labor costs.\nThe response structure added in the \"WSDL/JSON\" field can be obtained from the external service documentation.\nIf only the request format is provided, the response format can be acquired using API tools like SoapUI, Postman, Katalon Studio etc.\nFor example, in\nPostman\n, the user needs to:\nSelect the HTTP method;\nEnter the external service URL;\nIn the \"BODY\" tab, select raw and define the request format;\nAdd the request body;\nClick Send.\nThis generates a response structure that should be copied and pasted into the ETL \"WSDL/JSON\" response structure field in the specified response format.\nFor XML format responses from an\nexternal service\nsource, a root object must be defined.\nVerify recognized field types in the dynamic structure to prevent data retrieval errors.\nSpecial case for \"Source. External service\".\nBesides XML or JSON, a dynamic structure can be automatically generated with the \"File\" format if the \"WSDL/JSON\" field contains at least one character.\nThe structure will appear as follows:\n2. Query parameters\nView the \"Query parameters\" tab description.\nThis tab includes three sub-tabs:\n\"Parameters\"\n- to configure the request sent to the external service for data retrieval;\n\"Connection settings (optional)\"\n- for configuring authentication when accessing the external service;\n\"Manage connection\"\n- to configure the connection parameters to the external service.\nParameters\nTo send a request body, add the request text in the \"Request body\" parameter (in the previously specified\nformat\n). This is necessary for the following HTTP methods:\nPUT;\nPOST;\nDELETE.\nGET and HEAD methods do not send a request body.\nRequest body text is usually included in the external service documentation.\nTo add request headers, click the\nbutton in the \"Header parameters\" registry panel.\nIn the modal window, set the following parameters:\nSetting\nPurpose\nName\nEntering the header name.\nParameter value\nEntering the header value, which can be static or use a parameter identifier.\nPart of the request\nSelecting a part of the request from the dropdown list; parts must be pre-created (see\nrequest parts\n).\nUsed in MULTIPART requests.\nRequest parameters\nDepending on the external service, request parameters can be dynamically passed in the request body, header, or URL.\nFor example, in the screenshot below, the request body is parameterized using the \"CURRDATE\" identifier. When sending the request, the system will substitute this with the current date:\nTo add query parameters, click\non the \"Query parameters\" registry panel. When creating a parameter, specify:\nSetting\nPurpose\nName\nDefining the parameter name.\nType of parameter\nDefining the substitutional parameter location (where the system should look for the identifier). Possible options:\n• BODY - in the request body;\n• HEADER - in header parameters;\n• METHOD - in the method;\n• QUERY - for parameterizing GET values in the URL, using curly brackets for identifiers;\n• URL - for a placeholder parameter in the URL;\n•\nXSLT\n— in the XSLT transformation stylesheet;\n• File mask;\n• File path.\nIdentifier\nEntering the identifier name that the system uses to find and substitute the parameter value.\nAlgorithm\nSpecifying the parameter value that substitutes the query identifier. The algorithm returns a string. If it returns null, the identifier\nwill not\nbe replaced.\nHide value when writing to log\nEnabling hiding the parameter’s value in the log.\nThe option to disable hiding the parameter value in the log is controlled by the\nstrictAccessControlLevel\nparameter in the\nconfiguration file\n.\nEnabled by default.\nParameter setup for MULTIPART requests\nIf MULTIPART is selected in the\nRequest format\n, a composite request with multiple parts can be sent to the external service, allowing for different data types or file transfers.\nRequest parts are added to the corresponding object registry by clicking the\nbutton in the control panel and configuring the following settings in the modal window:\nSetting\nPurpose\nName\nDefining the parameter name.\nAlgorithm for getting the value\nReturning the request part body.\nPart headers\nAdding headers is similar to header parameters.\nConnection settings (optional)\nSpecify the SSL certificate in the \"SSL configuration\" field.\nSelect an SSL certificate from the dropdown list of previously added certificates or create a new one by selecting the \"Add\" option in the action menu on the right side of the field.\nTo add credentials, click the\nbutton on the control panel of the \"Authentication credentials\" embedded registry.\nDepending on the scope (credentials can be used for proxy server or final web server authentication), multiple hosts and/or ports may be added.\nSetting\nPurpose\nETL Stage\nSelecting an ETL stage for which the authentication setting will be used (current ETL stage).\nScope\nSecret host\nSelecting a secret variable containing the host address for authentication.\nSecret port\nSelecting a secret variable containing the port number for authentication.\nCredentials\nAuth method\nSelecting an authentication method. Possible values:\n• Basic - simplest scheme, where username and password are sent in an unencrypted header;\n•\nKerberos\n;\n•\nNTLM\n.\nSecret login\nSelecting a secret variable containing the user login.\nSecret password\nSelecting a secret variable containing the user password.\nSecret domain\nSelecting a secret variable containing the external service domain.\nThe parameter is used with NTLM authentication method.\nManage connection\nSetting\nPurpose\nFollow redirects\nFor security, this option is disabled by default — the system only requests the URL specified in the source settings (\"Main Settings\" tab), and an error will occur if the external service redirects to another service during ETL execution.\nIf the external service is trusted, set this parameter to \"Yes\" to allow redirects.\nUse Cookie Manager\nConsent to use the Cookie Manager.\nDefault option is active.\nRepetitions when an error occurs. Delay in seconds\nWait time for a response from the external service before resending the request, specified in seconds.\nRepetitions when an error occurs. Number of attempts\nEntering a numerical value defining the number of retry attempts to the external service.\n3. Resulting structure\nView the \"Resulting structure\" tab parameters description.\nThe resulting structure is a dynamic structure with possibility to process response headers from the external service.\nThis sub-tab includes the following settings for configuration:\nSetting\nPurpose\nFill in the missing items with empty values\nA Boolean attribute that fills missing elements in the dynamic structure response from the external service with empty values.\nIgnore namespaces\nUsed when parsing a dynamic XML structure; namespaces are ignored if this parameter is active.\nResponse title processing\nProcessing response titles by saving the received title to the attribute of the starting type, specified in the\nETL object\n.\nTo create an attribute to save the response from the external service, use the \"ETL. ETL object instance\" subtype as the starting type.\nCommonly used in authentication.\nXSLT conversion before processing the response\nUsed with XML responses from the external service when transformation via\nXSLT\nstylesheet is needed.\nThe \"Schema element output structure\" on this tab corresponds to the similar structure presented in the \"Basic parameters\" tab under\n\"Response structure description\"\n.\nStage setup\nA data source of the \"External service\" type has an extensive set of parameters, and its configuration depends on the task and the specifics of working with the external service.\nFor example, if the stage’s purpose is to send a request to an external service without receiving data, a minimal set of parameters may be used, including:\n\"URL\" - the address of the external service to send the request to (empty in this case);\n\"HTTP method\" - the parameter that tells the external service the request purpose;\n\"Response format\" - specifies the format of the response from the external service, set here as \"ignore.\"\nTypically, the \"External service\" source is used to retrieve data from an external service by sending a request and generating a dynamic data structure based on the received data.\nIn this case, the stage setup can be done as follows:\n1. Fill out the\nmain parameters\non the tab of the same name:\n1.1. specify the external service URL where data will be requested;\n1.2. define the HTTP method, with GET and POST being the most common (other options can be selected from the dropdown for specific tasks);\n1.3. select request and response formats, usually XML or JSON (other formats can be selected from the dropdowns if needed).\nWhen describing the response structure, the System will expect the specified response format. If the request and response formats are not set, the System defaults to JSON.\n2. In the\n\"Response structure description\"\nblock on the \"Basic parameters\" tab, a dynamic structure is created.\n3. According to the external service documentation and the HTTP method specified in step 1, dynamic request parameters may be required, transmitted in the request body, header, or URL. For example, in a request to retrieve legal entity data, the TIN could be such a parameter.\nThis step is done by creating request parameters and placing identifiers in the request body, header values, or the external service URL (\nsee details\n).\n4. If processing of the external service response header is needed, the received value is saved in the starting attribute of the\nETL object type\n. Configure this on the\n\"Resulting structure\"\ntab.\n5. Stage debugging - an essential step to check the stage configuration.\nAdditional settings\nSometimes, connecting to an external service requires additional settings, such as:\ndefining\nSSL certificate\nor\nproxy settings\nvalues;\nDepending on the server where the application is installed, proxy settings may be automatically defined.\nif the external service requires authentication, it can be configured using request parameters or special parameters on the\n\"Connection settings (Optional)\"\ntab;\nif the external service redirects to another service (redirect), causing an ETL error, the user can allow reconnection if he trusts the service on the\n\"Manage connection\"\ntab.",
  "source": "https://docs.greendata.ru/platform/en/source-external-service.html"
}