{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.455.2 от 04.04.2025\nНовые возможности\nПри создании\nбизнес-процесса\nтеперь доступна новая опция загрузки бесплатного шаблона процесса из\nмаркетплейса\n.\nТеперь  при создании\nстартовых страниц\nпользователи могут использовать готовые варианты, полученные из\nмаркетплейса\n.\nНовый функционал по добавлению\nтегов\nпозволит классифицировать объекты Системы, улучшить организацию данных и упростить процесс поиска объектов.\nВ\nвиджете \"Прикрепление файлов\"\nпоявилась возможность скачивания файла вместе с подписью.\nНовая функция\n\"currentControl\"\nпозволит получить значение атрибута, по которому вызывается алгоритм стилизации.\nПревышение лимита активных сессий одной учетной записи при парольной или доменной\nаутентификации\nтеперь сопровождается завершением старой активной сессии.\nНастройка политикой безопасности в системных настройках, работа с чужими данными в корзине, сброс кэша и управление монопольным режимом теперь осуществляются при наличии соответствующих\nразрешений\n.\nВ\nаудите действий\nпоявилась возможность фиксировать группы доступа пользователя на момент выполнения действия.\nВнедрен модуль анализа финансово-хозяйственной деятельности (АФХД) с продвинутыми механизмами загрузки данных по счетам и оборотно-сальдовым ведомостям.\nРеализована поддержка сносок.\nИзменения и улучшения\nУсовершенствован процесс добавления объектов на\nпредметную область\n.\nДоработан процесс удаления в корзину –  при наличии зависимых объектов выводится предупреждение об ошибке валидации.\nУдален тип объекта \"Модуль\" [SYS_MODULE].\nВ объекте типа \"ETL. Элемент схемы. Граничное событие. Ошибка\" добавлена возможность создания обрабатываемого исключения через атрибут.\nВ реестре улучшен формат отображения значения атрибутов с\nвизуалом \"Телефон пользователя\"\n.\nПри настройке\nвкладки\nстабилизирована возможность добавления алгоритма подсчета объектов.\nПри создании нового визуала объекта в\nпредметной области\nтеперь создается пустой визуал, а не\nнаследуемого типа объекта\n.\nПриведено к единообразию отображение кнопок закрытия модального окна в меню пользователя.\nСкорректировано отображение модального окна с предупреждением о несохраненных изменениях.\nПри вызове алгоритма через действие скорректировано наименование модального окна для заполнения параметров.\nДоработано отображение элементов на визуале объекта типа \"Элемента опросного листа\".\nСкорректировано модальное окно функции\ngetObject\n.\nВозможность перехода в\nсреду разработки виджетов\nтеперь может осуществляться из настроек виджета \"Навигационная панель\".\nОптимизированы настройки\nвиджета \"Финансовая отчетность\"\n.\nПри настройке\nаналитической панели \"Канбан-доска\"\nдобавлена возможность использования опции\nскрытия фона\nэлемента.\nСтабилизирована возможность просмотра источника данных для выбранного в реестре пользовательского отчета.\nОтлажен процесс копирования алгоритмов.\nСтабилизировано применение\nалгоритма визуализации\nи заполнения значений полей цепочечного атрибута.\nОтлажен процесс компиляции алгоритма при обработке массива идентификаторов атрибутов в функции\nattrNewValue\n.\nРезультат выполнения функции\nloadByExcelTemplate\nпри возникновении ошибки разбора данных теперь включает сообщение об ошибке.\nОтлажена возможность получения значений атрибутов экземпляра посредством\nattrByVar\n, когда объект добавляется при помощи функции\nattr\nс признаком \"Получить объект целиком\".\nПри наличии ошибки валидации на каком-либо объекте стабилизировано применение действия\n\"Установка значения атрибута для нескольких объектов\"\nк остальным объектам.\nСтабилизирована работа действия\n\"Переопределение действия кнопки ОК в модальных окнах\"\n.\nСтабилизирована возможность установка обновлений с невалидным значением текстового/строкового атрибута, в результате чего будут скорректированы настройки данного атрибута.\nСтабилизировано формирование обновлений, содержащих виджеты и ETL-процессы.\nВ системных настройках отлажена работоспособность поля поиска.\nОптимизирована загрузка аудита действий за счет асинхронной записи об открытии реестра и объекта.\nДобавлена проверка существования keytab фaйла при настройке\nKerberos аутентификации\n.\nСтабилизирована процесс\nраспознавания отчетности\n.\nСтабилизировано отображение правок при замене текста посредством горячих клавиш в режиме рецензирования.\nСтабилизирована фильтрация комментариев при наличии параметров, значения которых рассчитываются алгоритмом по документу, сформированному по шаблону.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.455.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.455.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.455.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.455.2-latest.html"
}