{
  "title": "Мастер импорта данных отчетности",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nМастер импорта данных отчетности\nМастер импорта данных отчетности позволяет загружать информацию из структурированных файлов формата XLS.\nСтабильная работа мастера обеспечивается форматом документов MS Office Excel (XLS и XLSX). Применение альтернативных программных продуктов: LibreOffice Calc, iWork Numbers, Zoho Office Sheet, WPS Office Spreadsheets и пр., для подготовки и формирования XLS документов не допускается.\nИмпортируемые данные загружаются в атрибут \"Формы отчетности\"\n[RISK_FORM_INST_LIST\n] в экземпляр типа объекта.\nИмпортируются только те данные, формы отчетности которых уже размещены в системе\n(подробнее о\nнастройке формы отчетности\n).\nПервоначально импорт данных выполняется в режиме настройки, где\nформируется шаблон импорта\n. Сформованный шаблон может корректироваться при необходимости. Далее пользователь выполняет загрузку данных.\nИмпорт данных выполняется после создания отчета для его заполнения\n(подробнее о\nзаполнении формы отчетности\n)\nИмпорт данных по формам из Excel\nосуществляется пользователем, и может выполняться в следующих режимах\n:\nрежим настройки – настройка шаблона импорта отчетности в Системе;\nзагрузка с использованием шаблона;\nредактирование шаблона.\nРабота в режиме настройки выполняется для инициализации загружаемого файла. При этом ''\nформируются настройки шаблона импорта отчетности\n''. То есть пользователю необходимо связать поля загружаемого файла с настройками сформированной формы отчетности (подробнее о\nнастройке формы отчетности\n).\nРежим \"Загрузка с использованием шаблона\" предполагает импорт данных из файлов формата XLS посредством ранее настроенного шаблона.\nДля импорта данных\nнеобходимо:\n1. Открыть мастер импорта в режиме \"Загрузка с использованием шаблона\".\n2. Выбрать отчет для загрузки по кнопке\n. Система отобразит данные файла.\n3. Указать шаблон импорта отчетности из выпадающего списка.\n4. Нажать\nдля загрузки данных. Система отобразит результат выполненных действий.\nКнопка\nпозволит вернуться к работе с мастером импорта отчетных форм.\nВ случае возникновения ошибок, или дублирования данных, Система уведомит об этом:\nРежим \"Редактирования шаблона\" позволит отредактировать ранее сформированный шаблон импорта отчетности.\nИмпорт данных по формам из Excel\nявляется\nДействием\nв Системе (подробнее о\nпользовательских действиях\n). И может быть настроено соответственно. Пример аналогичной настройки –\nНастройка действия по копированию данных с объекта на объект",
  "source": "https://docs.greendata.ru/platform/ru/reporting-data-importer.html"
}