{
  "title": "Источник. Файл",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИсточник. Файл\nИсточник типа \"Файл\" применяется в случаях, когда в Систему необходимо:\nзагрузить файлы из какого-либо серверного каталога;\nосуществить пользовательскую загрузку файлов через интерфейс Системы (наиболее часто применяется для загрузки файлов формата Excel).\nВ\nSaaS окружении\nфункциональность источника типа \"Файл\" недоступна.\nДля загрузки в Систему данных из файла необходимо при настройке\nсхемы ETL-процесса\nс панели действий и компонентов перетащить (Drag&Drop) в рабочую область элемент задачи.\nПосле чего определить добавленный этап как\nИсточник. Файл\n:\nПараметры настройки\nПереход к настройкам источника данных типа \"Файл\" осуществляется\nпосле сохранения схемы ETL\nпри помощи нажатия на соответствующую иконку этапа:\nВ результате чего откроется страница, на которой представлена карточка с набором параметров для настройки источника данных:\nВ поле \"Наименование\" отображается наименование этапа ETL-схемы, которое при необходимости может быть изменено.\nВ поле \"Путь к каталогу\" указывается путь к репозиторию, в котором содержатся необходимые для загрузки файлы (указанная директория должна быть доступна для Системы).\nК указанной части пути добавляется префикс с базовой директорией, заданной в\nконфигурационном файле приложения\n.\nВ случае, когда из указанного каталога необходимо получить не все файлы, а только определенные, в поле \"Маска\" следует указать маску файла. Например, можно использовать загрузку по определенным типам файла, перечисляя маски: *.csv, *.xml.\nЕсли путь к каталогу не задан, предполагается, что файл будет загружен пользователем через настроенный интерфейс Системы.\nОстальные параметры настройки источника данных типа \"Файл\" распределены по трем вкладкам.\nПараметры источника\nНа\nвкладке \"Параметры источника\"\nуказываются:\nПараметр\nНазначение\nРасширение файла\nВыбор расширения используемого файла для распознавания данных Системой. Возможные значения:\n•\nCSV\n;\n• JSON;\n•\nXLS\n;\n•\nXML\n;\n• Бинарный файл;\n• Текстовый файл.\nВ зависимости от выбранного расширения файла могут быть отображены дополнительные параметры источника.\nЗаполнять отсутствующие элементы пустыми значениями\nЛогический атрибут, определяющий заполнение формируемых полей пустыми значениями.\nCSV\nЕсли загружаемый файл идентифицирован как файл\nс расширением CSV\n, могут быть настроены следующие правила получения данных из тела файла:\nПараметр\nНазначение\nЗаполнять отсутствующие элементы пустыми значениями\nПараметр настраивается при помощи выбора значений \"Да/Нет\" в раскрывающемся списке.\nЕсли выбрано значение \"Да\", при отсутствии данных в ячейке XLS-файла, атрибуту, соответствующему такой ячейке устанавливается значение\nnull\n.\nФайл содержит заголовки\nПараметр настраивается при помощи выбора значений \"Да/Нет\" в раскрывающемся списке.\nПри выборе значения \"Да\" для определения строки заголовка Система построчно будет искать соответствие с наименованиями атрибутов, указанных в динамической структуре. После определения строки заголовка Система сопоставит данные атрибутам по соответствующим столбцам. При наличии столбцов, не соответствующих наименованиям, указанным в динамической структуре, данные данных столбцов будут пропущены.\nПри выборе значения \"Нет\" запрос данных из файла будет осуществлен справа налево, начиная с первого поля.\nНомер первой строки с данными\nВвод числового значения для определения номера строки, с которой осуществится запрос данных из файла.\nНумерация строк используется сверху вниз, начиная с 0, например, ячейке A4 соответствует значение 3, ячейке A5 — 4, ячейке B5 — 4.\nПо умолчанию используется данные с 0 строки (ячейка A1).\nЭлемент динамической структуры с номером строки\nИспользуется для сопоставления элемента динамической структуры с номером строки, содержащей данные.\nПараметр настраивается после того, как динамическая структура сформирована.\nПеред выбором значения параметра рекомендуется обновить страницу для корректности отображения элементов динамической структуры, после чего посредством иерархии, доступной в виде выпадающего списка выбирается необходимый элемент динамической структуры.\nСимвол-разделитель (для CSV файлов)\nОпределение символа для разделения полей в строке CSV-файла.\nПо умолчанию используется символ \"запятая\".\nСимвол разделитель строк\nОпределение символа для разделения строк в CSV-файле.\nПо умолчанию используется символ \"запятая\".\nТранспонировать файл перед обработкой\nНастройка, при активном переключателе поля чекбокс которой осуществляется транспонирование (поворот) файла, в результате чего ориентация таблицы изменяется так, что строки становятся столбцами, а столбцы – строками, применяется для файлов без заголовков или с простыми заголовками.\nТранспонирование CSV-файла осуществляется относительно первого поля.\nXLS\nРаспознавание данных из файла с расширением XLS с целью дальнейшего разложения по динамической структуре настраивается при помощи набора параметров частично схожего с набором параметров при расширении CSV:\nПараметр\nНазначение\nЗаполнять отсутствующие элементы пустыми значениями\nПараметр настраивается при помощи выбора значений \"Да/Нет\" в раскрывающемся списке.\nЕсли выбрано значение \"Да\", при отсутствии данных в ячейке XLS-файла, атрибуту, соответствующему такой ячейке устанавливается значение\nnull\n.\nФайл содержит заголовки\nПараметр настраивается при помощи выбора значений \"Да/Нет\" в раскрывающемся списке.\nПри выборе значения \"Да\" для определения строки заголовка Система построчно будет искать соответствие с наименованиями атрибутов, указанных в динамической структуре. После определения строки заголовка Система сопоставит данные атрибутам по соответствующим столбцам. При наличии столбцов, не соответствующих наименованиям, указанным в динамической структуре, данные данных столбцов будут пропущены.\nПри выборе значения \"Нет\" запрос данных из файла будет осуществлен справа налево, начиная с ячейки A1.\nНомер первой строки с данными\nВвод числового значения для определения номера строки, с которой осуществится запрос данных из файла.\nНумерация строк используется сверху вниз, начиная с 0, например, ячейке A4 соответствует значение 3, ячейке A5 — 4, ячейке B5 — 4.\nПо умолчанию используется данные с 0 строки (ячейка A1).\nНомер первого столбца с данными\nВвод числового значения для определения номера столбца, с которого осуществляется запрос данных из файла.\nНумерация столбцов используется справа налево, начиная с 0, например, ячейке B1 соответствует значение 1, ячейке C1 — 2, ячейке C3 — 2.\nПо умолчанию используется данные с 0 строки (ячейка A1).\nЭлемент динамической структуры с номером строки\nИспользуется для сопоставления элемента динамической структуры с номером строки, содержащей данные.\nПараметр настраивается после того, как динамическая структура сформирована.\nПеред выбором значения параметра рекомендуется обновить страницу для корректности отображения элементов динамической структуры, после чего посредством иерархии, доступной в виде выпадающего списка выбирается необходимый элемент динамической структуры.\nЛисты книги для загрузки\nВвод числового значения номера листа или его наименования, либо диапазон значений для определения листов загрузки данных. Например, ввод значения 1-3, \"Лист4\", 6 соответствует листам с номерами 1, 2, 3, 6 и листу с наименованием Лист4.\nПо умолчанию данные загружаются только с 1 листа файла.\nЭлемент динамической структуры с названием листа\nИспользуется для сопоставления элемента динамической структуры с названием листа файла, содержащем данные.\nПараметр настраивается после того, как динамическая структура сформирована.\nПеред выбором значения параметра рекомендуется обновить страницу для корректности отображения элементов динамической структуры, после чего посредством иерархии, доступной в виде выпадающего списка выбирается необходимый элемент динамической структуры.\nПропускать пустые строки\nПараметр настраивается при помощи выбора значений \"Да/Нет\" в раскрывающемся списке. При выборе значения \"Да\" Система продолжит поиск данных до конца листа XLS-файла.\nПо умолчанию используется значение \"Нет\", при обнаружении пустой строки Система останавливает загрузку данных с текущего листа.\nТранспонировать файл перед обработкой\nНастройка, при активном переключателе поля чекбокс которой осуществляется транспонирование (поворот) файла, в результате чего ориентация таблицы изменяется так, что строки становятся столбцами, а столбцы – строками, применяется для файлов без заголовков или с простыми заголовками.\nТранспонирование листов файла осуществляется относительно ячейки A1.\nЗагружаемый Excel-файл преобразуется в плоскую динамическую структуру, в которой будет представлена коллекция объектов, полученная из данных разобранных строк (данные одной строки отождествляют отдельный объект Системы).\nДля корректной загрузки данных в Систему файл должен соответствовать некоторым ограничениям:\nДанные из файла, используемые для обновления или создания объектов в Системе должны быть представлены в виде таблицы и распределены по столбцам согласно атрибутивному составу объекта;\nРекомендуется использовать простые структуры данных, в частности, данные атрибутов типа multiselect или дочерний объект разбиваются на разные таблицы и помещаются на разные листы Excel-файла.\nXML\nТак как при создании файлов формата XML учитываются общепринятые синтаксические правила языка, при выборе данного расширения настройка источника файлов не предполагает каких-либо обширных дополнительных настроек.\nПри этом в карточке настройки отобразится только один дополнительный параметр.\nПараметр\nНазначение\nИгнорировать пространства имен\nОптимизирует работу Системы со структурами XML.\nПри выборе значения \"Да\" настройка позволяет считать идентичными структуры, в которых пространства имен представлены в различном виде.\nПо умолчанию данная настройка включена.\nОписание структуры\nНа вкладке \"Описание структуры\"\nдобавляется предполагаемая структура загружаемых данных, по которой Система автоматически сгенерирует динамическую структуру выхода источника. Подробное описание представлено в статье\n\"Динамическая структура данных (ETL)\"\n.\nПорядок полей структуры должен в точности соответствовать порядку полей атрибутивного состава загружаемого файла.\nОписание структуры данных  осуществляется при помощи параметров:\nПараметр\nНазначение\nФормат описания структуры данных\nВыбор формата формируемого файла.\nВозможные значения: JSON, XML.\nЕсли значение параметра не указано, по умолчанию Система ожидает получить данные в формате JSON, хотя также разложит в динамическую структуру и простой XML (плоский, без вложенности).\nWSDL/JSON\nПример структуры данных загружаемого файла. Где значения поля определит его тип автоматически.\nОпределение структуры данных отобразиться на следующей вкладке – \"Структура выхода\".\nСтруктура выхода\nНа вкладке \"Структура выхода\"\nотображается динамическая структура формируемого файла.\nПодробное описание представлено в статье\n\"Динамическая структура данных (ETL)\"\n.\nНастройка этапа\nОсновной целью настройки источника типа \"Файл\" является формирование динамической структуры и определение способа получения данных из загружаемых файлов через данную динамическую структуру.\nПошаговая настройка этапа предполагает:\nОпределение метода загрузки файла (из серверного каталога или при помощи непосредственной загрузки файлов через интерфейс Системы).\nУстановка\nправил управления получения данных\nиз тела файла.\nЕсли в Систему необходимо загрузить тело файла целиком без разложения данных в динамическую структуру, на данном шаге в качестве расширения файла выбирается \"Бинарный файл\". Если из файла необходимо извлечь текст, то в качестве расширения выбирается \"Текстовый файл\".\nШаги 3-4 при этом выполнять не требуется. Динамическая структура будет сформирована автоматически.\nФормирование динамической структуры.\n3.1.\nОписание структуры данных\nдинамической структуры в формате XML или JSON и сохранение введенных настроек приведут к тому, что Система сгенерирует динамическую\nструктуру выхода источника\n.\n3.2. Динамическая структура выхода источника может создаваться бизнес-аналитиком вручную посредством добавления и настройки элементов в дереве динамической структуры.\n3.3. Комбинированный способ формирования динамической структуры предполагает выполнение п.3.1.\nс последующим\nдобавлением элементов в дереве динамической структуры.\nПри выборе расширения файла CSV или XLS на шаге № 2 имеется возможность загрузки в Систему не только данных файла, но и наименования листов и номеров строк с данными, для этого в динамической структуре, построенной на шаге № 3, должны быть созданы соответствующие дополнительные элементы. После чего, следует вернуться к настройке правил управления (шаг № 2), обновить страницу для корректного отображения элементов структуры и сопоставить данные элементы с соответствующими параметрами.\nОтладка этапа\n— неотъемлемый шаг для проверки корректности настройки этапа.\nПример\nС примером настройки источника типа \"Файл\" можно ознакомиться в статье\n\"Настройка ETL-процесса при загрузке данных из XLS-файлов с разных листов\"\n.",
  "source": "https://docs.greendata.ru/platform/ru/source-file.html"
}