{
  "title": "Вкладка \"Настройка колонок\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВкладка \"Настройка колонок\"\nНастройки данной вкладки позволяют определить, какие колонки будут отображаться в реестре, их порядок и группировка строк.\nВкладка отсутствует при настройке реестра вида \"Плиточный реестр\".\nВыбор колонок\nРабота с вкладкой осуществляется посредством двух таблиц:\n\"Атрибуты для колонок\" – левая таблица, которая содержит атрибуты типа объекта настраиваемого реестра;\nКнопки в панели управления таблицы:\nпереключатель \"Показать родительские атрибуты\" позволяет отобразить атрибуты родительского типа объекта;\nкнопка\nпозволяет добавить атрибуты\nдочернего типа объекта\n;\nКнопка доступна при наличии дочерних типов у типа объекта  настраиваемого реестра.\nПо нажатию на кнопку откроется модальное окно для выбора дочернего типа, атрибуты которого необходимо отобразить в таблице.\nДля сброса выбранного дочернего типа следует нажать на кнопку\n, в результате чего отобразятся атрибуты типа объекта настраиваемого реестра.\nВыбранный дочерний тип будет сброшен автоматически:\nпри смене типа объекта в\nнастройках реестра\n;\nпосле перезагрузки страницы/переоткрытия окна настроек.\nкнопка\nпозволяет добавить атрибуты дочернего типа связанного типа объекта;\nКнопка доступна при выборе объектного атрибута, который ссылается на тип объекта, имеющего дочерние типы объекта.\nПо нажатию на кнопку\nоткроется модальное окно для выбора дочернего типа, атрибуты которого необходимо отобразить в таблице.\nДобавленные атрибуты дочернего типа будут доступны в выпадающем списке объектного атрибута.\n\"Колонки\" – правая таблица с добавленными атрибутами, данные которых необходимо отображать в реестре.\nФормирование колонок реестра осуществляется посредством выбора атрибутов в левой таблице и перемещением их в правую таблицу при помощи соответствующей стрелки\nмежду таблицами.\nНастройка колонок\nПосле того как колонки выбраны, можно определить их прядок и настроить отображение данных.\nДля этого используются опции над таблицей \"Колонки\":\nпереключатель \"Скрыть названия колонок\" – опция, которая скрывает наименования атрибутов (шапку таблицы реестра);\n– кнопка для формирования объединенной шапки в таблице реестра. После нажатия на кнопку отобразится строка для ввода наименования шапки, объединяющей колонки.\nПосле ввода наименования необходимо выделить поле checkbox данной строки и нажать на кнопку настройки колонки\n. В результате чего откроется модальное окно, в  котором при необходимости можно заменить ранее указанное наименование шапки и определить колонки для объединения.\nШапка реестра примет следующий вид:\n– кнопка настроек\nвыделенной\nколонки.\nНабор параметров настройки.\nПараметр\nНазначение\nНаименование колонки\nОпределение наименования колонки реестра для отображения.\nЗадать стиль текста алгоритмом\nПризнак, определяющий способ стилизации текста.\nАлгоритм стилизации\nОпределение алгоритма стилизации данных, представляемых в колонке.\nВ случае одновременной настройки стилизации для строк и колонок,\nотображение столбцов в приоритете\n.\nПараметр отображается при активном признаке \"Алгоритм стилизации\".\nСтиль текста\nОпределение\nстиля форматирования\nданных, представляемых в колонке.\nПараметр отображается при неактивном признаке \"Алгоритм стилизации\".\nГиперссылка\nПризнак, определяющий отображение значения в реестре в виде гиперссылки, при клике на которую будет открыта карточка объекта.\nПараметр недоступен при настройке колонки для атрибута типа \"Логический\", \"Дата\", \"Дата и время\", \"Время\", \"Текст\", \"Примитивный\", \"Автонумерация\".\nДействие при переходе по ссылке\nВыбор альтернативного действия при клике на гиперссылку в реестре, которое определяется типом \"Действие при переходе по ссылке в реестре\" [SYS_REG_COL_ACTION].\nШирина колонки\nОпределение ширины колонки в реестре.\nПо умолчанию для колонки \"Наименование\" указано значение 300, для остальных колонок – 150.\nВыравнивание\nСпособ выравнивания текста в колонке. Возможные варианты:\nслева;\nпо центру;\nсправа.\nЕсли в параметре \"Стиль текста\" задано выравнивание текста, то оно будет использовано в приоритете над данной настройкой.\nОтображать колонку\nПризнак, определяющий отображение данной колонки в реестре.\nПодсказка для пользователя\nВвод текста подсказки для настраиваемой колонки.\nДругое\nАлгоритм фильтрации значений\nВыбор алгоритма\nтипа\n\"Алгоритм. Условие фильтрации для выбора элементов\" для ограничения отображаемых значений в выпадающем списке при работе с реестром в\nрежиме редактирования\n.\nПараметр доступен при настройке колонки для атрибута типа \"Объект\".\nЕсли объектный атрибут ссылается на тип объекта, для которого в качестве\nреестра по умолчанию\nвыбран\n\"Реестр с иерархией\"\n, то в выпадающем списке будут отображены отфильтрованные значения вместе с корневыми узлами.\nФильтр на основе источника\nВыбор фильтра, сформированного на основе\nисточника данных\n.\nПараметр доступен при настройке колонки для атрибута типа \"Объект\".\nФункция агрегации\nОпределение способа агрегации данных в колонке. Возможные значения:\nсреднее;\nсумма.\nПараметр доступен при настройке колонки для атрибута типа \"Денежный\", \"Числовой\" или \"Целое число\".\nАлгоритм блокировки редактирования поля\nВыбор алгоритма\nтипа\n\"Алгоритм. Условие для визуала\" для определения условий блокировки редактирования значений в колонке.\nПараметр доступен при активном признаке \"Разрешено редактирование в реестре\".\nРежим поиска\nВыбор режима поиска по значениям в данной колонке. Возможные варианты:\nзаканчивается на;\nначинается с;\nне участвует в поиске;\nравно;\nсодержит подстроку.\nПо умолчанию установлено значение \"Содержит подстроку\".\nРазрешено редактирование в реестре\nПризнак, определяющий возможность изменения значений в колонке в\nрежиме редактирования\nреестра.\nЗаданная стилизация полей и сформированная шапка таблицы сохраняется при\nвыгрузке реестра\nв формате XLSX по кнопке\n.\n– кнопка для группировки позволяет отобразить экземпляры реестра по группам согласно значению(ям) выбранного(ых) атрибута(ов).\nНабор параметров группировки.\nПо нажатию на кнопку откроется модальное окно для выбора атрибутов группировки:\nДля настройки группировки\nне должны использоваться\nцепочечные атрибуты\n.\nКнопка\nдля настройки группы доступна после выбора атрибута группировки. Для атрибута можно настроить следующие параметры:\nПараметр\nНазначение\nНаименование колонки\nОтображение наименования используемого атрибута. В реестре отобразится\nзначение этого атрибута\n.\nСвернута по умолчанию\nПараметр, определяющий способ отображения группы данных (свернута/развернута).\nОтображать количество элементов\nПараметр, определяющий отображение количества экземпляров в группе.\nОтображать результаты агрегации в\nОтображение поля результата агрегации. Возможные значения:\nитоги в отдельной строке;\nитоги в строке агрегации.\nВ случае настройки группировки по атрибуту \"Сотрудник, внесший последние изменения\" реестр примет вид:\nГруппировка данных\nне учитывается\nпри экспорте реестра\nв формате XLSX по кнопке\n.\n– кнопка для добавления виртуальной колонки (подробнее,\nдалее\n).\nНастройка доступна для видов реестра: \"Плоский реестр\", \"Легкий реестр\", \"Реестр с иерархией\" и \"Реестр с папками\".\nДля виртуальной колонки недоступны группировка, фильтрация и сортировка данных. Сортировка пользователей осуществляется в алфавитном порядке.\nВ\nрежиме редактирования\nреестра изменение данных виртуальной колонки недоступно.\nВиртуальная колонка\nне учитывается\nпри экспорте реестра\nв формате XLSX по кнопке\n.\nВиртуальная колонка может быть добавлена в\nобъединенную шапку\n.\n– кнопка для удаления колонки.\n– кнопки для определения порядка отображения колонок.\nВиртуальная колонка\nПри нажатии на кнопку\nоткроется модальное окно, в котором необходимо указать наименование колонки и выбрать вариант добавляемой виртуальной колонки из выпадающего списка:\nСотрудники, работающие с карточкой объекта – создание виртуальной колонки для демонстрации пользователей, работающих с карточкой объекта в текущий момент. Например, при обработке обращений клиентов менеджерам важно видеть какой объект уже взят в работу другим менеджером.\nВиртуальная колонка добавится в настройках реестра следующим образом:\nПосле сохранения настроек в реестре будет добавлена колонка, демонстрирующая иконки профилей пользователей, у которых карточка объекта открыта в текущий момент. При наведении курсора мыши на иконку отобразится наименование пользователя и занимаемое им подразделение:\nМаксимальное количество отображаемых пользователей ограничено шириной колонки.\nЕсли количество отображенных пользователей превышает допустимую область, тогда в поле указывается количество не поместившихся пользователей, при клике на которое отобразится полный список сотрудников, работающих с карточкой объекта в текущий момент.\nОтображение виртуальной колонки не зависит от\nсистемной настройки\n\"Отображать пользователей, редактирующих карточку объекта\".\nОбъединение атрибутов объекта – создание виртуальной колонки для объединения атрибутов разных типов объекта. Например, для отображения в реестре паспортных данных удобно объединить атрибуты \"Серия\" и \"Номер\" в одном поле.\nПри выборе виртуальной колонки вида \"Объединение атрибутов объекта\" откроется модальное окно, в котором следует выбрать:\nспособ разделения атрибутов:\nзапятая;\nпробел;\nатрибуты, которые будут объединены в колонке;\nНеобходимый состав атрибутов формируется путем перемещения атрибутов из таблицы \"Доступные атрибуты\" в таблицу \"Атрибуты в колонке\" при помощи стрелок\nмежду таблицами.\nКнопка\nв панели управления таблицы \"Доступные атрибуты\" позволяет добавить атрибуты дочернего типа связанного типа объекта.\nКнопка доступна при выборе объектного атрибута, который ссылается на тип объекта, имеющего дочерние типы объекта.\nПо нажатию на кнопку\nоткроется модальное окно для выбора дочернего типа, атрибуты которого необходимо отобразить в таблице.\nДобавленные атрибуты дочернего типа будут доступны в выпадающем списке объектного атрибута.\nВ виртуальной колонке можно настроить отображение изображений.\nПосле выбора добавленного в таблицу \"Атрибуты в колонке\" атрибута типа \"Файл\" с\nнеактивным признаком \"Множественный выбор\"\nнад таблицей отобразится кнопка\n, по нажатию на которую в открывшемся модальном окне необходимо указать способ отображения файла:\nназвание файла (значение по умолчанию);\nминиатюра;\nназвание файла с миниатюрой.\nПоле \"Предпросмотр\" на примере логотипа GreenData демонстрирует выбранные настройки отображения.\nПри выборе способа \"Миниатюра\"/\"Название файла с миниатюрой\" можно настроить следующие параметры:\nПараметр\nНазначение\nФорма изображения\nВыбор формы изображения. Доступные варианты:\nпрямоугольник;\nкруг;\nквадрат.\nПо умолчанию изображение отображается в форме прямоугольника.\nШирина (px)\nОпределение ширины занимаемой изображением области в px.\nДопускается ввод целочисленного значения от 1 до 200.\nВысота (px)\nОпределение высоты занимаемой изображением области в px.\nДопускается ввод целочисленного значения от 1 до 200.\nПараметр недоступен при форме изображения \"Круг\" и \"Квадрат\".\nСкругление углов (px)\nОпределение размера скругления углов изображения в px.\nДопускается ввод целочисленного значения в указанном под полем диапазоне (зависит от размера изображения).\nПараметр отображается при форме изображения \"Прямоугольник\" и \"Квадрат\".\nПо умолчанию используется скругление углов 2px.\nВыравнивание изображения\nВыравнивание изображения в занимаемой области относительно верхнего левого угла.\nПри указанных настройках может быть создана виртуальная колонка следующего вида:\nПосле сохранения изменений по кнопке\nвнешний вид реестра изменится в соответствии с произведенными настройками.",
  "source": "https://docs.greendata.ru/platform/ru/tab_columns_and_groupings_settings.html"
}