{
  "title": "Creating a custom action (via a button)",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nCreating a custom action (via a button)\n''A\ncustom action\ncan be ensured by the analyst depending on the business logic implemented.'' This allows you to display a button for special action in the System object profile and/or registry. At the moment, the System provides a wide range of actions to configure (displaying buttons in the profile and registry).\nSee details here\n.\nTo create a new custom action, you need to:\n1. Go to the register of\nActions\n(\nmore about working with the registry\n), click\n. The System will display the action parameters.\n2. Specify parameters for the new action.\nSetting\nPurpose\nName\nEntering the action name. This name is usually assigned to the action button. You can override the name when you configure the associated object type (for more information, refer to point 4).\nAction type\nChoosing the type of the action generated. Possible values:\nAction (button)\nFolder (a drop-down list to select actions), it is used to optimize the location of items in the profile/registry\nParent action\nDefining a parent action. It is often used to display buttons from a drop-down list.\nSystem identifier\nEntering/viewing the ID number of the action generated. The field can be filled in automatically.\nSystem order\nEntering/viewing the system number of the action generated. The field can be filled in automatically.\nHint\nDefining a hint/a tip that will be displayed when hovering over the button.\nSystem JS module identifier\nEntering the system ID of the JS module. If the User interface module is not specified, the value is required in this field.\nUser interface module\nChoosing a module (a set of settings to ensure the required platform functionality) from the drop-down list. Some modules activate additional fields to configure an action in the\nAction additional parameters\n. For example, after selecting the\nCall algorithm\nmodule, you need to create/specify the algorithm called. For more information, refer to point 3.\nAction additional parameters\nCreating/selecting additional parameters of the action. Different parameters are defined depending on the specified\nuser action module\n. Described below (point 3).\nVisibility. Examples of displaying actions are provided at the end of the article.\nShow in registry\nDetermine whether a custom button can be displayed in the registry control panel.\nShow in profile\nDetermine whether a custom button can be displayed in the object profile control panel.\nShow in LocalObject\nDetermine whether a custom button can be displayed in the child object profile control panel.\nRelated object types\nObject types\nDefining the object type from which the action is configured. The setting contains a number of parameters described below (point 4).\nAdditional attributes\nAction options\nDefining/entering action options.\n3. Define additional action parameters. To do this, click the\n. button. After saving additional parameters, the button in the\nAdditional parameters\nblock of fields will change to\n. The required parameters depend on the user interface module selected. The following describes the parameters of the most common user interface modules.\n3.1. If you select the\nCall algorithm\nmodule, you need to specify:\nSetting\nPurpose\nName\nEntering/viewing the setting name.\nAlgorithm\nEntering/selecting the algorithm from the list.\nOpen object profile\nDefining how to open the object profile. The System allows you to open an object profile that has not yet been saved (that is, the decision to save the object is expected from the end user). To open the profile, the algorithm must return the required object: \"return\". In this case, the System will open a profile of the object specified (which is created and filled in in the algorithm). Otherwise, the result of the work is a profile of the object the algorithm is running for.\nHow to open the object profile\nDefining how to open the object profile. Possible options:\nIn modal window\nIn new window\nIn this window\nVisual\nSelecting the visual for the object profile to be opened. The field is active if\nYes\nis selected in the previous field.\nSave object\nDefining whether the current object can be saved.\nLock the object profile\nDefining whether the current object profile can be locked for editing.\nExamples of actions of the\nCall algorithm\nmodule are: creating an order, creating a new contract, e-mail notification of new and/or overdue tasks.\n3.2. If you choose the\nRun a business process module (without selecting from the list of available ones)\n, you need to specify:\nSetting\nPurpose\nName\nEntering/viewing the setting name.\nRelation of process and object type\nChoosing the relation of the process and object type (more\nabout it\n) from the drop-down list.\nProcess\nChoosing a business process (more\nabout it\n) from the drop-down list.\nExamples of actions in the\nRun a business process\nmodule are: approval of the sales terms and conditions, agreement of vacation, checking the client’s reliability.\n3.3. If you select the\nCopy data\nmodule, you need to specify:\nSetting\nPurpose\nName\nEntering/viewing the setting name.\nCopy items\nDefining the copy items (attributes) (\nsee details here\n).\nSave after copying\nDefining whether the copied data can be saved.\nExamples of actions of the\nCopy data\nmodule are: approval of the sales terms and conditions, agreement of vacation, checking the client’s reliability.\nA detailed use case how to make settings\n.\n4. Select the object type in which profile the custom action should be performed. To define the object type, click the\nbutton in the\nRelated object types\n. The System will display the parameters profile.\nSetting\nPurpose\nName\nEntering/viewing the setting name.\nAlgorithm of action visibility in the child object\nSelecting/entering an algorithm from the drop-down list that defines whether the button is visible in child object types.\nActions\nSelecting an action from the drop-down list.\nSystem attribute object type\nDefining the object type in which profile the custom action button will be displayed.\nOverride the action name\nEntering the button name (if required). By default, the button name is defined by the action name.\nOverride the action options\nEntering the action options for the object type given (if required). By default, the configured action options are taken into account (point 2).\nOverride the action parameters\nEntering/overriding the additional parameters for the action. By default, additional action parameters (point 2) are taken into account, depending on the user interface module applied.\nOverride the action hint\nEntering a hint/a tip that will be displayed when hovering over the button. By default, the configured action hint is used (point 2).\n5. Save the profile of the\nAction\nusing\n.\nDepending on the settings of\naction visibility\n, they are displayed:\nIn the registry. For example, in the Monitoring factors registry; for more information, refer to\nregistry settings\nIn the object profile. For example in the task profile\nIn the control panel of the child object representation. For example, when displaying the LocalObject represented by the File object type\nThe button can also be configured using the\nWidgets\nbutton. This allows you to set the width of the button and place an icon on it. In this case, the action is created in the way described here.",
  "source": "https://docs.greendata.ru/platform/en/creating-a-custom-action-via-a-button.html"
}