{
  "title": "Виджет \"Навигационная панель\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Навигационная панель\"\nВиджет \"Навигационная панель\"\n– это инструмент для удобной навигации в Системе.\nРазмещение виджета на\nстартовой странице\nпозволит пользователю быстро перейти в выбранный пункт меню, реестр или объект.\nПример настроенного виджета:\nВ Системе настроены 7 вариантов шаблонов навигационной панели:\nПредварительный просмотр шаблона доступен при наведении курсора на иконку\nрядом с наименованием. Доступные варианты шаблонов:\nНастройка\nДобавление виджета в карточку объекта осуществляется в режиме\nнастройки визуала экземпляра\n. При переходе на панели \"Элементы\" на вкладку \"Виджеты\" необходимо из раздела \"Навигационная панель\" перетащить (Drag&Drop) необходимый шаблон виджета в рабочую область карточки.\nПараметры\nДля управления виджетом необходимо нажать на кнопку \"Настройки\", в результате чего откроется модальное окно со следующими параметрами:\nПараметр\nНазначение\nНаполнение панели\nОбработка действия\nОпределение компонента, переход к которому необходимо осуществить при клике на панель. Возможные варианты:\nПункт меню;\nОбъект;\nРеестр.\nПункт меню\nОпределение пункта меню, переход к которому необходимо осуществить при клике на панель.\nВыбор пункта меню осуществляется из выпадающего списка, при необходимости можно\nнастроить новый пункт меню\nчерез меню действий параметра.\nПараметр доступен при выборе действия \"Пункт меню\".\nТип объекта\nОпределение типа объектов, карточка объекта или реестр которого будут открыты при клике на панель.\nВыбор типа объектов осуществляется из выпадающего списка, при необходимости можно\nсоздать новый тип объектов\nчерез меню действий параметра.\nПараметр доступен при выборе действия \"Объект\" или \"Реестр\".\nОбъект\nЭкземпляр, визуал которого будет отображаться при клике на панель.\nВыбор объекта осуществляется из выпадающего списка экземпляров указанного типа объектов, при необходимости можно\nсоздать новый объект\nчерез меню действий параметра.\nПараметр доступен при выборе действия \"Объект\".\nВизуал\nОпределение визуала объекта, который будет отображаться при клике на панель.\nВыбор визуала объекта осуществляется из выпадающего списка визуалов указанного типа объектов, при необходимости можно\nсоздать новый визуал объекта\nчерез меню действий параметра.\nПараметр доступен при выборе действия \"Объект\".\nРеестр\nОпределение реестра, который будет отображаться при клике на панель.\nВыбор реестра осуществляется из выпадающего списка реестров указанного типа объектов, при необходимости можно\nсоздать новый реестр\nчерез меню действий параметра.\nПараметр доступен при выборе действия \"Реестр\".\nЗаголовок\nВвод текста заголовка панели (максимальный размер 2000 символов).\nСтиль\nОпределение способа задания стиля заголовка. Возможные варианты:\nСтиль;\nАлгоритм.\nПо умолчанию для всех шаблонов установлено значение \"Стиль\".\nСтиль заголовка\nОпределение стиля для текста заголовка. Выбор осуществляется посредством выпадающего списка из экземпляров типа объектов\n\"Основной стиль форматирования\"\n.\nПараметр доступен при выборе варианта \"Стиль\" в качестве способа задания стиля заголовка.\nАлгоритм\nВыбор алгоритма, с помощью которого будет задан стиль для текста заголовка.\nАлгоритм должен возвращать экземпляр типа объектов\n\"Основной стиль форматирования\"\n.\nПараметр доступен при выборе варианта \"Алгоритм\" в качестве способа задания стиля заголовка.\nОписание\nВвод текста описания панели (максимальный размер 2000 символов).\nПараметр доступен только для шаблонов с описанием.\nСтиль\nОпределение способа задания стиля для текста описания. Возможные варианты:\nСтиль;\nАлгоритм.\nПараметр доступен только для шаблонов с описанием.\nСтиль описания\nОпределение стиля для текста описания. Выбор осуществляется посредством выпадающего списка из экземпляров типа объектов\n\"Основной стиль форматирования\"\n.\nПараметр доступен при выборе варианта \"Стиль\" в качестве способа задания стиля описания.\nАлгоритм\nВыбор алгоритма, с помощью которого будет задан стиль для текста описания.\nАлгоритм должен возвращать экземпляр типа объектов\n\"Основной стиль форматирования\"\n.\nПараметр доступен при выборе варианта \"Алгоритм\" в качестве способа задания стиля описания.\nСкругление углов\nОпределение размера скругления углов изображения на панели. Возможные варианты:\nБез скругления;\nXS;\nS;\nM;\nL.\nПараметр доступен для шаблонов с дополнительным изображением.\nОбводка\nПризнак, определяющий наличие обводки изображения на панели. Возможные варианты:\nДа;\nПри выборе варианта доступен color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA и HEX.\nНет.\nПараметр доступен для шаблонов с дополнительным изображением.\nПри нажатии на кнопку отобразится контекстное меню для выбора способа добавления изображения на панель:\nФайл с диска – откроется проводник для загрузки файла с устройства пользователя.\nПри добавлении изображения с диска в Системе создается новый экземпляр типа \"Файл\" [FS_FILE].\nФайл из системы – откроется реестр типа \"Файл\" [FS_FILE] для выбора изображения, ранее загруженного в Систему.\nДопустимый формат загружаемого файла: *.png, *.jpg, *.jpeg.\nПараметр доступен для шаблонов с дополнительным изображением.\nРедактирование панели\nРазмер панели\nОпределение размера панели. Возможные варианты:\nXS;\nS;\nM;\nL.\nПо умолчанию для всех шаблонов установлено значение XS.\nРазмер панели в мобильном приложении\nОпределение размера панели в мобильном приложении. Возможные варианты:\nXS;\nS;\nM;\nL.\nПо умолчанию для каждого шаблона установлено собственное значение.\nАвтоширина\nПризнак, при котором ширина панели будет автоматически подобрана под доступную область.\nПо умолчанию параметр неактивен.\nСкругление углов\nОпределение размера скругления углов панели. Возможные варианты:\nБез скругления;\nXS;\nS;\nM;\nL.\nПо умолчанию для каждого шаблона установлено собственное значение.\nТень\nОпределение размера тени. Возможные варианты:\nБез тени;\nS;\nM;\nL.\nСтиль панели\nОпределение способа задания стиля для фона панели. Возможные варианты:\nСтатичный;\nАлгоритм.\nПо умолчанию для всех шаблонов установлено значение \"Статичный\".\nЗаливка\nОпределение способа заливки фона. Возможные варианты:\nБез заливки;\nЦвет;\nПри выборе варианта доступен color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA и HEX.\nГрадиент.\nНастройка градиента осуществляется в модальном окне.\nДля настройки перехода необходимо выбрать тип градиента: линейный или радиальный. Для радиального градиента также можно указать угол наклона в градусах.\nПосле чего необходимо добавить минимум две точки градиента нажатием на кнопку\nи для каждой указать положение, цвет и прозрачность.\nПараметр доступен при статичном способе определения стиля фона панели.\nОбводка\nПризнак, определяющий наличие обводки панели. Возможные варианты:\nДа;\nПри выборе варианта доступен color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA и HEX.\nНет.\nПараметр доступен при статичном способе определения стиля фона панели.\nАлгоритм\nВыбор алгоритма, с помощью которого будет задан стиль фона панели.\nАлгоритм должен возвращать экземпляр типа объектов\n\"Основной стиль форматирования\"\n.\nПараметр доступен при способе определения стиля фона панели с помощью алгоритма.\nПри нажатии на кнопку отобразится контекстное меню для выбора способа добавления изображения для фона панели:\nФайл с диска – откроется проводник для загрузки файла с устройства пользователя.\nПри добавлении изображения с диска в Системе создается новый экземпляр типа \"Файл\" [FS_FILE].\nФайл из системы – откроется реестр типа \"Файл\" [FS_FILE] для выбора изображения, ранее загруженного в Систему.\nДопустимый формат загружаемого файла: *.png, *.jpg, *.jpeg.\nПод параметрами настройки отображается макет виджета.\nВ верхней части модального окна расположена кнопка \"Перейти в режим разработчика\", по нажатию на которую осуществится переход в\nсреду разработки виджетов\nдля создания пользовательского виджета.\nПример\nРассмотрим процесс размещения виджета на стартовой странице приложения.\nПредварительно необходимо подготовить объекты Системы, быстрый переход к которым требуется настроить.\nРеестр \"Материалы маркетинга и продаж\":\nРеестр \"Запрос о регистрации сделки\":\nПлиточный реестр\n\"Актуальные новости\":\nДалее необходимо одним из\nдоступных способов\nсоздать стартовую страницу без привязки к объектам Системы.\nОткроется страница, на которой следует ввести наименование стартовой страницы, после чего перейти к настройке визуала нажатием на кнопку\n.\nЗатем в режиме\nредактирования визуала экземпляра\nнеобходимо из раздела \"Навигационная панель\" вкладки \"Виджеты\" перетащить (Drag&Drop) в рабочую область карточки\nчетыре\nшаблона \"Заголовок снизу\".\nДалее необходимо заполнить\nпараметры настройки\nдля каждой панели виджета.\nНапример, при настройке панели \"Материалы для продаж\" необходимо выбрать реестр \"Материалы маркетинга и продаж\", сформированный\nранее\n:\nПанели \"Регистрация сделки\" и \"Актуальные новости\" настраиваются аналогичным образом.\nЗатем необходимо настроить панель \"Общение\" для перехода к пункту меню \"Чаты\", указав следующие настройки:\nВ результате настройки на стартовой странице будет отображена панель навигации для быстрого перехода к необходимым разделам Системы:",
  "source": "https://docs.greendata.ru/platform/ru/navigation-panel-widget.html"
}