{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз\nLTS.397.4\nот 07.02.2024\nНовые возможности\nТеперь вместо узлов аналитической панели \"Граф\" можно использовать картинки, а при нажатии на узел объект будет открыт в новой вкладке.\nРеализовано новое действие «Закрытие модального окна».\nПоявилась возможность переопределять действие по нажатию на кнопку \"Ок\" в модальном окне.\nПри работе с электронными документами в режиме работы с закладками добавлена\nвозможность перехода из закладки к карточке объекта, по которому сформировалось значение закладки.\nИзменения и улучшения\nДоработана логика связанных элементов, теперь обязательные атрибуты типа объект или дочерний объект не могут быть очищены при удалении связанного объекта.\nДобавлена возможность управления положением параметров в карточках типов, связанных с параметрами объектов.\nОптимизировали настройки по созданию атрибутов для работы с файлами.\nОтлажен процесс создания экземпляра в дочернем атрибуте.\nСтабилизировано отображение предметных областей.\nНалажена работоспособность функции numberToWords.\nТеперь при использовании признака \"Установить значение\" для функции attrByVar цепочечные атрибуты будут скрыты.\nНалажена возможность редактирования алгоритма фильтрации в модальном окне.\nСтабилизирован процесс сборки GUF-файлов при добавлении визуала.\nСтабилизирована работоспособность аналитической панели \"Элемент управления\" на дашбордах, перенесенных в приложение при помощи GUF-файлов.\nПри работе с дашбордами стабилизирован процесс выгрузки диаграмм.\nВ модуле EDoc оптимизированы настройки сравнения версий документов при работе с закладками и после добавления/удаления экземпляров вложенного шаблона.\nПроизведена доработка настроек, отвечающая за отображение алгоритмов в реестре вычислимого показателя.\nСтабилизировано отображение панели с расшифровкой для выделенного объекта в реестре.\nОптимизировали настройки для задач с отложенным началом выполнения.\nСтабилизировали работу GreenData Messenger при редактировании сообщений.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.397.3\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.397.3.war\nhttps://downloads.greendatasoft.ru/LTS/lts.397.3.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.397.4-latest.html"
}