{
  "title": "Источник. Внешняя БД",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИсточник. Внешняя БД\nИсточник типа \"Внешняя БД\" используется в случае необходимости получения данных из внешней БД для дальнейшего использования.\nДля использования источника необходимо при настройке\nсхемы ETL-процесса\nс панели действий и компонентов перетащить (Drag&Drop) в рабочую область элемент задачи.\nПосле чего определить добавленный этап как\nИсточник. Внешняя БД\n:\nПараметры настройки\nПереход к настройкам источника данных типа \"Внешняя БД\" осуществляется\nпосле сохранения схемы ETL\nпри помощи нажатия на соответствующую иконку этапа:\nВ результате чего откроется страница, на которой представлена карточка с набором параметров для настройки источника данных:\nПараметр\nНазначение\nСоединение с внешней БД\nВыбор\nсоединения с внешней БД\n, с которой настраивается взаимодействие.\nПри пустом значении атрибута база данных определяется как текущая, с которой работает Система.\nТип команды\nВыбор типа команды из выпадающего списка. Возможные значения:\nвызов процедуры;\nвызов функции;\nзапрос.\nSQL/PSQL\nВвод запроса к внешней БД.\nДопускается использование параметризованного запроса. Данная необходимость возникает в случае, когда значения параметров запроса должны быть определены в момент его запуска.\nПараметры запроса\nДобавление параметров запроса (рассмотрено\nдалее\n).\nПараметры запроса\nПараметры позволяют сделать запрос к БД более динамическим и гибким, заполняя значения переменных во время выполнения. Чаще всего параметры используются в случаях, когда запрос выполняется многократно, но каждый раз с разными значениями.\nДобавление параметров запроса осуществляется во встроенном реестре \"Параметры запроса\" нажатием на кнопку\n. При создании параметра запроса указываются:\nПараметр\nНазначение\nНаименование\nВвод наименования параметра.\nВид параметра\nОпределение вида параметра. Возможные значения:\nпараметр SQL-запроса – использование значения из БД;\nПараметр используется во время выполнения запроса.\nВ качестве данного параметра не может быть использовано, например, имя таблицы БД.\nПараметр SQL указывается в запросе через знак \":\", например:\nwhere date_report >= :date_start\nsql\nCopied!\nподстановочный параметр – замена подстроки в запросе.\nПараметр используется до выполнения запроса.\nИдентификатор\nОпределение идентификатора параметра.\nУказанный идентификатор используется в запросе к БД.\nАлгоритм\nОпределение алгоритма, результат работы которого будет передан в параметр. Алгоритм должен возвращать:\nстроку, число или дату – в случае настройки параметра вида \"Параметр SQL-запроса\";\nПример алгоритма\nДля заполнения параметра значением кода объекта может быть использован следующий алгоритм:\nстроку, содержащую текст запроса (подстроку) – при настройке подстановочного параметра.\nПример алгоритма\nДля заполнения параметра подстрокой запроса может быть использован следующий алгоритм:\nВ зависимости от результата выполнения условия в параметр может быть передана подстрока\nand status = 1\nили пустая строка.\nВ алгоритмах формирования параметров на источнике допустимо использование функции\netlValue\nдля обращения к входящей динамической структуре, но при этом необходимо указывать полный путь до нужной ноды, начиная с корня.\nЭлемент динамической структуры\nАтрибут\nне используется\nпри настройке параметров запроса на источнике типа \"Внешняя БД\".\nВыходная структура\nВ поле \"WSDL/JSON\" формируется описание предполагаемой структуры данных. Подробнее с темой можно ознакомиться в статье\n\"Динамическая структура данных (ETL)\"\n.\nПример\nНапример, требуется загрузка списка всех пользователей, работавших в Системе за последние сутки.\nДля этого на\nсхему ETL-процесса\nнеобходимо добавить этап \"Источник. Внешняя БД\" и заполнить параметры настройки:\nв поле \"SQL/PSQL\" производится запрос к базе данных;\nПодробнее о запросе\nПосредством SQL-запроса осуществляется обращение к таблице\n\"Аудит. Сессия\"\n[SYS_AU_SESSION].\nИз таблицы извлекаются поля \"Сотрудник\" и \"Наименование сотрудника\", соответствующие условию, заданному при помощи оператора\nwhere\n.\nПолученные данные группируются по сотруднику (при наличии нескольких сессий у одного сотрудника) посредством оператора\ngroup by\n.\nнеобходимая дата задается с помощью параметра запроса:\nПодробнее об алгоритме\nПериод времени задается с помощью функции\nplusDays\n, где от текущей даты (\ncurrentDate\n) отнимается 1 день.\nв параметре \"WSDL/JSON\" формируется динамическая структура.",
  "source": "https://docs.greendata.ru/platform/ru/source-external-data-base.html"
}