{
  "title": "Приемник. Форма отчетности",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПриемник. Форма отчетности\nПриемник типа \"Форма отчетности\" предназначен для\nзаполнения экземпляров форм отчетности\n(и создания новых экземпляров при необходимости) на основе полученной информации.\nЭкземпляром формы отчетности\nсчитается информация о финансовом положении экономического субъекта (предприятия/компании), сформированная на указанную отчетную дату согласно соответствующей\nформе отчетности\n.\nЭкземпляры формы отчетности представлены типом объектов \"РМ. Экземпляр формы отчетности\" [RISK_FORM_INST].\nДля использования приемника необходимо при настройке\nсхемы ETL-процесса\nс панели действий и компонентов перетащить (Drag&Drop) в рабочую область элемент задачи.\nПосле чего определить добавленный этап как\nПриемник. Форма отчетности\n:\nПараметры настройки\nДля перехода к параметрам настройки приемника необходимо\nсохранить схему ETL\n, после чего в меню действий этапа нажать на кнопку\n.\nВ результате чего в новой вкладке откроется страница с набором параметров для настройки.\nСвязь полей\nВ первую очередь необходимо настроить пары связей. В правой части области настройки расположен перечень стандартных элементов формы отчетности (подробнее об элементах и настройке формы отчетности описано в\nстатье\n).\nДля настройки связи необходимо сопоставить элемент входной динамической структурой (далее  – ДС) в левой части области с соответствующим ему элементом формы отчетности в правой части области, после чего нажать на кнопку «Связать».\nТакже при необходимости определяются параметры загрузки данных:\nПараметр\nНазначение\nЗаполнять отсутствующие элементы пустыми значениями\nЛогический атрибут, определяющий необходимость присвоения значения\nnull\nэлементам формы отчетности при отсутствии значений во входной структуре данных.\nОчистить лог при успешном выполнении этапа\nПризнак, используемый для оптимизации хранения в базе данных. При активации параметра в случае успешного выполнения этапа лог текущего этапа очищается.\nПо умолчанию настройка активна.\nНастройка связывания форм отчетности\nДля того чтобы определить, какие формы будут заполняться при помощи данного приемника, производится настройка связывания, которая заключается в привязке необходимых форм отчетности и всех составляющих элементов.\nДля этого в поле \"Настройка связывания форм отчетности\" необходимо выбрать настройку: выбор осуществляется посредством выпадающего списка из ранее созданных экземпляров типа \"ETL. Настройка приемника форм отчетности\" [SYS_ETL_RF_SETTING].\nДалее описаны параметры настройки экземпляра типа \"ETL. Настройка приемника форм отчетности\".\nПривязка форм\nДля привязки форм отчетности необходимо во встроенном реестре \"Привязки форм\" нажать на кнопку\nи в открывшемся окне заполнить следующие параметры:\nПараметр\nНазначение\nФорма отчетности\nВыбор формы отчетности, экземпляр которой необходимо заполнить/создать.\nСпособ привязки\nОпределение способа привязки формы отчетности. Возможные значения:\nпо идентификатору;\nпо коду статьи;\nПри привязке формы отчетности\nне используется\nспособ привязки \"По коду статьи\". Данный вариант доступен только для привязки строк.\nпо наименованию;\nпо строке сопоставления.\nСтрока сопоставления\nВвод строки для идентификации формы отчетности. Возможные варианты перечисляются через символ \";\", при этом регистр не учитывается.\nПараметр заполняется при привязке формы отчетности по строке сопоставления.\nСпособ привязки стандарта\nОпределение способа привязки\nстандарта финансовой отчетности\n. Настройка опциональна, привязка осуществляется в том случае, когда в разных стандартах используются формы отчетности с одинаковыми идентификаторами/наименованиями. Возможные значения:\nпо идентификатору;\nпо коду статьи;\nПри привязке стандарта\nне используется\nспособ привязки \"По коду статьи\". Данный вариант доступен только для привязки строк.\nпо наименованию;\nпо строке сопоставления.\nСтрока сопоставления стандарта\nВвод строки для идентификации стандарта финансовой отчетности. Возможные варианты перечисляются через символ \";\", при этом регистр не учитывается.\nПараметр заполняется при привязке стандарта по строке сопоставления.\nЗатем необходимо сохранить настройки нажатием на кнопку\nв панели управления, в результате чего во встроенном реестре \"Привязки форм\" отобразятся привязанные формы отчетности. При выборе формы отчетности будут отображены указанные ранее параметры привязки и появится возможность привязки разделов.\nПривязка разделов\nДалее необходимо выполнить привязку\nразделов формы отчетности\n, для этого во встроенном реестре \"Привязки разделов\" следует нажать на кнопку\nи для каждого раздела заполнить параметры настройки, расположенные на трех вкладках:\nВкладка \"Привязка раздела\"\nпредназначена для настройки привязки раздела по следующим параметрам:\nПараметр\nНазначение\nРаздел формы отчетности\nВыбор раздела формы отчетности, привязка которого осуществляется.\nСпособ привязки\nОпределение способа привязки раздела формы отчетности. Возможные значения:\nпо идентификатору;\nпо коду статьи;\nПри привязке раздела\nне используется\nспособ привязки \"По коду статьи\". Данный вариант доступен только для привязки строк.\nпо наименованию;\nпо строке сопоставления.\nСтрока сопоставления\nВвод строки для идентификации раздела формы отчетности. Возможные варианты перечисляются через символ \";\", при этом регистр не учитывается.\nПараметр заполняется при привязке раздела формы отчетности по строке сопоставления.\nНа\nвкладке \"Показатели\"\nопределяется способ привязки показателей (столбцов) отчетной формы в одноименном поле. Возможные значения:\nпо идентификатору;\nпо коду статьи;\nПри привязке показателя\nне используется\nспособ привязки \"По коду статьи\". Данный вариант доступен только для привязки строк.\nпо наименованию;\nпо строке сопоставления.\nПри работе приемника показатели будут найдены и привязаны автоматически.\nИсключением является привязка показателей\nпо строке сопоставления\n.\nВ этом случае необходимо осуществить привязку показателей вручную.\nДля каждого показателя формы отчетности необходимо во встроенном реестре \"Привязки показателей\" нажать на кнопку\n, после чего заполнить следующие параметры:\nПараметр\nНазначение\nПоказатель формы отчетности\nВыбор показателя отчетной формы, привязка которого осуществляется.\nСтрока сопоставления\nВвод строки для идентификации показателя отчетной формы. Возможные варианты перечисляются через символ \";\", при этом регистр не учитывается.\nПараметр заполняется при привязке показателей формы отчетности по строке сопоставления.\nНа\nвкладке \"Строки\"\nнеобходимо указать способ привязки строк отчетной формы в одноименном поле. Возможные значения:\nпо идентификатору;\nпо коду статьи;\nпо наименованию;\nпо строке сопоставления.\nПри работе приемника строки отчетной формы будут найдены и привязаны автоматически.\nИсключением является привязка строк\nпо строке сопоставления\n.\nВ этом случае необходимо осуществить привязку строк отчетной формы вручную.\nДобавление строк осуществляется нажатием на кнопку\nво встроенном реестре \"Привязки строк\", после чего заполняются следующие параметры:\nПараметр\nНазначение\nСтрока формы отчетности\nВыбор строки отчетной формы, привязка которой осуществляется.\nСтрока сопоставления\nВвод строки для идентификации строки отчетной формы. Возможные варианты перечисляются через символ \";\", при этом регистр не учитывается.\nПараметр заполняется при привязке показателей формы отчетности по строке сопоставления.\nПример\nНапример, требуется на основе полученных из внешней системы данных заполнить экземпляр формы отчетности по организации ООО \"Яблоня\" на указанную отчетную дату.\nПредварительно необходимо\nнастроить форму отчетности\n, согласно которой будет формироваться отчетность.\nДалее при создании\nсхемы ETL-процесса\nнеобходимо добавить этап \"Приемник. Форма отчетности\" и перейти к его настройкам.\nДопустим, входные данные приемника соответствуют представленной ниже ДС. При настройке приемника необходимо настроить пары связей между полями входной ДС и элементами отчетной формы:\nПодробнее\nОбъект, для которого заполняется форма отчетности, в ДС представлен полем \"obj_id\", а отчетная дата – полем \"report_date\".\nЭлементы отчетной формы получены из внешней системы в следующем виде:\nформа отчетности задается с помощью идентификатора, передаваемого посредством поля \"form_ident\";\nразделы отчетной формы определяются по наименованию, которое хранится в поле \"part_name\";\nстроки отчетной формы передаются с помощью кода статьи, указанного в поле \"row_code\";\nпоказатели отчетной формы определяются с помощью идентификатора, хранящегося в поле \"pok_ident\";\nчисловые значения хранятся в поле \"value_num\";\nстроковые значения содержатся в поле \"value_str\".\nВ поле \"Настройка связывания форм отчетности\" указывается объект настройки, в котором осуществлена привязка созданной ранее формы отчетности, а также всех ее элементов (разделов, показателей и строк отчетной формы).\nВ соответствии с полученными данными настраиваются привязки:\nформы отчетности – по ее идентификатору:\nразделов – по наименованию:\nпоказателей – по идентификатору.\nНапример, показатель \"Комментарий\":\nстрок – по коду статьи.\nНапример, строка \"Выручка за минусом НДС и акцизов\":\nПри запуске ETL-процесса будет создан экземпляр формы отчетности типа \"РМ. Экземпляр формы отчетности\" [RISK_FORM_INST], заполненный на основе полученных из внешней системы данных:",
  "source": "https://docs.greendata.ru/platform/ru/receiver-reporting-form.html"
}