{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.465.13 of October 29, 2025\nNew features\nStorage of\nuser unsaved data\nnow considers expression recalculations/auto-calculation and can be configured per specified visual instance.\nBrowser back buttons support for navigating previously visited hierarchy levels in\ntile registries\nwas added. A top-level object list navigation button was added to the registry control panel.\nThe\n\"Button\" widget\nsettings was improved, and it can now be used as a template when creating\ncustom widgets\n.\nFor the \"ETL object\" type, permission control was changed to \"System Permission Control\". The \"Run\" privilege was added for\nlaunching ETL processes\nvia system buttons.\nCreating and managing\nmain menu items\nbecome simpler and more convenient.\nSecret variables\nare now stored in the main database by default.\nAdditional parameters for PostgreSQL session configuration when setting up database connections was added.\nThere is a new convenient way to save important messages, files and notes in a\n\"Saved messages\" chat\n.\nChanges and improvements\nAutomatic generation of object type table names and attribute field names was enhanced.\nObject deleting mechanism was improved for cases with dependent objects that the user lacks access permissions for.\nCreating filter via parameter action menu was added for \"Object parameters. Filter\" type objects.\nThe default value for the \"Expanded by default\" attribute in\nmain menu settings\nwas set to \"No\".\nIn new objects after saving, the process of switching between\ntabs\nwas debugged.\nHighlighting required attributes and displaying object attribute values referencing the default\n\"Hierarchical registry\"\nobject type was enhanced when working with objects in registry\nedit mode\n.\nData filtering with dynamic type shift was stabilized when using\ncustom registry filters\nand switching filter types.\nImage resizing functionality for thumbnails in\nvirtual registry columns\nwas stabilized.\nRegistry display was stabilized according to specified column widths.\nSettings opening functionality was fixed for\n\"Task Registry\"\ntype, and an assignee selection element was added to its control panel.\nThe display of numerical values and aggregation for chained attributes in registries and child attributes was debugged.\nHiding an area containing user-invisible parameters settings was enhanced on object visual.\nDate filtering capability in the\n\"Explorer\" widget\nwas fixed.\nThe display of values in the table presented via the\n\"Dashboard\"\nwidget was stabilized.\nThe operation of the\nlock algorithm\nfor the\n\"Button\"\nwidget was adjusted.\nDashboards now support data filtering in the\n\"Table\" analytical panel\nwhen used as a\ndrill-down panel\n.\nOverriding standard actions with\nbatch actions\nwas stabilized.\nExecution of\ncustom button actions\nplaced in child attributes added via frame to related type visuals was fixed.\nCreating\nobject chats\nvia business process algorithms was fixed.\nThe operation of the\ncontextObjAttr\nfunction with chained context-type attributes was adjusted.\nThe performance of\nvisibility algorithms\nusing the\nalg\nfunction was optimized.\nConfiguration settings for\ncondition trees\nwere improved.\nPermission verification for executing\ndata sources\nwas improved.\nAccess permissions for creating and deleting\nmenu items\nusing registry control panel buttons were adjusted.\nNumber of System security improvements were implemented.\nThe cyclicity check when creating a business process was improved.\nThe process of\nETL execution\nfrom a file was debugged.\nBefore starting the ETL, the ability to open a modal dialog for parameter input was stabilized.\nThe operation of the \"Search for an object in the registry\" type transformer was debugged.\nInstallation of updates containing\nbusiness process templates\nwas optimized.\nAccess group deleting capability was fixed when specified\nprivilege levels\nare set.\nThe list of user errors sent to system administrators via email was adjusted.\nThe ability to add users to\nSystem access groups\nwas stabilized.\nCache clearing was improved when saving\nsecurity principal privileges\n.\nThe performance of\nbalance checks\nwas optimized.\nUser lock/unlock process was fixed based on Microsoft Active Directory data.\nDatabase size display was fixed for\nSaaS solutions\n.\nData synchronization with Microsoft Active Directory\nwas improved. It is now performed only during the user’s first login with a domain account.\nThe display and saving of\nsecret variables\nin the specified\ndirectory\nwas stabilized.\nThe change saving process was enhanced during collaborative document editing.\nCursor and ruler display was fixed after loading file versions and accepting all changes in review mode.\nPage numbering configuration was fixed in documents.\nThe display of edited data when switching between the document view and review tabs was stabilized.\nThe generation of printed form was stabilized.\nBy improving the processing of headers, footers, and comments, the creation of a new document version from a file was stabilized.\nThe capability for collaborative work on a document from different nodes was improved.",
  "source": "https://docs.greendata.ru/platform/en/LTS.465.13-latest.html"
}