{
  "title": "\"Date range\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Date range\" widget\n\"Date range\" is a tool that allows the user to set a period of time, specifying its start and end.\nThe data displayed by the\nwidget\ncan be used by the business analyst as parameters for subsequent configuration of the business logic of the System module being developed.\nExample of a customized widget for a payment schedule:\nSetting up\nThe widget is added in the\nvisual of an instance\nediting mode. It is necessary to drag (Drag-and-drop) the \"Date range\" widget from the \"Widgets\" tab of the \"Elements\" panel from the \"User Information\" section to the workspace of the object profile.\nBy clicking on the\nbutton, a modal window with a set of widget settings will be opened opens.\nParameters\nSetting\nPurpose\nAttribute with start/end date (with start/end date and time)\nSelecting the attribute type that defines the value of the start/end date. The following types of attributes will be available for selecting, including parent attributes:\n\"Date\";\n\"Date and time\".\nPlaceholder for the start/end date\nEnter the text that will be displayed as a hint inside the start/end date input field.\nSymbol before the start/end date\nEnter a character or text to be displayed before the start/end date.\nAfter filling in the parameters to save the changes, click on the\nbutton. The settings will be applied after saving the\nvisual\n. After that, working with the added widget will be available from the object profile.\nDepending on the type of the selected value of the \"Attribute with start date\" and \"Attribute with end date\" parameters, the widget display can take the following form:\nWidget with \"Date\" value type.\nWidget with \"Date and type\" value type.\nParameter attributes can be of different types. For example, for the\n\"Attribute with start date\"\nparameter, an attribute of the \"Date\" type can be selected, for the\n\"Attribute with end date\"\nparameter — \"Date and Time\".\nThe date range can be set manually by entering numeric values in the widget fields or using the calendar available after clicking on the\nicon.\nIn the calendar, select the\nstart date\nfrom which the data should be displayed and, optionally, the\nend date\n, since the end value for displaying the data may not be set or set later.\nTo change the month, click on the date, and then it will be possible to select the month. The year is set similarly to the month. Learn more about\nworking with DateTime attribute\n.\nWidget fields can be filled in by default if the values of the attributes involved in the setting are not empty.\nThe widget automatically sets time limits, checking the fulfillment of compliance with the condition: \"The start date is less than or equal to End date\".\nThe date range can also be set by clicking on the \"Today\" and \"Now\" buttons for each of the dates.\nBy clicking the button:\n\"Today\" — the current date is set in the calendar. Available for an attribute with the \"Date\" or \"Date and Time\" value types;\n\"Now\" — the current time is set in the timer. Available for an attribute with the \"Date and Time\" value type.\nWhen setting the end date by clicking on \"Now\", the start date will be automatically reset to zero.\nThe time must not be set to a value greater than 23:59. The value 00:00 is used to determine midnight.\nSaving the set date range is done by clicking on the \"Done\" button.\nUse case\nAs one of the popular cases, using the \"Date Range\" widget allows limiting the selection of objects. For example, it is necessary to display payments for a certain time period in the object profile.\nTo do this, a number of successive actions must be performed:\n1. Create the \"Application for credit\" type.\nThe main object type must contain the following attribute composition:\n2.Create the \"Payments\" type and link it to the \"Application for credit\" type using the \"Payments\"\nchild attribute\n.\nAttribute composition of the \"Payments\" child object:\n3.  In the\nregistry\nof instances of the \"Application for credit\" type, create a new instance and switch to the\nvisual\nediting mode.\n4. Drag-and-drop the \"Date range\" widget and the \"Payments\" child attribute to the visual.\n5. Configure the \"Date Range\" widget by filling in the parameters.\nSet the time interval and click on the \"Done\" button.\n6. For the \"Payments\" type registry it is necessary to add a filter condition, which will be implemented by comparing the value of the \"Payment date\" attribute with the values of the \"Start date\" and \"End date\" attributes of the main object type \"Application for credit\", which are, in turn, set using the widget \"Date range\".\nTo do this, in the \"Payments\"\nregistry\ntype, by clicking on the\nbutton, it will be possible to configure the registry. On the \"Filtering and search filters\" tab, in the \"Data filtering algorithm\" field, open the actions menu and select \"Add\".\nIn the profile that opens, specify the parameters in the \"General information\" block:\n\"The object type with elements to be filtered\" (set by the System by default);\n\"Object profile with parameters to be used for filter (parent object)\".\nNext, add a filtering algorithm in the \"Filter condition\" block..\nSee more about configuring the filtering algorithm.\nIt is necessary to add a condition to the filtering algorithm, which consists of two subconditions connected with the and operator. The subcondition consists of comparing the left part (attribute value), the operator and the right part (parameter).\nThe algorithm involves:\nthe\nattr\n, function, located on the\n\"Sources\"\ntab, uses it to select the \"Payment Date\" attribute.\nthe\nparentAttr\n, function, located on the\n\"Sources\"\ntab, through which the values of the attributes of the parent type \"Start Date\" and \"End Date\" are inserted into the algorithm.\nthe\nand\n, function, which implements the boolean \"And\", located on the\n\"Arithmetic and Boolean\"\n.\n7. Save the changes by clicking \"Save\" and \"OK\" on the \"Elements\" panel.\nAfter that, the object profile will display a payment schedule with the ability to display records of payments according to the specified time interval.",
  "source": "https://docs.greendata.ru/platform/en/widget-date-range.html"
}