{
  "title": "Action processing order when working with an object",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nAction processing order when working with an object\nOpening a new object\nWhen opening an object, the sequence of actions performed on the server and client sides of the application depends on whether an existing object is being opened, a copy is being created, or a new object is being created:\nEvent algorithms, expressions, and autonumbering may include settings that trigger actions on the interface, including overwriting previously set attribute values.\nThe calculation of\nexpressions\nwith active \"Calculate when creating new objects\" and \"Set result in attribute\" options is not performed for attributes with predefined\ndefault values\n, including those obtained through\nautonumbering\n.\nData recovery from cache occurs when the\n\"Save entered data when closing a new (unsaved) object\" setting\nis active.\nIf\nautonumbering\nis set with the calculation time for the\n\"Upon creation\"\nnumber, the sequence number will be assigned by the system each time a new object is created or an existing object is copied.\nIn the case of copying an object, the sequence number assigned in the copied object will be used. If absent, the number assigned by autonumbering will be used.\nFind more about:\ncreating an object type instance\n;\nexpressions/autocalculations\n;\nscreen form events\n;\nautonumbering\n.\nChanging object data\nActions performed on the server and client sides of the application as a result of attribute value changes:\nEvent algorithms, expressions, and autonumbering may include settings that trigger actions on the interface.\nFind more about:\nexpressions/autocalculations\n;\nOnChanged event\n.\nClosing object\nWhen closing an object, the following sequence of actions is performed:\nEvent algorithms may include settings that trigger actions on the interface.\nData is saved to the cache when the\n\"Save entered data when closing a new (unsaved) object\" setting\nis active.\nFind more about:\nscreen form events\n;\nstoring unsaved data\n.\nDeleting object\nThe sequence of actions when deleting an object can be represented in the following diagram:\nAn object is deleted only if the transaction completes successfully. If any error occurs at any stage, the transaction is aborted, and all changes are rolled back.\nIf the action for a dependent object is set to \"Move to recycle bin\" or \"Delete permanently\", object\nvalidations\nand\nsearch for related objects\nwill also be performed for the dependent object within the current transaction.\nCheck algorithms and events may include settings that trigger actions on the interface.\nFind more about:\nrecycle bin\n;\ndeleting related objects\n;\nobject validations\n;\nobject lifecycle events\n;\nprimitive object\n.\nSaving object\nWhen saving an object that already exists in the system, the following sequence of actions is performed:\nAn object is saved to the database only if the transaction completes successfully. If any error occurs at any stage, the transaction is aborted, and all changes are rolled back.\nWhen saving a new object, the sequence of actions can be represented in the following diagram:\nEvent algorithms, validations, expressions, and autonumbering may include settings that trigger actions on the interface.\nFind more about:\nprimitive object\n;\ncreating an object type instance\n;\nexpressions/autocalculations\n;\nobject lifecycle events\n;\nobject validations\n;\nautonumbering\n;\nattribute settings\n.",
  "source": "https://docs.greendata.ru/platform/en/action_processing_order_when_working_with_object.html"
}