{
  "title": "Untitled",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nThis release version is outdated! Find the current version\nhere\n.\nRelease LTS.421.5 of August 1, 2024\nNew features\n1.\nThe new \"synchronizeDomainUsers\" function allows integrating the system with Microsoft Active Directory. It enables the option to synchronize data and domain users from an external provider.\n2.\nVirtual column registry set up was improved, possibility to add attributes from different object types was added.\nChanges and improvements\n\"Object chat\" widget\nwas improved;\nAdding existing attribute was improved, system remembers previously selected object types;\nSetting up\ntab\n’s name and color by algorithm was stabilized;\nRunning expressions when creating child objects was optimized;\nViewing algorithm’s service information is now available in \"Read\" mode;\nCreating and viewing new objects for\npermissions control of authorization object\ntype in\nfolder registry\nwas stabilized;\nAccessing object registry from created object type copy was stabilized;\nOpening\nmultiple choice object attribute\nby clicking on value was improved;\nSelecting attribute values in registry editing mode was stabilized;\nPreviewing and downloading files in completed task of business process was optimized and display of buttons in control panel of incoming and outgoing documents was improved;\nSearch filter’s reset values button’s functionality is now applied to search bar;\nReturning to previous page was stabilized;\nEdoc improvements: downloading and adding document to print in Review mod was stabilized, creating print form using algorithm, tagging users in comments, scrolling and working with document in multiple windows were improved;\nOperation of algorithms, authorization/registration page loading time and system notifications were improved;\n\"Algorithm. Random aggregation for a form cell\" and \"Algorithm. Aggregation by reporting form indicators\" object visuals were improved.\nRegistry column editing option was stabilized;\nBusiness process search bar was improved;\nupdateProviderUserData function was stabilized;\nDisplay of outgoing documents configured on stage was stabilized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.421.5-latest.html"
}