{
  "title": "Контроль пользователей в системе",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nКонтроль пользователей в системе\nВзаимодействие пользователя с системой сопровождается созданием сессии, в которой фиксируются следующие данные:\nпользователь\n;\nсотрудник\n;\nсетевой адрес входа;\nдата и время открытия сессии;\nдата и время последней активности;\nинформация об используемом браузере.\nС личными сессиями каждый пользователь может ознакомиться, выбрав в\nменю профиля пользователя\n\"Мои сессии\".\nУправление сессиями пользователей\nВозможность управления сессиями пользователей Системы доступна при наличии прав на выполнение разрешения\n\"Управление сессиями любых пользователей\"\n.\nУправление сессиями пользователей Системы необходимо выбрать пункт \"Мои сессии\" в\nменю профиля пользователя\n, в результате чего будет открыт реестр \"Управление сессиями\".\nПо умолчанию в реестре установлен фильтр по текущему пользователю. Для просмотра сессий всех пользователей Системы необходимо очистить фильтр:\nНад представленным реестром сессий располагаются следующие кнопки:\n— обновление списка сессий;\n— завершение выбранной сессии;\nПри удалении сессии отобразится модальное окно для выбора способа очистки:\nкнопка \"Отмена\" или закрытие модального окна — сессия не будет завершена;\nудалить только сессию — завершение выбранной сессии с сохранением возможности авторизации в приложении по данным, ранее сохраненным пользователем при помощи опции \"Запомнить меня\";\nочистить \"Запомнить меня\" — завершение выбранной сессии и удаление данных для авторизации, сохраненных при помощи опции \"Запомнить меня\".\nПри завершении сессии администратором пользователю будет отображено соответствующее уведомление, после чего будет произведен принудительный выход из системы и переход на страницу авторизации.\n— включение\nмонопольного режима\n.\nПри включенном монопольном режиме отображается кнопка для его отключения.\nДля отображения кнопки пользователь должен обладать разрешением\n\"Управление сессиями любых пользователей\"\n.\nМонопольный режим\nМонопольный режим — это особый режим работы приложения, который ограничивает доступ пользователей в приложение на период установки обновлений или каких-либо других технических работ с системой. Это позволяет приложению выполнять критически важные операции без вмешательства других процессов.\nПри установке монопольного режима будет произведен принудительный выход из системы для всех пользователей, не обладающих разрешением\n\"Управление сессиями любых пользователей\"\n, и вход в приложение будет ограничен на период работы монопольного режима.\nДля отключения монопольного режима в реестре сессий следует нажать на кнопку\n.",
  "source": "https://docs.greendata.ru/platform/ru/user-control-in-the-system.html"
}