{
  "title": "Templates for visual",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nTemplates for visual\nTemplates for visual\nare ready–made sets of interface elements that can be applied to an object profile as an initial setting of the visual. When further configuring the visual, the added set of elements can be changed or supplemented with the necessary elements.\nTypes of templates\nTemplates for visuals are presented on the \"Templates\" tab of the Elements panel, the template display includes the name of the template and its thumbnail.\nWhen setting up a visual, the user can use both a system template and create their own. It is recommended to create your own template if there is a typical layout that needs to be applied to profiles of different object types.\nThe list of system templates offers a choice of the following layout options:\n2 rows + 2 columns;\nheader + tab group;\nwith panel on the right;\nwith status bar.\nThe number of system templates may vary depending on the increase in System functionality.\nCreating custom template\nTo create your own template, follow the sequence of steps:\n1. customize the visual, the template of which needs to be created. It is important to keep in mind that the layout of the current visual will be saved in the template: groups, panels, widgets. Attributes and other settings (for example,\nvisual algorithms\n) are not saved to the template.\n2. On the \"Templates\" tab in the \"Custom\" section, click the add button, which is always located in place of the first template.\n3. In the modal window that opens, customize the template by adding:\nthe name of the template, the field can be filled in automatically;\nthe image of the template thumbnail, the acceptable format of uploaded files: JPEG, JPG and PNG.\nThe uploaded image will be displayed under the template settings:\nIf the image has not been uploaded, after saving the template, the thumbnail will look as shown below:\n4. Save the specified template settings\nThe created template will be saved on the \"Templates\" tab in the \"Custom\" section.\nEditing the template\nWhen hovering the mouse over the template thumbnail, a hover will appear in the upper right corner to edit the template or delete it. Clicking on the edit icon opens a window with the ability to change the name or thumbnail of the template. It is not possible to edit the visual in the template, to save the changed visual, a new template must be saved.\nApplying the template\nIt is not possible to insert a template as part of the customized visual, the template is applied to the entire visual.\nIf the template is selected, the visual will be cleared and replaced with the template.\nTo apply the template to the object profile, click on the selected template.\nThen the system will display the following notification:\nBy clicking \"No\" the visual will not be changed, by clicking \"Yes\" the current visual will be replaced by a set of template elements.",
  "source": "https://docs.greendata.ru/platform/en/templates-for-object-visual.html"
}