{
  "title": "\"Rating\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Rating\" widget\nThe\nRating widget\nis an interface tool that allows the user to conduct online voting to receive feedback. The widget accumulates the ratings of other users and contains a form for collecting reviews.\nExample of a customized widget:\nSetup\nBefore setting up the widget, create a new\nentity\nand proceed to creating instances for this object type.\nThe widget is added to the object profile in the\ninstance visual\nediting mode. When switching to the \"Widgets\" tab in the \"Elements\" panel, it is necessary to drag (Drag&Drop) the \"Rating\" widget from the \"Interactions\" section to the workspace.\nSettings\nTo further configure the widget, click\n, which opens a modal window.\nIn order to set up the widget:\nSelect a template or create a new one with widget display settings.\nTo create the template with display settings, click\nand fill in the following settings in the modal window that opens:\nSetting\nPurpose\nName\nEntering the name of the template.\nAllow to leave reviews\nChoosing the option to leave reviews. If the setting is active, the corresponding button will be available during the rating, when clicked, it will be possible to leave the review.\nExample\nThe parameter is active by default.\nAllow to respond to reviews\nChoosing the option to respond to reviews. If the setting is active, a response button will be available next to the review\n.\nExample\nThe parameter is available when the \"Allow to leave reviews\" option is active.\nAllow to leave reactions on reviews\nChoosing the option to leave reactions to reviews. If the setting is active, the corresponding\nand\nbuttons will become available next to the review.\nExample\nThe parameter is available when the \"Allow to leave reviews\" option is active.\nAdd advantages and disadvantages to the review\nChoosing the ability to add advantages and disadvantages to the review. If the setting is active, the review will consist of three fields: \"Advantages\", \"Disadvantages\" and \"Comment\", while all fields are required.\nExample\nThe parameter is available when the \"Allow to leave reviews\" option is active.\nShow reviews\nChoosing whether other users' reviews can be displayed. If the setting is active, the review history will be available with the option to sort it.\nExample\nThe setting is available when the \"Allow to leave reviews\" option is active.\nShow details\nChoosing the option for details If the setting is active, an area with statistics on the scores will be displayed..\nExample\nThe parameter is active by default.\nText asking to give a rating\nEntering the text of the hint, which will be located in the area to the left of the picker to give the score.\nExample\nNumber of decimal places for the score\nDetermining the number of decimal places when calculating the average score.\nBy default, the value is \"1\".\nRating below which a review is required\nChoosing the lowest score that does not require a review. If the rating is below the specified value, a mandatory field for entering a review will be displayed.\nExample\nBy default, the value is \"3\".\nThe parameter is available when the \"Allow to leave reviews\" option is active.\nSelect the created template or create the new template with scores.\nThe template is created by clicking\nwhich opens a modal window where the name of the template is specified.\nThen adjust the score titles. To create a score title, click\nand fill in the name, as well as the number of scores.\nThe maximum score (number of points) is 10.\nThe number of given scores determines the number of\ncharacters in the picker. The specified headers are used for clarity when displaying details.\nAfter saving the widget settings, the generated rating template will be displayed on the screen. The score set using the picker will be automatically saved in the System.\nIn the customized rating widget, the rating details are displayed in descending order of rating score (number of points).\nAs a result, users with \"Write\"\npermissions\nto instances of the object type in which the \"Rating\" widget is configured can give feedback by leaving reviews, scores and feedback.\nAfter users have given the score, they can delete it, leave the review or comment using the buttons:\nUsers also have the ability to edit\n, delete\nand comment\non the review:\nExample of the parameters:\nRating multiple items in one object profile\nIn the widget settings, it is impossible to determine the object for which the rating is performed.\nIf rating is required for different elements in the same profile, then separate templates with settings and scores for each element can be used.\nThus, it will be possible to leave different scores and reviews for each element separately.",
  "source": "https://docs.greendata.ru/platform/en/rating-widget.html"
}