{
  "title": "Release details, version LTS.441",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nRelease details, version LTS.441\nPatch LTS.441.4 of December 10, 2024\nNew features\nA new\nfeature to save entered data\nwhen closing an unsaved object profile was added.\nChanges and improvements\nIn registries, when activating the\nregistry edit mode\n, a tooltip now appears indicating the need to remove focus from the row to save the changes made.\nUpdate package LTS.441.3 of December 6, 2024\nNew features\n1. Users can now independently\ndefine\ntheir preferred method of object opening.\n2. Within an object profile, it is now possible to\nredefine the action\nof the \"Save\" button. For example, saving and exiting the profile in one click.\n1. In the registry editing mode, a new object can now be created by adding a new line, which optimizes the time for filling directories.\n2. It is now possible to create the condition tree-based data filtering directly in the object type registry.\nThe\n\"General search\" widget\nsettings were updated with the \"Search mode\" option that allows adjusting the search request using the keyboard.\nA new function,\ngetSignData\n, was introduced for retrieving certificate data used in visual stamps for PDF electronic signatures.\nWith the appropriate\npermissions\n, it is now possible to manage\nsessions\nof other users.\nAn option to display non-printing characters was added.\nThe maximum size of attached files was added.\n1. Users can now get to know all about GreenData directly from the Meeting room.\n2. Communication during\nGreenData Meet\nsessions was improved with the addition of camera, microphone, and audio device configuration options.\nUpdates with a large number of objects can now be formed via an API by specifying object IDs or fetching them from an SQL-based source.\nAdditionally, updates can now include only permissions without adding objects themselves.\nSending\nemail messages\nis now supported via the starttls protocol.\nIt is now possible to specify the response format as \"TEXT\" on both the data source and the data receiver from an external service.\nTimeouts for distributed ETL execution, including task acquisition and processing, can now be set via the\nconfiguration file\n.\nChanges and improvements\nThe option to create\nbidirectional relations\nbetween attributes with overridden types was improved;\nThe \"Choose instance type field\" option for all object attribute visuals was stabilized;\nThe process of saving objects with\nmultiselect attributes\nwas stabilized;\nThe object filtering in multiselect attributes with the active\n\"Selecting an object with a text element via a popup window\"\noption was improved;\nThe\n\"Use in Mobile App\"\noption was debugged;\nApplying the specified visual when opening the object profile via the action button was improved;\nSnapshot mode object displays were stabilized;\nThe possibility to preview .docx files was stabilized;\nThe process of redirecting users with the \"Back\" button after object deletion was improved;\nNow, if the current object is deleted via an action, users are redirected to the object registry without a page reload;\nThe data in the registry is now updated automatically.\nThe display of column filters in registries was stabilized;\nThe logic for displaying registries and opening visuals when clicking on the\nmain menu item\nwas improved ensuring compatibility with user access permissions;\nWhen configuring search filters in the registry or the \"Global search\" widget, users can now redefine the\naction on click\nwithin the search result area;\nThe ability to attach files to the hierarchical element in\n\"Explorer\" widget\nis now available only after saving;\nThe display of the\n\"Title by attribute\" widget\nwas stabilized to match the styles specified during configuration, and for the \"Time\" type attribute, the display of the attribute visual setting specified during configuration was adjusted;\nThe creation of percentage and monetary values in the\n\"Attribute table\" widget\nwas stabilized;\nStyling settings for attribute visual algorithms were debugged;\nThe\nautocalculation\nis now recalculated immediately after changing the value in the aggregation attribute or in cases when changing the values in attributes involved in the filtering algorithm;\nIn the\nCondition tree\n, filtering by specified types was added. Additionally, the creation of conditions with chained attributes and checking the conditions with an object, transferred through a parameter were stabilized;\nThe execution of algorithms that use bit operations and classes for working with dates was optimized;\nThe\nreportDatesBetween\nfunction in\nvisual algorithms\nwas stabilized;\nThe functionality of the newExcelWorkbook function was stabilized;\nThe display of the \"Confirm action\" button when deleting a dashboard was optimized;\nThe dashboard\ndrill-down\ndecryption was stabilized;\nThe transfer of\nsettings\nfor\nthe \"Linear chart\" analytical dashboard\nvia a GUF file was stabilized;\nThe business process launch was improved;\nObject processing based on schedules was improved for higher stability;\nThe user trying to access the \"Theme designer\" without \"Read\" permissions for theme instances will be redirected to the Start page;\nReport generation in the data source was stabilized;\nThe ability to export an object data source with a hidden field was stabilized;\nThe migration of\nupdates\nwith default values in print forms containing the\ncolor palette\nand algorithm in employee profile fields was stabilized;\nThe\nCI/CD\nupdate transfer security was improved;\nThe connection to an external database was stabilized;\nThe SSL configuration for establishing a secure connection within integration was stabilized;\nChecking for access permissions when working with SQL console was improved;\nThe application performance when updating the cache was optimized;\nCollaborating on the document in the EDoc was stabilized;\nIn the EDoc module, the application/rejection of edits was improved, including working with the bookmarks when loading a version of a document from a file;\nIn the Edoc module, the visibility of the \"Display comparison results with standard wording\" button now depends on the completion of the data source for value comparison;\nIn the Edoc module, the process of downloading documents from the PDF file preview was debugged;\nIn\nGreenData Meet\n, when creating a meeting, the display of a modal window for entering the username and room name was stabilized;\nIn the\nGreenData mobile app\n, push notifications are now displayed correctly when switching between applications or users;\nThe attribute in the \"Chatbot connection settings\" object type [SYS_CHATBOT_SETTINGS] was optimized.",
  "source": "https://docs.greendata.ru/platform/en/LTS.441.4-details.html"
}