{
  "title": "Источниковский атрибут",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nИсточниковский атрибут\nИсточниковский атрибут используется для ускорения работы нагруженных карточек.\nПримером является карточка Контрагента, включающая анкетные данные клиента. Эти данные отображаются посредством вычисления значений необходимых атрибутов в самом источнике.\nТаким образом,\nисточниковский атрибут только отображает значение\n, рассчитанное алгоритмом сложной логики на основе источника.\nЗначения источниковского атрибута\nне фиксируются в базе данных\n, но доступны для:\nотображения в карточках объектов, реестрах, алгоритмах;\nвсех видов фильтрации.\nВычисление (перерасчет) значения атрибута происходит в момент открытия карточки, выполнения алгоритма.\nДля настройки источниковского атрибута необходимо при\nсоздании атрибута\nактивировать переключатель \"На основе источника\" и заполнить следующие параметры:\nПараметр\nНазначение\nНаименование\nНазвание добавляемого атрибута.\nНаименование поля для таблицы\nНазвание атрибута для отображения в таблице базы данных.\nДопускается ввод наименования длиной не более 23 знаков, без пробелов и спецсимволов, состоящего из букв латинского алфавита, цифр и знаков подчеркивания, начинающегося с буквы.\nНаименование поля для таблицы не может содержать префикс SYS, WF, RF, RISK, ETL или FS, поскольку они зарезервированы исключительно для системных типов.\nС требованиями по идентификации атрибутов можно ознакомиться в\nстатье\n.\nВ\nSaaS и Private Cloud решениях\nпри активном сервисе перевода значение будет сгенерировано системой автоматически с возможностью ручной корректировки.\nВ\nOn-Premise решении\nданный функционал выполняется в соответствии с\nсистемными настройками переводчика\n.\nПравила формирования наименования поля для таблицы.\nсервис перевода применяется только для буквенных символов;\nпри генерации наименования поля для таблицы слова в словосочетании разделяются нижним подчеркиванием;\nспецсимволы в наименование поля для таблицы не добавляются;\nцифры, расположенные перед буквенными символами, отбрасываются, так как наименование поля для таблицы должно начинаться с буквы;\nцифры, размещенные после буквенных символов через пробел, добавляются через нижнее подчеркивание, при отсутствии пробела – слитно;\nесли в результате перевода длина наименования поля для таблицы превышает 23 символа, то осуществляется обрезка слова/словосочетания;\nпри создании атрибута типа \"Объект\" в наименовании поля для таблицы добавляется постфикс \"_ID\", атрибута типа \"Дата\" – \"_DATE\";\nесли сервис перевода недоступен, тогда поле остается пустым.\nТип\nОпределение типа данных при помощи выбора значения из выпадающего списка.\nВозможные значения типа атрибута\nцелое число;\nчисловой;\nденежный;\nлогический;\nобъект;\nдата;\nдата и время;\nвремя;\nстрока;\nфайл.\nПосле сохранения типа объекта допускается только следующая замена типа атрибута:\n\"Целое число\" → \"Числовой\"/\"Денежный\";\n\"Денежный\" → \"Целое число\"/\"Числовой\";\n\"Числовой\" → \"Целое число\"/\"Денежный\";\n\"Дата\" → \"Дата и время\";\n\"Дата и время\" → \"Дата\".\nПри смене типа атрибута \"Числовой\" на \"Целое число\" или \"Денежный\" на \"Числовой\" десятичные значения в данных будут утеряны.\nИсточник\nВыбор\nисточника данных на основе SQL\n.\nИсточник должен содержать 2 поля с точными наименованиями:\nID\n– код объекта, для которого будет рассчитано значение;\nVAL\n– используемое значение.\nВ источнике данных поиск производится по полю\nID\n. При наличии строки с искомым результатом Система возвращает значение, хранимое в поле\nVAL\n.\nИсточник данных должен возвращать\nне более одного\nзначения\nVAL\nдля каждого уникального\nID\n.\nВкладки\n\"Визуал\"\n,\n\"События\"\nи\n\"Дополнительное\"\nкарточки атрибута содержат параметры отображения атрибута и дополнительные настройки.\nВ случае добавления источниковского атрибута в тип объекта, необходимо дополнительно проверить его работу, смежных\nреестров\nи\nпроцессов ETL\n(при их наличии). В сложных расчетах\nисточниковские атрибуты должны использоваться с осторожностью\n.\nПример\nПри работе с Заявкой на принятие решения (далее, ЗПР) необходимо отобразить запрашиваемую сумму по всем рассматриваемым Вопросам группы компаний Клиента. Выборка членов группы компаний и их вопросов на рассмотрении может интенсивно нагружать Систему.\nПо этой причине необходимо задать расчет \"Суммы по всем рассматриваемым Вопросам группы компаний Клиента\" в источнике (Базе данных). Для этого необходимо определить атрибут \"Сумма вопросов на рассмотрении по ГК, руб\" как источниковский.\nИсточником для расчета значения будет являться SQL-запрос к Базе данных:",
  "source": "https://docs.greendata.ru/platform/ru/source-attribute.html"
}