{
  "title": "Виджет \"Статус бар\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Статус бар\"\nВиджет \"Статус бар\"\n— инструмент отображения хода маршрутного объекта бизнес-процесса.\nПример настроенного виджета:\nПо сравнению с виджетом\n\"Расширенный статус бар\"\nданный инструмент настраивается с помощью справочника, содержащего в себе список этапов, и алгоритма определения текущего этапа.\nНастройка\nДобавление виджета осуществляется в режиме редактирования\nвизуала экземпляра\n. На панели \"Элементы\" необходимо перейти на вкладку \"Виджеты\" и из раздела \"Процессы\" перетащить (Drag&Drop) в рабочую область карточки  виджет \"Статус бар\".\nПараметры\nПри нажатии на кнопку настройки откроется модальное окно, в котором представлены следующие параметры:\nПараметр\nНазначение\nНаполнение этапов\nБлок настроек, определяющих данные для этапов статус-бара.\nТип объекта для отображения статусов\nОпределение типа объекта, экземпляры которого будут использоваться в качестве этапов статус-бара.\nАлгоритм для получения текущего статуса\nАлгоритм определения текущего этапа. Алгоритм должен возвращать справочное значение из экземпляра выбранного типа объекта.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, создание нового или редактирование выбранного алгоритма возможно через меню действий параметра.\nПри создании нового алгоритма, в параметр \"Базовый тип объектов\" автоматически подставляется тип объекта, в объекте которого размещен виджет.\nДинамически формировать этапы статус бара\nПереключатель, при помощи которого определяется способ формирования этапов статус-бара.\nПри\nактивном\nпереключателе этапы статус-бара будут формироваться динамически в зависимости от заданных условий фильтрации.\nПорядок этапов в данном случае выстраивается в соответствии с последовательностью объектов в типе, выбранном в качестве значения параметра \"Тип объекта для отображения статусов\".\nДинамический способ формирования этапа позволяет редактировать и добавлять новые этапы статус-бара посредством настройки фильтра и в рамках типа объекта, используемого для получения статусов.\nДанный способ позволяет оптимизировать процесс правок при использовании типа объекта для получения статусов в большом количестве виджетов.\nПри\nнеактивном\nпереключателе этапы статус-бара настраиваются и редактируются статично в настройках виджета.\nПо умолчанию переключатель неактивен.\nВид фильтра\nОпределение способа фильтрации. Посредством переключателя типа radiobutton выбирается один из трех видов фильтра:\nАлгоритм фильтрации;\nSQL условие;\nДерево условий.\nПараметр доступен при активном переключателе \"Динамически формировать этапы статус бара\".\nАлгоритм для фильтрации данных\nОпределение алгоритма, при помощи которого будет осуществляться фильтрация экземпляров выбранного типа объектов, используемых для формирования этапов статус-бара.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, создание нового или редактирование выбранного алгоритма возможно через меню действий параметра.\nПри создании нового алгоритма, в параметр \"Тип объекта, элементы которого нужно отфильтровать\" автоматически подставляется значение, выбранное в настройках виджета в параметре \"Тип объекта для отображения статусов\".\nПараметр отображается в случае выбора вида фильтрации \"Алгоритм фильтрации\".\nФильтр на основе SQL\nОпределение фильтра на основе SQL с использованием источников данных, который будет регулировать перечень этапов статус-бара.\nВыбор ранее созданного фильтра осуществляется из выпадающего списка, создание нового или редактирование выбранного фильтра возможно через меню действий параметра.\nПри создании нового фильтра на основе SQL, в параметр \"Базовый тип объекта\" автоматически подставляется значение, выбранное в настройках виджета в параметре \"Тип объекта для отображения статусов\".\nПараметр отображается в случае выбора вида фильтрации \"SQL условие\".\nДерево условий\nНастройка фильтрации при помощи\nконструктора логических условий\n, который будет регулировать перечень этапов статус-бара.\nВыбор ранее созданного дерева условий осуществляется из выпадающего списка, создание нового или редактирование выбранного дерева условий возможно через меню действий параметра.\nПри создании нового дерева условий, в параметр \"Тип объекта, элементы которого нужно отфильтровать\"  автоматически подставляется значение, выбранное в настройках виджета в параметре \"Тип объекта для отображения статусов\".\nПараметр отображается в случае выбора вида фильтрации \"Дерево условий\".\nОтображать подпись к этапам\nПараметр управляет возможностью добавления текстовых подписей к отдельным этапам статус-бара.\nПри активном параметре в нижней части модального окна настроек для каждого этапа появится поле \"Подпись к этапу\" для выбора или создания экземпляра типа \"Шаблон текстового сообщения\" [SYS_TEMPLATE_TEXT_MSG].\nПодпись отображается под наименованием этапа и может содержать как статический текст, так и текст, сформированный с помощью алгоритма.\nПример настройки и отображения подписи к этапу.\nДопустим, в подписи к этапу требуется отобразить количество дней, затраченных на его выполнение.\nСформируем подпись посредством алгоритма, рассчитывающего разницу между датами при помощи функции\ngetWorkDatesBetween\n:\nВ результате чего под наименованием этапа появится настроенная подпись:\nПараметр доступен при выборе вида этапов \"Линейный\".\nОтображать счетчик этапов\nПараметр, при активном положении которого в правой части виджета отображается счетчик этапов в формате \"текущий этап/всего этапов\".\nПараметр доступен при выборе вида этапов \"Линейный\".\nОтображать дополнительную информацию\nПараметр управляет возможностью добавления дополнительной информации к отдельным этапам статус-бара.\nПри активном параметре в нижней части модального окна настроек для каждого этапа появится поле \"Дополнительная информация по этапу\" для выбора или создания экземпляра типа \"Шаблон текстового сообщения\" [SYS_TEMPLATE_TEXT_MSG].\nДополнительная информация отображается на боковой панели при клике по этапу и может содержать как статический текст, так и текст, сформированный с помощью алгоритма.\nПараметр доступен при выборе вида этапов \"Линейный\".\nСтиль\nБлок настроек, при помощи которых настраивается отображение этапов статус-бара.\nСтиль пройденного этапа\nВыбор цветового решения пройденных этапов.\nВыбор ранее созданного\nстиля форматирования\nосуществляется из выпадающего списка, создание нового или редактирование выбранного стиля возможно через меню действий параметра.\nПо умолчанию используется базовый стиль \"Стиль пройденного этапа. Блоки\".\nСтиль текущего этапа\nВыбор цветового решения текущего этапа.\nВыбор ранее созданного\nстиля форматирования\nосуществляется из выпадающего списка, создание нового или редактирование выбранного стиля возможно через меню действий параметра.\nПо умолчанию используется базовый стиль \"Стиль текущего этапа. Блоки\".\nСтиль предстоящего этапа\nВыбор цветового решения предстоящих этапов.\nВыбор ранее созданного\nстиля форматирования\nосуществляется из выпадающего списка, создание нового или редактирование выбранного стиля возможно через меню действий параметра.\nПо умолчанию используется базовый стиль \"Стиль предстоящего этапа. Блоки\".\nВыберите вид этапов\nВизуальное представление виджета. Возможные варианты:\nблоки;\nточки;\nлинейный.\nПо умолчанию установлен вид этапов \"Блоки\".\nСчитать последний этап завершенным\nПризнак, влияющий на отображение последнего этапа статус бара.\nВ случае прохождения всех этапов статус-бара:\nпри\nактивном\nпризнаке – к последнему этапу применяется стиль пройденного этапа;\nпри\nнеактивном\nпризнаке – к последнему этапу применяется стиль текущего этапа.\nПо умолчанию параметр активен.\nОбласть в нижней части модального окна настроек предназначена для:\nотображения макета динамически сформированного статус-бара\n– при активном переключателе \"Динамически формировать этапы статус бара\", корректной настройке фильтра и в случае наличия статусов, соответствующих условию фильтрации.\nЕсли фильтр настроен некорректно или в выбранном типе объекта для отображения статусов отсутствуют экземпляры, удовлетворяющие заданным условиям фильтрации, в данной области будет отображена подсказка – \"Не получилось отобразить список статусов\".\nнастройки этапов виджета\n– при неактивном переключателе \"Динамически формировать этапы статус бара\".\nВ данном случае необходимо добавить нужное количество этапов, указав для каждого соответствующее значение справочника, выбранного в параметре \"Тип объекта для отображения статусов\".\nКаждый статус может быть выбран только один раз.\nДля каждого этапа видов \"Блоки\" и \"Точки\" при нажатии на кнопку\nдоступны опции удаления и перемещения.\nПорядок этапов вида \"Линейный\" регулируется при помощи перетаскивания (Drag&Drop) строк посредством элемента\n.\nДля этапов\nвидов \"Блоки\" или \"Точки\"\nпо умолчанию наименованием устанавливается наименование выбранного объекта, которое можно заменить в рамках текущего статус-бара в поле \"Отобразить как\".\nПри настройке статус-бара\nвида \"Линейный\"\nс активными опциями \"Отображать подпись к этапам\" и \"Отображать дополнительную информацию\" в нижней части модального окна отобразятся поля \"Подпись к этапу\" и \"Дополнительная информация по этапу\", которые необходимо заполнить соответствующими данными.\nПример\nРассмотрим процесс настройки виджета на примере маршрута заявки при формировании  этапов статус-бара:\nСтатически.\nДинамически.\nДля настройки виджета потребуются:\nсправочник (тип объекта, экземпляры которого будут использоваться для отображения статусов виджета);\nалгоритм, содержащий id атрибута, в котором установлен статус маршрутного объекта;\nфильтр объектов справочника (алгоритм фильтрации, SQL условие или дерево условий) – в случае настройки динамического формирования этапов;\nстили форматирования\nэтапов – создаются при необходимости, могут использоваться базовые стили.\nДанные объекты системы могут быть подготовлены заранее или созданы в процессе настройки виджета.\nВ качестве справочника создадим тип объекта \"Состояния\" со следующим набором экземпляров:\nВиджет будем размещать в объекте типа \"Заявка\", в атрибутивном составе которого имеется объектный атрибут \"Состояние заявки\", ссылающийся на созданный справочник \"Состояния\".\nАлгоритм для определения текущего статуса маршрутного объекта примет вид:\nДалее в режиме редактирования\nвизуала экземпляра\nтипа \"Заявка\" необходимо из раздела \"Процессы\" вкладки \"Виджеты\" перетащить (Drag&Drop) в рабочую область карточки виджет \"Статус бар\".\nПо кнопке\nперейдем к настройке параметров.\nРассмотрим случай настройки\nстатического формирования этапов\n. Для этого укажем следующие параметры:\nВ данном случае для настройки стиля отображения этапов используются настройки по умолчанию.\nДалее можно приступить к настройке этапов виджета.\nДобавление этапов осуществляется по кнопке\n, для каждого добавленного этапа необходимо определить статус, выбрав значение в поле под этапом.\nПри необходимости можно изменить наименование этапа с помощью ввода значения в поле \"Отобразить как\".\nКаждый статус может быть выбран только один раз.\nВ настройках каждого этапа доступны опции удаления и перемещения этапов.\nПосле сохранения визуала в карточке объекта заявки отобразится настроенный статус-бар, отображающий текущий этап маршрутного объекта, определенный в атрибуте состояния объекта.\nРассмотрим случай настройки\nдинамического формирования этапов\n.\nДопустим, что тип объектов \"Состояние\" может содержать экземпляры для состояний различных типов объектов (в атрибутивный состав добавлен объектный атрибут, ссылающийся на тип \"Тип объекта\").\nВ случае динамического формирования этапов для того чтобы в статус баре были отображены только статусы типа \"Заявка\", потребуется настроить фильтр, например, при помощи следующего\nдерева условий\n:\nПри настройке виджета \"Статус бар\" следует указать следующие параметры:\nВ данном случае при настройке стиля отображения этапов изменен вид этапов, остальные настройки используются по умолчанию.\nВ нижней части модального окна отображен макет статус бара, этапы которого сформированы динамически в соответствии с фильтром дерева условий \"Фильтрация заявок\".\nПосле сохранения визуала в карточке объекта заявки отобразится настроенный статус-бар. Изменение текущего этапа маршрутного объекта осуществляется после выбора значения в атрибуте состояния объекта и сохранения карточки объекта.",
  "source": "https://docs.greendata.ru/platform/ru/status-bar-widget.html"
}