{
  "title": "Setting up access permissions for object type instances",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nSetting up access permissions for object type instances\nAn administrator can restrict users' permissions to work with specific object type instances. The settings determine which users can\ncreate\n,\nview\n,\nedit\n, and\ndelete\ninstances of a particular type.\nThe primary configuration is performed in the\nobject type profile\nby selecting a\npermission control type\nin the corresponding attribute.\nWhen creating a new object type with the \"Object\" [SYS_OBJECT] parent, \"System permission control\" is set by default. In other cases, the permission control is inherited from the parent type.\nWhen copying an object type, the permission control of the original type is preserved.\nThe System implements the following permission control types:\nPermission Control Type\nDescription\nRecommended Usage Scenario\nAll users have configured permissions for all instances of the type\nAccess\nto all instances\nis determined only by permission settings on the object type related to type instances. Permission differentiation between individual instances is not applied.\nUsed when there is no need to differentiate permissions between individual object type instances.\nAll users have read permission\nAllows configuring different permissions for\nediting\nand\ndeleting\ninstances. Meanwhile, the permission for\nreading\ntype instances is controlled by access permission settings on the object type.\nThis permission control type is a combination of \"All users have configured permissions for all instances of the type\" and \"System permission control\".\nApplied when it’s required to differentiate permissions for\nediting\nand\ndeleting\ninstances, but there’s no need to configure different\nread\npermissions for different object type instances.\nPermission control by condition tree\nAllows regulating user permissions for actions performed with type instances (\nreading\n,\nediting\n,\ndeleting\n,\ncreating\n), depending on dynamically changing attributes.\nApplied when it’s necessary to differentiate permissions to type instances among a large number of users and complex department structures. In this case, conditions can be set using \"authorization principals\" of any type, including chained ones.\nPermission control by assignees\nAllows differentiating access to object type instances depending on who is the responsible employee for the business process task. That is, only the\nuser with an active task\nfor it will be able to\nedit\nthe routing object profile.\nRecommended for use when there is a\nbusiness process\ntriggered by the object type and a need to differentiate permissions according to assigned tasks.\nPermission inheritance from related object\nAllows differentiating access to instances of the current object type based on access permissions to the\nrelated\nobject.\nTo define the related object, specify a\nmandatory\nobject singleselect attribute\nin the \"Attribute for permission inheritance\" field.\nUsed when\nrelated entities\nexist and there is a need to provide\nuniform access\nto them.\nPermission inheritance with system control\nAllows differentiating access to instances of the current object type based on access permissions to the\nrelated\nobject or when configured permissions exist for the object itself.\nTo define the related object, specify a\nmandatory\nobject singleselect attribute\nin the \"Attribute for permission inheritance\" field.\nThis permission control type is a combination of \"Permission inheritance from related object\" and \"System permission control\".\nUsed when\nrelated entities\nexist and there is a need to provide\nuniform access\nto them with the possibility of additional configuration of exclusive access to some instances.\nBy authorization objects\nAllows users to restrict actions performed on instances of the main type (\nread\n,\nedit\n,\ndelete\n,\ncreate\n), depending on the specific values of object attributes used in the type.\nUsed when it is necessary to configure permissions based on the values of\nobject attributes\n.\nSystem permission control\nAllows configuring the ability to\nread\n,\nedit\n, and\ndelete\neach instance separately.\nUsed when it is necessary to differentiate permissions for different instances.\nSystem permission control by group\nThe principle of operation of \"System permission control by group\" is similar to that of \"System permission control\" but is more optimal in terms of performance. Its only difference is that access permissions can be configured only for\naccess groups\n, not for individual users.\nUsed when it is necessary to differentiate permissions for different instances and there is a large number of users with the same roles (e.g., clients, customers, buyers).",
  "source": "https://docs.greendata.ru/platform/en/setting-up-permissions-for-object-type-instances.html"
}