{
  "title": "Системные настройки",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСистемные настройки\nОптимальная конфигурация платформы может настраиваться в соответствии с конкретными потребностями и требованиями. Эта возможность осуществляется через экземпляры системных типов, наследуемых от типа \"Системные настройки\" [SYS_SETTING].\nДля удобства, переход к настройкам следует осуществлять через специальный пункт меню, последовательно выбрав:\n\"Администрирование\"\n→\n\"Настройки\"\n→\n\"Системные настройки\"\n.\nНа открывшейся странице будет представлен реестр системных настроек, наименования которых отражают их функциональное назначение:\nдополнительно\n;\nзамещения\n;\nимпорт отчетности\n;\nинтеграция с почтовым сервисом\n;\nлогирование\n;\nмобильное приложение\n;\nнастройка чат-ботов\n;\nоформление\n;\nпереводчик\n;\nподключение сервиса выполнения Python скриптов\n;\nподключение сервиса распознавания\n;\nрасчетный модуль\n;\nрасширенные настройки для бизнес-процессов\n;\nсистемные уведомления\n;\nсоздание обновлений\n;\nэлектронная подпись\n.\nДанный список может быть дополнен путем создания прикладных/пользовательских настроек. Подробнее можно ознакомиться в статье\n\"Пользовательские системные настройки\"\n.\nСистемные настройки базовой поставки платформы – экземпляры типа \"Системные настройки\" [SYS_SETTING].\nСистемные пользовательские настройки – экземпляры типа \"Элемент системной настройки\" [SYS_SETT_ITEM].\nПри нажатии на объект, в правой части страницы отобразится боковая панель с параметрами выбранной настройки. После изменения значений параметров необходимо сохранить настройку нажатием на кнопку\n, расположенную на панели управления настраиваемого объекта.\nДля перехода к необходимой настройке можно воспользоваться строкой поиска:\nПредставленные результаты поиска отображают группы настроек, в которых найдено соответствующее значение.\nПосле изменения Системных настроек требуется\nобновить кэш\n.\nДополнительно\n\"Дополнительно\" – это экземпляр типа \"Дополнительные системные настройки\" [SYS_ADDITIONAL_SETTINGS], в котором собраны настройки, не относящиеся к какому-либо конкретному модулю Системы.\nПараметр\nНазначение\nОтдельный контекст сохранения для сохранений внутри ЖЦ\nСистема выполнит сохранения в жизненных циклах (в событиях объектах) в отдельной транзакции.\nПо умолчанию настройка неактивна.\nБлокировать предпросмотр PDF-документа\nЗапрет на\nпредпросмотр файлов\nформата PDF. При активной настройке нажатие на PDF-документ приведет к скачиванию файла.\nПо умолчанию настройка неактивна.\nБлокировать предпросмотр файлов с комментариями и/или исправлениями\nЗапрет на предпросмотр файлов формата *.docx, которые содержат комментарии и/или исправления, добавленные в сторонней программе.\nПри активной настройке в окне предпросмотра будет отображено соответствующее уведомление.\nИспользовать асинхронный режим выполнения операций\nВыполнение операций сохранения объектов и расчета алгоритмов в асинхронном режиме.\nПо умолчанию настройка неактивна.\nИспользовать часовой пояс сотрудника\nНастройка, при которой Система будет учитывать часовой пояс сотрудника, регламентировать расчет нормативного срока и уведомлений.\nПо умолчанию настройка неактивна.\nИспользовать потоковый экспорт\nНастройка, при которой Система позволяет эффективно экспортировать большие объемы данных. При этом экспорт выполняется без загрузки данных в память сервера.\nФункция работает для источников данных, дашбордов и реестров.\nПо умолчанию настройка активна.\nАдрес сервера приложений\nАдрес приложения в сети, используется для генерации ссылок на объекты Системы в отправляемых сообщениях.\nПо умолчанию заполняется адресом сервера приложений.\nМаксимальное количество элементов при выгрузке в excel\nНастройка ограничивает количество элементов при выгрузке в excel.\nЗначение по умолчанию 1000000.\nАнонимный вход\nНастройка, регулирующая возможность использования\nанонимного режима\nв Системе.\nДанная настройка синхронизируется с настройкой способа авторизации \"Анонимный вход\" в\nконструкторе страницы входа\n.\nКлюч для шифрования атрибутов\nКлюч для шифрования значений атрибутов при хранении в базе данных.\nШифрование применяется для атрибутов с активной настройкой \"Хранить в зашифрованном виде\".\nДанная настройка параметра доступна в\nдополнительных настройках атрибута\nтипа \"Строка\", \"Дата\", \"Дата и Время\", \"Время\", \"Целое число\", \"Денежный\", \"Логический\", \"Числовой\".\nЗначение ключа задается через экземпляр типа\n\"Секретная переменная\"\n.\nДля шифрования атрибутов в настройках секретной переменной должен быть активирован параметр \"Необходимо шифрование\".\nПри активации настройки атрибута \"Хранить в зашифрованном виде\" для шифрования используется значение параметра, заданное пользователем, иначе Система устанавливает секретную переменную с идентификатором [ENCODED_ATTR_KEY], при её отсутствии единый ключ для шифрования всех атрибутов создается Системой автоматически.\nПри замене значения ключа данные будут расшифрованы предыдущим ключом и зашифрованы новым.\nКлюч шифрования должен иметь длину 256 бит.\nЗамещения\n\"Замещения\" – это экземпляр типа \"Расширенные настройки для замещений\" [SYS_SUBST_SETTINGS], настройки которого позволяют оптимизировать процесс отработки\nзамещения\nза счет сокращения количества сохранений ответственных сотрудников.\nПараметр\nНазначение\nЗапускать замещение только по активным ответственным\nВ случае активной настройки при старте замещения происходит выборочное пересохранение ответственных [SYS_OBJ_RESP].\nПод выборку попадают ответственные в следующих случаях, когда ответственный сотрудник является:\nглобальным;\nлокальным с активным процессом, в рамках которого он является ответственным, то есть у атрибута \"Признак активности\" [IS_ACTIVE] в объекте установлено значение \"true\".\nИнформация о том, является ли ответственный сотрудник по маршрутному объекту локальным или глобальным, хранится в типе \"Ответственные сотрудники\"\n[SYS_OBJ_RESP]\n, в атрибуте \"Дополнительный объект\"\n[EXT_OBJ_ID]\n.\nВ указанный атрибут записывается\nссылка на экземпляр\n(\nподробнее об этом\n) бизнес-процесса.\nЕсли ответственный сотрудник является локальным, атрибут заполнен, если ответственный глобальный – атрибут пустой.\nПо умолчанию настройка неактивна.\nИмпорт отчетности\n\"Импорт отчетности\" – это экземпляр типа \"Расширенные настройки импорта отчетности\" [SYS_LOAD_FORM_SETTINGS], в котором хранятся настройки, связанные с модулем \"Импорт отчётности\".\nПараметр\nНазначение\nИспользовать асинхронную трансформацию форм отчетности\nПризнак выполнения трансформации форм отчетности асинхронно. При этом формируется очередь трансформаций в разрезе объекта, к которому прикреплены трансформируемые формы отчетности.\nПри активной настройке работа Системы в асинхронном режиме не представлена наглядно, но Система формирует соответствующее уведомление. Если настройка неактивна, тогда пользователю прежде чем продолжить работу с карточкой объекта, необходимо дождаться завершения запущенных процессов.\nПо умолчанию настройка активна.\nПроизводить поиск показателей по значению\nПоиск показателей по значению при импорте отчетности.\nПо умолчанию настройка активна.\nПерезатирать существующие данные при импорте\nПри активной настройке Система заменит исходные данные загружаемыми при импорте.\nПо умолчанию настройка неактивна.\nНастройки импорта банковской отчётности\nПрекращать импорт отчетности банков при обнаружении отсутствующего в системе счета\nПрекращение импорта отчетности при обнаружении отсутствующего в системе счета.\nПо умолчанию настройка неактивна.\nИмпортировать отчетность банков с проверкой на наличие счетов\nСписок идентификаторов отчетных форм для проверки на наличие счетов.\nЗначение по умолчанию – \"0409101;0409102\".\nИнтеграция с почтовым сервисом\n\"Интеграция с почтовым сервисом\" – это экземпляр типа \"Расширенные настройки интеграции с почтовым сервисом\" [SYS_EMAIL_SETTINGS], в котором определяются разрешенные сервера отправки электронных сообщений и настройки учетных записей электронной почты.\nПараметр\nНазначение\nРазрешенные сервера отправки\nСписок имен или IP-адресов серверов приложений, с которых может выполняться отправка уведомлений:\nесли поле пустое или содержит символ\n*\n, то отправка выполняется на любые сервера;\nдобавление конкретных IP-адресов или имен хостов ограничивает отправку только на указанные разрешенные сервера (IP-адреса и имена хостов перечисляются через \";\");\nпри вводе некорректного значения попытка отправки сообщений блокируется, что также влияет на использование соответствующих функций алгоритмов или настройку сервисных действий в бизнес-процессах.\nУчетная запись электронной почты\nНастройка взаимодействия с почтовым сервером, подробнее рассмотрено в статье\n\"Настройки для работы с почтовым сервером\"\n.\nЛогирование\n\"Логирование\" – это экземпляр типа \"Расширенные настройки логирования\" [SYS_LOG_SETTINGS], в котором осуществляются настройки логирования приложения.\nПараметр\nНазначение\nЛогирование сохраняемых данных\nЛогирование данных по объектам, передаваемых на сохранение.\nПо умолчанию настройка неактивна.\nЛогирование выполнения алгоритмов в базу данных\nВозможность сохранения данных отладки алгоритма в экземпляр типа \"Лог выполнения алгоритмов\" [SYS_WRITE_LOG] при вызове функции\nprintout\n.\nДля логирования выполнения алгоритма в базу данных помимо активации системной настройки необходимо логическому параметру функции\nprintout\nустановить значение\n\"true\"\n.\nПо умолчанию настройка неактивна.\nЛогирование почтовых отправлений из системы\nЛогирование в необъектную таблицу sys_email_log.\nЕсли настройка активна, то записи в таблицу sys_email_log\nне\nдобавляются.\nПо умолчанию настройка активна.\nУровень логирования прикладного протокола\nНастройка для управления детальности записи в лог пользовательских событий.\nВозможные значения системной настройки:\nERROR — уровня критичности, при котором в логе фиксируются только ошибки;\nWARNING — уровня критичности, при котором в логе фиксируются предупреждения и ошибки;\nINFO — уровня критичности, при котором в лог записывается полная информация (по этапам, предупреждениям, ошибкам).\nДетальность записи в лог событий \"ДО. Сервис. Вычисление значения атрибута\" и \"ДО. Сервис. Установить значение атрибута\" реализуется при значении системной настройки\nINFO\n.\nДетальность записи в лог события \"ДО. Сервис. Запустить алгоритм\" может регулироваться значением системной настройки (ERROR/WARNING/INFO) или функцией\nwriteWfLog\n.\nЕсли уровень критичности не указан или введено некорректное значение, тогда запись в протокол производится не будет.\nПо умолчанию используется значение \"ERROR\".\nОграничение размера лога выполняется из файла app-service.xml правкой параметра:\nDlogback.property.max_file_size\n=<размер в байтах>\nНастройка ограничивает размер лога в каждом файле. В случае, если лог начинает превышать указанный размер, создается следующий файл и т.д.\nМобильное приложение\n\"Мобильное приложение\" – это экземпляр типа \"Расширенные настройки для мобильного приложения\" [SYS_MOBILE_SETTINGS], в котором хранятся настройки, связанные с\nмобильным приложением\n.\nПараметр\nНазначение\nИдентификатор типа для фильтрации списка контактов\nИдентификатор типа со списком сотрудников для отображения в кастомном пункте меню \"Контакты\" (поддерживается только в iOS).\nСписок ролей для отслеживания маршрута следования\nСписок ролей пользователей (идентификаторов групп доступа), для которых Система будет отслеживать маршрут следования (поддерживается только на Android).\nРасположение меню в мобильном приложении\nВид меню, отображаемый в мобильном приложении для новых пользователей по умолчанию.\nВозможные варианты:\nбыстрое меню внизу экрана;\nменю по кнопке бутерброд.\nПо умолчанию используется значение \"Меню по кнопке бутерброд\".\nДоступен переход в браузер\nПараметр отвечает за видимость пункта меню \"Перейти в браузер\" в\nмобильном приложении GreenData\n(поддерживается только на Android).\nПри активной настройке пункт меню \"Перейти в браузер\" будет отображен, при неактивной – скрыт.\nПо умолчанию настройка активна.\nДоступна отправка логов\nПараметр отвечает за видимость настройки \"Отправить лог работы\" в пункте меню \"Настройки\"\nмобильного приложения GreenData\n.\nПо нажатию на настройку \"Отправить лог работы\" открывается модальное окно для выбора приложения на мобильном устройстве пользователя, в которое будет отправлен файл с логом работы в формате *.txt.\nЕсли системная настройка активна, то в настройках мобильного приложения будет доступна отправка лога работы, если неактивна, то скрыт.\nПо умолчанию настройка активна.\nНастройка панели инструментов стартовой страницы\nДанный блок параметров отвечает за размещение кнопок в хедере стартовой страницы мобильного приложения.\nЗдесь можно добавить, удалить, заменить кнопки и настроить их порядок.\nПри  нажатии на кнопку \"Добавить\" добавляется строка для настройки, в которой необходимо выбрать пункт меню и иконку будущей кнопки.\nРанее созданный пункт меню может быть выбран из выпадающего списка, создание нового пункта меню возможно через меню действий параметра.\nВ панель инструментов можно добавить максимум три кнопки.\nПорядок кнопок регулируется при помощи перетаскивания (Drag&Drop) строк настройки посредством элемента\n.\nПо умолчанию в панели инструментов стартовой страницы добавлены кнопки для перехода в пункты меню \"Чаты\", \"Задачи\" и \"Профиль\".\nНастройка чат-ботов\n\"Настройка чат-ботов\" – это экземпляр одноименного типа объекта [SYS_CHATBOT_SETTINGS], в котором хранятся настройки подключения чат-ботов для автоматизации взаимодействия с пользователями.\nПараметр\nНазначение\nНастройки подключения чат-бота для Telegram\nTelegram Token\nТокен\n, полученный при создании telegram-бота.\nЗначение токена задается посредством создания экземпляра типа\n\"Секретная переменная\"\n.\nПри отсутствии значения параметра после сохранения настроек чат-бот будет отключен.\nТокен аутентификации сервиса TG\nТокен аутентификации сервиса Greendata-CRM.\nЗначение токена задается посредством создания экземпляра типа\n\"Секретная переменная\"\n.\nВ качестве значения может быть использован hook токен пользователя, процесс создания которого описан в статье\n\"Создание пользовательского токена\"\n.\nПри отсутствии значения параметра после сохранения настроек чат-бот будет отключен.\nПользователь токена должен быть включен в группу доступа \"Административная группа\" [ROLE_ADMIN].\nЯзык ответов чат-бота\nЯзык, на котором осуществляется отправка сообщений чат-бота.\nЗначение параметра выбирается при помощи выпадающего списка из доступных\nязыков интерфейса\n.\nПо умолчанию используется язык из базы данных.\nВключить чат-бота\nВключение чат-бота для работы по сценарию, настроенному с помощью дерева решений.\nДерево решений\nДерево решений\nдля работы чат-бота. Выбор осуществляется из экземпляров типа \"Чат-бот. Дерево решений\" [BOT_DECISION_TREE].\nПараметр доступен при активной настройке \"Включить чат-бота\".\nПри нажатии на кнопку осуществляется синхронизация дерева решений с чат-ботом.\nКнопка доступна после выбора дерева решений.\nИИ ассистент\nБлок содержит настройки подключения ассистента на базе искусственного интеллекта, предназначенного для консультации пользователей по функциональным возможностям Системы.\nВ\nSaaS и Private Cloud решениях\nИИ ассистент активирован по умолчанию и работает на базе знаний\nWiki\n.\nДля включения ассистента в\nOn-Premise решении\nнеобходимо задать соответствующие\nпараметры в конфигурационном файле\n.\nДля подключения ассистента с собственной базой знаний необходимо нажать на кнопку\nво встроенном реестре и заполнить параметры настройки (подробнее в\nстатье\n).\nС примером настройки чат-бота можно ознакомиться в статье\n\"Настройка чат-бота для технической поддержки интернет-провайдера\"\n.\nОформление\n\"Оформление\" – это экземпляр типа \"Расширенные настройки оформления\" [SYS_DESIGN_SETTINGS], в котором хранятся настройки, связанные с оформлением компонентов Системы.\nПараметр\nНазначение\nНастройки общего оформления\nОткрывать гиперссылки в модальном окне\nОткрытие гиперссылок по клику в модальном окне.\nПри активной настройке гиперссылка открывается в модальном окне, при неактивной – в новой вкладке текущего браузера.\nПо умолчанию настройка активна.\nОтображать пользователей, редактирующих карточку объекта\nОтображение иконок пользователей, редактирующих карточку объекта, в верхнем правом углу.\nПо умолчанию настройка неактивна.\nОтображать индикацию изменений в объекте\nОтображение\nсостояния объекта\nв зависимости от вносимых пользователем изменений.\nПри активном переключателе в\nнавигационной панели\nили в шапке модального окна (в зависимости от режима открытия объекта) будет отображаться одно из следующих состояний изменения объекта:\nнет изменений – при отсутствии изменений в объекте;\nошибка сохранения – индикация в случае ошибки сохранения изменений, например, если есть обязательные незаполненные поля;\nсохранение – состояние, когда осуществляется сохранение объекта;\nвнесение изменений – индикация, которая показывает наличие несохраненных изменений в объекте.\nПри изменениях, вносимых в объект другим пользователем, индикация для текущего пользователя не отображается.\nПо умолчанию настройка неактивна.\nИспользовать простой режим работы\nВизуальное скрытие технических полей настроек.\nПо умолчанию настройка неактивна.\nСхема графического интерфейса пользователя по умолчанию\nТема, устанавливаемая новому пользователю по умолчанию.\nЗаполняется автоматически названием темы, выбранной по умолчанию в настройках\nконструктора тем оформления\n.\nНастройки оформления главного меню\nРасширять главное меню при наведении мыши\nВозможность автоматического раскрытия меню в полноразмерный режим из сокращенного при наведении курсора мыши. Подробнее о возможных видах\nглавного меню\n.\nПо умолчанию настройка неактивна.\nМаксимальная ширина главного меню\nМаксимальная ширина главного меню в px.\nЗначение по умолчанию – 349.\nНастройки оформления атрибутов\nИндикация количества символов в многострочных полях\nОтображение количества введенных и доступных символов в многострочном строковом поле.\nПри активной настройке под строковым полем отобразится запись с указанием количества введенных символов из допустимых 2000 (например, \"\n145 / 2000\n\").\nРазмер шрифта записи 12 px, цвет – #b3b3b3.\nПо умолчанию настройка неактивна.\nПомечать атрибуты, значения которых могут быть рассчитаны на сервере\nСистема визуально выделит атрибуты, для которых задано вычислимое выражение (т.е. когда значение атрибута рассчитывается по формуле).\nПо умолчанию настройка активна.\nВид комментария к атрибуту\nСпособ отображения комментария к атрибуту.\nВозможные варианты:\nмногострочный ввод;\nтекст с поддержкой сложного форматирования.\nПо умолчанию используется \"Текст с поддержкой сложного форматирования\".\nНастройки оформления реестров\nСохранять сортировку реестра автоматически при её изменении\nСохранение пользовательской фильтрации и сортировки реестра в случае её изменения при обновлении вкладки браузера.\nПо умолчанию настройка неактивна.\nПорядок кнопок для редактирования объектов\nПорядок системных кнопок, определяющих способ открытия объекта:\nnewWindow (в новом окне);\nmodal (в модальном);\nthisWindow (в текущем).\nСпособ открытия объекта может быть переопределен в\nнастройках конкретного реестра\n.\nНастройки, указанные пользователем в пункте\n\"Настройки оформления реестра\"\nменю профиля пользователя, имеют приоритет над данной системной настройкой.\nЗначение по умолчанию: [\"thisWindow\", \"newWindow\", \"modal\"]\n.\nПорядок кнопок для редактирования объектов (дочерние объекты)\nПорядок системных кнопок, определяющих способ открытия объекта в дочерних атрибутах:\nnewWindow (в новом окне);\nmodal (в модальном);\nthisWindow (в текущем).\nСпособ открытия объекта в дочерних атрибутах может быть переопределен в\nнастройках конкретного реестра\n.\nНастройки, указанные пользователем в пункте\n\"Настройки оформления реестра\"\nменю профиля пользователя, имеют приоритет над данной системной настройкой.\nЗначение по умолчанию: [\"modal\", \"thisWindow\", \"newWindow\"]\n.\nВид реестра задач по умолчанию\nВид\nреестра задач\n, открываемый по умолчанию.\nПрименяется для реестров типа \"ДО\". Задачи на процессе\" [WF_PROCESS_TASK] и его дочерних типов, включая\nвиджет \"Реестр задач\"\n.\nВозможные варианты:\nКалендарь;\nТаблица.\nВ\nнастройках\nотдельного реестра вид реестра по умолчанию может быть переопределен.\nПо умолчанию используется значение \"Календарь\".\nПереводчик\n\"Переводчик\" – это экземпляр типа \"Настройки переводчика\" [SYS_TRANSLATOR_SETTINGS], в котором настраивается возможность автоматической генерации наименований таблиц и полей для таблиц.\nНастройки задаются при развертывании платформы на\nOn-Premise решении\n.\nПараметр\nНазначение\nТип переводчика\nВыбор типа переводчика, который определит необходимость и способ автоматической генерации наименований таблиц и полей для таблиц.\nДопустимые варианты:\n\"Переводчик по словарю\" — вариант для перевода при помощи словаря, сохраненного в системе;\n\"Яндекс Переводчик\" — Яндекс сервис перевода. Если сервис недоступен, то перевод не осуществляется.\nЕсли настройка не задана, то автоматическая генерация наименований таблиц и полей для таблиц не производится.\nПо умолчанию используется \"Переводчик по словарю\".\nСловарь\nТип объекта, экземпляры которого используются для перевода.\nЗначение параметра устанавливается Системой — \"Русско-английский словарь\" [SYS_DICT_RU_EN].\nСловарь состоит из базы терминов, которая может быть расширена пользователем.\nПри создании новых экземпляров пользователю необходимо указать русское и английское слова, при этом начальная форма слова (лемма) будет заполнена Системой автоматически.\nПри создании дубликата значение экземпляра будет перезаписано.\nПараметр отображается при настройке переводчика по словарю.\nПрименять транслитерацию для слов, отсутствующих в словаре\nУправляет обработкой слов, которые не найдены в словаре.\nПри активной настройке отсутствующее в словаре слово будет заменено на его транслитерацию, при неактивной — перевод не осуществляется.\nПри обработке словосочетаний: найденные слова переводятся, отсутствующие в словаре обрабатываются в соответствии с заданной настройкой.\nПо умолчанию настройка неактивна.\nПараметр отображается при настройке переводчика по словарю.\nAPI адрес переводчика\nАдрес сервиса перевода.\nПараметр отображается при настройке Яндекс переводчика.\nAPI ключ переводчика\nКлюч для аутентификации в сервисе перевода.\nЗначение токена задается посредством создания экземпляра объекта типа\n\"Секретная переменная\"\n.\nПараметр отображается при настройке Яндекс переводчика.\nТаймаут подключения, мс.\nВремя ожидания соединения с сервисом, указанное в миллисекундах.\nПо умолчанию используется значение 2000.\nПараметр отображается при настройке Яндекс переводчика.\nТаймаут чтения, мс.\nВремя ожидания ответа от сервиса, указанное в миллисекундах.\nПо умолчанию используется значение 2000.\nПараметр отображается при настройке Яндекс переводчика.\nПодключение сервиса выполнения Python скриптов\n\"Подключение сервиса выполнения Python скриптов\" – это экземпляр типа \"Настройки подключения сервиса выполнения Python скриптов\" [SYS_GREENPY_SETTINGS], в котором хранятся настройки, относящихся к модулю Python.\nПараметр\nНазначение\nАдрес сервиса выполнения Python скриптов\nВыполнение Python скриптов осуществляется Системой на сервере по указанному адресу.\nПуть до директории общего доступа\nДля корректного выполнения Python скриптов необходимо указать путь к папке общего доступа, настроенной между\nсервисом GreenPy\nи приложением GreenData, из которого Python скрипт будет читать и записывать файлы.\nПодключение сервиса распознавания\n\"Подключение сервиса распознавания\" – это экземпляр типа \"Настройки подключения сервиса распознавания\" [SYS_FILE_RECOG_SETTINGS], в котором осуществляется настройка подключения к сервисам распознавания речи в голосовых сообщениях, аудио- и видеофайлов.\nПараметр\nНазначение\nРаспознавание файла. URL\nСсылка на сервис распознавания отчетности.\nРаспознавание файла. Идентификатор БД\nИдентификатор БД, используемый для распознавания отчетности.\nПо умолчанию используется значение prod.\nДля возможности исключения использования этого сервиса из чужого аккаунта рекомендуется указать защитный идентификатор формата prod@guid/guid.\nРаспознавание аудио и видео\nТокен для подключения к сервису транскрибации\nТокен\nдля аутентификации сервиса распознавания речи.\nЗначение токена задается посредством создания экземпляра объекта типа\n\"Секретная переменная\"\n.\nВключить сервис транскрибации\nАктивация сервиса распознавания речи для возможности транскрибации голосовых сообщений, аудио- и видеофайлов в\nGreenData Messenger\n.\nПараметры подключения к сервису распознавания речи задаются в\nконфигурационном файле приложения\n.\nПри активном сервисе транскрибации в области голосовых сообщений и сообщений, содержащих аудио- или видеофайл, будет доступна кнопка\n. По нажатию на данную кнопку результат транскрибации будет представлен в выпадающем блоке\n\"Полное содержание\"\n.\nПри выключенном сервисе транскрибации кнопка\nбудет отображаться в заблокированном виде для пользователя с правом на действие \"Выполнение\"\nразрешения\n\"Технические операции\" [TECHNICAL_OPERATIONS].\nСервис суммаризации (LLM)\nТокен для подключения к сервису суммаризации\nТокен\nдля аутентификации сервиса суммаризации.\nЗначение токена задается посредством создания экземпляра объекта типа\n\"Секретная переменная\"\n.\nВключить сервис суммаризации\nАктивация сервиса по формированию краткого содержания голосовых сообщений, аудио- и видеофайлов в\nGreenData Messenger\n.\nПараметры подключения к сервису суммаризации задаются в\nконфигурационном файле приложения\n.\nЕсли активны оба сервиса – транскрибации и суммаризации, то в области голосовых сообщений и сообщений, содержащих аудио- или видеофайл, будет доступна кнопка\n. По нажатию на данную кнопку результат суммаризации будет представлен в выпадающем блоке\n\"Краткое содержание\"\n.\nЕсли сервис транскрибации неактивен, то просмотр результата суммаризации недоступен.\nПри выключенном сервисе суммаризации, но включенном сервисе транскрибации блок \"Краткое содержание\" будет отображаться в заблокированном виде для пользователя с правом на действие \"Выполнение\"\nразрешения\n\"Технические операции\" [TECHNICAL_OPERATIONS].\nРасчетный модуль\n\"Расчетный модуль\" – это экземпляр типа \"Расширенные настройки расчетного модуля\" [SYS_CALCIND_SETTINGS], в котором хранятся настройки, относящиеся к расчетному модулю.\nПараметр\nНазначение\nИспользовать арабские цифры вместо римских в названиях кварталов\nИспользование цифр в названиях кварталов при работе с отчетными формами:\nарабские цифры – при активной настройке;\nримские цифры – при неактивной настройке.\nПо умолчанию настройка неактивна.\nРасширенные настройки для бизнес-процессов\n\"Расширенные настройки для бизнес-процессов\" – это экземпляр одноименного типа объектов [SYS_WF_SETTINGS], в котором хранятся настройки, относящиеся к модулю WorkFlow.\nПараметр\nНазначение\nИспользовать синхронный режим трассировки\nВыполнение Системой каждого этапа/операции только после завершения предыдущего.\nНапример, завершенная пользователем задача будет дожидаться завершения всех сервисных действий, расположенных после, блокируя дальнейшие действия пользователя.\nПо умолчанию настройка активна.\nИспользовать асинхронный пересчёт просрочек по нормативным срокам\nАсинхронный режим пересчета нормативных сроков.\nПо умолчанию настройка активна.\nРазрешить блокировку экземпляра процесса во время выполнения перехода\nСистема заблокирует экземпляр в БД для того, чтобы избежать одновременного выполнения трассировки в разных потоках по одному и тому ж маршруту.\nПо умолчанию настройка активна.\nНе рекомендуется отключать настройку.\nОткрывать назначенную задачу в модальном окне\nСпособ открытия назначенной задачи по клику (кнопка в уведомлении). При активной настройке открытие осуществится в модальном окне, при неактивной – в новой вкладке текущего браузера.\nПо умолчанию настройка активна.\nРазрешить использование связанных пользователей\nСистема определит доступные права на маршрутный объект и ответственных по задаче, с учетом связанных пользователей из разных систем.\nПо умолчанию настройка неактивна.\nСистемные уведомления\n\"Системные уведомления\" – это экземпляр типа \"Расширенные настройки системных уведомлений\" [SYS_NOTIF_SETTINGS], при помощи которого регулируются настройки системных уведомлений.\nПараметр\nНазначение\nДлительность показа уведомлений\nДлительность отображения всплывающих сообщений в секундах.\nПрименяется для всплывающих уведомлений на синем или зеленом фонах, а также для\nнастраиваемых сообщений\n.\nЗначение по умолчанию – 5.\nОтображать сообщения об обновлении объекта\nОтображение автоматического уведомления после обновления объекта.\nПо умолчанию настройка активна.\nУведомлять по почте при упоминании в комментариях EDoc\nОповещение пользователей по электронной почте при упоминаниях в комментариях EDoc.\nШаблон уведомлений при упоминаниях в комментариях\nВыбор\nшаблона уведомления\n, по которому формируется уведомление пользователю при упоминаниях в комментариях EDoc.\nВыбор осуществляется посредством выпадающего списка из экземпляров типа \"Шаблон уведомления\" [SYS_EMAIL_NOTIFICATION].\nВключить отображение последнего входа при авторизации\nОтображение уведомления с информацией о дате и времени последнего входа в Систему.\nЕсли настройка активна, при входе пользователя в Систему отобразится уведомление следующего формата:\nПо умолчанию настройка неактивна.\nСоздание обновлений\n\"Создание обновлений\" – это экземпляр типа \"Расширенные настройки создания обновлений\" [SYS_GUF_SETTINGS], в котором хранятся настройки, относящиеся к формированию файлов обновлений.\nПараметр\nНазначение\nФормировать обновления в усеченном режиме\nНастройка, при которой Система исключит иерархию в типах, атрибуты-дочерние объекты, связи вычислимых показателей и алгоритмов, формулы алгоритмов, иерархию в данных из обновления.\nПо умолчанию настройка неактивна.\nВключать подпроцессы в гуф с бизнес-процессом\nОпределение режима сбора бизнес процесса в файл для\nобновления\nСистемы (*.guf).\nПри активной настройке осуществляется автоматическое добавление подпроцессов основного процесса в создаваемое обновление, при неактивной – без подпроцессов.\nПо умолчанию настройка неактивна.\nЭлектронная подпись\n\"Электронная подпись\" – это экземпляр типа \"Расширенные настройки электронных подписей\" [SYS_SIGNATURE_SETTINGS], в котором хранятся настройки для ЭП.\nПараметр\nНазначение\nФоновое изображение по умолчанию\nДанная настройка позволяет задать фоновое изображение для электронной подписи.\nВыполнять полную проверку подписи при подписании файлов\nПолная проверка электронной подписи при подписании файлов.\nПо умолчанию настройка неактивна.",
  "source": "https://docs.greendata.ru/platform/ru/system-settings.html"
}