{
  "title": "Проверка подписи файла",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nПроверка подписи файла\nПри подписании файла электронной подписью система может выполнять проверку подписи в соответствии с установленными настройками.\nПодписание документов реализуется по нажатию на кнопку через настроенное действие, например,\n\"Подписать файл (ПЭП)\"\n.\nПроверка подписи настраивается через параметры объекта типа \"Вид подписи файла\" [FS_FILE_SIGN_KIND]:\nПараметр\nНазначение\nНаименование\nНаименование вида подписи.\nИдентификатор\nВвод уникального идентификатора создаваемого объекта настройки.\nНастройки повторной подписи файла\nБлокировать подписание одним подписантом файла несколько раз\nПризнак, определяющий возможность многократного подписания файла одной валидной подписью.\nПри установке значения \"Нет\" пользователь сможет подписать файл одной валидной подписью несколько раз.\nВ случае выбора значения \"Да\" пользователь сможет подписать файл одной подписью только один раз.\nАлгоритм времени блокировки подписи файла одним сертификатом несколько раз\nИспользуется для блокировки возможности подписания файла на определенное время.\nАлгоритм должен определять количество минут, в течение которых запрещено повторное подписание файла. В случае работы с несколькими подписями, пользователь может подписать файл каждой из них.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nПараметр доступен при неактивном признаке \"Блокировать подписание одним подписантом файла несколько раз\".\nНастройки подписи файла\nНастройка проверки подписей файлов\nНастройка проверки подписей файлов на отозванность и квалифицированность.\nВ объекте данных настроек устанавливаются значения логических параметров \"Проверять сертификат на отозванность\", \"Проверять сертификат на квалифицированность\" – \"Да\"/\"Нет, и отображаются/прикрепляются файлы доверенных корневых сертификатов.\nВыбор ранее созданного объекта настройки осуществляется из выпадающего списка, добавление нового объекта доступно через меню действий параметра.\nАлгоритм проверки подписи\nАлгоритм, при помощи которого задается условие проверки подписи.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, добавление нового\nалгоритма\nдоступно через меню действий параметра.\nАлгоритм должен возвращать объект типа \"Справочник результатов проверки ЭЦП\" [FS_FILE_SIGN_CHECK].\nВ объектах типа \"Справочник результатов проверки ЭЦП\" задается текст и цвет фона проверки подписи, используемые при отображении информации о подписях.\nПри подписании документа результат проверки:\nотображается при просмотре информации о подписях:\nОтображение кнопок работы с атрибутом типа \"Файл\" зависит от\nвизуала атрибута\n.\nфиксируется в реестре типа \"Результат верификации электронной подписи\" [FS_SIGN_VERIFY_RESULT]:\nНа отображение информации о подписях могут повлиять изменения значений следующих параметров:\n\"Результат проверки ЭП\" – объект типа \"Справочник результатов проверки ЭЦП\" [FS_FILE_SIGN_CHECK], определяющий текст и цвет фона результата проверки подписи;\n\"Сертификат квалифицированный\" – логический параметр, определяющий надпись в заголовке подписи файла.\nПри выборе значения \"Да\" отображается \"Сертификат квалифицированный\", при установке значения \"Нет\" или отсутствии значения – \"Сертификат не квалифицированный\".",
  "source": "https://docs.greendata.ru/platform/ru/file_signature_verification.html"
}