{
  "title": "extObjects",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nextObjects\nReturns the object collection of the selected GreenData app that provided access to data.\nTo use the function, a connection to the external application must be configured. For more details, see the article \"\nIntegration between platform applications\n\".\nSyntax\nextObjects\n(connectObj, typeIdObj, attr)\nParameter\nPurpose\nconnectObj\nObject containing the settings for the connection to the external application.\nThe value must be an instance of the \"External Application Connection\" [SYS_CONNECTION_EXT] object type.\nFor more details on creating a connection, refer to the article \"\nIntegration between platform applications\n\".\ntypeIdObj\nObject type from the external application whose collection of objects needs to be retrieved.\nattr\nSelecting of an attribute of the specified object type, the value of which needs to be retrieved or modified.\nNote\nThe function is called from the\n\"Sources\"\ntab of the algorithm editor toolbar, resulting in a modal window opening for parameter selection.\nSelecting the object type and its attributes becomes available after choosing the object with settings for the connection to the external application.\nUse examples\nExample 1\nFor example the goal is to configure the ability to manage product pricing in\nApplication B\nfrom\nApplication A\n.\nIn\nApplication B\n, a custom token is created in the user card of a user with permission to edit instances of the \"Catalog\" type. This token will be used in\nApplication A\nwhen creating the connection to the\nexternal application\n.\nAssume that for a sale, the price for all items in the \"Catalog\" type needs to be set to \"999\".\nFor this action, it is not necessary to have synchronized object types with the same UUID.\nAn algorithm created in\nApplication A\ncan take the following form:\nSee more\nvar\nfor defining a variable;\nforEach\nfor implementing a loop through the collection of \"Catalog\" type objects;\nattrByVar\nfor changing the price of items;\nsave\nfor saving the changed object in the\napplication B\n.\nAs a result of the algorithm’s execution, the prices of all objects in the \"Catalog\" object type of\nApplication B\nwill be changed:\nExample 2\nHowever, if within the simplified integration, the values of a specific product need to be changed, for example, items named \"T-shirt,\" the algorithm will be as follows:\nUnlike Example 1, this algorithm uses the\nfilterAlg\nfunction to configure filtering by the \"Name\" attribute.\nWhen using a filtering algorithm based on attributes of the parent type \"Object\" (Name, ID, Create date, etc.), synchronization of object type data is not required.\nWhen using a filtering algorithm based on non-parent type attributes, the extObjects function allows accessing the attribute values of the external application’s object type only if the object type data is synchronized (the object types must have identical UUIDs).\nAs a result of the algorithm’s execution, in the \"Catalog\" object type of\nApplication B\n, only the prices of instances named \"T-shirt\" will be changed:",
  "source": "https://docs.greendata.ru/platform/en/extobjects.html"
}