{
  "title": "Getting Started with GreenData Platform",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nGetting Started with GreenData Platform\nYou get started with the GreenData platform - a universal tool for creating IT systems of any complexity that help manage data and automate business processes.\nWith GreenData, you can focus on solving business problems and, without technical obstacles, get a ready-made solution.\nAdvantages of GreenData\nGreenData provides advanced functionality that allows to:\ncreate solutions\nwithout special technical development and programming skills;\nreduce development time and costs\n- the platform has all the necessary tools for developing different types of applications without the need for additional installation and purchase of components;\nautomate routine operations\n, reducing the number of errors and speeding up processes;\nadapt and scale applications\ndepending on the growth and needs of the business - making changes to business processes and adding new data sources is possible at any stage without affecting the efficiency and stability of your applications;\nmanage access securely and reliably\n- detailed access management and role model configuration will ensure the protection of confidential information;\nFor secure storage of sensitive data, GreenData uses the Hashicorp Vault tool.\nTo ensure reliable operation of the platform, regular system vulnerability scanning according to common OWASP standards and dependency updates are built into the development process.\nminimize risks and dependence on foreign IT solution providers\n— GreenData complies with the requirements of the Russian Ministry of Digital Development, is included in the Unified Register of Russian Software, and does not depend on foreign components, DBMS, or OS.\nFeatures\nGreenData is a flexible and universal platform with extensive functionality that includes many modules:\nGradually, you will learn to effectively apply all the platform’s tools, but for now, get acquainted with the purpose of the main modules:\nYou can read a brief description of the functionality you will start working with in each of the main modules in\n\"First setup steps\"\n.\nThe\n\"Data Model\"\nmodule allows organizing structures for storing and further processing of data. In the future, the created object model will become the basis for the business process model.\nModeling with a focus on the essence of the business task, without being distracted by technical design problems.\nWorking with business entities, not database tables - without involving SQL specialists for implementation.\nData entry is performed through visuals configured according to the needs and requirements of the user.\nThe\n\"Business Rules\"\nmodule allows setting business logic for any action and at any stage.\nDefining data processing rules, calculations, business process logic, and interface properties by configuring business rules and algorithms.\nUsing a simplified business language, developed on the basis of groovy, which allows operating with any attributes of the object model created by the user, with logical and loop operators, defining variables, and any other constructions for working with data typical for most programming languages.\nBusiness rules and algorithms are configured with an intuitive algorithm editor with a rich set of functions.\nAlgorithms and business rules can be launched on events and on a schedule.\nThe system allows using data for complex calculations and analysis, it is possible to use neural networks and machine learning, and, if necessary, to use Python in calculations.\nThe\n\"Screen Forms\"\nmodule helps adapt the interface using intuitive constructors.\nAbility to customize the appearance of all elements of the finished application in accordance with the corporate style of the company and user requirements.\nAbility to fully customize the user interface for the tasks of a specific user or different groups of users.\nSetting up the structure of forms for different types of data: lists, cards, registries using a convenient constructor with Drag&Drop.\nAbility to personalize the login and registration page in the application.\nThe\n\"Business Processes\"\nmodule allows organizing interaction and work of performers according to business process rules in BPMN2.0 notation.\nBusiness processes are integrated with the object model, so you can work with data without wasting time on transformations.\nExceptional flexibility of the online business process model allows adjusting business rules \"on the fly\" without stopping activity.\nA single information management space for managing multiple performers, work rules, and regulations is available.\nThe\n\"Role Model\"\nmodule allows configuring transparent and manageable access to data and operations, ensuring security and ease of use for all categories of users.\nCreating role groups from scratch or based on organizational-role matrices.\nAbility to add complex access rules considering powers related to objects and operations.\nSimple and visual role configuration in a graphical interface.\nQuick creation of role groups from scratch or based on existing matrices.\nClear separation of user permissions for performing operations with documents, tasks, processes, and other platform objects.\nAbility to configure access permissions at the level of objects, operations, or entire data groups.\nSupport for precise role distribution among employees to control task execution.\nThe functionality of the\n\"Analytics and Reporting\"\nmodule collects data in a form convenient for analysis, providing a visual representation of data and business charts.\nAutomatic data collection for reporting.\nBuilding reports interactively - reports are formed based on changed data.\nDashboards and rich graphics allow displaying data in the form of tables, charts, graphs, and diagrams.\nThe\n\"Integrations\"\nmodule toolkit allows loading, importing, and transforming data from various sources.\nExtraction and transformation of data in ETL integration is configured in a constructor, not programmed by developers.\nThe logic of working with data is configured in data processing and transformation schemes, which resemble business process schemes.\nHeterogeneous data sources are supported - you can extract data from objects, files, documents, external resources, DBMS.\nThe\n\"Complex Calculations\"\nmodule capabilities allow setting up and performing complex calculations to solve any business problems, including using machine learning tools.\nSetting up arbitrary calculations is done with the algorithm editor built into the platform.\nCombining calculations into complex methods is applied in case of calculation hierarchies, multi-stage and batch calculations.\nThe ability to run calculations on a schedule allows initiating and performing calculations on events and timers.\nThe\n\"Electronic Documents\"\nmodule allows generating documents from user templates with substitution of any data contained in the application.\nOnline work with documents similar to Google Docs.\nFull interactivity of documents ensures automatic updating when source data is edited.\nCollaborative work with the document, possibility of approval and formation of disagreement protocols.\nThe\n\"Mobile and Desktop Applications\"\nmodule is intended for organizing work with the application, communication, and data transfer through integrated services and applications.\nA set of corporate messengers working in an integrated way is implemented for convenience.\nNative mobile applications are available for iOS and Android.\nOnline conferences can be organized by creating a meeting in the browser using the GreenData Meet service.",
  "source": "https://docs.greendata.ru/platform/en/introduction_to_the_platform.html"
}