{
  "title": "Настройка диаграммы Ганта",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка диаграммы Ганта\nДиаграмма Ганта — это инструмент планирования для визуализации пула задач проекта в графическом виде. На диаграмме отображаются задачи, порядок и прогресс их выполнения.\nГрафик работ состоит из ряда отрезков, размещённых вдоль временной оси. Каждый из них соответствует отдельной задаче или подзадаче. Начало и конец отрезка соответствуют моменту начала и завершения работы по задаче. Длина отрезка — продолжительность работ.\nИспользование диаграммы Ганта позволяет наглядно увидеть все этапы работы. Она показывает:\nзадачи и подзадачи, включённые в проект;\nпоследовательность задач и подзадач;\nпродолжительность задач и подзадач;\nпроцент выполнения задачи или подзадачи на текущий момент;\nдаты начала и окончания проекта;\nвремя, которое занимает каждая задача/подзадача;\nспособы объединения задач.\nПорядок создания Диаграммы\nДля работы с Диаграммами Ганта необходимо последовательно выбрать пункты меню Отчёты → Диаграммы Ганта:\nТакже к данному разделу можно перейти после последовательного выбора пунктов меню: Администрирование→ Управление объектами→ Типы объектов и открытия реестра типа \"Диаграмма Ганта\" [SYS_GANTT] (подробнее про\nработу с реестром объектов\n).\nВ данном разделе будет представлен реестр. К настройкам уже созданной диаграммы можно перейти посредством двойного клика по наименованию диаграммы либо при помощи нажатия на кнопку\nна панели управления. Для открытия представления Диаграммы Ганта необходимо выбрать строку в реестре и нажать на кнопку \"Открыть Диаграмму Ганта\":\nДля создания нового экземпляра реестра следует нажать на кнопку\nна панели управления. Откроется окно, в котором выбирается тип диаграммы:\nВ открывшихся настройках необходимо указать наименование диаграммы и выбирать тип календаря в поле \"Календарь выходных/праздничных\" для последующего расчёта разницы дат начала и окончания задач.\nРадиобаттон \"по шаблону\" и \"на основе бизнес-процесса\" - недоступны, их реализация запланирована в предстоящий план работ.\nТакже необходимо выбрать посредством каких типов Проекта и задач будет построена диаграмма. По умолчанию используются настройка \"Использовать типы Проекта и Задачи по умолчанию\".\nОсобенности построения Диаграммы Ганта при использовании собственных типов Проекта и Задач рассмотрено\nв статье\n.\nДля сохранения настроек диаграммы требуется нажать на кнопку сохранения\nна панели управления, после чего в шапке страницы отобразится кнопка \"Открыть Диаграмму Ганта\", которую следует нажать непосредственно для перехода к представлению Диаграммы.\nПредставление Диаграммы\nПосле перехода к Диаграмме Ганта откроется окно, поделенное на две части. Левая часть предназначена для демонстрации задач и подзадач в виде таблицы:\nПравая часть окна отображает данные таблицы в виде Диаграммы Ганта:\nДля редактирования уровня, расположения, скрытия задачи следует воспользоваться соответствующими кнопками в шапке страницы.\nНажатие на иконку\nприведет к скрытию задачи из диаграммы, данная задача будет помечена как удаленная, но сохранится в Системе. Полное удаление возможно только в реестре задач.\nДля настройки отображения списка и диаграммы можно использовать следующие кнопки:\nНажатием на круг рядом с задачей/подзадачей устанавливается статус выполнения задачи\n:\nв работе (ACTIVE);\nзавершена (COMPLETED);\nпровалено (FAILED);\nприостановлено (SUSPENDED);\nнеопределенный (UNDEFINED).\nСтатус ACTIVE применим только к элементам, у которых данный статус установлен для родительского элемента.\nСтатус SUSPENDED применим только к элементам, у которых данный статус установлен для родительского элемента.\nПри установке статуса SUSPENDED элементу все его активные, а также имеющие неопределенный статус дочерние элементы и их активные потомки также становятся приостановленными.\nСтатусы FAILED и UNDEFINED автоматически применяются ко всем дочерним элементам.\nДля обновления и сохранения данных диаграммы следует нажать на соответствующие иконки\nв правой части шапки окна Диаграммы Ганта.\nРабота с диаграммой Ганта\nДобавление и изменение Задач\nСпособ №1\nДля создания новой задачи необходимо установить курсор в строку таблицы и ввести наименование задачи, после чего добавить данные по задаче в соответствующие поля. Для сохранения внесенных правок таблицы следует нажимать на иконку сохранения\nв правом верхнем углу окна.\nТаким образом после ввода наименования в таблице и области диаграммы можно:\nустановить статус задачи;\nизменить даты начала и окончания выполнения задачи, по умолчанию будет установлена текущая дата;\nВ области диаграммы можно перетаскивать (\"Drag&Drop\") задачу относительно временной шкалы, меняя тем самым даты начала и окончания выполнения задачи:\nсделать дату начала/окончания задачи несмещаемой;\nуказать продолжительность дней выполнения задачи:\nпо умолчанию при изменении продолжительности дней будет меняться\nдата окончания выполнения задачи\n;\nесли\nдата окончания выполнения задачи\nопределена как несмещаемая, при изменении продолжительности дней будет меняться\nдата начала выполнения задачи\n;\nпри добавлении свойства несмещаемости одновременно для\nдат начала и окончания выполнения задачи\nизменить продолжительность дней невозможно;\nсвойство несмещаемости связанных между друг другом задач (зависимость) также может ограничить возможность изменения продолжительности дней выполнения задачи;\nИзменить продолжительность выполнения задачи также можно в области диаграммы, передвигая границы элемента задачи.\nПри изменении протяженности элемента задачи в его правом верхнем углу будет отображена продолжительность рабочих дней выполнения задачи:\nопределить прогресс выполняемой задачи (в %);\nдобавить зависимости между задачами, данное свойство возможно реализовать при наличии минимум двух задач, при этом не имеющих несовместимых ограничений, вызванных свойством несмещаемости дат.\nЗависимости показывают в какой очередности необходимо выполнять задачи. Иными словами демонстрируют структурную декомпозицию проекта.\nЗадавать последовательность задач и смещения сроков относительно друг друга рекомендуется не в таблице данных задачи, а непосредственно в области диаграммы, передвигая задачи и создавая необходимую связку между ними.\nДобавленная зависимость сформирует связь между задачами, при которой изменение сроков выполнения или продолжительности одной задачи автоматически приведет к смещению сроков связанных с ней задач.\nВажным условием для внесения изменения связанных между собой задач является отсутствие несовместимых ограничений, вызванных свойством несмещаемости дат.\nИзменения, вносимые в таблице задач или области диаграммы автоматически применяются в карточке задачи.\nДля вставки новой задачи между двух существующих, изменения последовательности или уровней задач, а также скрытия задачи из диаграммы необходимо обратиться к панели управления, расположенной над таблицей данных.\nОпределение ресурсов задачи данным способом не осуществляется, для того, чтобы указать ресурсы задачи необходимо воспользоваться способом № 2, представленным ниже.\nСпособ №2\nДля создания новой задачи следует нажать на иконку редактирования рядом с наименованием проекта либо на строку проекта посредством двойного клика.\n.\nВ результате чего откроется окно, в котором следует добавлять новые задачи в реестре \"Задачи проекта\" при помощи кнопки\n. В открывшемся окне будет представлена карточка задачи диаграммы Ганта.\nКарточка задачи Диаграммы\nКарточка задачи - это окно для настройки и редактирования данных задачи.\nПри добавлении новой задачи\nобязательно\nуказывается:\nнаименование задачи;\nдата начала задачи.\nЗаполнение полей остальных параметров позволит произвести более детальную настройку данных задачи Диаграммы Ганта. Данные параметры предоставляют возможность:\nопределить несмещаемость дат начала и окончания задачи посредством перевода переключателей в активное положение;\nзадать продолжительность выполнения задачи, в рабочих днях. Устанавливается как целочисленное значение, которое влияет на значение поля \"Дата окончания задачи\";\nустановить прогресс выполнения задачи (в %);\nдобавить описание задачи;\nобозначить последовательность задач и смещения сроков относительно друг друга. Заполнение данного поля создаст связь между задачами. Зависимость задается в формате целочисленного значения (порядковый номер задачи), в случае необходимости создания связей текущей задачи с несколькими другими значения следует указывать через запятую.\nСоздавать связь между задачами рекомендуется не в карточке задачи, а непосредственно в области диаграммы:\nназначить/сменить родительскую задачу. При помощи данного параметра в поле \"Родительская задача\" посредством выпадающего списка из доступных задач проекта выбирается родительская задача по отношению к текущей задаче;\nуказать ресурсы (сотрудники, инструменты, техника или оборудование, необходимые для выполнения проекта). Выбор ресурсов осуществляется из экземпляров типа объекта \"Диаграмма Ганта. Ресурсы\" [SYS_GANTT_RESOURCE]. Для определения ресурсов задачи следует в нижней части карточки задачи в блоке \"Ресурсы\" нажать на кнопку\nи в открывшемся окне выбрать Ресурс, указать % использования ресурса и его порядок.\nВ рамках одной задачи может быть добавлено несколько ресурсов.\nТакже в карточке задачи можно увидеть заблокированные поля, такие как:\nдата окончания задачи. Значение данного поля устанавливается автоматически. При создании новой задачи определяется значением даты начала задачи, данное значение пересчитывается при вводе количества рабочих дней продолжительности задачи;\nссылка на пользовательскую задачу. Поле заполняется автоматически, оно необходимо для случая, когда задача имеет связь с внешней задачей;\nстатус задачи - параметр, демонстрирующий статус выполнения текущей задачи, изменение которого доступно только в таблице задач представления Диаграммы Ганта;\nскрыть из диаграммы. Данный параметр показывает отображена ли текущая задача на Диаграмме Ганта, при активном положении переключателя задача является скрытой.\nВнесенные в карточку изменения можно фиксировать нажатием на иконку сохранения в верхней части окна карточки задачи, для сохранения данных и выхода из карточки следует нажать на кнопку \"Ок\".\nДля создания подзадачи также можно выбрать в реестре задач строку с родительской задачей и нажать на кнопку добавления новой задачи\nна панели управления:\nТаким образом при открытии карточки новой задачи поле \"Родительская задача\" будет заполнено автоматически.\nДля открытия карточки готовой задачи необходимо в реестре задач выбрать строку задачи и нажать на кнопку\nна панели управления либо открыть карточку задачи посредством двойного клика по строке задачи.\nДля удаления задачи следует выбрать строку задачи и нажать на кнопку удаления\nна панели управления:\nДля сохранения внесенных изменений в реестр задач (создание, редактирование, удаление задач) требуется нажать на кнопку \"Сохранить задачу\". После чего откроется окно представления Диаграммы Ганта с внесенными изменениями.",
  "source": "https://docs.greendata.ru/platform/ru/gantt-chart.html"
}