{
  "title": "\"Attribute table\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Attribute table\" widget\nThe\nAttribute Table widget\nis a tool that generates a table for displaying attribute values in dynamics.\nExamples of a customized widget:\nThe widget is used to demonstrate the dynamics of changes in\nhistorical attributes\n.\nAdding a widget to the object profile is done in the\nvisual of instance\nediting mode. When switching from the “Elements” panel to the “Widgets” tab, drag and drop (Drag&Drop) the “Attribute table” widget from the “ Lists and tables of objects” section into the workspace of the profile.\nThe system will display the settings to configure the widget.\nSettings\nTo edit the widget, click on the “Settings” button. This will open a modal window, where the following parameters can be selected:\nSetting\nPurpose\nDynamics type\nDetermining the type of attribute change dynamics. The selection is using the drop-down list. Possible values:\nAnnually;\nEvery day;\nQuarterly;\nMonthly;\nEvery week;\nEvery second;\nEvery six months.\nAfter selecting the dynamics type, the System will display additional fields for configuration.\nAttribute with display dynamics type\nDetermining the object attribute that refers to the \"Dynamics type\" object type. When selecting the value of this attribute, it must be greater than or equal to the value selected as the type of widget dynamics.\nDisplay from a new line\nThe data is displayed line by line relative to the dynamics type. That is, the values of each attribute period are displayed in the table from a new line. It is most often used to get rid of the horizontal scrollbar in the table. Possible periods:\nAnnually;\nEvery day;\nQuarterly;\nMonthly;\nEvery week;\nEvery second;\nEvery six months.\nType attribute to define the scale of numeric attributes\nSelecting an attribute to determine the scale (digit capacity) of numeric values. It is used to configure the display of numeric attributes.\nReporting date (Attribute)\nSelecting an attribute of the current object that fixes the reporting date. The selection is made using the drop-down list of attributes of the \"Date\" type.\nAttributes\nDefining version attributes that have the same time dependence as the widget dynamics type.\nTo adjust the color selection of the cell (s), click on the\nbutton (reviewed below).\nThe parameter display is available after selecting the “ Dynamics type” parameter value.\nPeriods amount before the reporting date\nDefining number of periods before the reporting date. The number of periods is set after selecting one of the options:\n1. Attribute;\n2. Constant.\nIf the attribute value is used, the System will display the \"Attribute\" field, where the corresponding attribute is selected.\nWhen selecting the \"Constant\" option, a numeric value is entered in the adjacent field.\nThe parameter display is available after selecting the “ Dynamics type” parameter value.\nThe default value is \"10\"\n.\nPeriods after\nEnter a numeric value to determine the number of periods displayed after the reporting date.\nThe parameter display is available after selecting the “ Dynamics type” parameter value.\nBy default, the \"0\" value is specified to avoid displaying empty values.\nProlong values for empty periods\nA feature that determines how \"empty columns\" are displayed in the table. Setting the parameter involves choosing one of the options:\n1. attribute;\n2. constant.\nIf the attribute value is used, the System will display the \"Attribute\" field, where the corresponding attribute is selected. When selecting the \"Constant\" option, the \"Value\" parameter will be displayed with the checkbox window, when the checkbox is selected, the value\ntrue\n, when the checkbox is unchecked, the value is\nfalse\n.\nProlong values anyway\nA sign that determines the display of the value for future periods. Setting the parameter involves choosing one of the options:\n1. attribute;\n2. constant.\nIf the attribute value is used, the System will display the \"Attribute\" field, where the corresponding attribute is selected. When selecting the \"Constant\" option, the \"Value\" parameter will be displayed with the checkbox window, when the checkbox is selected, the value is\ntrue\n, when the checkbox is unchecked, the value is\nfalse\n.\nSet same values by periods\nFeature that determines the filling of the table for the next periods with the entered value in one cell.\nThe setting is\navailable for values with \"year\" period\n.\nIf the setting is set, the specified period is hidden (the year number is not displayed). The table header will indicate the periods according to the dynamics type to display. That is, when displaying the \"Monthly\" period, if you enter a value for January, the data are duplicated for each month until the end of the period. Setting the parameter involves choosing one of the options:\n1. attribute;\n2. constant.\nIf the attribute value is used, the System will display the \"Attribute\" field, where the corresponding attribute is selected. When selecting the \"Constant\" option, the \"Value\" parameter will be displayed with the checkbox window, when the checkbox is selected, the value is\ntrue\n, when the checkbox is unchecked, the value is\nfalse\n.\nThe parameter display is available after selecting the “ Dynamics type” parameter value.\nNumber of rows\nDetermining the number of rows to display by entering a numeric value. The number of rows displayed determines the height of the widget. If the number of attributes is greater than the number of specified rows, then pagination by pages is displayed.\nThe parameter display is available after selecting the “ Dynamics type” parameter value.\nShow \"Total\" column\nDisplaying a column with totals (rightmost column).\nHide column with criterion\nThe table is displayed\nwithout\nan attribute name column.\nPut the dynamics type in a separate column\nFeature that determines the display of the dynamics type value in a separate column.\nThe setting is available after selecting the value in the \"Display from a new line\" field.\nAfter selecting this attribute value, only the\nname of the day/ month/ quarter/ half-year\nwill be displayed; the year number will be moved to a separate column. Next, select on which side of the attribute table you want to display the column with the dynamics type (reviewed below).\nDisplay a column with the dynamics type\nDefining the attribute table side of the column location table with the dynamics type.\nThe setting is available after selecting the \"Put the dynamics type in a separate column\" option. The selection is made using the\nswitch , when the switch is in the \"Left\" position, the dynamics type column will be located on the left side of the table, when the switch is in the \"Right\" position, the dynamics type column will be located on the right side of the table.\nHide column with criterion\nThe table is displayed\nwithout\nan attribute name column.\nAttributes for \"Total\" column\nSelection of attributes for which the final value will be calculated. The final value can be calculated for attributes of the \"Integer\", \"Numeric\", \"Money\" type.\nAttribute locking algorithms\nThe parameter provides the ability to specify locking for each attribute using an algorithm.\nThe locking algorithm is supposed to return an array of date values according to the selected dynamics type, for example, [2024-10-01, 2024-07-01, 2024-04-01].\nIf the returned array of dates does not match the dynamics type selected in the settings, the system will not lock anything. For example, for the quarterly dynamics type, the locking will not occur if the array [24-05-25, 24-02-27] is returned.\nTo add locking conditions, click on the “Add” button, then select an attribute in the opened modal window, and the condition for locking is determined using the algorithm.\nAll the specified locking algorithms will be displayed as a table; to delete a condition, select the row in the table and click the “Delete” button.\nBlock historical periods values (before the reporting date)\nFeature that determines the blocking of values of historical periods. When using this parameter, it will not be possible to enter and edit cell values before the current date.\nDisplay historical values of linked versions\nDisplaying values of previous versions. It is only applied to the hierarchical object type with a hierarchy attribute configured that references an object instance of the same object type.\nAttributes for \"Total\" column\nSelection of attributes for which the final value will be calculated. The final value can be calculated for attributes of the \"Integer\", \"Numeric\", \"Money\" type.\nFreeze \"Criteria\" column\nFixing the first column when scrolling the entire values table.\nVersion date attribute\nSelecting an attribute by which historical values of related versions are displayed.\nBy default, the \"Create date\" is used\nTo set the attributes highlighting, click on the\nbutton, then a modal window will open, in which you need to select an attribute for highlighting from the drop-down list (the selection of several attributes is carried out sequentially).\nTo delete an attribute, click on the\nicon, located to the right of the added attribute name.\nAfter selecting the attribute, the System will display the fields in which you need to specify:\nattribute highlighting condition, which is set using a range of values;\nstyle. The formatting style is selected from a drop-down list of pre-prepared styles, if you need to create a new style, as well as edit or view the selected style, use the kebab menu on the right side of the field and select the desired option in the context menu.\nAfter completing the attribute highlighting setting, click on the\nbutton.\nThe layout of the generated attribute table is located under the widget parameters. This table also displays the \"Order\" column, which is used to customize the order in which rows are displayed in the table. To change the order of the row, click on the corresponding arrows:\nUse case\nDaily sales need to be visually demonstrated by displaying a table with the values of three attributes:\nsales volume, USD;\nsales plan fulfillment;\nshift supervisor.\nTo do this, use the \"Attribute table\" widget. Note that attributes must be time-dependent for\ndaily\npresentation, \"Attribute dependence discreteness\" in this case must be\ndaily\n. Also, for the subsequent configuration of the widget, an attribute of the \"Date\" type will be required to fix the reporting date.\nThe elements \"Row\" and \"Attribute group\" are added to the object profile in the editing mode of the\nvisual of the instance\nby dragging to the workspace. The \"Attribute table\" widget is placed in the grouping container. The system will display the widget parameters.\nThe minimum acceptable settings for the widget is a selection of parameters:\n\"Dynamics type\"\n– within the scope of the task, it is necessary to select the \"Daily\" value;\n\"Reporting date (Attribute)\"\n– an attribute of the \"Date\" type is specified;\n\"Attributes\"\n– in this field, the attributes are selected, the values of which will be displayed in the table.\nThe selection of attributes is possible only from attributes whose time-dependent discreteness corresponds to the type of dynamics selected in the parameter of the same name (in the current example, the \"daily\" value is selected).\nWith these parameters, the widget in the object profile on 02/19/2021 will take the following form:\nYou can use the following parameters to customize the table display more harmoniously:\n\"Number of rows\"\n– for example, set the value according to the number of attributes displayed in the \"Criteria\" column;\n\"Periods amount before reporting date\"\n– for example, the value \"3\", which will correspond to three days before the specified reporting date (02/19/2021);\n\"Periods after\"\n– for example, the value \"3\", which will correspond to three days after the specified reporting date (02/19/2021);\n\"Setting attribute highlighting\"\n– to demonstrate this parameter, the display style of the cells of the \"Sales plan fulfilment\" attribute with the \"Yes\" value will be changed.\nAfter these edits, the table will take the following form:\nAfter these edits, the table will take the following form\nthe \"Type attribute to define the scale of numeric attributes\"\nparameter is used, which specifies an object attribute referring to the registry of the \"Value scale\" type.\nTo use an additional type of dynamics selected as the\n\"Attribute with display dynamics type\"\nparameter, you will need an object attribute referring to the registry of the \"Dynamics type\" type.\nTo do this, it is necessary to supplement the attribute composition of the \"Sales volume\" object type:\nAfter that, when you select the added attribute \"Scale of values\" in the widget settings as the parameter\n\"Type attribute to define the scale of numeric attributes\"\nyou can change the scale of numeric values:\nThe change of scale is performed for\nall\nnumeric values of the attributes.\nWhen selecting the \"Sales dynamics type\" attribute as the\n\"Attribute with display dynamics type\"\nattribute value, you can select only the type of dynamics equal to or greater than the basic one (the basic type of dynamics is the type of dynamics set in the widget settings in the \"Dynamics type\" field).\nIf the selected dynamics type (the value of the added \"Sales dynamics type\" attribute) is greater than the discreteness of the attribute dependence on time, in this case it is necessary to set the type of value aggregation for each attribute in the table layout, located under the widget parameter settings. Available aggregation options:\nat the beginning of the period;\nat the end of the period.\nWhen selecting the \"Quarter\" attribute value of the dynamics type, the table can take the following form:\nIf the widget is not blocked, you can change the attribute values, these edits will be saved in the historical attribute after saving the object profile. To do this, the following\nparameters\nmay be useful (parameters do not apply to object attributes):\nIn this case, when entering the attribute value, this value will be set for all \"empty\" cells, starting from the next empty cell to the first cell with the filled value:\nWhen using this parameter, the entered value will be assigned to all subsequent cells, including for cells with the already entered values:\nWhen using the\n\"Display from a new line\"\nparameter, the attribute values of the previously specified period will be displayed line by line depending on the selected parameter value. For example, if you select the \"Every week\" value and the specified display period is three days before and after the reporting date (02/05/2021-03/03/2021), the table will take the following form:\nEditing attribute values with no widget block set by the blocking algorithm is possible only for the values of the selected period (25.02.2021-03.03.2021).\nWhen selecting the\n\"Show column Total\"\noption, fill in the\n\"Attributes for column Total\"\n, parameter, specifying attributes of the \"Integer\", \"Numeric\" or \"Money\" type:\nAfter that, the sum of the values of the selected attributes for the period displayed in the table will be calculated in the separate column \"Total\":\nWhen there are several values for one reporting period, you can configure several versions to be displayed simultaneously, provided that a new version is created that refers to the previous version of the current object type instance.\nTo do this, the \"Versions\" object attribute is added to the object type, referring to instances of the same type and\ntime-dependent\nwith the \"Daily\" discreteness. After that, in the additional object type settings on the \"Hierarchy\" tab, the hierarchical type is specified, and the created \"Versions\" attribute is set as an attribute of the hierarchy.\nTo create a new version of an object, a new instance is added to the \"Sales volume\" registry in the hierarchy of an existing object. It is recommended to use the \"Registry with hierarchy\" registry , for more information, see the \"\nConfiguring the registry\n\".\nThus, when the\n\"Display historical values of linked versions\"\nwidget parameter is active and if there are several values for one reporting period, the versions of the attribute values of the upper levels of the hierarchy will be displayed in a separate column. In this case, the attribute that characterizes the version date is selected in the\n\"Version date attribute\"\nparameter (by default, the date of creation of the object is used).\nVersions are displayed in the order of appearance.",
  "source": "https://docs.greendata.ru/platform/en/attribute-table-widget.html"
}