{
  "title": "Аналитическая панель дашборда \"Ключевые показатели\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАналитическая панель дашборда \"Ключевые показатели\"\nАналитическая панель\nдашборда\n\"Ключевые показатели\" – визуальный инструмент для наглядного представления текущих значений ключевых показателей эффективности (KPI).\nПример настроенной аналитической панели \"Ключевые показатели\":\nДля построения аналитической панели \"Ключевые показатели\" в карточке\nдашборда\nв режиме редактирования визуала должен быть добавлен сформированный\nисточник данных\n.\nДобавление аналитической панели \"Ключевые показатели\" в\nдашборд\nосуществляется в режиме редактирования визуала. Для этого необходимо с панели \"Элементы\" перетащить (Drag&Drop) элемент \"Ключевые показатели\", расположенный на вкладке \"Аналитические панели\", в рабочую область дашборда.\nДальнейшая настройка выполняется по кнопке \"Открыть настройки\", при нажатии на которую откроется модальное окно \"Настройка виджета \"Ключевые показатели\", содержащее три вкладки.\nПараметры настройки\nШаблоны\nНа вкладке \"Шаблоны\" представлены шаблоны с заранее заданным стилем оформления. По умолчанию выбран базовый шаблон.\nПри выборе шаблона важно обращать внимание на\nрасположение значений на элементах\n– их перемещение в дальнейшем будет недоступно.\nЦветовое решение, размер элементов, радиус угла скругления будут доступны для корректировки на вкладке\n\"Настройка содержимого\"\n.\nНастройка содержимого\nНа вкладке \"Настройка содержимого\" определяются основные параметры аналитической панели:\nПараметр\nНазначение\nИсточник данных\nВыбор\nисточника данных\nдля отображения.\nВыбор осуществляется из выпадающего списка, в котором представлены источники,\nдобавленные в карточку дашборда\n.\nКоличество отображаемых на аналитической панели элементов будет равно количеству строк, которые вернул указанный источник данных.\nМаксимальное количество отображаемых элементов на аналитической панели – 24.\nПорядок элементов регулируется при помощи сортировки, настроенной в источнике данных.\nПоле обязательно для заполнения.\nНаименование\nОпределение наименования источника данных.\nПредпросмотр\nПоле, в котором отображается результат настройки для проверки ее корректности.\nРазмер элемента\nОпределение размера элемента. Возможные варианты:\nXS;\nS;\nM;\nL;\nXL.\nПо умолчанию для всех шаблонов установлено значение M.\nКоличество столбцов\nОпределение количества элементов, расположенных в одной строке.\nСкругление углов\nОпределение размера скругления углов элемента. Возможные варианты:\nБез скругления;\nXS;\nS;\nM;\nL;\nXL.\nПо умолчанию для каждого шаблона установлено собственное значение.\nАвтоширина\nПризнак, при котором элементы будут равномерно растянуты по всей ширине доступной области.\nПоле с кодом объекта показателя\nОпределение поля, содержащего код показателя, для дальнейшего его использования в алгоритме стилизации. Выбор осуществляется посредством выпадающего списка из всех полей указанного источника данных.\nСтиль фона\nОпределение способа задания стиля фона. Возможные варианты:\nСтатичный;\nАлгоритм.\nЗаливка\nОпределение способа заливки фона. Возможные варианты:\nЦвет – при выборе варианта доступен color picker с возможностью выбора цвета на палитре или ввода кода цвета в форматах RGBA, HEX и HSVA.\nГрадиент;\nРадиальный градиент;\nКонический градиент;\nКвадратный градиент.\nНастройка градиента осуществляется в модальном окне.\nДля настройки перехода необходимо выбрать два цвета, используя color picker.\nДополнительно для варианта \"Градиент\" доступно поле \"Угол\" для изменения положения цветов относительно друг друга, а для варианта \"Квадратный градиент\" – поле \"Размер\" для определения ширины отображения первого цвета.\nПоле доступно при выборе варианта \"Статичный\" при определении способа задания стиля фона.\nОбводка\nВыбор способа обводки элемента. Возможные варианты:\nНет;\nСплошная;\nТочечная;\nПунктирная;\nДвойная.\nПри выборе любого варианта, за исключением варианта \"Нет\", доступен color picker с возможностью выбора цвета обводки.\nПоле доступно при выборе варианта \"Статичный\" при определении способа задания стиля фона.\nАлгоритм стиля\nВыбор алгоритма, с помощью которого будет задан стиль фона элемента.\nАлгоритм должен возвращать объект типа\n\"Основной стиль форматирования\"\n.\nЕсли параметр \"Поле с кодом объекта показателя\" заполнен, то алгоритм будет выполнен по объекту, код которого содержится в выбранном поле источника.\nЕсли дашборд размещен на визуале объекта при помощи виджета\n\"Дашборд\"\nи при этом параметр \"Поле с кодом объекта показателя\" не заполнен, то алгоритм стиля будет выполнен по объекту, на котором расположен виджет.\nВыбор ранее созданного алгоритма осуществляется из выпадающего списка, создание нового алгоритма доступно через меню действий параметра.\nПример настройки алгоритма стиля\nЗададим стиль фона элементов с помощью следующего алгоритма:\nПри помощи оператора\nif\nпроверяется значение показателя и посредством функции\nreturn\nвозвращается соответствующий объект типа\n\"Основной стиль форматирования\"\n: \"Красный фон\", \"Желтый фон\" или \"Зеленый фон\".\nВ результате чего элементы аналитической панели будут отображены следующим образом:\nПоле доступно при выборе варианта \"Алгоритм\" при определении способа задания стиля фона.\nДалее расположен блок настройки значений, которые необходимо отобразить на элементе.\nПараметр\nНазначение\nПоле источника\nОпределение поля для отображения в качестве выбранного значения.\nВыбор осуществляется посредством выпадающего списка из всех полей указанного источника данных.\nПоле обязательно для заполнения.\nСтиль текста\nОпределение способа задания стиля текста. Возможные варианты:\nСтатичный;\nАлгоритм.\nСтиль\nОпределение стиля текста.\nВыбор ранее созданного\nстиля форматирования\nосуществляется из выпадающего списка, создание нового стиля доступно через меню действий параметра.\nПоле доступно при выборе варианта \"Статичный\" при определении способа задания стиля текста.\nАлгоритм стиля\nВыбор алгоритма, с помощью которого будет задан стиль текста.\nАлгоритм должен возвращать объект типа\n\"Основной стиль форматирования\"\n.\nЕсли параметр \"Поле с кодом объекта показателя\" заполнен, то алгоритм будет выполнен по объекту, код которого содержится в выбранном поле источника.\nЕсли дашборд размещен на визуале объекта при помощи виджета\n\"Дашборд\"\nи при этом параметр \"Поле с кодом объекта показателя\" не заполнен, то алгоритм стиля будет выполнен по объекту, на котором расположен виджет.\nПример настройки алгоритма стиля\nЗададим стиль текста элементов с помощью следующего алгоритма:\nСогласно условию, заданному при помощи операторов\nif\nи\nelse\n, проверяется значение поля источника \"Наименование\", полученного при помощи функции\nfield\n.\nПри помощи функций\nreturn\n,\ndict\nбудет возвращаться объект типа\n\"Основной стиль форматирования\"\n\"Задача завершена\" или \"Фирменный стиль\".\nПоле доступно при выборе варианта \"Алгоритм\" при определении способа задания стиля текста.\nРасположение значений на элементе зависит от выбранного шаблона и не может быть изменено.\nДля удаления значения с элемента необходимо нажать на кнопку\n. Добавление значений для отображения на элементе осуществляется нажатием на кнопку\n.\nМаксимально возможное количество значений для отображения на элементе – 4, после чего кнопка для добавления новых значений станет неактивна.\nРасшифровки\nНа данной вкладке настраивается связь между двумя и более аналитическими панелями, иными словами данная настройка позволяет в режиме реального времени изменять отображение данных одной аналитической панели в зависимости от выбранного значения другой аналитической панели.\nПодробнее с настройкой расшифровок можно ознакомиться в статье \"\nДетализация данных (Drill Down Расшифровка)\n\".",
  "source": "https://docs.greendata.ru/platform/ru/kpi-dashboard.html"
}