{
  "title": "Настройка курируемости",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nНастройка курируемости\nНастройка курируемости определяет права на просмотр и редактирование маршрутных объектов Системы.\nДля настройки курируемости\nв Системе\nиспользуется два типа объекта\n:\nнастройка курируемости;\nматрица курируемости (дочерний объект \"Настройки курируемости\").\nПри настройке курируемости создаются матрицы курируемости (для определения ответственных и подчиненных сотрудников) в рамках одного типа объекта Системы, а также распространяется на его дочерние типы. Матрица курируемости определяет переход задачи к ответственному исполнителю в рамках бизнес-процесса.\nНапример, для заявки на принятие решения создается один объект \"Настройка курируемости\", в котором присутствует несколько объектов \"Матрица курируемости\" (для определения ответственных сотрудников):\nматрица, описывающая переход задачи от клиентского менеджера к руководителю кредитного подразделения;\nматрица, описывающая переход от руководителя кредитного подразделения к сотруднику кредитного подразделения и т.д.\nДля \"Настройки курируемости\"\nнеобходимо:\n1. В меню навигации пункт\n\"Матрица определения ответственных\"\n:\n2. Нажать на кнопку\nдля добавления нового экземпляра объекта \"Настройка курируемости\". Система отобразит карточку добавления нового объекта \"Настройка курируемости\":\n3. Указать в полях соответственно:\nнаименование – название создаваемой настройки;\nсправочник типов объектов – выбрать тип объекта, настройка доступа к которому выполняется.\n4. Создать матрицу(цы) курируемости (подробнее,\n\"Создание матрицы курируемости\"\n).\n5. Сохранить внесенные документы, нажав\nв карточке экземпляра объекта \"Настройка курируемости\". Настройка курируемости выполнена.\nВ случае корректировки имеющихся настроек необходимо выполнить пересчет эффективных прав для редактируемых учетных записей пользователей (групп пользователей) (подробнее,\n\"Создание пользователя в Системе\"\n).",
  "source": "https://docs.greendata.ru/platform/ru/setting-up-curation.html"
}