{
  "title": "sequenceNextVal",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nsequenceNextVal\nThe function is used when auto-numbering objects to assign the next ordinal value, the returned value is stored in the \"Current value\" field.\nThe function increments the sequence by 1\neach time the function is called\n.\nFor example, when using a function in an\nexpression\nit is recommended to deactivate the \"Calculate when creating new object\" parameter to avoid assigning a number to an object that may not be saved after creation (the number will be lost).\nOr, for example, if the When changing attributes used in the algorithm/When changing any attributes of this type values are selected as an automatic recalculation of the expression, then when changing the values of the corresponding attributes, the function can be called again, which in turn will lead to a change in the sequence number for the current object.\nSyntax\nsequenceNextVal\n(sequenceIdObj)\nParameter\nPurpose\nsequenceIdObj\nID of an object of the\n\"Auto-numbering\" type [\nSYS_SEQUENCE\n] (or a child type), through which an ordinal number is assigned to a specified object.\nNote\nBefore using the\nsequenceNextVal\nfunction, create an instance of the\n\"Auto-numbering\" [\nSYS_SEQUENCE\n] type (or a child type).\nBy default, the sequence value starts with 1. If necessary, the current value can be changed when configuring the instance or using the\nsetSequenceCurrVal\nfunction.\nAdding a function to the algorithm code is done from the \"Additional\" section of the algorithm editor.\nWhen calling the function, a modal window opens to select the previously created auto-numbering sequence:\nAn integer value is automatically set to the specified object attribute. After creating a new object, it will be assigned the following sequence number.\nExample\nLet’s assume that the names of loan applications should be set automatically, considering sequential numbering.\nTo do this, create a new instance with the name \"Loan application number\" in the\n\"Auto-numbering\" [\nSYS_SEQUENCE\n] object type.\nNext, use the following algorithm to calculate the value of the \"Name\" attribute in the object types for generating loan application in the\nexpressions\n:\nWhen configuring the\nexpressions\nthe \"Calculate at the time of creation of new objects\" option is inactive.\nWhen calling the\nsequenceNextVal\nselect the created \"Loan application number\" auto-numbering  instance.\nTherefoer, the name is generated using the\ntext\nand\nsequenceNextVal\nfunctions.",
  "source": "https://docs.greendata.ru/platform/en/sequencenextval.html"
}