{
  "title": "ETL. Трансформатор. Запуск вложенной ETL",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nETL. Трансформатор. Запуск вложенной ETL\nТрансформатор \"ETL. Трансформатор. Запуск вложенной ETL\" используется для переиспользования существующих ETL.\nНастройка\nТрансформаторы ETL настраиваются в\nпреобразователе данных\n, добавленном на\nсхему\nETL-процесса.\nДля настройки используется следующий набор параметров:\nПараметр\nНазначение\nНаименование\nНазвание созданного трансформатора.\nПорядок\nВвод порядкового номера трансформатора для определения последовательности запуска при наличии нескольких трансформаторов.\nETL\nВыбор ETL-процесса, запуск которого предполагается внутри настраиваемого ETL-процесса.\nПродолжить работу ETL при возникновении ошибки\nПризнак, используемый для игнорирования ошибок работы трансформатора.\nПродолжить обработку данных при возникновении ошибки\nПризнак, используемый для игнорирования ошибок обработки отдельных элементов динамической структуры (коллекции).\nКоллекция входных данных\nВыбор элемента динамической структуры настраиваемого ETL-процесса, значение которого необходимо преобразовать.\nКоллекция выходных данных\nВыбор элемента динамической структуры настраиваемого ETL-процесса, в который будет передаваться полученное значение вложенного ETL-процесса.\nАлгоритм для формирования параметров запуска ETL\nОпределение алгоритма для формирования параметров стартового экземпляра запускаемого объекта ETL.\nВ поле \"Базовый тип объектов\" алгоритма должен быть выбран\nтип стартового объекта\nзапускаемого объекта ETL.\nВ поле \"Контекстный тип объекта\" алгоритма должен быть указан тип стартового объекта текущего ETL-процесса.\nДля получения значения атрибута экземпляра текущего ETL-процесса можно воспользоваться функцией\ncontextObjAttr\n.\nПример\nДопустим, требуется осуществить загрузку производственного календаря за 2024-2026 годы из внешнего сервиса.\nВ первую очередь, необходимо настроить ETL-процесс \"Вложенная ETL\", с помощью которого будет осуществляться запрос данных от внешнего сервиса.\nПодробнее\nНа\nсхему ETL\nследует добавить\nИсточник. Внешний сервис\nи перейти к настройке параметров нажатием на кнопку\n:\nНа вкладке \"Основные параметры\" в блоке\n\"Тип и адрес сервиса\"\nуказываются следующие параметры:\nВ поле \"URL\" необходимо добавить ссылку на внешний сервис, содержащую подстановочный параметр\nyear\n, настройка которого осуществляется на вкладке\n\"Параметры запроса\"\n:\nТакже на вкладке \"Основные параметры\" в блоке\n\"Описание структуры ответа\"\nнеобходимо сформировать структуру ответа от внешнего сервиса:\nДалее настраивается ETL-процесс, посредством которого производится многократный (для каждого года) запрос к внешнему сервису.\nДля этого на\nсхему ETL\nследует добавить следующие этапы:\nИсточник. Внешняя БД\n– для формирования динамической структуры, с помощью которой задается необходимый период загрузки данных.\nПодробнее\nПерейти к настройкам источника данных нажатием на кнопку\n:\nВ блоке \"Запрос данных\" указываются следующие параметры:\nВ блоке \"Выходная структура\" необходимо сформировать динамическую структуру:\nПреобразователь данных\n– для многократного запуска настроенного ранее ETL-процесса.\nПерейти к настройкам преобразователя данных нажатием на кнопку\n:\nНеобходимо предварительно добавить в выходную структуру преобразователя данных элемент динамической структуры (объект) для хранения полученного значения:\nДля того чтобы в рамках настраиваемого ETL-процесса выполнить запрос данных от внешнего сервиса для каждого года, необходимо настроить трансформатор со следующими параметрами:\nПодробнее об алгоритме\nПосредством функции\nattr\nс активной опцией \"Установить значение\" атрибуту \"Год загрузки\" присваивается значение элемента\nyear\nдинамической структуры, полученное с помощью функции\netlValue\n.\nВ результате чего будет произведена загрузка данных производственного календаря за 2024-2026 годы из внешнего сервиса.",
  "source": "https://docs.greendata.ru/platform/ru/etl-transformer-running-nested-etl.html"
}