{
  "title": "\"OnChanged\" event",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"OnChanged\" event\nThe OnChanged event is used to track changes in an attribute value. When the user changes an attribute value, the Onchanged event triggers and runs a specified algorithm.\nThe algorithm runs after removing focus from an attribute field for which the OnChanged event is configured, without any confirmation, that is, the event works in real time.\nThe OnChanged event is not triggered when an attribute value is changed via an\nalgorithm\nor an\nexpression\n.\nThis allows performing additional actions when changing an attribute value, for example, hiding or showing some fields in the profile, updating the values of other attributes or checking entered data. It can also be used to automatically save record changes without having to click on the \"Save\" button.\nThe OnChange event is executed in the object profile, in the\nregistry edit mode\n, in the\n\"Object registry\"\nand\n\"Horizontal registry\"\nwidgets, in object attributes with the\n\"Registry for multi-select attribute\"\n/\n\"Multiple objects as a table\"\nvisual, and in child attributes.\nChanges to attribute values made as a result of the OnChange event execution in the\nregistry edit mode\nmust be saved.\nThe object can be saved either by adding the\nsave\nfunction to the event algorithm or by clicking the\nbutton in the registry control panel.\nThe OnChanged event is triggered\nafter\nthe\nexpression\ndependent on the edited attribute.\nRestrictions\nThe functional is\nnot available\nfor the following type attributes:\n\"Object\" with \"many-to-many\" relation\n(multiselect-attributes);\n\"Child object\"\n;\n\"Custom\".\nThe OnChanged event doesn’t work with source attributes, as they are made for display purposes only and do not require data entry.\nThe triggered algorithm can set values for other attributes, but this action does not apply to the attribute under which the current OnChanged event is running.\nThe profile is not blocked when the algorithm is running, that is, the value of an attribute field with a customized OnChanged event can be changed again, which will lead to the next launch of the algorithm.\nOnChanged events are executed sequentially as they are queued.\nIt is worth considering that attribute values saved by user can be changed as the algorithms are developed.\nIf the algorithm executing process requires more time (more than 300ms), the System displays a message at the top of the work area:\nAnd a notification upon completion in the lower right corner of the screen:\nEvent setup\nTo customize an OnChanged event, go to the \"Event\" tab in the attribute profile.\nNext, in the \"OnChanged event\" parameter, select an algorithm to be launched when the attribute value changes.\nThe algorithm can be:\nselected in a drop-down list from pre-created algorithms, for which the custom attribute type is selected as the base type;\ncreated using the \"Add\" option in the parameter action menu.\nIf an algorithm is created/edited directly from the type attribute profile, it opens in a modal window by default.\nTo create an event, the algorithm uses two arguments that determine the previous and current values of the attribute.\nThese values can be obtained using the\nattrNewValue\nand\nattrOldValue\nfunctions.\nFor a\ntime-dependent attribute\n, the functions only work for the current value.\nExample\nWhen booking a tour, a user selects the destination country; when changing the country in real time, he must be reminded of the need to get familiar with the rules of entry and staying in that country.\nTo do this, in the booking profile, for the \"Country\" attribute, customize an OnChanged event as follows:\nFunctions used when creating the algorithm.\nIn the algorithm code:\nthe condition is specified through the\nif\nfunction;\nthe condition for changing the value of the “Country” attribute field is checked using the\nattrOldValue\nand\nattrNewValue\nfunctions;\nthe\nand\nfunction combines two conditions;\nthe\nisNotNull\nand the\nattrNewValue\nfunctions check whether the “Country” attribute field is cleared;\nthe\nsendPopUpMsg\nfunction is used to display a notification on the user screen;\nthe\nattrNewValue\nfunction participates in generating the notification text by displaying the name of the country selected by user.\nAs a result of this setting, the user receives a corresponding notification when selecting a country.",
  "source": "https://docs.greendata.ru/platform/en/onchanged-event.html"
}