{
  "title": "Untitled",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nДанная версия релиза устарела, с актуальной версией можно ознакомиться по\nссылке\n.\nРелиз LTS.434.2 от 18.10.2024\nНовые возможности\nРеализована поддержка горячих клавиш при работе с реестрами и карточками экземпляров.\nТеперь количество экземпляров при\nгруппировке в реестре\nможет отображаться опционально.\nВ\nаналитической панели дашборда \"Таблица\"\nпоявилась возможность создания объединенной шапки для колонок таблицы по аналогии с\nреестрами объектов\n.\nВ модуле EDoc при работе в режиме сравнения версий реализовано отображения пользователя, внесшего изменение в документ.\nРеализована возможность загрузки файла через интерфейс реестра документов EDoc.\nДля удобного поиска записей, связанных с одной операцией, в лог добавлена метка traceId.\nИзменения и улучшения\nСтабилизирована работа проверки уникальности значений атрибутов, входящих в ограничение или ключ, при одновременном сохранении нескольких объектов с одинаковыми значениям.\nДля экземпляров типа объектов \"Настройка кнопок панели управления в реестре\" исправлена обратная совместимость.\nСтабилизировано прикрепление файла в систему.\nОптимизирована работа дочерних атрибутов при наличии события\nonChanged\n.\nСтабилизирована работа поисковых фильтров в реестре для атрибутов типа \"Строка\" и \"Текст\".\nОтображение реестра с закрепленными столбцами отлажено и стабилизировано при скроллировании.\nСтабилизирована работа фильтрации в реестре при смене вида фильтра.\nОтлажен процесс переноса представления реестра при помощи GUF-файла.\nСтабилизировано отображение\nвиджета \"Статус бар\"\n.\nОтлажен процесс переноса виджетов\n\"Заголовок по атрибуту\"\nи\n\"Статус бар\"\nпри помощи GUF-файла.\nПоявилась возможность отображения в\nкоммуникационной панели\nкарточки экземпляра при выделении его в\nвиджете \"Реестр объектов\"\n.\nПри использовании\nвиджета \"Реестр объектов\"\nстабилизирована работа\nпакетного действия\n.\nОтлажено отображение полей источника при настройке ранее созданных\nаналитических панелей дашборда \"Диаграмма динамики\"\n.\nОтлажена работа функции\nattrOldValue\n.\nДобавлена возможность включения в\nпакетное действие\nмодуля пользовательского интерфейса \"Загрузка локальных объектов из Excel\".\nОтлажено отображение дополнительных атрибутов задачи в соответствии с заданной областью применения: для мобильного приложения или веб-версии.\nВ карточке задачи бизнес-процесса отлажено отображение стиля подсветки\nатрибута для выбора ответственных\n.\nОптимизирована работа источников данных на основе запросов с комментариями.\nТеперь в аудите действий фиксируется пользователь, установивший обновление, а также стабилизировано отображение записей в зависимости от выбранной локализации.\nВ модуле EDoc отлажено отображение истории документа при создании новой версии другим пользователем, а также добавлено уведомление о создании новой версии документа. Помимо этого, стабилизирована работа при вводе текста в ячейки таблицы.\nВ GreenData Meet улучшено качество звука при одновременном включении микрофонов у нескольких пользователей.\nВ GreenData Messenger проведена оптимизация получения сообщений из чата с telegram-ботом.\nПроизведена унификация модальных окон в Системе.\nДоработаны настройка реестра типа объектов \"Хранилище файлов\" [FS_STORAGE] и визуалы экземпляров.\nФайлы для скачивания\nДля docker:\ndockerhub.greendatasoft.ru/public/platform:v4.434.2\nДля war:\nhttps://downloads.greendatasoft.ru/LTS/lts.434.2.war\nhttps://downloads.greendatasoft.ru/LTS/lts.434.2.war.sha256.txt\nДля скачивания файлов необходима учетная запись.",
  "source": "https://docs.greendata.ru/platform/ru/LTS.434.2-latest.html"
}