{
  "title": "Основные элементы управления",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nОсновные элементы управления\nПосле установки платформы и успешной авторизации пользователя Система отобразит\nстартовую страницу\n. С помощью манипуляторов (клавиатуры и компьютерной мыши) пользователь\nуправляет элементами графического интерфейса и выполняет настройку платформы\n.\nГрамотно настроенный интерфейс способствует облегчению понимания и освоения Системы пользователями любого уровня.\nОсновными элементами\nинтерфейса являются:\nЭлемент\nНазначение\nГлавное меню\nПредназначено для перехода между разделами (модулями) Системы.\nНавигационная панель (заголовок)\nПредназначена для отображения заголовка выбранного раздела.\nПанель управления (инструментов)\nСодержит основные команды для работы с объектами системы.\nРабочая область\nСодержит основные информационные данные выбранного в панели навигации раздела.\nКоммуникационная панель\nИспользуется для размещения часто используемой  информации, позволяющий обращаться к дополнительным данным без потери контекста работы с основным рабочим окном.\nВ навигационной панели расположены:\nкнопка\nдля перехода к\nглавному меню\n;\nкнопка\nдля возврата к ранее открытому объекту;\nВозврат на предыдущую\nвкладку\nна визуале карточки объекта осуществляется нажатием на кнопку \"Назад\" в браузере.\nменю профиля пользователя\n, которое предназначено для точечной настройки Системы для конечного пользователя (например, для настройки оформления или смены пароля);\nчат\n– инструмент для обмена сообщениями между пользователями (внутри Системы) в режиме реального времени;\nВидимость кнопки регулируется правом доступа на\nразрешение \"Доступ к чату\"\n.\nобновления в платформе – список новых возможностей, изменений и улучшений платформы. Подробнее можно ознакомиться в\nстатье\n.\nВидимость кнопки регулируется правом доступа на\nразрешение \"Просмотр обновлений в платформе\"\n.\nсервисы платформы – переход к списку\nсервисов платформы\n;\nВидимость кнопки регулируется правом доступа на\nразрешение \"Просмотр сервисов в навигационной панели\"\n.\nязык интерфейса Системы, по нажатию на который отобразится контекстное меню с доступными для выбора\nязыками локализации\n:\nПо умолчанию применяются настройки локали из браузера пользователя.\nВ браузере Google Chrome определение языка расположено в настройках \"Дополнительные\".\nместоположение пользователя –\nгеопозиция\n, которая устанавливается Системой автоматически при авторизации пользователя в приложении, и при необходимости может быть изменена.\nОбратите внимание, выбор локали (\nязыка интерфейса\n) и\nстрана пребывания\nпользователя определяют в Системе формат по умолчанию для значений\nатрибутов\nтипа:\nдата;\nвремя;\nдата и время;\nчисловой;\nцелое число;\nденежный.\nПо умолчанию в навигационной панели отображается наименование открытого объекта, отображение которого может быть задано в\nнастройках визуала экземпляра\n.\nПри активации\nсистемной настройки \"Отображать индикацию изменений в объекте\"\nв  навигационной панели будет отображаться состояние изменений объекта.",
  "source": "https://docs.greendata.ru/platform/ru/basic-controls.html"
}