{
  "title": "Виджет \"Чат по объекту\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Чат по объекту\"\nВиджет \"Чат по объекту\" – это инструмент для создания группового чата с привязкой к конкретному экземпляру объекта. Иными словами данный функциональный элемент обеспечивает возможность коммуникации между пользователями для работы и согласования действий в рамках заданного объекта.\nПример настроенного виджета:\nНастройка\nДобавление виджета осуществляется в режиме редактирования\nвизуала экземпляра\n. На панели \"Элементы\" необходимо перейти на вкладку \"Виджеты\" и из раздела \"Взаимодействия\" перетащить (Drag&Drop) в рабочую область карточки  виджет \"Чат по объекту\".\nПараметры\nПри нажатии на кнопку настройки виджета откроется модальное окно со следующим набором параметров:\nПараметр\nНазначение\nЧат по текущему объекту\nСоздание чата по текущему объекту.\nПри активном переключателе создание чата при работе с виджетом осуществляется по текущему объекту.\nПри неактивном переключателе станет доступен параметр \"Чат по объекту\".\nЧат по объекту\nСоздание чата по объекту, связанному с текущим, в котором размещается виджет.\nСвязанный объект указывается через цепочечный объектный атрибут текущего объекта.\nПлавающая кнопка чата\nОпределение расположения кнопки по созданию и открытию чата по объекту.\nПри активном переключателе кнопка по созданию и открытию чата фиксируется в правом нижнем углу экрана независимо от положения других элементов визуала.\nПри неактивном переключателе данная кнопка располагается в области расположения виджета.\nПо умолчанию переключатель активен.\nНа одном визуале может быть добавлена только одна плавающая кнопка. Если на визуале карточки уже есть виджет с активным параметром, тогда в настройках других виджетов \"Чат по объекту\" данный переключатель будет заблокирован.\nРабота с виджетом\nНастроенный виджет отображается в карточке объекта в виде кнопки:\n– для создания чата по объекту;\n– для открытия ранее созданного чата по объекту.\nКнопка чата становится активна после сохранения экземпляра объекта при наличии соответствующих прав у пользователя.\nСоздание чата\nСоздание чата по объекту доступно только пользователям, которые обладают\nправами на редактирование данного объекта\n.\nВ случае создания чата по объектному атрибуту, в карточке объекта, в которой размещен виджет, должно быть определено значение соответствующего атрибута.\nСоздание чата осуществляется по кнопке\n, после нажатия на которую в правом нижнем углу экрана отобразится окно с чатом по заданному объекту. Созданный чат доступен в разделе \"Объектные чаты\" как в\nGreenData Messenger\n, так и в\nмобильном приложении GreenData\n.\nПо одному экземпляру объекта может быть только один чат.\nПо умолчанию создаваемый по объекту чат является закрытым.\nПосле создания чата, администратор может сделать данный чат открытым.\nНаименование чата задается в виде: \"<Наименование объекта>\", пользователь не может редактировать название чата.\nПри изменении наименования объекта, наименование чата по объекту будет изменено автоматически.\nЧат по объекту обладает теми же\nвозможностями\n, что и обычный чат, однако помимо этого в окне\n\"Информация о чате\"\nв чате по объекту размещается иконка с гиперссылкой для перехода в соответствующий экземпляр объекта.\nЕсли объект был удален, данная иконка блокируется, помимо этого меняется аватар чата и название – «Объект не найден».\nОднако если объект был помещен в корзину, а затем восстановлен, функционал иконки, аватар и наименование чата восстанавливаются.\nВ случае удаления объекта, чат по данному объекту не удаляется, но перемещается в конец списка чатов.\nДобавление участников чата\nВступление в чат по объекту доступно только тем пользователям, у которых есть\nправа на просмотр или редактирование данного объекта\n.\nДобавление пользователей в\nзакрытый чат\nосуществляется\nтолько администратором чата\nпри помощи:\n1. Опции \"Добавить собеседника\" с присвоением пользователю роли администратора, читателя или участника.\n2. Отправки ссылки-приглашения на вступление в чат в роли читателя или участника.\nПринятия заявки на вступление в чат, отправленной пользователем после нажатия на кнопку\nв карточке объекта. В случае принятия заявки администратором, пользователь вступает в чат под ролью участника.\nПри необходимости администратор чата в окне\n\"Информация о чате\"\nсможет исключить пользователей или сменить их роли.\nДобавление пользователя в\nоткрытый чат\nосуществляется:\nУчастниками чата посредством опции \"Добавить собеседника\".\nУчастниками чата при помощи отправки ссылки-приглашения.\nСамостоятельным вступлением пользователя в чат при помощи нажатия на кнопку\nв карточке объекта.\nВ случае добавления пользователя в чат по объекту при помощи опции \"Добавить собеседника\", в списке отображаются только пользователи с доступом к объекту.\nПользователь с отсутствием прав на объект не сможет вступить в чат по данному объекту по ссылке-приглашению.\nПри лишении прав на объект, пользователь автоматически удаляется из чата по данному объекту.\nВ случае восстановления прав на объект, пользователю необходимо повторно пройти процедуру\nдобавления в чат\n.\nПример настройки\nНапример, в приложении может быть настроен\nбизнес-процесс\nпо объекту типа \"Заявка на оборудование\" – созданная сотрудником заявка перед подготовкой документов должна быть согласована руководителем.\nДля наиболее упрощенной демонстрации смены прав и возможностей роли по ходу бизнес-процесса, в примере не учтен случай отказа в согласовании заявки.\nК типу объектов \"Заявка на оборудование\" применяется\nконтроль прав \"Контроль прав по ответственным сотрудникам\"\n.\nВ задаче задействованы две\nгруппы доступа\n\"Сотрудник\" и \"Руководитель\".\nПри работе с заявкой могут появиться вопросы для обсуждения или необходимость уточнения деталей. Для этого потребуется создание чата по данному объекту.\nРеализовать быстрое создание чата по объекту можно при помощи добавления в режиме редактирования\nвизуала экземпляра\nтипа \"Заявка на оборудование\" виджета \"Чат по объекту\".\nПри настройке виджета указываются следующие параметры:\nВ результате чего в правом нижнем углу объекта заявки будет размещена кнопка\n.\nВажно отметить, что право на создание чата имеет только пользователь, обладающий\nправом на редактирование объекта\n. После того как чат будет создан, право на вступление будет доступно пользователям с наличием\nправ на чтение или редактирование текущего объекта\n.\nПроцесс формирования заявки.\nПользователь с ролью \"Сотрудник\" создает заявку на оборудование, в результате чего осуществляется запуск бизнес-процесса – на автора создается первая задача.\nПосле завершения задачи автором, генерируется задача на пользователя с ролью \"Руководитель\".\nПосле завершения задачи руководителем формируется задача на пользователя с ролью \"Сотрудник\".\nТак как к объекту применяется контроль прав \"Контроль прав по ответственным сотрудникам\", права доступа к маршрутному объекту регулируются следующим образом:\nЗадача\nПрава доступа\nПроверка корректности заполнения данных\nПравами на чтение и редактирование объекта обладает только\nавтор заявки\n.\nСогласование заявки на оборудование\nПользователь с ролью \"Сотрудник\"\nобладает правом на чтение.\nПользователь с ролью \"Руководитель\"\nобладает правами на чтение и редактирование объекта.\nПодготовка документов по заявке\nПользователь с ролью \"Сотрудник\"\nобладает правами на чтение и редактирование объекта.\nПользователь с ролью \"Руководитель\"\nобладает правом на чтение.\nИными словами при виде прав \"Контроль прав по ответственным сотрудникам\" правом на редактирование объекта наделен только пользователь с активной задачей, при завершении задачи у него остается только право на чтение объекта.\nДопустим, что необходимость обсуждения заявки появилась при выполнении задачи \"Согласование заявки на оборудование\". На данном этапе создать чат может только пользователь с ролью \"Руководитель\", так как только он обладает правом на редактирование объекта.\nДля создания чата руководитель нажимает на кнопку\n. В результате чего по умолчанию создается закрытый чат,\nдобавление участников\nв который регулируется администратором чата – пользователем, создавшим чат:\nадминистратор добавляет пользователей при помощи опции \"Добавить собеседника\" или посредством отправки ссылки-приглашения на вступление в чат;\nпользователи, обладающие правом на чтение или редактирование объекта, могут нажать в карточке объекта на кнопку\nи отправить заявку на вступление в чат. Администратор получает заявку на вступление  в чате по объекту, где он может принять или отклонить заявку.\nНапример, создатель чата добавил нескольких руководителей в чат для обсуждения. После согласования заявка перешла к задаче \"Подготовка документов по заявке\", в данном случае пользователь с ролью \"Сотрудник\" обладает правом на чтение и редактирование объекта, но:\nНе может создать чат по объекту, так как по одному экземпляру объекта может быть только один чат.\nТак как чат закрытый, данный пользователь может быть добавлен только администратором, вступить в чат по ссылке-приглашению или отправить заявку на вступление, став участником чата только после одобрения администратора.\nАдминистратор чата может регулировать роли других пользователей, удалять их из чата или сделать чат открытым.",
  "source": "https://docs.greendata.ru/platform/ru/object-chat-widget.html"
}