{
  "title": "getWorkDatesBetween",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\ngetWorkDatesBetween\nThis is implemented by calling the\nnew\nconstructor, which creates an instance of the LocalDate class.\nby calendar;\nfor a specified employee;\nfor a specified System user.\nSyntax\ngetWorkDatesBetween (period, calendar | employee | user, startDate, endDate)\nSetting\nPurpose\nperiod\nThe period type, for which the calculation of working time will be carried out. Selected when calling the function in the modal window \" Calculate working hours by calendar\". Possible values:\n• day;\n• hour;\n• minute;\n• second.\ncalendar/employee/user\nAn instance of one of the following types (or a child type) can be specified as a parameter:\n1. \"Calendar.\" [SYS_CALENDAR], by which the working days should be calculated.\n2. \"Employee\" [SYS_EMPLOYEE], by which the information about the working days/hours of the employee is determined. The calculation is made using the production (or general) calendar of the employee.\n3. \"User\". [SYS_USER]. The System uses the employee’s production (or general) calendar for the calculation from the specified user.\nThe current employee is set by default when the function is called - currentUser(Employee).\nstartDate\nDeductible date (\"Date\" or \"Date and time\" type attribute).\nThe current date is set by default when the function is called - currentDate().\nendDate\nDecrementable date (\"Date\" or \"Date and time\" type attribute).\nThe current date is set by default - currentDate()\nNote\nThe function is called using the\nbutton, located in the Algorithm Editor on the \"Date\" tab.\nThis will open a modal window where the type of dynamics to calculate the working hours according to the calendar should be selected.\nAfter selecting and clicking the \"OK\" button, the function construction with the selected dynamics type and with the default values of the other parameters, that should be replaced within the task, will be added to the algorithm code.\nExample\nTo calculate the standard deadline for completing the tasks, depending on the time of its receipt to the specialist, taking into account the local working hours of the responsible employee, use an algorithm (fragment):\nRefer to\nProcess Stage Widget\nto learn an example of how to use the getWorkDatesBetween function.",
  "source": "https://docs.greendata.ru/platform/en/getworkdatesbetween.html"
}