{
  "title": "Создание карточки шаблона печатной формы",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nСоздание карточки шаблона печатной формы\nКарточка шаблона печатной формы позволяет выполнить настройки для формирования конечного документа.\nНастройка позволяет сформировать привычную печатную форму, а также отладить функциональность инструмента EDoc (подробнее о\nмодуле eDOC\n).\nСоздание карточки шаблона печатной формы\nФормирование печатных форм в Системе реализуется посредством\nтипа объекта \"Шаблон печатной формы\"\n. Соответственно, создание шаблона выполняется в реестре указанного типа объекта. Для создания шаблона печатной формы необходимо нажать на кнопку\n.\nПоле\nНазначение\nНаименование\nВвод наименования печатной формы в Системе.\nКонвертировать в формат\nОпределение конвертации печатной формы в формат PDF. Без выбора настройки документ выгружается в формате шаблона печатной формы.\nETL для сохранения данных во внешний источник\nВыбор объекта ETL для сохранения данных во внешний источник (используется при интеграции). Подробнее об интеграции на странице\nРабота с ETL\n.\nФайл\nОпределение шаблона документа для формирования печатной формы.\nБазовый тип объектов\nОпределение базового типа объекта, атрибуты которого будут использоваться в формируемом документе.\nШаблон предполагает формирование в инструменте КОД\nОпределение возможности работы с инструментом eDoc. Возможные значения:\nда – предполагает использование инструмента EDoc (подробнее на странице\nМодуль eDOC\n);\nнет – предполагает формирование только печатной формы документа.\nВыгружать в файл, без предварительного просмотра\nОпределение возможности выгрузки печатной формы документа. Возможные значения:\nда – выполнение выгрузки сформированного документа;\nнет – выполнение предварительного просмотра (при работе с EDoc – редактирования) сформированного документа, и последующей выгрузки/ печати. Используется при работе с шаблонами, сформированными в текстовых редакторах (например, MS Word).\nФормировать по файлу, прикрепленному к объекту\nЛогически атрибут, определяющий файл для использования в качестве шаблона. Возможные значения:\nда – предполагает использование в качестве шаблона файл, прикрепленный к объекту, по которому формируется печатная форма. При этом Система отберет файл объекта, классификация которого совпадает с классификацией шаблона. Если подходящих файлов несколько, выбирается последний прикрепленный.\nнет – предполагает использование настраиваемого шаблона документа.\nОписание\nВвод описания документа (опционально)\nЗагрузка шаблона выполняется по кнопке\n, выгрузка –\n.\nВидеообзор использования настройки \"Конвертировать в формат\"\n.\nВ случае работы с модулем EDoc (при выборе значения \"Да\" в поле \"Шаблон предполагает формирование в инструменте КОД\"), Система сформирует полнофункциональный шаблон печатной формы. Иначе, шаблон будет содержать только три вкладки: \"Закладки\", \"Привязанные типы\", \"Параметры\".\nВкладка \"Закладки\"\nНа вкладке \"Закладки\" отображены установленные закладки или именованные диапазоны шаблона документа\n(подробнее о\nподготовке шаблона\n).\nВ случае работы с модулем EDoc вкладка служит для отображения закладок, источники которых настраиваются на вкладке \"Источники данных\". Иначе, необходимо настроить источник данных для каждой закладки. Для этого необходимо:\n1. Выбрать закладку из списка и нажать\n. Система отобразит форму ввода параметров закладки.\n2. Указать значения основных полей для определения источника\nПоле\nНазначение\nТип закладки\nОпределение типа закладки из выпадающего списка. Чаще всего используются следующие типы закладок:\n1. закладка на основе алгоритма;\n2. закладка на основе атрибута;\nВыбор типа закладок обуславливает дальнейшее заполнение необходимых полей для формирования значения настраиваемой закладки.\nТип данных закладки\nОпределение типа данных закладки посредством выпадающего списка. Тип данных источника должен совпадать с типом формируемого значением поля (закладки).\nАтрибут\nВыбор атрибута, значение которого необходимо отобразить в поле. Используется при типе закладке \"Закладка на основе атрибута\".\nЕсли отображение закладки зависит от выполнения определенного условия, его необходимо выбрать/ ввести в\nнастройке (атрибуте) \"Выводить закладку только при выполнении условия\"\n. Условие задается\nалгоритмом\n(настройка используется для печатной формы формата XLSX).\n3. Сохранить настройки посредством кнопки\nв карточке объекта.\nВкладка \"Привязанные типы\"\nВкладка \"Привязанные типы\" отображает те типы объектов, к которым привязывается настраиваемая печатная форма\n.\nПозволяет настроить печать документа дочернего объекта из родительского. То есть если \"Заявка на оформление кредитно-обеспечительной документации\" (далее Заявка на КОД) является дочерним объектом для \"Кредитной заявки\", можно настроить формирование печатной формы \"Заявки на КОД\" из \"Кредитной заявки\". Для этого необходимо указать тип объекта, к которому привязывается печатная форма посредством кнопки\n.\nПоле\nНазначение\nНаименование\nВвод наименования выполняемой настройки.\nСправочник типов объектов\nОпределение типа объекта Системы, к которому привязывается печатная форма.\nПечатная форма\nОтображение настраиваемой печатной формы.\nАтрибут типа, в который будет сохранен сформированный документ\nВыбор атрибута типа, в который будет сохраняться формируемый документ. Где:\nпервая строка – определение типа объекта;\nвторая строка – определение атрибута выбранного типа.\nПредставление реестра\nВыбор настроенного ранее/ создание представления реестра. Используется для формирования списка/ фильтрации объектов, для которых доступна ПФ.\nПример использования настройки\n.\nПрикреплять сформированный файл к объекту\nЛогический атрибут, определяющий прикрепление документа к объекту. Используется при автоматическом создании печатных форм (для этого в алгоритмах используется функция\nprintEDoc\n)\nУсловие формирования ПФ\nВыбор/ ввод алгоритма для определения условий формирования печатной формы. Алгоритм не должен содержать\nцепочечные атрибуты\n.\nВидеообзор использования настройки\n.\nТакже на вкладке необходимо продублировать связь печатной формы с базовым типом объекта. То есть настроить связь объекта с типом, печатная форма которого настраивается.\nВкладка \"Источники данных\"\nНа вкладке \"Источники данных\" определяется как формируется значение для закладки шаблона документа.\nДля этого необходимо выполнить редактирование каждой Закладки по кнопке\n.\nОсновными полями к заполнению являются:\nПоле\nНазначение\nИсточник данных, расширение\nВыбор шаблона источника данных.\nТип данных источника\nВыбор типа источника данных из выпадающего списка. Тип данных источника должен совпадать с типом формируемого значением поля (закладки). Поле обязательно к определению. В случае ошибочного определения типа данных источника, отображение значения будет некорректным или вовсе отсутствовать.\nМножественный выбор\nЛогический атрибут, определяющий сохранение нескольких значений объектного атрибута (мультиселект). Выбор нескольких значений объектного атрибута также будет доступен в процессе работы с опросным листом.\nПравки применяются к исходным данным\nЛогический атрибут, определяющий сохранение измененных вручную (на печатной форме) значений в атрибут типа.\nНеобходимо согласование\nЛогический атрибут, определяющий возможность согласования значений используемых атрибутов.\nСогласующие роли\nВыбор пользователя, роли пользователя для согласования значений используемых атрибутов. Используется в случае необходимости согласования.\nСохранять исходный текст под закладкой\nЛогический атрибут, определяющий сохранение текста \"под закладкой\" шаблона при выводе документа. При использовании в процессе формирования таблиц документа, определяет следующее:\nсохранение текста \"под закладкой\" шаблона;\nпри создании новой строки в таблице документа, копирование значения \"закладки\" предыдущей строки в новую.\nАлгоритм фильтрации\nВыбор/ ввод алгоритма фильтрации. Обычно используется для типа данных источника \"Объект\" для фильтрации значений, отображающихся в опросном листе.\nАлгоритм определения подсветки источника\nВыбор/ ввод алгоритма для подсветки значений в опросном листе. При печати документа подсветка не сохраняется. Используется при необходимости.\nЗапретить автоматическое продолжение списков для многострочных значений\nЛогический атрибут, определяющий отключение автонумерации в скачиваемом документе (включая проставление абзаца посредством алгоритма). Используется для строковых значений.\nДалее необходимо дозаполнить соответствующие поля, в зависимости от указанного источника. Например, при выборе \"источника данных на основе атрибута\", необходимо указать соответствующий атрибут в поле \"Атрибут типа\".\nПримеры настройки источников данных для полей печатных форм\nКорректировка необходимых значений (атрибутов) шаблона печатной формы настраивается на вкладке \"Опросный лист\".\nВкладка \"Опросный лист\"\nВкладка \"Опросный лист\" позволяет настроить поля, значения которых корректируются в процессе формирования документа.\nДля выбора полей в опросный лист необходимо нажать кнопку\n. Система отобразит форму ввода параметров значений опросного листа.\nОбязательными полями к заполнению являются\nПоле\nНазначение\nНаименование\nВвод наименования настройки. Наименование элемента отображается в опросном листе.\nТип элемента опросного листа\nОпределение типа элемента опросного листа. Возможные значения:\nатрибут – отображение атрибута;\nвыбор варианта – отображение варианта для выбора (радио-баттон);\nгруппа – наименование последующей группы полей;\nсворачивающаяся группа – наименование последующей группы полей с возможностью скрытия для пользователя;\nсворачивающийся блок – наименование последующей группы полей с возможностью скрытия для пользователя; при этом отображение полей визуально не группируется (в отличии от предыдущего значения);\nтекст – отображение текста на опросном листе.\nИсточник данных шаблона печатной формы\nОпределение источника данных шаблона печатной формы (закладки), формирование которого выполняется. Требует заполнения в случае выбора элемента опросного листа \"Атрибут\".\nРодительский элемент опросного листа\nОпределение родительского элемента, определение подгруппы полей при отображении.\nДля изменения порядка перечисления необходимо нажать\n, с помощью стрелок изменить расположение элемента. Последовательность элементов в настройке опросного листа сохранится при его последующем отображении.\nПосле сохранения настроек, Система позволит корректировать указанные значения в области \"Опросный лист\" в процессе формирования документа.\nВкладка \"Алгоритмы видимости элементов\"\nНа вкладке настраивается видимость полей печатной формы посредством алгоритмов\n.\nНастройка видимости для элемента документа выполняется после нажатия кнопки\n. Система отобразит форму ввода необходимых параметров\nПоле\nНазначение\nЭлемент документа\nВвод номера элемента документа (абзаца). Номера абзацам документа присваиваются автоматически, подробнее об автоматической разметке документа на странице\nПодготовка шаблона\n. Необходимо указать только числовое обозначение абзаца.\nАлгоритм видимости (рассчитывается только при формировании печатной формы)\nВыбор/ ввод алгоритма из выпадающего списка (подготовленного ранее).\nАлгоритм видимости\nВыбор/ ввод алгоритма фильтрации объектов из выпадающего списка (опционально).\nВкладка \"Алгоритмы преобразователи\"\nВкладка \"Алгоритмы преобразователи\" позволяет внести алгоритмы, используемые для формирования значений полей (закладок)\n.\nАлгоритмы вносятся\nдля закладок типа \"Закладка на основе алгоритма\"\n. После нажатия на кнопку\n.\nПри этом\nтип данных закладки\nдолжен совпадать с\nтипом данных возвращаемого алгоритмом значения\n.\nВкладка \"Привязанные алгоритмы скрытия\"\nНа этой вкладке фиксируются алгоритмы скрытия элементов печатной формы.\nПосле нажатия на кнопку\n.\nЭлементы (абзацы) для скрытия или отображения определяются в цифровых значениях после автоматической разметки документа. Подробнее об автоматической разметке документа – на странице\nПодготовка шаблона\nВкладка \"Связь параграфов и ответственных\"\nНа вкладке устанавливается связь параграфов (абзацев документа) и ответственных сотрудников\n. Настройка используется для определения согласующих редакцию документа ролей пользователей.\nСвязь параграфов и ответственных устанавливается после нажатия кнопки\n. Система отобразит форму ввода необходимых параметров\nПоле\nНазначение\nТип выдачи прав\nОпределение типа выдачи прав. Возможные значения:\nприменение итоговых редакций;\nсогласование.\nПрименять настройку для всего документа\nЛогический атрибут, определяющий применение настроек ко всему документу.\nЭлемент документа\nВвод номера элемента документа (абзаца). Номера абзацам документа присваиваются автоматически, подробнее об автоматической разметке документа на странице\nПодготовка шаблона\n. Необходимо указать только числовое обозначение абзаца.\nСогласующие роли\nВыбор согласующих документ ролей пользователей (созданных ранее).\nВкладка \"Параметры\"\nНа вкладке \"Параметры\" определяются параметры используемого типа объекта\n.\nПри этом, чтобы экранная форма со значениями параметров не отображалась при формировании ПФ, необходимо\nв поле \"Скрывать из формы со значениями параметров\"\nвыбрать значение \"\nДа\n\".",
  "source": "https://docs.greendata.ru/platform/ru/creating-print-form-template-profile.html"
}