{
  "title": "Extensions",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nExtensions\nExtensions are a tool that allows one object type to be supplemented with attributes of another type. This helps synchronize attribute sets between different objects, even if they are not within the same hierarchy.\nUse examples:\na decision request can include data from a client form;\na collateral conclusion can contain attributes of a collateral object.\nWorking with extensions is performed in the object type settings on the \"Extensions\" tab, which is divided into two sections:\n\"Extensions\"\n— for adding main extensions;\n\"Possible extensions\"\n— for working with potential extensions.\nTo add an extension, click the\nbutton in the corresponding section and, in the window that appears, select an object type that will serve as a source of attributes (the extending type):\nUsing parent or child types as extensions is\nnot allowed\n.\nThe full list of types in the parameter drop-down list becomes available after clicking the \"Show all types\" button\n, which is displayed if the \"Run\" permission for the\n\"View system types in the \"Object type\" registry\"\nis granted.\nAfter selecting the extending type, click the \"OK\" button, then save the profile of the current object type.\nAs a result of the configuration, working with attributes of the extending type becomes available:\non the object visual\n: the placement method of extending type attributes on the visual depends on the extension type (\nmain\nor\npossible\n);\nin the profile of the extended type\n: the list of attributes of the extending type becomes available on the\n\"Attributes\"\ntab when the \"Show parent attributes\" option is enabled;\nFor attributes added via\nmain extensions\n,\noverriding\nparameters relative to the original values is available.\nWhereas modification of attributes added via\npossible extensions\nis available only from the extending type profile.\nin the registry of the extended type\n: when\nconfiguring columns\nof the registry of the extended type, the \"Show parent attributes\" option must be enabled to display attributes of the extending type;\nin algorithms\n: to access values of attributes of the extending type in algorithms, the\nattr\nfunction is used.\nWhen the attribute set of the extending type changes, all changes are automatically reflected in the extended type as well.\nMain extensions\nThe main extension automatically adds all attributes from the selected (extending) object type to the current (extended) type.\nAttribute placement on the visual\nAdding additional attributes is performed in the\ninstance visual editing\nmode of the current type. On the \"Elements\" panel, go to the \"Attributes\" tab, enable the \"Show parent attributes\" option, and drag and drop the required attribute from the list into the profile workspace.\nWorking with attributes\nFurther work with additional attributes is performed\nin a standard way\n.\nPossible extensions\nA possible (potential) extension is an\noptional\nset of attributes that the user can manually add to a specific object type instance when necessary.\nWhen a possible extension is added to an object, the System automatically creates a new instance of the extending type and relates it with the original object. As a result, the data is stored in the table of the extending type rather than in the main table of the extended object, which helps optimize the database structure.\nPossible extensions are managed using the following parameters:\nSetting\nPurpose\nMandatory selection of a possible extension\nDefining whether at least one extension from the list must be selected before saving an object instance.\nThe default value is \"No\".\nSelecting multiple extensions in the same instance\nControlling whether one or multiple extensions can be selected for a single object instance.\nThe default value is \"No\".\nHide the Extension button in the object profile\nControlling the visibility of the extension selection button.\nThe default value is \"No\".\nAttribute placement on the visual\nAdding additional attributes is performed in the\ninstance visual editing\nmode of the current type. On the \"Elements\" panel, go to the \"Layout\" tab and drag and drop the \"Extension\"\ngrouping element\ninto the profile workspace.\nNext, in the \"Extension type\" and \"Visual\" fields, select the corresponding extending type added\nearlier\nin the \"Possible extensions\" section, as well as the visual required for display.\nWorking with attributes\nIn the control panel of the extended type object, the \"Extensions\" button is displayed. Clicking it opens a modal window with the list of possible extensions:\nAfter selecting an extension, attributes are added to the extended type in accordance with the previously selected visual of the extending type.\nKey differences\nA comparison of the functionality of main and possible extensions is presented in the table below.\nCharacteristic\nMain extension\nPossible extension\nApplication\nAutomatically to all instances of the type\nManually to individual instances by selection\nData storage\nIn the table of the extended type\nIn the table of the extending type\nAttribute configuration\nParameters can be overridden in the extended type\nCannot be overridden; settings of the original type are used\nMain purpose\nPermanent extension of type functionality\nFlexible, situation-aware of specific instances",
  "source": "https://docs.greendata.ru/platform/en/extensions.html"
}