{
  "title": "Аудит",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nАудит\nВедение аудита повышает уровень целостности данных в базе.\nФиксирование изменений данных ведётся в Системе автоматически и не требует отдельных действий пользователя.\nЖурнал аудита постоянно хранит данные о процессах и изменениях, в том числе:\nобновления Системы;\nдействия пользователей в Системе;\nизменения данных, внесенных конкретным пользователем в определенное время.\nЗадачей журнала аудита является организация единого места хранения всех изменений в базе данных.\nПросмотр журнала большинства видов аудита доступен после последовательного выбора пунктов меню: \"Администрирование\" → \"Аудит\".\nПолный перечень всех видов аудита доступен\nв реестре типов объектов\n.\nВ Системе различают следующие виды аудита:\nаудит действий\n(фиксация действий пользователей, совершаемых в Системе);\nаудит изменений\n(фиксация изменений данных, внесенных пользователем в Систему);\nаудит обновлений (фиксация операции \"Установка обновления\" с расширенными данными);\nаудит ошибок (логирование  ошибок, возникающих в Системе);\nВ\nSaaS-решении\nлогирование ошибок не производится.\nаудит системных действий\n(фиксация системных операций);\nВ\nSaaS-решении\nфиксация системных действий не осуществляется.\nаудит действий с правами (фиксация действий, касающихся прав доступа);\nаудит масок доступа (фиксация изменений прав доступа – повышение/понижение прав доступа и прав по умолчанию);\nаудит групп доступа (фиксация изменений групп доступа – принадлежности пользователей к ним);\nаудит сессий\n;\nаудит интеграций с внешними системами\n.\nНормализация аудита выполняется по расписанию, подробнее с настройкой можно ознакомиться по\nссылке\n.\nАудит действий\nДанный вид аудита фиксирует все действия пользователей, совершаемые в Системе.\nДля записи аудита используются параметры:\nПараметр\nНазначение\nПользователь\nПользователь, совершивший действие.\nПодразделение\nПодразделение пользователя, совершившего действие.\nОбъект\nОбъект, в рамках которого совершено действие (в реестре аудита параметр содержит ссылку для открытия карточки объекта в модальном окне).\nТип действия\nДействие, совершенное пользователем.\nКомментарий\nКомментарий Системы к выполненному действию.\nДата\nДата и время совершения действия.\nУспешность события\nПоказатель того, насколько успешно было выполнено действие.\nУровень привилегированности пользователей\nУровень привилегированности пользователей\nдля отслеживания действий отдельных субъектов.\nЕсли уровень привилегии пользователя определить не удалось или все уровни привилегий были удалены, тогда запись в аудите будет отсутствовать.\nПользователь, с правами которого выполняется действие\nПользователь, под правами которого совершено действие.\nНапример, при\nустановке обновлений\nпод пользователем с отсутствием прав на изменение объекта, но с правами на выполнение\nразрешения\n\"Установка обновлений\", данный параметр заполняется значением \"admin\", в других случаях в параметр записывается пользователь, выполняющий действие.\nВ случае нескольких\nподмен пользователя\nв параметре будет зафиксирован конечный пользователь, под правами которого выполняется действие.\nГруппы доступа пользователя на момент выполнения действия\nПеречисление ID групп доступа, в которые входит пользователь, совершающий действие.\nВ колонке реестра отображаются первые пять групп, в которые входит пользователь, при большем количестве фиксируется общее количество групп пользователя.\nВ зависимости от параметра в\nконфигурационном файле\nопределяется, какие группы доступа будут отображаться: в которые пользователь входит напрямую или косвенно.\nПо умолчанию отображаются группы доступа, в которые пользователь входит напрямую.\nАудит изменений значений атрибутов\nДанный вид аудита фиксирует каждое сохраненное изменение для всех атрибутов Системы.\nФиксация изменений атрибутов в аудите может быть отключена с помощью настройки \"Включить запись в аудит изменений\":\nв\nдополнительных настройках\nтипа объектов – для всех атрибутов типа;\nв\nнастройках атрибута\nна вкладке \"Дополнительное\" – для конкретного атрибута.\nДля перехода в реестр аудита необходимо последовательно выбрать в главном меню пункты:\nАдминистрирование → Аудит → Аудит изменений\n.\nПомимо этого, для просмотра аудита изменений по объекту можно нажать на кнопку\nв панели управления\nобъекта\nили после выбора объекта –\nреестра объектов\n.\nВидимость кнопки\nрегулируется наличием\nразрешения\n\"Просмотр аудита\".\nТип объекта, объект, по которому необходимо отобразить аудит изменений, а также даты начала и окончания периода отображения данных в реестре изменений можно определить в соответствующих полях.\nПредставленные в реестре данные могут быть экспортированы по кнопке\n, для обновления данных реестра следует нажать на кнопку\n.\nАудит системных действий\nДанный аудит предназначен для фиксации системных действий.\nВ\nSaaS-решении\nфиксация системных действий не осуществляется.\nДля перехода в реестр аудита необходимо последовательно выбрать в главном меню пункты:\nАдминистрирование → Аудит → Аудит системных действий\n.\nЖурнал аудита представляет собой дашборд, содержащий информацию о дате запуска системной операции, ее успешности, а также данные об ошибках (при их наличии) для следующих типов системных действий:\nЗапуск приложения\n;\nЗапуск расписания\n;\nОтправка почты;\nЗапуск бизнес-процесса\nпо объекту;\nЗапуск трассировки бизнес-процесса;\nЗапуск асинхронной задачи.\nАудит сессий\nСессия аудита создается только при успешной аутентификации пользователя в приложении.\nПросмотр аудита сессий пользователей доступен в реестре типа объекта \"Аудит. Сессия\" [SYS_AU_SESSION].\nДанные в журнале аудита могут быть\nотсортированы/отфильтрованы\nпо следующим параметрам:\nпо\nпользователю\n;\nпо\nидентификатору пользователя\n;\nпо информации из провайдера;\nЗначение параметра \"Информация из провайдера\" формируется в зависимости от\nпровайдера идентификации\n:\nпри доменной аутентификации извлекается имя домена;\nпри парольной и OAuth аутентификации используется соответствующий идентификатор учетной записи.\nпо\nсотруднику\n;\nпо IР-адресу;\nпо дате создания сессии аудита.\nАудит интеграций с внешними системами\nДанный вид аудита фиксирует результат выполнения событий:\nВзаимодействия с внешними базами данных (осуществляется запись каждого запроса).\nРаботу\nслушателя очереди сообщений\n.\nРаботу\nслушателя e-mail сообщений\n.\nWebhook\n-запросы.\nВзаимодействия по HTTP:\nподключения к внешним стендам GreenData\n;\nобращения к\nисточникам\n/\nприемникам\nданных из ETL (за исключением фиктивных);\nс сервисом\nDaData\n;\nс сервисом\nMangoOffice\n;\nс сервисом Ahunter.\nПросмотр данного вида аудита доступен при открытии\nреестра\nтипа объектов \"Аудит. Интеграция с внешними системами\" [SYS_AU_INTEGRATION].\nЗапись данных body/sql/emailText в аудит может быть ограничена количеством символов, заданным в\nконфигурационном файле\n.\nОтчеты по данным аудита и правам доступа\nДля удобства работы с большим количеством информации об изменениях данных в Системе настроены отчеты по данным аудита.\nДоступ к отчетам осуществляется после последовательного выбора пунктов меню: \"Администрирование\" → \"Отчеты по данным аудита и правам доступа\".\nДалее необходимо выбрать отчет и указать параметры фильтрации:\nАудит действий по пользователю\n– отчет, содержащий информацию о действиях пользователей в Системе.\nДоступна фильтрация по пользователю, типу действия, датам начала и окончания периода.\nУказанный период не должен превышать 31 день.\nАудит действий по объекту\n– фиксация действий, совершенных над объектом.\nДоступна фильтрация по типу объекта, объекту, датам начала и окончания периода.\nУказанный период не должен превышать 31 день.\nАудит изменений по объекту\n– фиксация изменений данных объекта.\nДоступна фильтрация по типу объекта, объекту, датам начала и окончания периода.\nАудит обновлений за период\n– отчет, содержащий перечень всех совершенных операций \"Установка обновления\" в Системе.\nДоступна фильтрация по датам начала и окончания периода.\nАудит масок доступа\n– фиксация изменений масок доступа для пользователей в Системе.\nДоступна фильтрация по датам начала и окончания периода.\nАудит назначения групп доступа\n– отчет, содержащий информацию о назначении групп доступа для пользователей в Системе.\nДоступна фильтрация по датам начала и окончания периода.\nАудит иных действий с правами\n– фиксация действий, касающихся прав доступа.\nДоступна фильтрация по датам начала и окончания периода.\nАудит входа в систему\n– отчет, содержащий информацию о сессиях пользователей в Системе.\nДоступна фильтрация по пользователю, датам начала и окончания периода.\nОчистка аудита изменений\nПроизвести очистку аудита изменений можно с помощью хранимой процедуры\nchange_audit_clean\n,\nс указанием параметров, по которым необходимо очистить аудит.\nДля выполнения скрипта очистки аудита пользователь БД должен иметь привилегии для выполнения скрипта\nSET session_replication_role = replica;\n.\nПараметры\nПараметр\nТип\nОписание\np_start_date\ntimestamp\nНачальные дата и время диапазона очистки.\np_end_date\ntimestamp\nКонечные дата и время диапазона очистки.\np_object_type_idents\nvarchar[]\nМассив идентификаторов типов объектов для очистки.\np_object_ids\nbigint[]\nМассив идентификаторов объектов для очистки (если NULL - очищаются все объекты указанных типов).\np_batch_size\nbigint[]\nРазмер батча при обработке данных (по умолчанию 10000).\nПример вызова процедуры, очищающей аудит для всех объектов типа \"Файл\" [FS_FILE] (включая дочерние) за прошедший месяц:\ncall\nchange_audit_clean(\np_start_date :=\nnow\n()::\ntimestamp\n-\ninterval\n'1 month'\n,\np_end_date :=\nnow\n()::\ntimestamp\n,\np_object_type_idents :=\nARRAY\n[\n'FS_FILE'\n],\np_object_ids :=\nARRAY\n[]::\ninteger\n[]\n);\nsql\nCopied!",
  "source": "https://docs.greendata.ru/platform/ru/audit.html"
}