{
  "title": "GreenData Mobile App",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nGreenData Mobile App\nGreenData Mobile Application\nis specialized software for smartphones and tablets, designed for efficient collaboration with colleagues, quick decision-making, and control over workflows configured in the platform application (hereinafter referred to as the instance).\nOperation in the native GreenData mobile application is only possible when connected to a pre-configured instance.\nFunctional Capabilities\nThe GreenData mobile application combines communication, task management, and data processing capabilities, providing:\na convenient corporate messenger for interacting with colleagues in both personal and group chats, which allows user to:\nexchange text messages, files, links, images;\nconduct audio and video calls with the ability to view the screen of the user sharing their screen via\nGreenData Messenger\n;\npersonalize user statuses;\ndraw attention to important discussions in group chats using the user mention feature;\nconfigure quick access to key information using the pinning feature for important messages and chats;\nuse convenient message search and structured storage of forwarded files and images in chats;\naccess to employee profile data of the connected instance;\nability to receive timely notifications about new task assignments, manage tasks, and track their deadlines;\nability to manage objects and analyze data:\nview and edit object data;\nanalyze data on dashboards;\nstart business processes\nwith appropriate permissions.\nSetup and Getting Started\nTo use the GreenData mobile application as a messenger, view the employee directory, and manage tasks, just follow a few simple steps:\nDownload and install the application on your mobile device.\nConnect to an existing instance and log in to the system.\nOptionally configure the application according to your needs and personal preferences.\nFor detailed descriptions, refer to the articles:\nInstalling and Logging into GreenData Mobile Application\nMobile Application Features and Settings\nTo adapt the appearance, content, and functionality of the GreenData mobile application to business tasks and user needs, you can optionally configure:\nthe login page;\nthe theme design;\nthe application’s main page;\nthe composition and sequence of menu items;\nthe visualization of system objects for correct display on mobile devices.\nFor detailed descriptions, refer to the articles:\nMobile Application Customization\nRecommendations for Configuring Object Display in Mobile Applications\nFor answers to frequently asked questions about working with the mobile application, see the article\n\"Mobile and Desktop Applications. FAQ\"\n.",
  "source": "https://docs.greendata.ru/platform/en/mobile-app.html"
}