{
  "title": "A reporting form based on data source",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\nA reporting form based on data source\nTo represent the data of the generated\nsource\nvisually, you need to configure a user reporting form\n. The configured report form allows you to specify data groupings and set formatting for data text and Excel table headers (if you download the report).\nTo set up a reporting form based on data source, you need to:\n1. Create a reporting form based on the data source from the corresponding registry. For more information, refer to\nWorking with the object registry\n.\n2. Specify parameters for the report form:\nName\nEntering the report name. This name will be displayed to the end user.\nData source\nChoosing the data source formed earlier, on the basis of which you want to create a report.\nReport header grouping\nDefining the report header grouping. This option is available after saving the reporting form profile. To group or ungroup data, you need to select the required columns (like you do it with the grouping of columns in MS Excel documents). As a result, the corresponding buttons will appear:\n,\n, which will be available to the user when viewing the report data.\nObject parameters\nSpecifying the reporting form parameters. It displays and assigns\nselected data source parameters\n. Parameters can be adjusted if necessary. New parameters of the reporting form can be added.\nHeader formatting style\nDefining the header formatting style (selecting/creating an algorithm).\nReport title style\nDefining the report title formatting style (selecting/creating an algorithm).\nReport title algorithm\nDefining the report title (a dynamic text generated by the algorithm).\nManaging the order in which data is presented in an exported MS Excel report\nFixed columns number\nSpecifying the required number of columns to display (integer value).\nFixed rows number\nSpecifying the required number of rows to display (integer value).\nOutput parameters when exporting\nA boolean attribute that defines how parameters are displayed in Excel table.\nEnable autofilters when exporting\nA boolean attribute that specifies the availability of the AutoFilter of data in Excel table.\nExcel sheet orientation\nDefining the orientation of the Excel sheet. Possible values:\nLandscape\nPortrait\nUse the print area by default\nA boolean attribute that defines the use of the Excel worksheet print area by default.\nPage layout – the width (of pages)\nThe number of pages of an Excel document counted per sheet (how wide) when printing.\nPage layout – the height (of pages)\nThe number of pages of an Excel document counted per sheet (how high) when printing.\nPage layout – scale (%)\nDefining the scale of the data representation when printing a document as a percentage of the actual value.\nThe established order of data representation in the exported report is automatically recorded in the MS Excel document.\n3. To save the reporting form generated, click\n. In this case, the System will display the generated columns of the report table and the parameters of the objects of the data source used (if any). If necessary, you can return to editing the reporting form (for more information, refer to\nWorking with the object registry\n).\n4. To close the profile \"Reporting form based on data source\" (presented in the modal window), click\n.\nThis will generate a user reporting form.\nWorking with a reporting form (including viewing a report) is similar to interacting with a data source, for more information, refer to\nWorking with data sources\n.\nWhen exporting data, the report will be customized as follows:",
  "source": "https://docs.greendata.ru/platform/en/a-reporting-form-based-on-data-source.html"
}