{
  "title": "Визуалы атрибута типа \"Логический\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВизуалы атрибута типа \"Логический\"\nАтрибут типа \"Логический\" может принимать следующие значения: да/ нет (true/ false).\nДля наглядного представления атрибута в Системе реализованы следующие визуалы, выбор которых осуществляется при настройке атрибута на вкладке \"Визуал\":\nвизуал \"Логический атрибут в виде checkbox’а\"\n;\nвизуал \"Логический атрибут в виде переключателя\"\n;\nвизуал \"Логический атрибут в виде выпадающего списка\"\n.\nЛогический атрибут в виде checkbox’а\nДанный визуал используется по умолчанию для атрибутов типа \"Логический\".\nПри помощи визуала \"Логический атрибут в виде checkbox’a\" отображение логического атрибута может быть представлено в виде элемента \"checkbox\".\nПо умолчанию атрибут предполагает два состояния: да/ нет (true/ false).\nПри активном переключателе \"Атрибут имеет 3 состояния\" предполагаются следующие состояния атрибута:\ntrue – верно/ да;\nfalse – ошибочно/ нет;\nnull – пустое значение.\nПосле настройки визуала атрибут примет следующий вид:\nЛогический атрибут в виде переключателя\nВизуал \"Логический атрибут в виде переключателя\" позволяет отобразить атрибут в виде графического переключателя. Для настройки визуала достаточно выбрать его из списка и указать количество его возможных состояний.\nПо умолчанию атрибут предполагает два состояния: да/ нет (true/ false).\nПри активном переключателе \"Атрибут имеет 3 состояния\" предполагаются следующие состояния атрибута:\ntrue – верно/ да;\nfalse – ошибочно/ нет;\nnull – пустое значение.\nВ карточке объекта логический атрибут примет следующий вид:\nЛогический атрибут в виде выпадающего списка\nВизуал \"Логический атрибут в виде выпадающего списка\" позволяет отобразить атрибут в виде выпадающего списка с возможностью выбора одного значения.\nДополнительных настроек визуал не требует.\nВ карточке объекта логический атрибут с данным визуалом отображается следующим образом:",
  "source": "https://docs.greendata.ru/platform/ru/boolean_attribute_visuals.html"
}