{
  "title": "\"General settings\" tab",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"General settings\" tab\nThe settings of this tab are used to display the object in the registry or when opening it.\nThis tab is missing for the \"Light Registry\" registry type.+\nThe list of settings on this tab depends on the selected registry view.\nFor more information about the settings of this tab for the tiled registry, see this\narticle\n.\nSetting\nPurpose\nVisual on opening\nSelecting the visual of the object that will be displayed when opening the object instance.\nAlgorithm for determining the list of performers\nConfiguring the list of performers in the task registry.\nThe algorithm should return an array of employee’s  system IDs.\nThe setting is displayed when selecting the\n\"Task Registry\"\nor\n\"Calendar Registry\"\nregistry types.\nCollapse hierarchy\nThe boolean parameter that determines the full/compact display of registry data by default upon opening it.\nPossible options:\n\"Yes\" - display only top-level parent objects in the hierarchy;\n\"No\" - display all objects.\nThis setting is relevant for hierarchical datasets (regions, organizational structures, etc.).\nThe setting is displayed when selecting the \"Registry with hierarchy\" registry visual\n.\nSave immediately after removing focus\nThe switch that determines whether an instance can be automatically saved after removing focus from a row.\nThe parameter is displayed when selecting the \"Flat registry\" or \"Registry with hierarchy\" registry type\n.\nUse default editing mode\nThe switch that determines whether the registry attributes can be edited without going to the instance profile. Thus, editing values becomes available in the registry when an attribute (row) is clicked.\nFor more information about how the registry works in the edit mode, see the\narticle\n.\nThe setting is displayed when selecting the \"Flat registry\" or \"Registry with hierarchy\" registry types\n.\nAfter saving changes by clicking the\nbutton, the registry will be updated according to the applied settings.",
  "source": "https://docs.greendata.ru/platform/en/tab_general_settings.html"
}