{
  "title": "Виджет \"Текст\"",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nВиджет \"Текст\"\nВиджет \"Текст\" позволяет отобразить текст в карточке объекта\nв заданном цвете и размере.\nВиджет \"Текст\" в отличие от\nвиджета \"Текстовое сообщение\"\nимеет более упрощенные настройки, применяемые ко всей фразе целиком.\nПример настроенного виджета:\nНастройка\nДобавление виджета в карточку объекта осуществляется в режиме настройки\nвизуала экземпляра\n. При переходе на панели \"Элементы\" на вкладку \"Виджеты\" необходимо из раздела \"Информация для пользователя\" в рабочую область карточки перетащить (Drag&Drop) виджет \"Текст\".\nПо кнопке\nвиджет копируется в папку\n\"Пользовательские\"\n, где его содержимое станет доступно для редактирования.\nПараметры\nДля управления виджетом необходимо нажать на кнопку \"Настройки\", в результате чего откроется модальное окно со следующими параметры настройки:\nПараметр\nНазначение\nТекст виджета\nТекст для отображения (максимальный размер 2000 символов).\nРазмер шрифта\nРазмер шрифта (кегль) текста. Допустим ввод значения от 1 до 100.\nЕсли значение не задано, по умолчанию используется 12 кегль, либо в случае активного признака \"Отображать как заголовок\" – 20 кегль.\nПо умолчанию установлен 12 кегль.\nОтображать как заголовок\nПризнак для отображения текста крупным шрифтом (20 кеглем).\nПризнак применяется только при отсутствии значения размера шрифта.\nМногострочное отображение\nПризнак, определяющий  способ отображения текста, не помещающегося в контейнер группировки.\nВ случае когда текст не помещается в строку:\nпри активном признаке текст переносится на новую строку;\nпри неактивном признаке текст, который не поместился в отведенное пространство, заменяется на многоточие, полный текст доступен в хинте при наведении курсора на виджет.\nЦвет текста\nЦвет текста.\nПо нажатию на кнопку цвета отобразится color picker с возможностью установки цвета при помощи пипетки или ввода кода цвета в RGB формате.\nПод параметрами настройки отображается макет виджета.\nВ верхней части модального окна расположена кнопка \"Перейти в режим разработчика\", по нажатию на которую осуществится переход в\nсреду разработки виджетов\nдля создания пользовательского виджета.",
  "source": "https://docs.greendata.ru/platform/ru/text-widget.html"
}