{
  "title": "\"Horizontal Registry\" widget",
  "text": "Was this article helpful?\nYes\nNo\nThank you for rating the article!\nBy leaving more detailed feedback, you help us improve the documentation\nComment on the rating\nContact information (optional)\nAttachments\nAdd file\nCancel\nSubmit\n\"Horizontal Registry\" widget\nThe \"Horizontal Registry\" widget\nis a tool designed to display static information in the form of harmoniously arranged bars (tile representation).\nExamples of a customized widget:\nA widget can be added in the\nedit mode of the visual\nof the object type. When switching to the \"Widgets\" tab in the \"Elements\" panel, drag-and-drop the \"Horizontal registry\" widget from the \"Lists and tables of objects\" section to the working area of the profile.\nThe \"Horizontal registry\" widget can only be dragged into a \"Row\" container previously added to the profile from the \"Groupings\" tab of the \"Elements\" panel.\nWe recommend to place the widget in the \"Attribute group\" container, which is also available on the \"Groupings\" tab.\nTo manage the widget, click on the \"Settings\" button, that will open a modal window.\nParameters\nThe widget is configured according to the following parameters:\nSetting\nPurpose\nAttribute with objects\nSelecting an attribute of the \"Child object \" or \"Object \" type with the \"multiple selection \" option active.\nVisual\nSelecting a visual from the drop-down list or adding/editing a\nvisual of the instance\nby clicking the three dots icon.\nNumber of default values\nThe number of profiles of the selected attribute with objects for the end user displayed by default. The maximum number of values is 15.\nDisplay the \"Show All\" button\nDisplay the \"Show All\" button in the type profile for the end user. The button is used to view the entire registry of objects.\nRegistry for displaying all objects\nThe field is available when the \" Show all button \" switch is active.\nSelecting the\nvisual\nof the registry.\nDisplay method\nThe field is available when the Show all button is active.\nSelecting the way all objects are displayed. Possible values:\n• in this window;\n• in a new tab;\n• in the modal window.\nTitle\nInput of the title of the widget to be configured. The maximum title length is 100 symbols.\nLocalization setting. When you click, a modal window opens, in which you enter the name of the subject area. Input is available in different languages.\nTitle style\nSelecting the title formatting style from the drop-down list or create a new one by clicking the three dots icon.\nUse case\nLet’s use the widget \"Horizontal registry\" to display the rates offered by fitness clubs. To do this - create the \"Fitness subscriptions\" object type, containing the following attributes:\nGoing to the\ntype registry\n, by clicking the\nbutton you need to create possible subscription options offered by fitness clubs. For example:\nAlso note that the\nvisual\nof objects of this type will be displayed in the configured \"Horizontal registry\" widget, so it is necessary to configure the visual according to the statement of the task to be performed.\nLet’s create a new\nvisual\n, which will be further selected when configuring the widget.\nIn the current task configuration of the visual is implemented by using the\n\"Attribute title\"\nfor each of the attributes: \"Name\", \"Price\" and \"Validity period\".As a result, the profile has the following view:\nIf necessary, you can create different\nvisuals\nfor further selecting when configuring the widget.\nTo create multiple registries, which can be selected when configuring the \"Horizontal registry\" widget, you should save the current representation by using the\nbutton on the control panel. After that, the buttons to add, copy and delete the registry will be available in the\nregistry settings\n.\nNext, let’s create the \"Fitness clubs\" object type, the attribute composition of which contains the object attribute of the previously created \"Fitness subscriptions\" object type:\nAfter opening the\ntype registry\n, let’s proceed to\nconfiguring the visual\nof the object. As a result, let’s add the necessary attributes and the \"Horizontal Registry\" widget to the working area of the object profile.\nTo make the \"Fitness subscriptions\" attribute appear only when you create a profile, let’s set the visibility algorithm:\n.\nIn the widget settings let’s specify the following parameters:\nAs a result, the object profile will have the following view:\nThe widget displays the values, selected in the attributes group \" Fitness club information\" (after saving the profile, this element of the profile will be hidden according to the specified visibility algorithm). As the number of displayed values by default is less than the number of selected values, you can move to the next group of values by pagination at the bottom part of the widget or by using the arrows, available when hovering the mouse cursor on the last elements.\nTo view the full object registry, you need to click on the \"Show all\" button in the bottom right corner of the widget. According to the widget settings, this registry will be opened in a new tab in the form of the visual specified in the settings.",
  "source": "https://docs.greendata.ru/platform/en/horizontal-registry-widget.html"
}