{
  "title": "Запуск ETL по расписанию",
  "text": "Была ли статья полезной?\nДа\nНет\nСпасибо за вашу оценку!\nОставляя более подробный отзыв, вы помогаете нам улучшать документацию\nКомментарий к оценке\nКонтактная информация (необязательно)\nВложения\nДобавить файл\nОтменить\nОтправить\nЗапуск ETL по расписанию\nСистема позволяет настроить\nзапуск ETL по расписанию\n.\nВ типе объекта \"Расписание запуска действий\"\nДля создания\nрасписания запуска\nETL необходимо создать новый экземпляр в типе объекта \"Расписание запуска действий\" [\nSYS_ACTION_SCHEDULE\n].\nВ настройках расписания следует указать название расписания, тип системного действия \"Запуск ETL\", время запуска ETL. В поле \"\nРасписание действует\n\" следует выбрать значение \"\nДа\n\". Поля \"Последнее выполнение прошло успешно\" и \"Дата последнего выполнения\" будут заполнены автоматически.\nПри необходимости, можно создать новое время запуска ETL (подробнее, см.\nПланировщик в формате CRON\n).\nПосле выбора системного действия в карточке экземпляра отобразится поле \"Объект с параметрами для действия\". Необходимо нажать на кнопку \"Создать новый\", чтобы настроить параметры для автоматического запуска ETL.\nНажав на кнопку, пользователю нужно выбрать тип настраиваемого объекта \"Параметры для автоматического запуска ETL\".\nАвтоматически пользователем будет создан новый экземпляр выбранного типа.\nВ зависимости от выбранного типа объекта будут изменяться настройки. В данном случае были созданы:\nобъект ETL, который отображает информацию о прожиточном минимуме;\nалгоритм для формирования параметров запуска ETL.\nДля настройки автоматического действия необходимо заполнить следующие поля:\nПоле\nНазначение\nОбъект ETL\nВыбор объекта ETL из выпадающего списка.\nАлгоритм для формирования параметров запуска ETL\nВыбор алгоритма из выпадающего списка\nПо завершении настройки параметра запуска ETL следует сохранить данные. Объект ETL будет отображен в карточке расписания.\nВ типе объекта \"Расписание запуска\"\nДля создания\nрасписания запуска\nETL необходимо создать новый экземпляр в типе объекта \"Расписание запуска\" [\nSYS_START_SCHEDULE\n].\nВ настройках расписания следует указать название расписания и время запуска ETL. В поле \"\nРасписание действует\n\" следует выбрать значение\n\"Да\"\n.\nЧтобы создать системное действие, нужно нажать на кнопку\nдочернего атрибута \"Планировщик заданий\".\nНажав на кнопку, пользователю следует выбрать тип планировщика \"Планировщик заданий. Запуск ETL\".\nАналогично примеру настройки параметров для автоматического запуска ETL необходимо заполнить следующие поля:\nПо завершении настройки планировщика следует сохранить данные с помощью кнопки\n. Созданный планировщик запуска ETL будет отражен в дочернем атрибуте \"Планировщик заданий\" в карточке расписания.\nПри необходимости пользователь может создать несколько автоматических задач для одного расписания.",
  "source": "https://docs.greendata.ru/platform/ru/running-scheduled-etl.html"
}